typedef struct DmChar08 {
    /* 0x000 */ Actor actor;
    /* 0x144 */ s32 unk144;                         /* inferred */
    /* 0x148 */ char pad148[0x14];                  /* maybe part of unk144[6]? */
    /* 0x15C */ SkelAnime unk15C;                   /* inferred */
    /* 0x1A0 */ void (*actionFunc)(DmChar08 *, GlobalContext *);
    /* 0x1A4 */ Actor *unk1A4;                      /* inferred */
    /* 0x1A8 */ Actor *unk1A8;                      /* inferred */
    /* 0x1AC */ f32 unk1AC;                         /* inferred */
    /* 0x1B0 */ f32 unk1B0;                         /* inferred */
    /* 0x1B4 */ f32 unk1B4;                         /* inferred */
    /* 0x1B8 */ f32 unk1B8;                         /* inferred */
    /* 0x1BC */ f32 unk1BC;                         /* inferred */
    /* 0x1C0 */ f32 unk1C0;                         /* inferred */
    /* 0x1C4 */ char pad1C4[0xC];                   /* maybe part of unk1C0[4]? */
    /* 0x1D0 */ f32 unk1D0;                         /* inferred */
    /* 0x1D4 */ f32 unk1D4;                         /* inferred */
    /* 0x1D8 */ f32 unk1D8;                         /* inferred */
    /* 0x1DC */ char pad1DC[0x8];                   /* maybe part of unk1D8[3]? */
    /* 0x1E4 */ f32 unk1E4;                         /* inferred */
    /* 0x1E8 */ char pad1E8[0x8];                   /* maybe part of unk1E4[3]? */
    /* 0x1F0 */ f32 unk1F0;                         /* inferred */
    /* 0x1F4 */ s16 unk1F4;                         /* inferred */
    /* 0x1F6 */ char pad1F6[0x4];                   /* maybe part of unk1F4[3]? */
    /* 0x1FA */ s16 unk1FA;                         /* inferred */
    /* 0x1FC */ s16 unk1FC;                         /* inferred */
    /* 0x1FE */ s8 unk1FE;                          /* inferred */
    /* 0x1FF */ u8 unk1FF;                          /* inferred */
    /* 0x200 */ s8 unk200;                          /* inferred */
    /* 0x201 */ u8 unk201;                          /* inferred */
    /* 0x202 */ u8 unk202;                          /* inferred */
    /* 0x203 */ s8 unk203;                          /* inferred */
    /* 0x204 */ char pad204[0x1];
    /* 0x205 */ u8 unk205;                          /* inferred */
    /* 0x206 */ s8 unk206;                          /* inferred */
    /* 0x207 */ s8 unk207;                          /* inferred */
    /* 0x208 */ s8 unk208;                          /* inferred */
    /* 0x209 */ u8 unk209;                          /* inferred */
    /* 0x20A */ char pad20A[0x2];                   /* maybe part of unk209[3]? */
} DmChar08;                                         /* size = 0x20C */

struct _mips2c_stack_DmChar08_Destroy {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_DmChar08_Draw {
    /* 0x00 */ char pad0[0x30];
    /* 0x30 */ Gfx *sp30;                           /* inferred */
    /* 0x34 */ Gfx *sp34;                           /* inferred */
    /* 0x38 */ char pad38[0x10];
};                                                  /* size = 0x48 */

struct _mips2c_stack_DmChar08_Init {
    /* 0x00 */ char pad0[0x3C];
    /* 0x3C */ SkelAnime *sp3C;                     /* inferred */
    /* 0x40 */ ActorContext *sp40;                  /* inferred */
    /* 0x44 */ char pad44[0xC];
};                                                  /* size = 0x50 */

struct _mips2c_stack_DmChar08_Update {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80AAF050 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80AAF15C {
    /* 0x00 */ char pad0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80AAF610 {
    /* 0x00 */ char pad0[0x18];
    /* 0x18 */ Actor *sp18;                         /* inferred */
    /* 0x1C */ Actor *sp1C;                         /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80AAF79C {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80AAF884 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80AAF8F4 {
    /* 0x00 */ char pad0[0x28];
    /* 0x28 */ f32 sp28;                            /* inferred */
    /* 0x2C */ char pad2C[0x4];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80AAFA18 {
    /* 0x00 */ char pad0[0x1C];
    /* 0x1C */ s16 sp1C;                            /* inferred */
    /* 0x1E */ s16 sp1E;                            /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80AAFAC4 {};              /* size 0x0 */

struct _mips2c_stack_func_80AAFAE4 {};              /* size 0x0 */

struct _mips2c_stack_func_80AAFB04 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80AAFB94 {};              /* size 0x0 */

struct _mips2c_stack_func_80AAFBA4 {
    /* 0x00 */ char pad0[0x58];
    /* 0x58 */ f32 sp58;                            /* inferred */
    /* 0x5C */ f32 sp5C;                            /* inferred */
    /* 0x60 */ f32 sp60;                            /* inferred */
    /* 0x64 */ char pad64[0x4];
};                                                  /* size = 0x68 */

struct _mips2c_stack_func_80AAFCCC {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80AAFE78 {};              /* size 0x0 */

struct _mips2c_stack_func_80AAFE88 {
    /* 0x00 */ char pad0[0x2C];
    /* 0x2C */ void *sp2C;                          /* inferred */
    /* 0x30 */ char pad30[0xC];                     /* maybe part of sp2C[4]? */
    /* 0x3C */ u32 sp3C;                            /* inferred */
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80AB01E8 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80AB023C {};              /* size 0x0 */

struct _mips2c_stack_func_80AB032C {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80AB096C {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80AB0A10 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80AB0E3C {};              /* size 0x0 */

struct _mips2c_stack_func_80AB0E7C {
    /* 0x00 */ char pad0[0x18];
    /* 0x18 */ f32 sp18;                            /* inferred */
    /* 0x1C */ f32 sp1C;                            /* inferred */
    /* 0x20 */ f32 sp20;                            /* inferred */
    /* 0x24 */ char pad24[0x4];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80AB0F90 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

? func_800C6554(f32, GlobalContext *, GlobalContext *, void *, GlobalContext *); /* extern */
f32 func_800F5A8C(u16, u16, u16, GlobalContext *);  /* extern */
void func_80AAF050(DmChar08 *arg0);                 /* static */
void func_80AAF15C(SkelAnime *arg0, void *arg1, s32 arg2, DmChar08 *); /* static */
void func_80AAF610(DmChar08 *, GlobalContext *);    /* static */
void func_80AAF79C(DmChar08 *, GlobalContext *);    /* static */
void func_80AAF884(DmChar08 *, GlobalContext *);    /* static */
void func_80AAF8F4(DmChar08 *, GlobalContext *);    /* static */
void func_80AAFA18(DmChar08 *, GlobalContext *);    /* static */
void func_80AAFAC4(DmChar08 *, GlobalContext *);    /* static */
void func_80AAFAE4(DmChar08 *, GlobalContext *);    /* static */
void func_80AAFB04(DmChar08 *, GlobalContext *);    /* static */
void func_80AAFB94(DmChar08 *, GlobalContext *);    /* static */
