typedef struct EnPr {
    /* 0x000 */ Actor actor;
    /* 0x144 */ SkelAnime unk144;                   /* inferred */
    /* 0x188 */ Vec3s unk188;                       /* inferred */
    /* 0x18E */ char pad18E[0x36];                  /* maybe part of unk188[10]? */
    /* 0x1C4 */ Vec3s unk1C4;                       /* inferred */
    /* 0x1CA */ char pad1CA[0x36];                  /* maybe part of unk1C4[10]? */
    /* 0x200 */ void (*actionFunc)(EnPr *, GlobalContext *);
    /* 0x204 */ u8 unk204;                          /* inferred */
    /* 0x205 */ char pad205[0x1];
    /* 0x206 */ s16 unk206;                         /* inferred */
    /* 0x208 */ s16 unk208;                         /* inferred */
    /* 0x20A */ s16 unk20A;                         /* inferred */
    /* 0x20C */ s16 unk20C;                         /* inferred */
    /* 0x20E */ s16 unk20E;                         /* inferred */
    /* 0x210 */ s16 unk210;                         /* inferred */
    /* 0x212 */ s16 unk212;                         /* inferred */
    /* 0x214 */ s16 unk214;                         /* inferred */
    /* 0x216 */ s16 unk216;                         /* inferred */
    /* 0x218 */ char pad218[0x4];                   /* maybe part of unk216[3]? */
    /* 0x21C */ s32 unk21C;                         /* inferred */
    /* 0x220 */ char pad220[0xC];                   /* maybe part of unk21C[4]? */
    /* 0x22C */ s16 unk22C;                         /* inferred */
    /* 0x22E */ s16 unk22E;                         /* inferred */
    /* 0x230 */ s16 unk230;                         /* inferred */
    /* 0x232 */ char pad232[0x2];
    /* 0x234 */ f32 unk234;                         /* inferred */
    /* 0x238 */ f32 unk238;                         /* inferred */
    /* 0x23C */ Vec3f unk23C;                       /* inferred */
    /* 0x248 */ char pad248[0x6C];                  /* maybe part of unk23C[10]? */
    /* 0x2B4 */ f32 unk2B4;                         /* inferred */
    /* 0x2B8 */ f32 unk2B8;                         /* inferred */
    /* 0x2BC */ f32 unk2BC;                         /* inferred */
    /* 0x2C0 */ char pad2C0[0x4];
    /* 0x2C4 */ f32 unk2C4;                         /* inferred */
    /* 0x2C8 */ f32 unk2C8;                         /* inferred */
    /* 0x2CC */ f32 unk2CC;                         /* inferred */
    /* 0x2D0 */ s16 unk2D0;                         /* inferred */
    /* 0x2D2 */ s16 unk2D2;                         /* inferred */
    /* 0x2D4 */ Vec3f unk2D4;                       /* inferred */
    /* 0x2D8 */ f32 unk2D8;                         /* overlap; inferred */
    /* 0x2DC */ char pad2DC[0x4];
    /* 0x2E0 */ Vec3f unk2E0;                       /* inferred */
    /* 0x2EC */ char pad2EC[0xC];
    /* 0x2F8 */ EnPr *unk2F8;                       /* inferred */
    /* 0x2FC */ ColliderCylinder unk2FC;            /* inferred */
} EnPr;                                             /* size = 0x348 */

struct _mips2c_stack_EnPr_Destroy {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnPr_Draw {
    /* 0x00 */ char pad0[0x38];
};                                                  /* size = 0x38 */

struct _mips2c_stack_EnPr_Init {
    /* 0x00 */ char pad0[0x50];
};                                                  /* size = 0x50 */

struct _mips2c_stack_EnPr_Update {
    /* 0x00 */ char pad0[0x34];
    /* 0x34 */ ColliderCylinder *sp34;              /* inferred */
    /* 0x38 */ PosRot *sp38;                        /* inferred */
    /* 0x3C */ char pad3C[0x4];
    /* 0x40 */ f32 sp40;                            /* inferred */
    /* 0x44 */ f32 sp44;                            /* inferred */
    /* 0x48 */ f32 sp48;                            /* inferred */
    /* 0x4C */ char pad4C[0x4];
    /* 0x50 */ ? sp50;                              /* inferred */
    /* 0x50 */ char pad50[0x4];
    /* 0x54 */ f32 sp54;                            /* inferred */
    /* 0x58 */ char pad58[0x10];
};                                                  /* size = 0x68 */

struct _mips2c_stack_func_80A3242C {
    /* 0x00 */ char pad0[0x34];
    /* 0x34 */ f32 sp34;                            /* inferred */
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80A324E0 {
    /* 0x00 */ char pad0[0x3C];
    /* 0x3C */ CollisionContext *sp3C;              /* inferred */
    /* 0x40 */ WaterBox *sp40;                      /* inferred */
    /* 0x44 */ u32 sp44;                            /* inferred */
    /* 0x48 */ ? sp48;                              /* inferred */
    /* 0x48 */ char pad48[0xC];
    /* 0x54 */ CollisionPoly *sp54;                 /* inferred */
};                                                  /* size = 0x58 */

struct _mips2c_stack_func_80A325E4 {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80A326F0 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A32740 {
    /* 0x00 */ char pad0[0x1C];
    /* 0x1C */ Actor *sp1C;                         /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80A32854 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A3289C {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A3295C {};              /* size 0x0 */

struct _mips2c_stack_func_80A32984 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80A32A40 {
    /* 0x00 */ char pad0[0x30];
    /* 0x30 */ WaterBox *sp30;                      /* inferred */
    /* 0x34 */ ? sp34;                              /* inferred */
    /* 0x34 */ char pad34[0x4];
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ char pad3C[0x4];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80A32AF8 {};              /* size 0x0 */

struct _mips2c_stack_func_80A32B20 {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80A32CDC {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A32D28 {
    /* 0x00 */ char pad0[0x2C];
    /* 0x2C */ Actor *sp2C;                         /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80A32E60 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A32EA4 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A32F48 {
    /* 0x00 */ char pad0[0x2C];
    /* 0x2C */ WaterBox *sp2C;                      /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80A33098 {
    /* 0x00 */ char pad0[0x3C];
    /* 0x3C */ void *sp3C;                          /* inferred */
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80A3357C {};              /* size 0x0 */

struct _mips2c_stack_func_80A335B4 {
    /* 0x00 */ char pad0[0x24];
    /* 0x24 */ ? sp24;                              /* inferred */
    /* 0x24 */ char pad24[0xC];
};                                                  /* size = 0x30 */

void func_80A3242C(EnPr *arg0, s32 arg1);           /* static */
s32 func_80A324E0(EnPr *arg0, GlobalContext *arg1); /* static */
s32 func_80A325E4(EnPr *arg0, EnPr *);              /* static */
void func_80A326F0(EnPr *arg0, EnPr *, GlobalContext *); /* static */
void func_80A32854(f32 arg0, f32, EnPr *);          /* static */
void func_80A3295C(EnPr *arg0);                     /* static */
void func_80A32AF8(f32 arg0, f32, EnPr *);          /* static */
void func_80A32CDC(EnPr *arg0);                     /* static */
void func_80A32E60(Actor *arg0);                    /* static */
void func_80A33098(Actor *arg0, GlobalContext *arg1); /* static */
s32 func_80A3357C(GlobalContext *arg0, s32 arg1, Gfx **arg2, Vec3f *arg3, Vec3s *arg4, Actor *arg5); /* static */
void func_80A335B4(GlobalContext *arg0, s32 arg1, Gfx **arg2, Vec3s *arg3, Actor *arg4); /* static */
