typedef struct EnNb {
    /* 0x000 */ Actor actor;
    /* 0x144 */ SkelAnime unk_144;                  /* inferred */
    /* 0x188 */ void (*actionFunc)(EnNb *, GlobalContext *);
    /* 0x18C */ char pad_18C[0x4];
    /* 0x190 */ ColliderCylinder unk_190;           /* inferred */
    /* 0x1DC */ u8 unk_1DC;                         /* inferred */
    /* 0x1DD */ char pad_1DD[0x3];                  /* maybe part of unk_1DC[4]? */
    /* 0x1E0 */ s32 *unk_1E0;                       /* inferred */
    /* 0x1E4 */ s32 unk_1E4;                        /* inferred */
    /* 0x1E8 */ Actor *unk_1E8;                     /* inferred */
    /* 0x1EC */ char pad_1EC[0x16];                 /* maybe part of unk_1E8[6]? */
    /* 0x202 */ Vec3s unk_202;                      /* inferred */
    /* 0x208 */ char pad_208[0x2A];                 /* maybe part of unk_202[8]? */
    /* 0x232 */ Vec3s unk_232;                      /* inferred */
    /* 0x238 */ char pad_238[0x2A];                 /* maybe part of unk_232[8]? */
    /* 0x262 */ u16 unk_262;                        /* inferred */
    /* 0x264 */ char pad_264[0x10];                 /* maybe part of unk_262[9]? */
    /* 0x274 */ f32 unk_274;                        /* inferred */
    /* 0x278 */ char pad_278[0x8];                  /* maybe part of unk_274[3]? */
    /* 0x280 */ s16 unk_280;                        /* inferred */
    /* 0x282 */ s16 unk_282;                        /* inferred */
    /* 0x284 */ char pad_284[0x8];                  /* maybe part of unk_282[5]? */
    /* 0x28C */ void *unk_28C;                      /* inferred */
    /* 0x290 */ s32 unk_290;                        /* inferred */
    /* 0x294 */ char pad_294[0x8];                  /* maybe part of unk_290[3]? */
} EnNb;                                             /* size = 0x29C */

struct _mips2c_stack_EnNb_Destroy {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnNb_Draw {
    /* 0x00 */ char pad_0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_EnNb_Init {
    /* 0x00 */ char pad_0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_EnNb_Update {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80BBFDB0 {
    /* 0x00 */ char pad_0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80BBFE60 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80BBFE8C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80BBFF24 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ ColliderCylinder *sp1C;              /* inferred */
    /* 0x20 */ char pad_20[0x8];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80BBFF90 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80BBFFD4 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ s32 sp1C;                            /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80BC0050 {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80BC00AC {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ s32 sp24;                            /* inferred */
    /* 0x28 */ char pad_28[0x2];
    /* 0x2A */ s16 sp2A;                            /* inferred */
    /* 0x2C */ char pad_2C[0x4];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80BC01DC {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ s32 sp2C;                            /* inferred */
    /* 0x30 */ char pad_30[0x8];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80BC045C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80BC04FC {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ s32 sp24;                            /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80BC05A8 {
    /* 0x00 */ char pad_0[0x28];
    /* 0x28 */ s32 sp28;                            /* inferred */
    /* 0x2C */ void *sp2C;                          /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80BC06C4 {
    /* 0x00 */ char pad_0[0x34];
    /* 0x34 */ ? sp34;                              /* inferred */
    /* 0x34 */ char pad_34[0xC];
    /* 0x40 */ ? sp40;                              /* inferred */
    /* 0x40 */ char pad_40[0x4];
    /* 0x44 */ f32 sp44;                            /* inferred */
    /* 0x48 */ char pad_48[0x8];
};                                                  /* size = 0x50 */

struct _mips2c_stack_func_80BC0800 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80BC08E0 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80BC0978 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80BC0A18 {
    /* 0x00 */ char pad_0[0x1A];
    /* 0x1A */ u16 sp1A;                            /* inferred */
    /* 0x1C */ char pad_1C[0x4];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80BC0B98 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ s32 sp24;                            /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80BC0C0C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80BC0C80 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80BC0D08 {};              /* size 0x0 */

struct _mips2c_stack_func_80BC0D1C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80BC0D84 {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ u8 sp20;                             /* inferred */
    /* 0x21 */ char pad_21[0xF];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80BC0EAC {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80BC1174 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80BC11B4 {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ f32 sp18;                            /* inferred */
    /* 0x1C */ f32 sp1C;                            /* inferred */
    /* 0x20 */ f32 sp20;                            /* inferred */
    /* 0x24 */ char pad_24[0x4];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80BC1278 {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

? func_800E0308(Camera *, Actor *);                 /* extern */
? func_8013AD9C(s16, s16, void *, void *, s32, s32); /* extern */
? func_8016A268(GlobalContext *, ?, ?, ?, s32, s32); /* extern */
Actor *func_80BBFDB0(EnNb *arg0, GlobalContext *arg1, s32 arg2, s16 arg3); /* static */
void func_80BBFE60(EnNb *arg0);                     /* static */
s32 func_80BBFE8C(EnNb *arg0, s32 arg1);            /* static */
void func_80BBFF24(Actor *arg0, GlobalContext *arg1); /* static */
Actor *func_80BBFF90(EnNb *arg0, GlobalContext *arg1); /* static */
s32 func_80BBFFD4(Actor *arg0, s16 arg1);           /* static */
s8 func_80BC0050(Actor *arg0, s32 arg1);            /* static */
s32 func_80BC00AC(Actor *arg0, GlobalContext *arg1); /* static */
s32 func_80BC01DC(Actor *arg0, GlobalContext *arg1); /* static */
? *func_80BC045C(Actor *arg0, GlobalContext *arg1); /* static */
