typedef struct EnTest3 {
    /* 0x000 */ Actor actor;
    /* 0x144 */ char pad_144[0x3];
    /* 0x147 */ s8 unk_147;                         /* inferred */
    /* 0x148 */ s8 unk_148;                         /* inferred */
    /* 0x149 */ char pad_149[0x2];                  /* maybe part of unk_148[3]? */
    /* 0x14B */ s8 unk_14B;                         /* inferred */
    /* 0x14C */ char pad_14C[0x7];                  /* maybe part of unk_14B[8]? */
    /* 0x153 */ u8 unk_153;                         /* inferred */
    /* 0x154 */ char pad_154[0x1];
    /* 0x155 */ u8 unk_155;                         /* inferred */
    /* 0x156 */ char pad_156[0xA2];                 /* maybe part of unk_155[163]? */
    /* 0x1F8 */ s32 unk_1F8;                        /* inferred */
    /* 0x1FC */ char pad_1FC[0x40];                 /* maybe part of unk_1F8[17]? */
    /* 0x23C */ void *unk_23C;                      /* inferred */
    /* 0x240 */ char pad_240[0x154];                /* maybe part of unk_23C[86]? */
    /* 0x394 */ u8 unk_394;                         /* inferred */
    /* 0x395 */ char pad_395[0x183];                /* maybe part of unk_394[388]? */
    /* 0x518 */ ColliderCylinder unk_518;           /* inferred */
    /* 0x564 */ ColliderQuad unk_564;               /* inferred */
    /* 0x5E4 */ ColliderQuad unk_5E4;               /* inferred */
    /* 0x664 */ ColliderQuad unk_664;               /* inferred */
    /* 0x6E4 */ ColliderCylinder unk_6E4;           /* inferred */
    /* 0x730 */ char pad_730[0xC];
    /* 0x73C */ s32 unk_73C;                        /* inferred */
    /* 0x740 */ s32 unk_740;                        /* inferred */
    /* 0x744 */ s32 unk_744;                        /* inferred */
    /* 0x748 */ char pad_748[0x24];                 /* maybe part of unk_744[10]? */
    /* 0x76C */ void (*actionFunc)(EnTest3 *, GlobalContext *);
    /* 0x770 */ char pad_770[0x2F8];                /* maybe part of actionFunc[191]? */
    /* 0xA68 */ ? *unk_A68;                         /* inferred */
    /* 0xA6C */ char pad_A6C[0x14];                 /* maybe part of unk_A68[6]? */
    /* 0xA80 */ s32 unk_A80;                        /* inferred */
    /* 0xA84 */ char pad_A84[0x2];
    /* 0xA86 */ s8 unk_A86;                         /* inferred */
    /* 0xA87 */ char pad_A87[0x49];                 /* maybe part of unk_A86[74]? */
    /* 0xAD0 */ f32 unk_AD0;                        /* inferred */
    /* 0xAD4 */ char pad_AD4[0x2AC];                /* maybe part of unk_AD0[172]? */
    /* 0xD80 */ s32 unk_D80;                        /* inferred */
    /* 0xD84 */ f32 unk_D84;                        /* inferred */
    /* 0xD88 */ s8 unk_D88;                         /* inferred */
    /* 0xD89 */ char pad_D89[0x5];                  /* maybe part of unk_D88[6]? */
    /* 0xD8E */ s16 unk_D8E;                        /* inferred */
    /* 0xD90 */ Actor *unk_D90;                     /* inferred */
    /* 0xD94 */ ? (*unk_D94)(EnTest3 *, GlobalContext *); /* inferred */
    /* 0xD98 */ char pad_D98[0x20];                 /* maybe part of unk_D94[9]? */
} EnTest3;                                          /* size = 0xDB8 */

struct _mips2c_stack_EnTest3_Destroy {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_EnTest3_Init {
    /* 0x00 */ char pad_0[0x28];
    /* 0x28 */ void *sp28;                          /* inferred */
    /* 0x2C */ Camera *sp2C;                        /* inferred */
    /* 0x30 */ char pad_30[0x8];
};                                                  /* size = 0x38 */

struct _mips2c_stack_EnTest3_Update {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ void *sp2C;                          /* inferred */
    /* 0x30 */ PosRot *sp30;                        /* inferred */
    /* 0x34 */ ? sp34;                              /* inferred */
    /* 0x34 */ char pad_34[0x14];
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_80A3E7E0 {};              /* size 0x0 */

struct _mips2c_stack_func_80A3E80C {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ void *sp18;                          /* inferred */
    /* 0x1C */ char pad_1C[0x4];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80A3E870 {};              /* size 0x0 */

struct _mips2c_stack_func_80A3E884 {};              /* size 0x0 */

struct _mips2c_stack_func_80A3E898 {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ s32 sp18;                            /* inferred */
    /* 0x1C */ char pad_1C[0x2];
    /* 0x1E */ u16 sp1E;                            /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80A3E960 {};              /* size 0x0 */

struct _mips2c_stack_func_80A3E97C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A3E9DC {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A3EA30 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A3EAC4 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A3EAF8 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80A3EB8C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A3EBFC {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A3EC30 {};              /* size 0x0 */

struct _mips2c_stack_func_80A3EC44 {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ void *sp18;                          /* inferred */
    /* 0x1C */ char pad_1C[0x4];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80A3ECEC {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A3ED24 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A3F080 {};              /* size 0x0 */

struct _mips2c_stack_func_80A3F09C {};              /* size 0x0 */

struct _mips2c_stack_func_80A3F0B0 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ ActorContext *sp1C;                  /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80A3F114 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A3F15C {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ Vec3f *sp20;                         /* inferred */
    /* 0x24 */ char pad_24[0x4];
    /* 0x28 */ ? sp28;                              /* inferred */
    /* 0x28 */ char pad_28[0xC];
    /* 0x34 */ ? sp34;                              /* inferred */
    /* 0x34 */ char pad_34[0xC];
    /* 0x40 */ Vec3s *sp40;                         /* inferred */
    /* 0x44 */ char pad_44[0x4];
    /* 0x48 */ Path *sp48;                          /* inferred */
    /* 0x4C */ char pad_4C[0x4];
};                                                  /* size = 0x50 */

struct _mips2c_stack_func_80A3F2BC {
    /* 0x00 */ char pad_0[0x38];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80A3F384 {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ ? sp2C;                              /* inferred */
    /* 0x2C */ char pad_2C[0x8];
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ Actor *sp38;                         /* inferred */
    /* 0x3C */ void *sp3C;                          /* inferred */
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80A3F4A4 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80A3F534 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A3F5A4 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A3F62C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A3F73C {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ ActorContext *sp20;                  /* inferred */
    /* 0x24 */ char pad_24[0x4];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80A3F8D4 {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80A3F9A4 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A3F9E4 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A3FA58 {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ s32 sp2C;                            /* inferred */
    /* 0x30 */ ? sp30;                              /* inferred */
    /* 0x30 */ char pad_30[0x4];
    /* 0x34 */ s32 sp34;                            /* inferred */
    /* 0x38 */ s32 sp38;                            /* inferred */
    /* 0x3C */ char pad_3C[0x4];
    /* 0x40 */ ? sp40;                              /* inferred */
    /* 0x40 */ char pad_40[0x1];
    /* 0x41 */ s8 sp41;                             /* inferred */
    /* 0x42 */ char pad_42[0xE];
};                                                  /* size = 0x50 */

struct _mips2c_stack_func_80A3FBCC {};              /* size 0x0 */

struct _mips2c_stack_func_80A3FBE8 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A3FDE4 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A3FE20 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ ? sp1C;                              /* inferred */
    /* 0x1C */ char pad_1C[0x4];
    /* 0x20 */ s32 sp20;                            /* inferred */
    /* 0x24 */ s32 sp24;                            /* inferred */
    /* 0x28 */ char pad_28[0x4];
    /* 0x2C */ ? sp2C;                              /* inferred */
    /* 0x2C */ char pad_2C[0x1];
    /* 0x2D */ s8 sp2D;                             /* inferred */
    /* 0x2E */ char pad_2E[0x2];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80A3FF10 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80A3FFD0 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A40098 {
    /* 0x00 */ char pad_0[0x26];
    /* 0x26 */ u16 sp26;                            /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80A40230 {
    /* 0x000 */ char pad_0[0x38];
    /* 0x038 */ Vec3f *sp38;                        /* inferred */
    /* 0x03C */ void *sp3C;                         /* inferred */
    /* 0x040 */ Vec3f *sp40;                        /* inferred */
    /* 0x044 */ s32 *sp44;                          /* inferred */
    /* 0x048 */ s32 *sp48;                          /* inferred */
    /* 0x04C */ void *sp4C;                         /* inferred */
    /* 0x050 */ char pad_50[0x8];                   /* maybe part of sp4C[3]? */
    /* 0x058 */ s32 sp58;                           /* inferred */
    /* 0x05C */ f32 sp5C;                           /* inferred */
    /* 0x060 */ f32 sp60;                           /* inferred */
    /* 0x064 */ char pad_64[0x4];
    /* 0x068 */ s32 sp68;                           /* inferred */
    /* 0x06C */ s32 sp6C;                           /* inferred */
    /* 0x070 */ f32 sp70;                           /* inferred */
    /* 0x074 */ f32 sp74;                           /* inferred */
    /* 0x078 */ f32 sp78;                           /* inferred */
    /* 0x07C */ ? sp7C;                             /* inferred */
    /* 0x07C */ char pad_7C[0xC];
    /* 0x088 */ ? sp88;                             /* inferred */
    /* 0x088 */ char pad_88[0xC];
    /* 0x094 */ ? sp94;                             /* inferred */
    /* 0x094 */ char pad_94[0x424];
};                                                  /* size = 0x4B8 */

struct _mips2c_stack_func_80A40678 {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ u8 sp2C;                             /* inferred */
    /* 0x2D */ char pad_2D[0xF];                    /* maybe part of sp2C[16]? */
    /* 0x3C */ s8 *sp3C;                            /* inferred */
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80A40824 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A4084C {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80A40908 {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80A409D4 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A40A6C {};              /* size 0x0 */

struct _mips2c_stack_func_80A40CF0 {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80A40F34 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ MtxF *sp1C;                          /* inferred */
    /* 0x20 */ char pad_20[0x18];                   /* maybe part of sp1C[7]? */
    /* 0x38 */ s16 *sp38;                           /* inferred */
    /* 0x3C */ char pad_3C[0x4];
    /* 0x40 */ ? sp40;                              /* inferred */
    /* 0x40 */ char pad_40[0x14];
    /* 0x54 */ void *sp54;                          /* inferred */
    /* 0x58 */ ? sp58;                              /* inferred */
    /* 0x58 */ char pad_58[0x48];
};                                                  /* size = 0xA0 */

struct _mips2c_stack_func_80A4129C {
    /* 0x00 */ char pad_0[0x4C];
    /* 0x4C */ ? sp4C;                              /* inferred */
    /* 0x4C */ char pad_4C[0x8];
    /* 0x54 */ f32 sp54;                            /* inferred */
    /* 0x58 */ char pad_58[0x8];                    /* maybe part of sp54[3]? */
    /* 0x60 */ GraphicsContext *sp60;               /* inferred */
    /* 0x64 */ Gfx *sp64;                           /* inferred */
    /* 0x68 */ s32 sp68;                            /* inferred */
    /* 0x6C */ s32 sp6C;                            /* inferred */
    /* 0x70 */ char pad_70[0x8];
};                                                  /* size = 0x78 */

? func_80123BD4(EnTest3 *, ?);                      /* extern */
? func_80125318(Gfx **, Vec3f *);                   /* extern */
? func_80125500(Vec3s *, GlobalContext *, Gfx **, Vec3f *); /* extern */
? func_80126B8C(void **, Vec3s *);                  /* extern */
s32 func_80127438(void **, Vec3s *, u8, Vec3s *);   /* extern */
? func_80128640(void **, Vec3s *, Gfx *, Vec3s *);  /* extern */
? func_80128B74(void **, Vec3s *, s32, Vec3s *);    /* extern */
? func_80A3E7E0(EnTest3 *arg0, void (*arg1)(Actor *, GlobalContext *)); /* static */
s32 func_80A3E80C(EnTest3 *arg0, s32 arg2, s32);    /* static */
? func_80A3E870(s32 arg0, ? arg1);                  /* static */
? func_80A3E884(s32 arg0, ? arg1);                  /* static */
? func_80A3E898(void *arg0, GlobalContext *arg1);   /* static */
? func_80A3E960(void *arg0, ? arg1);                /* static */
