typedef struct EnOt {
    /* 0x000 */ Actor actor;
    /* 0x144 */ void (*actionFunc)(EnOt *, GlobalContext *);
    /* 0x148 */ SkelAnime unk_148;                  /* inferred */
    /* 0x18C */ ColliderCylinder unk_18C;           /* inferred */
    /* 0x1D8 */ Vec3s unk_1D8;                      /* inferred */
    /* 0x1DE */ char pad_1DE[0x6C];                 /* maybe part of unk_1D8[19]? */
    /* 0x24A */ Vec3s unk_24A;                      /* inferred */
    /* 0x250 */ char pad_250[0x6C];                 /* maybe part of unk_24A[19]? */
    /* 0x2BC */ s32 unk_2BC;                        /* inferred */
    /* 0x2C0 */ EnDno_ActorUnkStruct unk_2C0;       /* inferred */
    /* 0x32C */ u16 unk_32C;                        /* inferred */
    /* 0x32E */ char pad_32E[0x2];
    /* 0x330 */ Vec3f unk_330;                      /* inferred */
    /* 0x33C */ s32 unk_33C;                        /* inferred */
    /* 0x340 */ char pad_340[0x4];
    /* 0x344 */ s16 unk_344;                        /* inferred */
    /* 0x346 */ s16 unk_346;                        /* inferred */
    /* 0x348 */ f32 unk_348;                        /* inferred */
    /* 0x34C */ f32 unk_34C;                        /* inferred */
    /* 0x350 */ f32 unk_350;                        /* inferred */
    /* 0x354 */ s16 unk_354;                        /* inferred */
    /* 0x356 */ s16 unk_356;                        /* inferred */
    /* 0x358 */ char pad_358[0x2];
    /* 0x35A */ s16 unk_35A;                        /* inferred */
    /* 0x35C */ s16 unk_35C;                        /* inferred */
    /* 0x35E */ char pad_35E[0x2];
    /* 0x360 */ EnOt *unk_360;                      /* inferred */
    /* 0x364 */ LightNode *unk_364;                 /* inferred */
    /* 0x368 */ LightInfo unk_368;                  /* inferred */
    /* 0x376 */ char pad_376[0x2];
    /* 0x378 */ ? unk_378;                          /* inferred */
    /* 0x378 */ char pad_378[0x4];
    /* 0x37C */ f32 unk_37C;                        /* inferred */
    /* 0x380 */ f32 unk_380;                        /* inferred */
    /* 0x384 */ u8 unk_384;                         /* inferred */
    /* 0x385 */ char pad_385[0x3];                  /* maybe part of unk_384[4]? */
    /* 0x388 */ s32 unk_388;                        /* inferred */
    /* 0x38C */ s32 unk_38C;                        /* inferred */
    /* 0x390 */ s16 unk_390;                        /* inferred */
    /* 0x392 */ char pad_392[0x2];
    /* 0x394 */ Vec3f unk_394;                      /* inferred */
    /* 0x398 */ f32 unk_398;                        /* overlap; inferred */
    /* 0x39C */ f32 unk_39C;                        /* overlap; inferred */
    /* 0x3A0 */ s16 unk_3A0;                        /* inferred */
    /* 0x3A2 */ char pad_3A2[0x2];
    /* 0x3A4 */ u8 unk_3A4;                         /* inferred */
    /* 0x3A5 */ char pad_3A5[0x397];                /* maybe part of unk_3A4[920]? */
    /* 0x73C */ s16 unk_73C;                        /* inferred */
    /* 0x73E */ char pad_73E[0x2];
    /* 0x740 */ f32 unk_740;                        /* inferred */
    /* 0x744 */ s8 unk_744;                         /* inferred */
    /* 0x745 */ s8 unk_745;                         /* inferred */
    /* 0x746 */ s8 unk_746;                         /* inferred */
    /* 0x747 */ ? unk_747;                          /* inferred */
    /* 0x747 */ char pad_747[0x1];
    /* 0x748 */ u8 unk_748;                         /* inferred */
    /* 0x749 */ u8 unk_749;                         /* inferred */
    /* 0x74A */ char pad_74A[0x2];                  /* maybe part of unk_749[3]? */
    /* 0x74C */ Vec3f unk_74C;                      /* inferred */
} EnOt;                                             /* size = 0x758 */

struct _mips2c_stack_EnOt_Destroy {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnOt_Draw {
    /* 0x00 */ char pad_0[0x34];
    /* 0x34 */ GraphicsContext *sp34;               /* inferred */
    /* 0x38 */ char pad_38[0x4];
    /* 0x3C */ GraphicsContext *sp3C;               /* inferred */
    /* 0x40 */ Gfx *sp40;                           /* inferred */
    /* 0x44 */ char pad_44[0xC];
};                                                  /* size = 0x50 */

struct _mips2c_stack_EnOt_Init {
    /* 0x00 */ char pad_0[0x3C];
    /* 0x3C */ PosRot *sp3C;                        /* inferred */
    /* 0x40 */ SkelAnime *sp40;                     /* inferred */
    /* 0x44 */ char pad_44[0x6];                    /* maybe part of sp40[2]? */
    /* 0x4A */ s16 sp4A;                            /* inferred */
    /* 0x4C */ f32 sp4C;                            /* inferred */
    /* 0x50 */ char pad_50[0x8];                    /* maybe part of sp4C[3]? */
    /* 0x58 */ ? sp58;                              /* inferred */
    /* 0x58 */ char pad_58[0xC];
    /* 0x64 */ f32 sp64;                            /* inferred */
    /* 0x68 */ f32 sp68;                            /* inferred */
    /* 0x6C */ f32 sp6C;                            /* inferred */
    /* 0x70 */ char pad_70[0x4];
    /* 0x74 */ ? sp74;                              /* inferred */
    /* 0x74 */ char pad_74[0xC];
};                                                  /* size = 0x80 */

struct _mips2c_stack_EnOt_Update {
    /* 0x00 */ char pad_0[0x58];
    /* 0x58 */ SkelAnime *sp58;                     /* inferred */
    /* 0x5C */ char pad_5C[0x14];
};                                                  /* size = 0x70 */

struct _mips2c_stack_func_80B5B2E0 {
    /* 0x00 */ char pad_0[0x4C];
    /* 0x4C */ ? sp4C;                              /* inferred */
    /* 0x4C */ char pad_4C[0xC];
    /* 0x58 */ ? sp58;                              /* inferred */
    /* 0x58 */ char pad_58[0x18];
};                                                  /* size = 0x70 */

struct _mips2c_stack_func_80B5BAAC {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80B5BB38 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B5BDA8 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80B5BE04 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B5BE88 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B5BED4 {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80B5BF60 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80B5BFB8 {
    /* 0x00 */ char pad_0[0x34];
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ f32 sp3C;                            /* inferred */
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80B5C154 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80B5C1CC {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80B5C244 {};              /* size 0x0 */

struct _mips2c_stack_func_80B5C25C {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80B5C3B8 {};              /* size 0x0 */

struct _mips2c_stack_func_80B5C3D8 {
    /* 0x00 */ char pad_0[0x28];
    /* 0x28 */ ActorShape *sp28;                    /* inferred */
    /* 0x2C */ u8 *sp2C;                            /* inferred */
    /* 0x30 */ Vec3f *sp30;                         /* inferred */
    /* 0x34 */ char pad_34[0x4];
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ f32 sp3C;                            /* inferred */
    /* 0x40 */ f32 sp40;                            /* inferred */
    /* 0x44 */ ? sp44;                              /* inferred */
    /* 0x44 */ char pad_44[0xC];
    /* 0x50 */ f32 sp50;                            /* inferred */
    /* 0x54 */ char pad_54[0x4];
    /* 0x58 */ f32 sp58;                            /* inferred */
    /* 0x5C */ f32 sp5C;                            /* inferred */
    /* 0x60 */ char pad_60[0x4];
    /* 0x64 */ f32 sp64;                            /* inferred */
    /* 0x68 */ char pad_68[0x8];
};                                                  /* size = 0x70 */

struct _mips2c_stack_func_80B5C634 {};              /* size 0x0 */

struct _mips2c_stack_func_80B5C64C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B5C684 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B5C6DC {
    /* 0x00 */ char pad_0[0x30];
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ char pad_34[0x4];
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ char pad_3C[0x2];
    /* 0x3E */ s16 sp3E;                            /* inferred */
    /* 0x40 */ char pad_40[0x4];                    /* maybe part of sp3E[3]? */
    /* 0x44 */ Actor *sp44;                         /* inferred */
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_80B5C910 {};              /* size 0x0 */

struct _mips2c_stack_func_80B5C950 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B5C9A8 {};              /* size 0x0 */

struct _mips2c_stack_func_80B5C9C0 {};              /* size 0x0 */

struct _mips2c_stack_func_80B5C9D0 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B5CA30 {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80B5CAD0 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B5CB0C {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80B5CBA0 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80B5CBEC {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80B5CC88 {};              /* size 0x0 */

struct _mips2c_stack_func_80B5CCA0 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B5CCF4 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B5CD40 {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ Actor *sp2C;                         /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80B5CE6C {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80B5CEC8 {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ ? sp2C;                              /* inferred */
    /* 0x2C */ char pad_2C[0x10];
    /* 0x3C */ Actor *sp3C;                         /* inferred */
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80B5D114 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B5D160 {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80B5D37C {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ f32 sp20;                            /* inferred */
    /* 0x24 */ f32 sp24;                            /* inferred */
    /* 0x28 */ char pad_28[0x8];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80B5D470 {
    /* 0x00 */ char pad_0[0x30];
    /* 0x30 */ s32 sp30;                            /* inferred */
    /* 0x34 */ s32 sp34;                            /* inferred */
    /* 0x38 */ char pad_38[0x8];                    /* maybe part of sp34[3]? */
    /* 0x40 */ f32 sp40;                            /* inferred */
    /* 0x44 */ f32 sp44;                            /* inferred */
    /* 0x48 */ f32 sp48;                            /* inferred */
    /* 0x4C */ f32 sp4C;                            /* inferred */
    /* 0x50 */ f32 sp50;                            /* inferred */
    /* 0x54 */ f32 sp54;                            /* inferred */
    /* 0x58 */ f32 sp58;                            /* inferred */
    /* 0x5C */ char pad_5C[0x4];
    /* 0x60 */ s32 sp60;                            /* inferred */
    /* 0x64 */ char pad_64[0x4];
};                                                  /* size = 0x68 */

struct _mips2c_stack_func_80B5D648 {
    /* 0x00 */ char pad_0[0x38];
    /* 0x38 */ Vec3f *sp38;                         /* inferred */
    /* 0x3C */ Vec3f *sp3C;                         /* inferred */
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80B5D750 {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80B5DAEC {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ ? *sp24;                             /* inferred */
    /* 0x28 */ char pad_28[0x8];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80B5DB6C {
    /* 0x00 */ char pad_0[0x4C];
    /* 0x4C */ s32 sp4C;                            /* inferred */
    /* 0x50 */ f32 sp50;                            /* inferred */
    /* 0x54 */ f32 sp54;                            /* inferred */
    /* 0x58 */ f32 sp58;                            /* inferred */
    /* 0x5C */ Actor *sp5C;                         /* inferred */
    /* 0x60 */ char pad_60[0x8];
};                                                  /* size = 0x68 */

struct _mips2c_stack_func_80B5DECC {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B5DF58 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80B5E078 {
    /* 0x00 */ char pad_0[0x54];
    /* 0x54 */ f32 sp54;                            /* inferred */
    /* 0x58 */ f32 sp58;                            /* inferred */
    /* 0x5C */ f32 sp5C;                            /* inferred */
};                                                  /* size = 0x60 */

struct _mips2c_stack_func_80B5E1D8 {
    /* 0x00 */ char pad_0[0x40];
};                                                  /* size = 0x40 */

f32 func_800C40B4(CollisionContext *, CollisionPoly **, ? *, PosRot *); /* extern */
s32 func_801242B4(Actor *);                         /* extern */
void func_80B5B2E0(GlobalContext *arg0, Vec3f *arg1, s16 arg2, Vec3f *arg3, s32 *arg4); /* static */
void func_80B5BAAC(LightInfo *arg0, ? *arg1, ? *arg2, s16 arg3); /* static */
void func_80B5BB38(? *arg0, s8 *arg1, f32 arg2);    /* static */
void func_80B5BDA8(EnOt *arg0, GlobalContext *arg1); /* static */
void func_80B5BE88(EnOt *arg0, GlobalContext *arg1); /* static */
void func_80B5BF60(EnOt *arg0, GlobalContext *arg1); /* static */
void func_80B5C154(Actor *arg0, GlobalContext *arg1); /* static */
void func_80B5C244(EnOt *arg0, GlobalContext *arg1); /* static */
void func_80B5C3B8(EnOt *arg0, GlobalContext *arg1); /* static */
void func_80B5C634(EnOt *arg0, GlobalContext *arg1); /* static */
