f32 func_800C40B4(CollisionContext *, CollisionPoly **, ? *, PosRot *); /* extern */
s32 func_801242B4(Actor *);                         /* extern */
void func_80B5B2E0(GlobalContext *arg0, Vec3f *arg1, s16 arg2, Vec3f *arg3, s32 *arg4); /* static */
void func_80B5BAAC(LightInfo *arg0, f32 *arg1, u8 *arg2, s16 arg3); /* static */
void func_80B5BB38(u8 *arg0, u8 *arg1, f32 arg2);   /* static */
void func_80B5BDA8(EnOt *arg0, GlobalContext *arg1); /* static */
void func_80B5BE88(EnOt *arg0, GlobalContext *arg1); /* static */
void func_80B5BF60(EnOt *arg0, GlobalContext *arg1); /* static */
void func_80B5C154(Actor *arg0, GlobalContext *arg1); /* static */
void func_80B5C244(EnOt *arg0, GlobalContext *arg1); /* static */
void func_80B5C3B8(EnOt *arg0, GlobalContext *arg1); /* static */
void func_80B5C634(EnOt *arg0, GlobalContext *arg1); /* static */
void func_80B5C684(EnOt *arg0, GlobalContext *arg1); /* static */
void func_80B5C910(EnOt *arg0, GlobalContext *arg1); /* static */
void func_80B5C9A8(EnOt *arg0, GlobalContext *arg1, s32); /* static */
void func_80B5C9D0(EnOt *arg0, GlobalContext *arg1); /* static */
void func_80B5CAD0(EnOt *arg0, GlobalContext *arg1); /* static */
void func_80B5CBA0(Actor *arg0, GlobalContext *arg1); /* static */
void func_80B5CC88(EnOt *arg0, GlobalContext *arg1); /* static */
void func_80B5CCF4(EnOt *arg0, GlobalContext *arg1); /* static */
void func_80B5CE6C(EnOt *arg0, GlobalContext *arg1); /* static */
void func_80B5D114(EnOt *arg0, GlobalContext *arg1); /* static */
s32 func_80B5D37C(GlobalContext *arg0, EnDno_ActorUnkStruct *arg1); /* static */
s32 func_80B5D470(GlobalContext *arg0, EnDno_ActorUnkStruct *arg1); /* static */
void func_80B5D648(EnOt *arg0, GlobalContext *arg1); /* static */
void func_80B5DAEC(Actor *this, GlobalContext *globalCtx); /* static */
void func_80B5DB6C(Actor *this, GlobalContext *globalCtx); /* static */
void func_80B5DECC(GlobalContext *globalCtx, s32 limbIndex, Gfx **dList, Vec3s *rot, Actor *actor); /* static */
u8 *func_80B5DF58(u8 *arg0, u8 arg1, Vec3f *arg2, ActorShape *arg3, s32 arg4); /* static */
void func_80B5E078(GlobalContext *arg0, u8 *arg1, s32 arg2); /* static */
void func_80B5E1D8(GlobalContext *arg0, u8 *arg1, s32 arg2); /* static */
extern ? D_06000040;
extern ? D_06000078;
extern ? D_060004A0;
extern void D_060005F8;
extern AnimationHeader D_060008D8;
extern FlexSkeletonHeader D_06004800;
static ColliderCylinderInit D_80B5E3A0 = {
    {0, 0, 0x19, 0x39, 0x10, 1},
    {1, {0, 0, 0}, {0xF7CFFFFF, 0, 0}, 0, 1, 1},
    {5, 0x21, 0xFFEC, {0, 0, 0}},
};
static struct_80B8E1A8 D_80B5E3CC = {
    {(AnimationHeader *)0x6004B30, 1.0f, 0, -5.0f},
    {(AnimationHeader *)0x60008D8, 1.0f, 0, -5.0f},
    {(AnimationHeader *)0x6000420, 1.0f, 0, 0.0f},
};
static InitChainEntry D_80B5E3FC;                   /* unable to generate initializer */
static Color_RGB8 D_80B5E408 = {0xFF, 0xC8, 0x50};
static Color_RGB8 D_80B5E40C = {0xFF, 0x3C, 0xC8};
static Vec3f D_80B5E410 = {400.0f, 600.0f, 0.0f};
static EnOt *D_80B5E880;
static EnOt *D_80B5E884;
static EnOt *D_80B5E888;

typedef struct EnDno_ActorUnkStruct {
    /* 0x0000 */ Vec3f unk_00;
    /* 0x000C */ char padC[0x4];
    /* 0x0010 */ s16 unk_10;
    /* 0x0012 */ char pad12[0xA];                   /* maybe part of unk_10[6]? */
    /* 0x001C */ u8 unk_1C;
    /* 0x001D */ u8 unk_1D;
    /* 0x001E */ char pad1E[0x2];                   /* maybe part of unk_1D[3]? */
    /* 0x0020 */ Vec3f unk_20;
    /* 0x002C */ Vec3f unk_2C;
    /* 0x0038 */ f32 unk38;                         /* inferred */
    /* 0x003C */ f32 unk3C;                         /* inferred */
    /* 0x0040 */ f32 unk40;                         /* inferred */
    /* 0x0044 */ char pad44[0x4];                   /* maybe part of unk40[2]? */
    /* 0x0048 */ Actor *unk_48;
    /* 0x004C */ f32 unk_4C;
    /* 0x0050 */ f32 unk_50;
    /* 0x0054 */ s16 unk_54;
    /* 0x0056 */ s16 unk_56;
    /* 0x0058 */ s32 unk_58;
    /* 0x005C */ s32 (*unk_5C)(GlobalContext *, EnDno_ActorUnkStruct *);
    /* 0x0060 */ s32 (*unk_60)(GlobalContext *, EnDno_ActorUnkStruct *);
    /* 0x0064 */ s32 (*unk_64)(GlobalContext *, EnDno_ActorUnkStruct *);
    /* 0x0068 */ s32 (*unk_68)(GlobalContext *, EnDno_ActorUnkStruct *);
} EnDno_ActorUnkStruct;                             /* size 0x6C */

typedef struct EnOt {
    /* 0x0000 */ Actor actor;
    /* 0x0144 */ void (*actionFunc)(EnOt *, GlobalContext *);
    /* 0x0148 */ SkelAnime unk148;                  /* inferred */
    /* 0x018C */ ColliderCylinder unk18C;           /* inferred */
    /* 0x01D8 */ Vec3s unk1D8;                      /* inferred */
    /* 0x01DE */ char pad1DE[0x6C];                 /* maybe part of unk1D8[19]? */
    /* 0x024A */ Vec3s unk24A;                      /* inferred */
    /* 0x0250 */ char pad250[0x6C];                 /* maybe part of unk24A[19]? */
    /* 0x02BC */ s32 unk2BC;                        /* inferred */
    /* 0x02C0 */ EnDno_ActorUnkStruct unk2C0;       /* inferred */
    /* 0x032C */ u16 unk32C;                        /* inferred */
    /* 0x032E */ char pad32E[0x2];                  /* maybe part of unk32C[2]? */
    /* 0x0330 */ Vec3f unk330;                      /* inferred */
    /* 0x033C */ s32 unk33C;                        /* inferred */
    /* 0x0340 */ char pad340[0x4];                  /* maybe part of unk33C[2]? */
    /* 0x0344 */ s16 unk344;                        /* inferred */
    /* 0x0346 */ s16 unk346;                        /* inferred */
    /* 0x0348 */ f32 unk348;                        /* inferred */
    /* 0x034C */ f32 unk34C;                        /* inferred */
    /* 0x0350 */ f32 unk350;                        /* inferred */
    /* 0x0354 */ s16 unk354;                        /* inferred */
    /* 0x0356 */ s16 unk356;                        /* inferred */
    /* 0x0358 */ char pad358[0x2];                  /* maybe part of unk356[2]? */
    /* 0x035A */ s16 unk35A;                        /* inferred */
    /* 0x035C */ s16 unk35C;                        /* inferred */
    /* 0x035E */ char pad35E[0x2];                  /* maybe part of unk35C[2]? */
    /* 0x0360 */ EnOt *unk360;                      /* inferred */
    /* 0x0364 */ LightNode *unk364;                 /* inferred */
    /* 0x0368 */ LightInfo unk368;                  /* inferred */
    /* 0x0376 */ char pad376[0x2];
    /* 0x0378 */ f32 unk378;                        /* inferred */
    /* 0x037C */ f32 unk37C;                        /* inferred */
    /* 0x0380 */ f32 unk380;                        /* inferred */
    /* 0x0384 */ u8 unk384;                         /* inferred */
    /* 0x0385 */ char pad385[0x3];                  /* maybe part of unk384[4]? */
    /* 0x0388 */ s32 unk388;                        /* inferred */
    /* 0x038C */ s32 unk38C;                        /* inferred */
    /* 0x0390 */ s16 unk390;                        /* inferred */
    /* 0x0392 */ char pad392[0x2];                  /* maybe part of unk390[2]? */
    /* 0x0394 */ f32 unk394;                        /* inferred */
    /* 0x0398 */ f32 unk398;                        /* inferred */
    /* 0x039C */ f32 unk39C;                        /* inferred */
    /* 0x03A0 */ s16 unk3A0;                        /* inferred */
    /* 0x03A2 */ char pad3A2[0x2];                  /* maybe part of unk3A0[2]? */
    /* 0x03A4 */ u8 unk3A4;                         /* inferred */
    /* 0x03A5 */ char pad3A5[0x397];                /* maybe part of unk3A4[920]? */
    /* 0x073C */ s16 unk73C;                        /* inferred */
    /* 0x073E */ char pad73E[0x2];                  /* maybe part of unk73C[2]? */
    /* 0x0740 */ f32 unk740;                        /* inferred */
    /* 0x0744 */ u8 unk744;                         /* inferred */
    /* 0x0745 */ s8 unk745;                         /* inferred */
    /* 0x0746 */ s8 unk746;                         /* inferred */
    /* 0x0747 */ u8 unk747;                         /* inferred */
    /* 0x0748 */ u8 unk748;                         /* inferred */
    /* 0x0749 */ u8 unk749;                         /* inferred */
    /* 0x074A */ char pad74A[0x2];                  /* maybe part of unk749[3]? */
    /* 0x074C */ Vec3f unk74C;                      /* inferred */
} EnOt;                                             /* size 0x758 */

void func_80B5B2E0(GlobalContext *arg0, Vec3f *arg1, s16 arg2, Vec3f *arg3, s32 *arg4) {
    Vec3f sp58;
    Vec3f sp4C;
    f32 temp_f0;
    f32 temp_f20;
    s32 temp_s0;
    void *temp_s3;
    s32 phi_s1;
    f32 phi_f20;
    s32 phi_s0;

    temp_s3 = arg0->setupPathList + (arg2 * 8);
    phi_s1 = 0;
    phi_f20 = 3.4028235e38f;
    phi_s0 = 0;
    if ((s32) temp_s3->unk0 > 0) {
        do {
            Math_Vec3s_ToVec3f(&sp58, Lib_SegmentedToVirtual(temp_s3->unk4) + phi_s1);
            temp_f0 = Math_Vec3f_DistXYZ(arg1, &sp58);
            if (temp_f0 < phi_f20) {
                temp_f20 = temp_f0;
                Math_Vec3f_Copy(&sp4C, &sp58);
                *arg4 = phi_s0;
                phi_f20 = temp_f20;
            }
            temp_s0 = phi_s0 + 1;
            phi_s1 += 6;
            phi_s0 = temp_s0;
