typedef struct EnHintSkb {
    /* 0x000 */ Actor actor;
    /* 0x144 */ ColliderJntSph unk_144;             /* inferred */
    /* 0x164 */ ColliderJntSphElement unk_164;      /* inferred */
    /* 0x1A4 */ char pad_1A4[0x40];
    /* 0x1E4 */ SkelAnime unk_1E4;                  /* inferred */
    /* 0x228 */ void (*actionFunc)(EnHintSkb *, GlobalContext *);
    /* 0x22C */ Vec3f unk_22C;                      /* inferred */
    /* 0x238 */ char pad_238[0x9C];                 /* maybe part of unk_22C[14]? */
    /* 0x2D4 */ f32 unk_2D4;                        /* inferred */
    /* 0x2D8 */ f32 unk_2D8;                        /* inferred */
    /* 0x2DC */ s32 unk_2DC;                        /* inferred */
    /* 0x2E0 */ Vec3s unk_2E0;                      /* inferred */
    /* 0x2E6 */ char pad_2E6[0x72];                 /* maybe part of unk_2E0[20]? */
    /* 0x358 */ Vec3s unk_358;                      /* inferred */
    /* 0x35E */ char pad_35E[0x7E];                 /* maybe part of unk_358[22]? */
    /* 0x3DC */ s16 unk_3DC;                        /* inferred */
    /* 0x3DE */ s16 unk_3DE;                        /* inferred */
    /* 0x3E0 */ s16 unk_3E0;                        /* inferred */
    /* 0x3E2 */ s16 unk_3E2;                        /* inferred */
    /* 0x3E4 */ s16 unk_3E4;                        /* inferred */
    /* 0x3E6 */ u16 unk_3E6;                        /* inferred */
    /* 0x3E8 */ u8 unk_3E8;                         /* inferred */
    /* 0x3E9 */ u8 unk_3E9;                         /* inferred */
    /* 0x3EA */ char pad_3EA[0x2];                  /* maybe part of unk_3E9[3]? */
} EnHintSkb;                                        /* size = 0x3EC */

struct _mips2c_stack_EnHintSkb_Destroy {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnHintSkb_Draw {
    /* 0x00 */ char pad_0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_EnHintSkb_Init {
    /* 0x00 */ char pad_0[0x34];
    /* 0x34 */ ColliderJntSph *sp34;                /* inferred */
    /* 0x38 */ char pad_38[0x8];
};                                                  /* size = 0x40 */

struct _mips2c_stack_EnHintSkb_Update {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80C1FE0C {};              /* size 0x0 */

struct _mips2c_stack_func_80C1FE20 {};              /* size 0x0 */

struct _mips2c_stack_func_80C1FE30 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80C1FE80 {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ SkelAnime *sp2C;                     /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80C1FF30 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80C1FF88 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ SkelAnime *sp24;                     /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80C2003C {
    /* 0x00 */ char pad_0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80C200B8 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80C2011C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80C2016C {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80C20274 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80C20334 {
    /* 0x00 */ char pad_0[0x38];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80C20484 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80C204F0 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80C20540 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80C20590 {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80C2066C {};              /* size 0x0 */

struct _mips2c_stack_func_80C2069C {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80C2075C {};              /* size 0x0 */

struct _mips2c_stack_func_80C2077C {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80C208BC {};              /* size 0x0 */

struct _mips2c_stack_func_80C208D0 {
    /* 0x00 */ char pad_0[0x38];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80C20A74 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80C20B88 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80C20C24 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80C20D64 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80C20E90 {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ void *sp2C;                          /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80C21250 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ Collider *sp24;                      /* inferred */
    /* 0x28 */ CollisionCheckContext *sp28;         /* inferred */
    /* 0x2C */ char pad_2C[0x4];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80C21320 {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80C21414 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80C21468 {
    /* 0x00 */ char pad_0[0x84];
    /* 0x84 */ f32 sp84;                            /* inferred */
    /* 0x88 */ f32 sp88;                            /* inferred */
    /* 0x8C */ f32 sp8C;                            /* inferred */
};                                                  /* size = 0x90 */

struct _mips2c_stack_func_80C215E4 {
    /* 0x00 */ char pad_0[0x40];
    /* 0x40 */ f32 sp40;                            /* inferred */
    /* 0x44 */ f32 sp44;                            /* inferred */
    /* 0x48 */ char pad_48[0x4];
    /* 0x4C */ f32 sp4C;                            /* inferred */
    /* 0x50 */ ? sp50;                              /* inferred */
    /* 0x50 */ char pad_50[0x4];
    /* 0x54 */ f32 sp54;                            /* inferred */
    /* 0x58 */ char pad_58[0x4];
    /* 0x5C */ f32 sp5C;                            /* inferred */
    /* 0x60 */ f32 sp60;                            /* inferred */
    /* 0x64 */ f32 sp64;                            /* inferred */
};                                                  /* size = 0x68 */

struct _mips2c_stack_func_80C21858 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ void *sp1C;                          /* inferred */
    /* 0x20 */ char pad_20[0x8];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80C219D4 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

void func_80C1FE0C(EnHintSkb *arg0, PosRot *, s32); /* static */
void func_80C1FE30(EnHintSkb *arg0);                /* static */
void func_80C1FF30(EnHintSkb *arg0);                /* static */
void func_80C2003C(EnHintSkb *arg0);                /* static */
void func_80C2011C(Actor *arg0);                    /* static */
void func_80C20274(Actor *arg0);                    /* static */
void func_80C20484(EnHintSkb *arg0);                /* static */
void func_80C20540(Actor *arg0);                    /* static */
void func_80C2066C(EnHintSkb *arg0);                /* static */
void func_80C2075C(EnHintSkb *arg0, PosRot *);      /* static */
void func_80C208BC(EnHintSkb *arg0);                /* static */
void func_80C20A74(Actor *arg0, GlobalContext *arg1); /* static */
void func_80C20B88(EnHintSkb *arg0, GlobalContext *arg1); /* static */
