struct _mips2c_stack_EnNiw_CheckRage {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_EnNiw_CuccoStorm {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnNiw_Destroy {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnNiw_Draw {
    /* 0x00 */ char pad_0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_EnNiw_DrawFeathers {
    /* 0x00 */ char pad_0[0x58];
};                                                  /* size = 0x58 */

struct _mips2c_stack_EnNiw_Held {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ ? sp24;                              /* inferred */
    /* 0x24 */ char pad_24[0xC];
};                                                  /* size = 0x30 */

struct _mips2c_stack_EnNiw_Idle {
    /* 0x00 */ char pad_0[0x2E];
    /* 0x2E */ s16 sp2E;                            /* inferred */
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ char pad_38[0x8];
};                                                  /* size = 0x40 */

struct _mips2c_stack_EnNiw_Init {
    /* 0x00 */ char pad_0[0x34];
    /* 0x34 */ PosRot *sp34;                        /* inferred */
    /* 0x38 */ ? sp38;                              /* inferred */
    /* 0x38 */ char pad_38[0x10];
};                                                  /* size = 0x48 */

struct _mips2c_stack_EnNiw_LandBeforeIdle {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnNiw_LimbDraw {};             /* size 0x0 */

struct _mips2c_stack_EnNiw_RunAway {
    /* 0x00 */ char pad_0[0x38];
    /* 0x38 */ ? sp38;                              /* inferred */
    /* 0x38 */ char pad_38[0x10];
};                                                  /* size = 0x48 */

struct _mips2c_stack_EnNiw_SetupCuccoStorm {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnNiw_SetupIdle {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_EnNiw_SetupRunAway {
    /* 0x00 */ char pad_0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_EnNiw_SpawnAttackNiw {
    /* 0x00 */ char pad_0[0x40];
    /* 0x40 */ f32 sp40;                            /* inferred */
    /* 0x44 */ f32 sp44;                            /* inferred */
    /* 0x48 */ char pad_48[0x4];
    /* 0x4C */ f32 sp4C;                            /* inferred */
    /* 0x50 */ f32 sp50;                            /* inferred */
    /* 0x54 */ f32 sp54;                            /* inferred */
};                                                  /* size = 0x58 */

struct _mips2c_stack_EnNiw_SpawnFeather {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ EnNiwFeather *sp18;                  /* inferred */
    /* 0x1C */ char pad_1C[0x4];
};                                                  /* size = 0x20 */

struct _mips2c_stack_EnNiw_Swimming {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ ? sp2C;                              /* inferred */
    /* 0x2C */ char pad_2C[0x4];
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ char pad_34[0x4];
};                                                  /* size = 0x38 */

struct _mips2c_stack_EnNiw_Thrown {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_EnNiw_Trigger {};              /* size 0x0 */

struct _mips2c_stack_EnNiw_Update {
    /* 0x00 */ char pad_0[0x54];
    /* 0x54 */ CollisionCheckContext *sp54;         /* inferred */
    /* 0x58 */ char pad_58[0x54];                   /* maybe part of sp54[22]? */
    /* 0xAC */ f32 spAC;                            /* inferred */
    /* 0xB0 */ f32 spB0;                            /* inferred */
    /* 0xB4 */ f32 spB4;                            /* inferred */
    /* 0xB8 */ f32 spB8;                            /* inferred */
    /* 0xBC */ f32 spBC;                            /* inferred */
    /* 0xC0 */ f32 spC0;                            /* inferred */
    /* 0xC4 */ f32 spC4;                            /* inferred */
    /* 0xC8 */ f32 spC8;                            /* inferred */
    /* 0xCC */ f32 spCC;                            /* inferred */
    /* 0xD0 */ s16 spD0;                            /* inferred */
    /* 0xD2 */ char pad_D2[0x2];
    /* 0xD4 */ Actor *spD4;                         /* inferred */
    /* 0xD8 */ char pad_D8[0x8];
};                                                  /* size = 0xE0 */

struct _mips2c_stack_EnNiw_UpdateFeather {
    /* 0x00 */ char pad_0[0x58];
};                                                  /* size = 0x58 */

struct _mips2c_stack_EnNiw_Upset {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80891320 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_808917F8 {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

void EnNiw_LandBeforeIdle(EnNiw *arg0, GlobalContext *arg1); /* static */
void func_808917F8(EnNiw *arg0, GlobalContext *arg1, s32 arg2); /* static */
extern AnimationHeader D_060000E8;
extern ? D_060023B0;
extern ? D_06002428;
extern FlexSkeletonHeader D_06002530;
static s16 D_80893460 = 0;
static ? D_80893484;                                /* unable to generate initializer */
static ? D_8089348C;                                /* unable to generate initializer */
static ? D_80893490;                                /* unable to generate initializer */
static ColliderCylinderInit D_80893498 = {
    {5, 0, 9, 0x3D, 0x20, 1},
    {0, {0, 0, 0}, {0xF7CFFFFF, 0, 0}, 0, 1, 1},
    {0xF, 0x19, 4, {0, 0, 0}},
};
static ? D_808934C4;                                /* unable to generate initializer */
static InitChainEntry D_808934D0[3];                /* unable to generate initializer */
