CRASHED

struct _mips2c_stack_func_808160A0 {
    /* 0x000 */ char pad_0[0x1B2];
    /* 0x1B2 */ u16 sp1B2;                          /* inferred */
    /* 0x1B4 */ s16 sp1B4;                          /* inferred */
    /* 0x1B6 */ s16 sp1B6;                          /* inferred */
    /* 0x1B8 */ s16 sp1B8;                          /* inferred */
    /* 0x1BA */ char pad_1BA[0x4];                  /* maybe part of sp1B8[3]? */
    /* 0x1BE */ s16 sp1BE;                          /* inferred */
    /* 0x1C0 */ char pad_1C0[0x8];                  /* maybe part of sp1BE[5]? */
    /* 0x1C8 */ s16 sp1C8;                          /* inferred */
    /* 0x1CA */ s16 sp1CA;                          /* inferred */
    /* 0x1CC */ char pad_1CC[0x4];
};                                                  /* size = 0x1D0 */

struct _mips2c_stack_func_80818904 {};              /* size 0x0 */

struct _mips2c_stack_func_80818920 {
    /* 0x00 */ char pad_0[0x30];
    /* 0x30 */ ? sp30;                              /* inferred */
    /* 0x30 */ char pad_30[0x30];
};                                                  /* size = 0x60 */

struct _mips2c_stack_func_808190C4 {};              /* size 0x0 */

struct _mips2c_stack_func_80819238 {
    /* 0x00 */ char pad_0[0x9C];
    /* 0x9C */ GraphicsContext *sp9C;               /* inferred */
    /* 0xA0 */ char pad_A0[0x10];                   /* maybe part of sp9C[5]? */
    /* 0xB0 */ s32 spB0;                            /* inferred */
    /* 0xB4 */ s32 spB4;                            /* inferred */
    /* 0xB8 */ s32 spB8;                            /* inferred */
    /* 0xBC */ s32 spBC;                            /* inferred */
    /* 0xC0 */ char pad_C0[0x4];
    /* 0xC4 */ Gfx *spC4;                           /* inferred */
};                                                  /* size = 0xC8 */

struct _mips2c_stack_func_8081B240 {
    /* 0x00 */ char pad_0[0x3C];
    /* 0x3C */ s16 sp3C;                            /* inferred */
    /* 0x3E */ char pad_3E[0x2];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_8081B6BC {};              /* size 0x0 */

struct _mips2c_stack_func_8081B6EC {
    /* 0x00 */ char pad_0[0x48];
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_8081BCA8 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ s16 sp24;                            /* inferred */
    /* 0x26 */ s16 sp26;                            /* inferred */
    /* 0x28 */ s16 sp28;                            /* inferred */
    /* 0x2A */ s16 sp2A;                            /* inferred */
    /* 0x2C */ char pad_2C[0x2];
    /* 0x2E */ u16 sp2E;                            /* inferred */
    /* 0x30 */ u16 sp30;                            /* inferred */
    /* 0x32 */ char pad_32[0xE];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_8081C684 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ void *sp1C;                          /* inferred */
    /* 0x20 */ char pad_20[0x10];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_8081D240 {
    /* 0x00 */ char pad_0[0xC4];
    /* 0xC4 */ s16 spC4;                            /* inferred */
    /* 0xC6 */ s16 spC6;                            /* inferred */
};                                                  /* size = 0xC8 */

struct _mips2c_stack_func_8081D6DC {
    /* 0x00 */ char pad_0[0x54];
    /* 0x54 */ Gfx *sp54;                           /* inferred */
    /* 0x58 */ char pad_58[0x38];
};                                                  /* size = 0x90 */

struct _mips2c_stack_func_8081E118 {
    /* 0x00 */ char pad_0[0x28];
    /* 0x28 */ s16 sp28;                            /* inferred */
    /* 0x2A */ char pad_2A[0xE];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_8081E7D8 {
    /* 0x00 */ char pad_0[0x38];
    /* 0x38 */ GraphicsContext *sp38;               /* inferred */
    /* 0x3C */ char pad_3C[0xA];                    /* maybe part of sp38[3]? */
    /* 0x46 */ s16 sp46;                            /* inferred */
    /* 0x48 */ s16 sp48;                            /* inferred */
    /* 0x4A */ s16 sp4A;                            /* inferred */
    /* 0x4C */ char pad_4C[0x4];
};                                                  /* size = 0x50 */

struct _mips2c_stack_func_8081FB1C {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ void *sp1C;                          /* inferred */
    /* 0x20 */ char pad_20[0x2];
    /* 0x22 */ s16 sp22;                            /* inferred */
    /* 0x24 */ char pad_24[0x4];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_8081FF80 {
    /* 0x00 */ char pad_0[0x40];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_808204AC {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ void *sp24;                          /* inferred */
    /* 0x28 */ char pad_28[0xC];                    /* maybe part of sp24[4]? */
    /* 0x34 */ s16 sp34;                            /* inferred */
    /* 0x36 */ s16 sp36;                            /* inferred */
    /* 0x38 */ s16 sp38;                            /* inferred */
    /* 0x3A */ s16 sp3A;                            /* inferred */
    /* 0x3C */ s16 sp3C;                            /* inferred */
    /* 0x3E */ u16 sp3E;                            /* inferred */
    /* 0x40 */ u16 sp40;                            /* inferred */
    /* 0x42 */ char pad_42[0xE];
};                                                  /* size = 0x50 */

struct _mips2c_stack_func_80820FA4 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ void *sp1C;                          /* inferred */
    /* 0x20 */ char pad_20[0x10];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80821730 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ void *sp1C;                          /* inferred */
    /* 0x20 */ char pad_20[0x10];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80821900 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8082192C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80821958 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80821984 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80821A04 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80821AD4 {};              /* size 0x0 */

struct _mips2c_stack_func_80821CC4 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80821D84 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ void *sp1C;                          /* inferred */
    /* 0x20 */ char pad_20[0x8];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80821F30 {
    /* 0x00 */ char pad_0[0x8];
    /* 0x08 */ s32 sp8;                             /* inferred */
    /* 0x0C */ s32 spC;                             /* inferred */
    /* 0x10 */ s32 sp10;                            /* inferred */
    /* 0x14 */ s32 sp14;                            /* inferred */
    /* 0x18 */ s32 sp18;                            /* inferred */
    /* 0x1C */ s32 sp1C;                            /* inferred */
    /* 0x20 */ s32 sp20;                            /* inferred */
    /* 0x24 */ s32 sp24;                            /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_808221DC {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ void *sp24;                          /* inferred */
    /* 0x28 */ char pad_28[0x4];
    /* 0x2C */ Gfx *sp2C;                           /* inferred */
    /* 0x30 */ char pad_30[0xC];                    /* maybe part of sp2C[4]? */
    /* 0x3C */ Gfx *sp3C;                           /* inferred */
    /* 0x40 */ char pad_40[0x10];                   /* maybe part of sp3C[5]? */
    /* 0x50 */ Gfx *sp50;                           /* inferred */
    /* 0x54 */ char pad_54[0x4];
    /* 0x58 */ Gfx *sp58;                           /* inferred */
    /* 0x5C */ char pad_5C[0xC];                    /* maybe part of sp58[4]? */
    /* 0x68 */ Gfx *sp68;                           /* inferred */
    /* 0x6C */ char pad_6C[0xC];                    /* maybe part of sp68[4]? */
    /* 0x78 */ Gfx *sp78;                           /* inferred */
    /* 0x7C */ char pad_7C[0x10];                   /* maybe part of sp78[5]? */
    /* 0x8C */ Gfx *sp8C;                           /* inferred */
    /* 0x90 */ char pad_90[0x14];                   /* maybe part of sp8C[6]? */
    /* 0xA4 */ Gfx *spA4;                           /* inferred */
    /* 0xA8 */ char pad_A8[0xC];                    /* maybe part of spA4[4]? */
    /* 0xB4 */ Gfx *spB4;                           /* inferred */
    /* 0xB8 */ char pad_B8[0x20];
};                                                  /* size = 0xD8 */

struct _mips2c_stack_func_80823350 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ s32 sp24;                            /* inferred */
    /* 0x28 */ s32 sp28;                            /* inferred */
    /* 0x2C */ void *sp2C;                          /* inferred */
    /* 0x30 */ char pad_30[0x84];                   /* maybe part of sp2C[34]? */
    /* 0xB4 */ Gfx *spB4;                           /* inferred */
    /* 0xB8 */ char pad_B8[0x8];                    /* maybe part of spB4[3]? */
    /* 0xC0 */ GraphicsContext *spC0;               /* inferred */
    /* 0xC4 */ char pad_C4[0x14];
};                                                  /* size = 0xD8 */

struct _mips2c_stack_func_80824738 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ void *sp1C;                          /* inferred */
    /* 0x20 */ char pad_20[0x2];
    /* 0x22 */ u16 sp22;                            /* inferred */
    /* 0x24 */ char pad_24[0x4];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_808248D0 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ void *sp24;                          /* inferred */
    /* 0x28 */ Gfx *sp28;                           /* inferred */
    /* 0x2C */ Gfx *sp2C;                           /* inferred */
    /* 0x30 */ char pad_30[0x18];
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_80824B90 {
    /* 0x00 */ char pad_0[0x28];
    /* 0x28 */ s32 sp28;                            /* inferred */
    /* 0x2C */ s32 sp2C;                            /* inferred */
    /* 0x30 */ void *sp30;                          /* inferred */
    /* 0x34 */ char pad_34[0x38];                   /* maybe part of sp30[15]? */
    /* 0x6C */ Gfx *sp6C;                           /* inferred */
    /* 0x70 */ char pad_70[0x20];
};                                                  /* size = 0x90 */

struct _mips2c_stack_func_808256E4 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ void *sp1C;                          /* inferred */
    /* 0x20 */ char pad_20[0x2];
    /* 0x22 */ u16 sp22;                            /* inferred */
    /* 0x24 */ char pad_24[0x4];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_8082585C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_808259D4 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ f32 sp1C;                            /* inferred */
    /* 0x20 */ f32 sp20;                            /* inferred */
    /* 0x24 */ f32 sp24;                            /* inferred */
    /* 0x28 */ f32 sp28;                            /* inferred */
    /* 0x2C */ f32 sp2C;                            /* inferred */
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ ?32 sp34;                            /* inferred */
    /* 0x38 */ ?32 sp38;                            /* inferred */
    /* 0x3C */ ?32 sp3C;                            /* inferred */
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80825A50 {
    /* 0x00 */ char pad_0[0x4];
    /* 0x04 */ s32 sp4;                             /* inferred */
    /* 0x08 */ s32 sp8;                             /* inferred */
    /* 0x0C */ s32 spC;                             /* inferred */
    /* 0x10 */ s32 sp10;                            /* inferred */
    /* 0x14 */ s32 sp14;                            /* inferred */
    /* 0x18 */ s32 sp18;                            /* inferred */
    /* 0x1C */ s32 sp1C;                            /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80825E28 {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ void *sp2C;                          /* inferred */
    /* 0x30 */ char pad_30[0x48];
};                                                  /* size = 0x78 */

struct _mips2c_stack_func_808274DC {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80827A8C {
    /* 0x00 */ char pad_0[0x34];
    /* 0x34 */ ? *sp34;                             /* inferred */
    /* 0x38 */ char pad_38[0x58];
};                                                  /* size = 0x90 */

struct _mips2c_stack_func_80827E08 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ GraphicsContext *sp1C;               /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_808283D8 {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ GraphicsContext *sp20;               /* inferred */
    /* 0x24 */ char pad_24[0xC];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_808286D8 {};              /* size 0x0 */

struct _mips2c_stack_func_80828788 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8082895C {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ SaveContext *sp24;                   /* inferred */
    /* 0x28 */ GlobalContext *sp28;                 /* inferred */
    /* 0x2C */ SaveContext *sp2C;                   /* inferred */
    /* 0x30 */ char pad_30[0x32];                   /* maybe part of sp2C[13]? */
    /* 0x62 */ s16 sp62;                            /* inferred */
    /* 0x64 */ char pad_64[0xE];                    /* maybe part of sp62[8]? */
    /* 0x72 */ u16 sp72;                            /* inferred */
    /* 0x74 */ char pad_74[0x24];
};                                                  /* size = 0x98 */

s32 func_80105318();                                /* extern */
void *func_801068FC(GlobalContext *, s32, SaveContext *); /* extern */
? func_80108AF8(GraphicsContext **);                /* extern */
s32 func_801090B0(s32);                             /* extern */
? func_801091F0(GraphicsContext **);                /* extern */
? func_80109428(GlobalContext *);                   /* extern */
s32 func_8010A0A4(GlobalContext *);                 /* extern */
? func_8010C1B0();                                  /* extern */
Gfx *func_8010CB80(Gfx *, ? *, ?, ?, s32, s32, s32, s32, s32, s32); /* extern */
void *func_8010CD98(void *, void *, ?, ?, s32, s32, s32, s32, s32, s32); /* extern */
void *func_8010D7D0(void *, ? *, ?, ?, s32, s32, s32, s32, s32, s32); /* extern */
Gfx *func_8010DC58(Gfx *, void *, s16, s16, s32);   /* extern */
