typedef struct EnKnight {
    /* 0x000 */ Actor actor;
    /* 0x144 */ u16 unk144;                         /* inferred */
    /* 0x146 */ s16 unk146;                         /* inferred */
    /* 0x148 */ u8 unk148;                          /* inferred */
    /* 0x149 */ char pad149[0x1];
    /* 0x14A */ s16 unk14A;                         /* inferred */
    /* 0x14C */ s16 unk14C;                         /* inferred */
    /* 0x14E */ s16 unk14E;                         /* inferred */
    /* 0x150 */ char pad150[0x1];
    /* 0x151 */ u8 unk151;                          /* inferred */
    /* 0x152 */ u8 unk152;                          /* inferred */
    /* 0x153 */ s8 unk153;                          /* inferred */
    /* 0x154 */ u8 unk154;                          /* inferred */
    /* 0x155 */ char pad155[0x1];
    /* 0x156 */ s16 unk156;                         /* inferred */
    /* 0x158 */ s16 unk158;                         /* inferred */
    /* 0x15A */ s16 unk15A;                         /* inferred */
    /* 0x15C */ s16 unk15C;                         /* inferred */
    /* 0x15E */ s16 unk15E;                         /* inferred */
    /* 0x160 */ char pad160[0x2];
    /* 0x162 */ u8 unk162;                          /* inferred */
    /* 0x163 */ char pad163[0x1];
    /* 0x164 */ f32 unk164;                         /* inferred */
    /* 0x168 */ f32 unk168;                         /* inferred */
    /* 0x16C */ f32 unk16C;                         /* inferred */
    /* 0x170 */ s16 unk170;                         /* inferred */
    /* 0x172 */ s16 unk172;                         /* inferred */
    /* 0x174 */ s16 unk174;                         /* inferred */
    /* 0x176 */ s16 unk176;                         /* inferred */
    /* 0x178 */ s16 unk178;                         /* inferred */
    /* 0x17A */ s16 unk17A;                         /* inferred */
    /* 0x17C */ f32 unk17C;                         /* inferred */
    /* 0x180 */ f32 unk180;                         /* inferred */
    /* 0x184 */ s16 unk184;                         /* inferred */
    /* 0x186 */ s16 unk186;                         /* inferred */
    /* 0x188 */ s16 unk188;                         /* inferred */
    /* 0x18A */ s16 unk18A;                         /* inferred */
    /* 0x18C */ s16 unk18C;                         /* inferred */
    /* 0x18E */ s16 unk18E;                         /* inferred */
    /* 0x190 */ u8 unk190;                          /* inferred */
    /* 0x191 */ u8 unk191;                          /* inferred */
    /* 0x192 */ u8 unk192;                          /* inferred */
    /* 0x193 */ u8 unk193;                          /* inferred */
    /* 0x194 */ SkelAnime unk194;                   /* inferred */
    /* 0x1D8 */ f32 unk1D8;                         /* inferred */
    /* 0x1DC */ Vec3f unk1DC;                       /* inferred */
    /* 0x1E8 */ char pad1E8[0xA8];                  /* maybe part of unk1DC[15]? */
    /* 0x290 */ u8 unk290;                          /* inferred */
    /* 0x291 */ u8 unk291;                          /* inferred */
    /* 0x292 */ char pad292[0x2];                   /* maybe part of unk291[3]? */
    /* 0x294 */ f32 unk294;                         /* inferred */
    /* 0x298 */ f32 unk298;                         /* inferred */
    /* 0x29C */ f32 unk29C;                         /* inferred */
    /* 0x2A0 */ u8 unk2A0;                          /* inferred */
    /* 0x2A1 */ u8 unk2A1;                          /* inferred */
    /* 0x2A2 */ s16 unk2A2;                         /* inferred */
    /* 0x2A4 */ f32 unk2A4;                         /* inferred */
    /* 0x2A8 */ f32 unk2A8;                         /* inferred */
    /* 0x2AC */ Vec3f unk2AC;                       /* inferred */
    /* 0x2B8 */ Vec3f unk2B8;                       /* inferred */
    /* 0x2C4 */ Vec3s unk2C4;                       /* inferred */
    /* 0x2CA */ char pad2CA[0xA8];                  /* maybe part of unk2C4[29]? */
    /* 0x372 */ Vec3s unk372;                       /* inferred */
    /* 0x378 */ char pad378[0xA8];                  /* maybe part of unk372[29]? */
    /* 0x420 */ void (*actionFunc)(EnKnight *, GlobalContext *);
    /* 0x424 */ s32 unk424;                         /* inferred */
    /* 0x428 */ s16 unk428;                         /* inferred */
    /* 0x42A */ char pad42A[0x2];
    /* 0x42C */ CutsceneContext unk42C;             /* inferred */
    /* 0x430 */ f32 unk430;                         /* overlap; inferred */
    /* 0x434 */ char pad434[0xC];                   /* maybe part of unk430[4]? */
    /* 0x440 */ f32 unk440;                         /* inferred */
    /* 0x444 */ char pad444[0x4];
    /* 0x448 */ f32 unk448;                         /* inferred */
    /* 0x44C */ char pad44C[0x4];
    /* 0x450 */ f32 unk450;                         /* inferred */
    /* 0x454 */ f32 unk454;                         /* inferred */
    /* 0x458 */ f32 unk458;                         /* inferred */
    /* 0x45C */ f32 unk45C;                         /* inferred */
    /* 0x460 */ f32 unk460;                         /* inferred */
    /* 0x464 */ f32 unk464;                         /* inferred */
    /* 0x468 */ f32 unk468;                         /* inferred */
    /* 0x46C */ f32 unk46C;                         /* inferred */
    /* 0x470 */ f32 unk470;                         /* inferred */
    /* 0x474 */ char pad474[0xC];                   /* maybe part of unk470[4]? */
    /* 0x480 */ f32 unk480;                         /* inferred */
    /* 0x484 */ f32 unk484;                         /* inferred */
    /* 0x488 */ ColliderCylinder unk488;            /* inferred */
    /* 0x4D4 */ ColliderJntSph unk4D4;              /* inferred */
    /* 0x4F4 */ ColliderJntSphElement unk4F4;       /* inferred */
    /* 0x534 */ ColliderJntSph unk534;              /* inferred */
    /* 0x554 */ ColliderJntSphElement unk554;       /* inferred */
    /* 0x594 */ ColliderJntSph unk594;              /* inferred */
    /* 0x5B4 */ ColliderJntSphElement unk5B4;       /* inferred */
    /* 0x5F4 */ char pad5F4[0x40];
    /* 0x634 */ ColliderCylinder unk634;            /* inferred */
    /* 0x680 */ s8 unk680;                          /* inferred */
    /* 0x681 */ char pad681[0x3];                   /* maybe part of unk680[4]? */
    /* 0x684 */ u32 unk684;                         /* inferred */
    /* 0x688 */ s16 unk688;                         /* inferred */
    /* 0x68A */ s16 unk68A;                         /* inferred */
    /* 0x68C */ f32 unk68C;                         /* inferred */
    /* 0x690 */ f32 unk690;                         /* inferred */
    /* 0x694 */ f32 unk694;                         /* inferred */
    /* 0x698 */ f32 unk698;                         /* inferred */
    /* 0x69C */ f32 unk69C;                         /* inferred */
    /* 0x6A0 */ f32 unk6A0;                         /* inferred */
    /* 0x6A4 */ f32 unk6A4;                         /* inferred */
    /* 0x6A8 */ char pad6A8[0x4];
    /* 0x6AC */ s16 unk6AC;                         /* inferred */
    /* 0x6AE */ char pad6AE[0x2];
    /* 0x6B0 */ f32 unk6B0;                         /* inferred */
    /* 0x6B4 */ u16 unk6B4;                         /* inferred */
    /* 0x6B6 */ u16 unk6B6;                         /* inferred */
    /* 0x6B8 */ u16 unk6B8;                         /* inferred */
    /* 0x6BA */ char pad6BA[0x2];
    /* 0x6BC */ u16 unk6BC;                         /* inferred */
    /* 0x6BE */ u16 unk6BE;                         /* inferred */
    /* 0x6C0 */ u16 unk6C0;                         /* inferred */
    /* 0x6C2 */ u16 unk6C2;                         /* inferred */
    /* 0x6C4 */ u8 unk6C4;                          /* inferred */
    /* 0x6C5 */ char pad6C5[0x3];                   /* maybe part of unk6C4[4]? */
    /* 0x6C8 */ Vec3f unk6C8;                       /* inferred */
} EnKnight;                                         /* size = 0x6D4 */

struct _mips2c_stack_EnKnight_Destroy {};           /* size 0x0 */

struct _mips2c_stack_EnKnight_Draw {
    /* 0x00 */ char pad0[0x44];
    /* 0x44 */ Gfx *sp44;                           /* inferred */
    /* 0x48 */ char pad48[0xC];                     /* maybe part of sp44[4]? */
    /* 0x54 */ Gfx *sp54;                           /* inferred */
    /* 0x58 */ Gfx *sp58;                           /* inferred */
    /* 0x5C */ Gfx *sp5C;                           /* inferred */
    /* 0x60 */ Gfx *sp60;                           /* inferred */
    /* 0x64 */ char pad64[0x8];                     /* maybe part of sp60[3]? */
    /* 0x6C */ s32 sp6C;                            /* inferred */
    /* 0x70 */ char pad70[0x8];
};                                                  /* size = 0x78 */

struct _mips2c_stack_EnKnight_Init {
    /* 0x00 */ char pad0[0x44];
    /* 0x44 */ ActorContext *sp44;                  /* inferred */
    /* 0x48 */ char pad48[0x10];
};                                                  /* size = 0x58 */

struct _mips2c_stack_EnKnight_Update {
    /* 0x00 */ char pad0[0x44];
    /* 0x44 */ ColliderCylinder *sp44;              /* inferred */
    /* 0x48 */ CollisionCheckContext *sp48;         /* inferred */
    /* 0x4C */ void (*sp4C)(EnKnight *, GlobalContext *); /* inferred */
    /* 0x50 */ char pad50[0x8];                     /* maybe part of sp4C[3]? */
    /* 0x58 */ f32 sp58;                            /* inferred */
    /* 0x5C */ char pad5C[0x10];                    /* maybe part of sp58[5]? */
    /* 0x6C */ f32 sp6C;                            /* inferred */
    /* 0x70 */ f32 sp70;                            /* inferred */
    /* 0x74 */ f32 sp74;                            /* inferred */
    /* 0x78 */ Actor *sp78;                         /* inferred */
    /* 0x7C */ char pad7C[0xC];
};                                                  /* size = 0x88 */

struct _mips2c_stack_func_809B20F0 {};              /* size 0x0 */

struct _mips2c_stack_func_809B21F4 {};              /* size 0x0 */

struct _mips2c_stack_func_809B22CC {
    /* 0x00 */ char pad0[0x98];
    /* 0x98 */ f32 sp98;                            /* inferred */
    /* 0x9C */ f32 sp9C;                            /* inferred */
    /* 0xA0 */ f32 spA0;                            /* inferred */
    /* 0xA4 */ f32 spA4;                            /* inferred */
    /* 0xA8 */ f32 spA8;                            /* inferred */
    /* 0xAC */ f32 spAC;                            /* inferred */
    /* 0xB0 */ f32 spB0;                            /* inferred */
    /* 0xB4 */ f32 spB4;                            /* inferred */
    /* 0xB8 */ f32 spB8;                            /* inferred */
    /* 0xBC */ char padBC[0x4];
};                                                  /* size = 0xC0 */

struct _mips2c_stack_func_809B2DD0 {
    /* 0x00 */ char pad0[0x34];
    /* 0x34 */ void *sp34;                          /* inferred */
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_809B2F54 {
    /* 0x00 */ char pad0[0x1C];
    /* 0x1C */ void *sp1C;                          /* inferred */
    /* 0x20 */ s32 sp20;                            /* inferred */
    /* 0x24 */ char pad24[0x4];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_809B316C {};              /* size 0x0 */

struct _mips2c_stack_func_809B31E8 {};              /* size 0x0 */

struct _mips2c_stack_func_809B329C {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809B331C {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_809B3394 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809B33F0 {
    /* 0x00 */ char pad0[0x24];
    /* 0x24 */ SkelAnime *sp24;                     /* inferred */
    /* 0x28 */ char pad28[0x4];
    /* 0x2C */ f32 sp2C;                            /* inferred */
    /* 0x30 */ char pad30[0x4];
    /* 0x34 */ f32 sp34;                            /* inferred */
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_809B35BC {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809B3618 {
    /* 0x00 */ char pad0[0x24];
    /* 0x24 */ SkelAnime *sp24;                     /* inferred */
    /* 0x28 */ char pad28[0x4];
    /* 0x2C */ f32 sp2C;                            /* inferred */
    /* 0x30 */ char pad30[0x4];
    /* 0x34 */ f32 sp34;                            /* inferred */
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_809B37C8 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809B3834 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809B389C {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_809B3958 {
    /* 0x00 */ char pad0[0x24];
    /* 0x24 */ SkelAnime *sp24;                     /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_809B3A7C {
    /* 0x00 */ char pad0[0x28];
    /* 0x28 */ f32 sp28;                            /* inferred */
    /* 0x2C */ char pad2C[0x4];
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ char pad34[0x4];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_809B3B94 {
    /* 0x00 */ char pad0[0x24];
    /* 0x24 */ SkelAnime *sp24;                     /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_809B3CD0 {
    /* 0x00 */ char pad0[0x1C];
    /* 0x1C */ void (*sp1C)(EnKnight *, f32);       /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_809B3DAC {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_809B3E9C {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809B3F0C {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_809B4024 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809B40E8 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_809B41D8 {};              /* size 0x0 */

struct _mips2c_stack_func_809B41F8 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_809B42B8 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809B4308 {
    /* 0x00 */ char pad0[0x28];
    /* 0x28 */ SkelAnime *sp28;                     /* inferred */
    /* 0x2C */ char pad2C[0x4];
    /* 0x30 */ Actor *sp30;                         /* inferred */
    /* 0x34 */ s16 sp34;                            /* inferred */
    /* 0x36 */ char pad36[0x2];
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ char pad3C[0x4];
    /* 0x40 */ f32 sp40;                            /* inferred */
    /* 0x44 */ f32 sp44;                            /* inferred */
    /* 0x48 */ f32 sp48;                            /* inferred */
    /* 0x4C */ f32 sp4C;                            /* inferred */
    /* 0x50 */ char pad50[0xC];                     /* maybe part of sp4C[4]? */
    /* 0x5C */ f32 sp5C;                            /* inferred */
};                                                  /* size = 0x60 */

struct _mips2c_stack_func_809B47EC {
    /* 0x00 */ char pad0[0x1C];
    /* 0x1C */ void (*sp1C)(Actor *, GlobalContext *); /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_809B4880 {
    /* 0x00 */ char pad0[0x24];
    /* 0x24 */ SkelAnime *sp24;                     /* inferred */
    /* 0x28 */ char pad28[0x10];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_809B4BFC {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809B4C58 {
    /* 0x00 */ char pad0[0x40];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_809B4E84 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_809B4ED8 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809B4F90 {
    /* 0x00 */ char pad0[0x2C];
    /* 0x2C */ f32 sp2C;                            /* inferred */
    /* 0x30 */ char pad30[0x4];
    /* 0x34 */ f32 sp34;                            /* inferred */
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_809B5058 {
    /* 0x00 */ char pad0[0x24];
    /* 0x24 */ f32 sp24;                            /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_809B51DC {
    /* 0x00 */ char pad0[0x2C];
    /* 0x2C */ f32 sp2C;                            /* inferred */
    /* 0x30 */ char pad30[0x4];
    /* 0x34 */ f32 sp34;                            /* inferred */
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_809B52E8 {
    /* 0x00 */ char pad0[0x3C];
    /* 0x3C */ ? sp3C;                              /* inferred */
    /* 0x3C */ char pad3C[0x4];
    /* 0x40 */ f32 sp40;                            /* inferred */
    /* 0x44 */ f32 sp44;                            /* inferred */
    /* 0x48 */ f32 sp48;                            /* inferred */
    /* 0x4C */ char pad4C[0xC];
};                                                  /* size = 0x58 */

struct _mips2c_stack_func_809B5634 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809B5698 {
    /* 0x00 */ char pad0[0x2C];
    /* 0x2C */ void *sp2C;                          /* inferred */
    /* 0x30 */ char pad30[0x6];                     /* maybe part of sp2C[2]? */
    /* 0x36 */ s16 sp36;                            /* inferred */
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ f32 sp3C;                            /* inferred */
    /* 0x40 */ f32 sp40;                            /* inferred */
    /* 0x44 */ ? sp44;                              /* inferred */
    /* 0x44 */ char pad44[0x4];
    /* 0x48 */ f32 sp48;                            /* inferred */
    /* 0x4C */ char pad4C[0x4];
};                                                  /* size = 0x50 */

struct _mips2c_stack_func_809B58D4 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809B592C {
    /* 0x00 */ char pad0[0x28];
    /* 0x28 */ f32 sp28;                            /* inferred */
    /* 0x2C */ char pad2C[0x4];
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ char pad34[0x4];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_809B59FC {
    /* 0x00 */ char pad0[0x28];
    /* 0x28 */ f32 sp28;                            /* inferred */
    /* 0x2C */ char pad2C[0x4];
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ char pad34[0x4];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_809B5B08 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_809B5D38 {};              /* size 0x0 */

struct _mips2c_stack_func_809B5D54 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_809B5E90 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809B5ED0 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_809B5FA8 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809B601C {
    /* 0x00 */ char pad0[0x24];
    /* 0x24 */ SkelAnime *sp24;                     /* inferred */
    /* 0x28 */ char pad28[0x4];
    /* 0x2C */ Actor *sp2C;                         /* inferred */
    /* 0x30 */ Actor *sp30;                         /* inferred */
    /* 0x34 */ char pad34[0xC];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_809B631C {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809B638C {
    /* 0x00 */ char pad0[0x34];
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ f32 sp3C;                            /* inferred */
    /* 0x40 */ f32 sp40;                            /* inferred */
    /* 0x44 */ f32 sp44;                            /* inferred */
    /* 0x48 */ f32 sp48;                            /* inferred */
    /* 0x4C */ f32 sp4C;                            /* inferred */
    /* 0x50 */ f32 sp50;                            /* inferred */
    /* 0x54 */ f32 sp54;                            /* inferred */
};                                                  /* size = 0x58 */

struct _mips2c_stack_func_809B6528 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809B6574 {
    /* 0x00 */ char pad0[0x98];
    /* 0x98 */ f32 sp98;                            /* inferred */
    /* 0x9C */ f32 sp9C;                            /* inferred */
    /* 0xA0 */ f32 spA0;                            /* inferred */
    /* 0xA4 */ f32 spA4;                            /* inferred */
    /* 0xA8 */ f32 spA8;                            /* inferred */
    /* 0xAC */ f32 spAC;                            /* inferred */
    /* 0xB0 */ f32 spB0;                            /* inferred */
    /* 0xB4 */ f32 spB4;                            /* inferred */
    /* 0xB8 */ f32 spB8;                            /* inferred */
    /* 0xBC */ char padBC[0x4];
};                                                  /* size = 0xC0 */

struct _mips2c_stack_func_809B6764 {
    /* 0x00 */ char pad0[0x30];
    /* 0x30 */ SkelAnime *sp30;                     /* inferred */
    /* 0x34 */ char pad34[0x4];
    /* 0x38 */ ? sp38;                              /* inferred */
    /* 0x38 */ char pad38[0x4];
    /* 0x3C */ f32 sp3C;                            /* inferred */
    /* 0x40 */ char pad40[0x4];
    /* 0x44 */ f32 sp44;                            /* inferred */
    /* 0x48 */ f32 sp48;                            /* inferred */
    /* 0x4C */ f32 sp4C;                            /* inferred */
    /* 0x50 */ Actor *sp50;                         /* inferred */
    /* 0x54 */ s16 sp54;                            /* inferred */
    /* 0x56 */ char pad56[0x2];
};                                                  /* size = 0x58 */

struct _mips2c_stack_func_809B6C04 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809B6C54 {
    /* 0x00 */ char pad0[0x3C];
    /* 0x3C */ SkelAnime *sp3C;                     /* inferred */
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_809B6D38 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809B6D94 {
    /* 0x00 */ char pad0[0x24];
    /* 0x24 */ Actor *sp24;                         /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_809B6EC8 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809B6F40 {
    /* 0x00 */ char pad0[0x20];
    /* 0x20 */ SkelAnime *sp20;                     /* inferred */
    /* 0x24 */ char pad24[0xC];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_809B7190 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809B71DC {
    /* 0x00 */ char pad0[0x20];
    /* 0x20 */ SkelAnime *sp20;                     /* inferred */
    /* 0x24 */ CutsceneContext *sp24;               /* inferred */
    /* 0x28 */ char pad28[0x8];                     /* maybe part of sp24[3]? */
    /* 0x30 */ Camera *sp30;                        /* inferred */
    /* 0x34 */ f32 sp34;                            /* inferred */
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_809B7708 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809B7778 {
    /* 0x00 */ char pad0[0x28];
    /* 0x28 */ Actor *sp28;                         /* inferred */
    /* 0x2C */ f32 sp2C;                            /* inferred */
    /* 0x30 */ char pad30[0x4];
    /* 0x34 */ f32 sp34;                            /* inferred */
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_809B78A4 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809B7950 {
    /* 0x00 */ char pad0[0x2C];
    /* 0x2C */ SkelAnime *sp2C;                     /* inferred */
    /* 0x30 */ void (*sp30)(EnKnight *, GlobalContext *); /* inferred */
    /* 0x34 */ char pad34[0x8];                     /* maybe part of sp30[3]? */
    /* 0x3C */ Camera *sp3C;                        /* inferred */
    /* 0x40 */ Actor *sp40;                         /* inferred */
    /* 0x44 */ f32 sp44;                            /* inferred */
    /* 0x48 */ f32 sp48;                            /* inferred */
    /* 0x4C */ f32 sp4C;                            /* inferred */
};                                                  /* size = 0x50 */

struct _mips2c_stack_func_809B842C {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809B8458 {
    /* 0x00 */ char pad0[0x20];
    /* 0x20 */ f32 *sp20;                           /* inferred */
    /* 0x24 */ f32 *sp24;                           /* inferred */
    /* 0x28 */ f32 *sp28;                           /* inferred */
    /* 0x2C */ f32 *sp2C;                           /* inferred */
    /* 0x30 */ char pad30[0x4];
    /* 0x34 */ SkelAnime *sp34;                     /* inferred */
    /* 0x38 */ CutsceneContext *sp38;               /* inferred */
    /* 0x3C */ char pad3C[0x8];                     /* maybe part of sp38[3]? */
    /* 0x44 */ f32 sp44;                            /* inferred */
    /* 0x48 */ f32 sp48;                            /* inferred */
    /* 0x4C */ f32 sp4C;                            /* inferred */
    /* 0x50 */ f32 sp50;                            /* inferred */
    /* 0x54 */ f32 sp54;                            /* inferred */
    /* 0x58 */ f32 sp58;                            /* inferred */
    /* 0x5C */ Camera *sp5C;                        /* inferred */
    /* 0x60 */ Actor *sp60;                         /* inferred */
    /* 0x64 */ f32 sp64;                            /* inferred */
};                                                  /* size = 0x68 */

struct _mips2c_stack_func_809B9A18 {
    /* 0x00 */ char pad0[0x4C];
    /* 0x4C */ f32 sp4C;                            /* inferred */
    /* 0x50 */ char pad50[0x4];
    /* 0x54 */ f32 sp54;                            /* inferred */
    /* 0x58 */ char pad58[0x8];
};                                                  /* size = 0x60 */

struct _mips2c_stack_func_809B9D24 {
    /* 0x00 */ char pad0[0x40];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_809B9E00 {
    /* 0x00 */ char pad0[0x88];
    /* 0x88 */ f32 sp88;                            /* inferred */
    /* 0x8C */ f32 sp8C;                            /* inferred */
    /* 0x90 */ f32 sp90;                            /* inferred */
    /* 0x94 */ f32 sp94;                            /* inferred */
    /* 0x98 */ f32 sp98;                            /* inferred */
    /* 0x9C */ f32 sp9C;                            /* inferred */
};                                                  /* size = 0xA0 */

struct _mips2c_stack_func_809B9F8C {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_809BA058 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809BA0CC {
    /* 0x00 */ char pad0[0x20];
    /* 0x20 */ f32 sp20;                            /* inferred */
    /* 0x24 */ f32 sp24;                            /* inferred */
    /* 0x28 */ SkelAnime *sp28;                     /* inferred */
    /* 0x2C */ char pad2C[0x8];                     /* maybe part of sp28[3]? */
    /* 0x34 */ Actor *sp34;                         /* inferred */
    /* 0x38 */ s16 sp38;                            /* inferred */
    /* 0x3A */ s16 sp3A;                            /* inferred */
    /* 0x3C */ f32 sp3C;                            /* inferred */
    /* 0x40 */ char pad40[0x4];
    /* 0x44 */ f32 sp44;                            /* inferred */
    /* 0x48 */ f32 sp48;                            /* inferred */
    /* 0x4C */ f32 sp4C;                            /* inferred */
};                                                  /* size = 0x50 */

struct _mips2c_stack_func_809BA940 {};              /* size 0x0 */

struct _mips2c_stack_func_809BA978 {
    /* 0x00 */ char pad0[0x2C];
    /* 0x2C */ ActorShape *sp2C;                    /* inferred */
    /* 0x30 */ char pad30[0x4];
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ char pad38[0x4];
    /* 0x3C */ Actor *sp3C;                         /* inferred */
    /* 0x40 */ s16 sp40;                            /* inferred */
    /* 0x42 */ s16 sp42;                            /* inferred */
    /* 0x44 */ f32 sp44;                            /* inferred */
    /* 0x48 */ f32 sp48;                            /* inferred */
    /* 0x4C */ f32 sp4C;                            /* inferred */
    /* 0x50 */ f32 sp50;                            /* inferred */
    /* 0x54 */ f32 sp54;                            /* inferred */
    /* 0x58 */ f32 sp58;                            /* inferred */
    /* 0x5C */ f32 sp5C;                            /* inferred */
};                                                  /* size = 0x60 */

struct _mips2c_stack_func_809BC2C4 {
    /* 0x00 */ char pad0[0x24];
    /* 0x24 */ Gfx *sp24;                           /* inferred */
    /* 0x28 */ char pad28[0x18];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_809BC67C {};              /* size 0x0 */

struct _mips2c_stack_func_809BC720 {};              /* size 0x0 */

struct _mips2c_stack_func_809BC8B4 {
    /* 0x00 */ char pad0[0x20];
    /* 0x20 */ ColliderJntSph *sp20;                /* inferred */
    /* 0x24 */ char pad24[0x4];
    /* 0x28 */ f32 sp28;                            /* inferred */
    /* 0x2C */ char pad2C[0xC];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_809BCA80 {
    /* 0x00 */ char pad0[0x18];
    /* 0x18 */ Vec3f *sp18;                         /* inferred */
    /* 0x1C */ char pad1C[0x4];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_809BCAD8 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809BCB54 {};              /* size 0x0 */

struct _mips2c_stack_func_809BCB78 {};              /* size 0x0 */

struct _mips2c_stack_func_809BD1AC {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809BD260 {};              /* size 0x0 */

struct _mips2c_stack_func_809BD29C {
    /* 0x00 */ char pad0[0x34];
    /* 0x34 */ Gfx *sp34;                           /* inferred */
    /* 0x38 */ Gfx *sp38;                           /* inferred */
    /* 0x3C */ char pad3C[0xC];
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_809BD490 {
    /* 0x00 */ char pad0[0x80];
};                                                  /* size = 0x80 */

struct _mips2c_stack_func_809BD858 {
    /* 0x00 */ char pad0[0x68];
};                                                  /* size = 0x68 */

? EffectSsKFire_Spawn(GlobalContext *, f32 *, ? *, ? *, s32, s32); /* extern */
? func_800B8D10(f32, GlobalContext *, EnKnight *, f32, ?, f32, s32, s32); /* extern */
f32 func_800C3FA0(CollisionContext *, ? *, f32 *);  /* extern */
? func_8016566C(?);                                 /* extern */
? func_80165690();                                  /* extern */
? func_80169940(GlobalContext *, s16, f32);         /* extern */
void func_809B20F0(GlobalContext *arg0, f32 *arg1, f32 *arg2, f32 *arg3, f32 arg4, f32 arg5, s16 arg6); /* static */
void func_809B21F4(EnKnight *arg0, s32 arg1, ColliderJntSph *arg2, f32 *arg3); /* static */
void func_809B22CC(Actor *arg0, GlobalContext *arg1, s32 arg2); /* static */
void func_809B2DD0(EnKnight *arg0, GlobalContext *arg1); /* static */
s32 func_809B2F54(EnKnight *arg0, GlobalContext *arg1); /* static */
