typedef struct EnSt {
    /* 0x000 */ Actor actor;
    /* 0x144 */ SkelAnime unk_144;                  /* inferred */
    /* 0x188 */ void (*actionFunc)(EnSt *, GlobalContext *);
    /* 0x18C */ u16 unk_18C;                        /* inferred */
    /* 0x18E */ u8 unk_18E;                         /* inferred */
    /* 0x18F */ char pad_18F[0x1];
    /* 0x190 */ ColliderCylinder unk_190;           /* inferred */
    /* 0x1DC */ ColliderCylinder unk_1DC;           /* inferred */
    /* 0x228 */ ColliderCylinder unk_228;           /* inferred */
    /* 0x274 */ ColliderCylinder unk_274;           /* inferred */
    /* 0x2C0 */ s8 unk_2C0;                         /* inferred */
    /* 0x2C1 */ char pad_2C1[0x3];                  /* maybe part of unk_2C0[4]? */
    /* 0x2C4 */ f32 unk_2C4;                        /* inferred */
    /* 0x2C8 */ f32 unk_2C8;                        /* inferred */
    /* 0x2CC */ f32 unk_2CC;                        /* inferred */
    /* 0x2D0 */ f32 unk_2D0;                        /* inferred */
    /* 0x2D4 */ f32 unk_2D4;                        /* inferred */
    /* 0x2D8 */ char pad_2D8[0x34];                 /* maybe part of unk_2D4[14]? */
    /* 0x30C */ s16 unk_30C;                        /* inferred */
    /* 0x30E */ s16 unk_30E;                        /* inferred */
    /* 0x310 */ s16 unk_310;                        /* inferred */
    /* 0x312 */ s16 unk_312;                        /* inferred */
    /* 0x314 */ s16 unk_314;                        /* inferred */
    /* 0x316 */ s16 unk_316;                        /* inferred */
    /* 0x318 */ s16 unk_318;                        /* inferred */
    /* 0x31A */ char pad_31A[0xCE];                 /* maybe part of unk_318[104]? */
    /* 0x3E8 */ Vec3s unk_3E8;                      /* inferred */
    /* 0x3EE */ char pad_3EE[0xAE];                 /* maybe part of unk_3E8[30]? */
    /* 0x49C */ Vec3s unk_49C;                      /* inferred */
    /* 0x4A2 */ char pad_4A2[0xAE];                 /* maybe part of unk_49C[30]? */
} EnSt;                                             /* size = 0x550 */

struct _mips2c_stack_EnSt_Destroy {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnSt_Init {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnSt_Update {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_808A5050 {
    /* 0x00 */ char pad_0[0x94];
    /* 0x94 */ f32 sp94;                            /* inferred */
    /* 0x98 */ f32 sp98;                            /* inferred */
    /* 0x9C */ f32 sp9C;                            /* inferred */
    /* 0xA0 */ f32 spA0;                            /* inferred */
    /* 0xA4 */ f32 spA4;                            /* inferred */
    /* 0xA8 */ f32 spA8;                            /* inferred */
    /* 0xAC */ ? spAC;                              /* inferred */
    /* 0xAC */ char pad_AC[0xC];
    /* 0xB8 */ f32 spB8;                            /* inferred */
    /* 0xBC */ char pad_BC[0x4];
    /* 0xC0 */ f32 spC0;                            /* inferred */
    /* 0xC4 */ char pad_C4[0x4];
};                                                  /* size = 0xC8 */

struct _mips2c_stack_func_808A52A8 {
    /* 0x00 */ char pad_0[0x94];
    /* 0x94 */ f32 sp94;                            /* inferred */
    /* 0x98 */ f32 sp98;                            /* inferred */
    /* 0x9C */ f32 sp9C;                            /* inferred */
    /* 0xA0 */ f32 spA0;                            /* inferred */
    /* 0xA4 */ f32 spA4;                            /* inferred */
    /* 0xA8 */ f32 spA8;                            /* inferred */
    /* 0xAC */ ? spAC;                              /* inferred */
    /* 0xAC */ char pad_AC[0xC];
    /* 0xB8 */ f32 spB8;                            /* inferred */
    /* 0xBC */ char pad_BC[0x4];
    /* 0xC0 */ f32 spC0;                            /* inferred */
    /* 0xC4 */ char pad_C4[0x4];
};                                                  /* size = 0xC8 */

struct _mips2c_stack_func_808A54B0 {
    /* 0x00 */ char pad_0[0x44];
    /* 0x44 */ Gfx *sp44;                           /* inferred */
    /* 0x48 */ Gfx *sp48;                           /* inferred */
    /* 0x4C */ char pad_4C[0x14];
};                                                  /* size = 0x60 */

struct _mips2c_stack_func_808A576C {
    /* 0x00 */ char pad_0[0x70];
};                                                  /* size = 0x70 */

struct _mips2c_stack_func_808A5988 {
    /* 0x00 */ char pad_0[0x34];
    /* 0x34 */ void *sp34;                          /* inferred */
    /* 0x38 */ char pad_38[0x4];
    /* 0x3C */ void *sp3C;                          /* inferred */
    /* 0x40 */ f32 sp40;                            /* inferred */
    /* 0x44 */ f32 sp44;                            /* inferred */
    /* 0x48 */ f32 sp48;                            /* inferred */
    /* 0x4C */ f32 sp4C;                            /* inferred */
    /* 0x50 */ char pad_50[0x3];
    /* 0x53 */ u8 sp53;                             /* inferred */
    /* 0x54 */ char pad_54[0x4];
};                                                  /* size = 0x58 */

struct _mips2c_stack_func_808A5AF8 {
    /* 0x00 */ char pad_0[0x54];
    /* 0x54 */ f32 sp54;                            /* inferred */
    /* 0x58 */ f32 sp58;                            /* inferred */
    /* 0x5C */ f32 sp5C;                            /* inferred */
};                                                  /* size = 0x60 */

struct _mips2c_stack_func_808A5BEC {
    /* 0x00 */ char pad_0[0x1E];
    /* 0x1E */ s16 sp1E;                            /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_808A5CCC {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_808A5D7C {};              /* size 0x0 */

struct _mips2c_stack_func_808A5DCC {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_808A5F28 {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ s32 sp18;                            /* inferred */
    /* 0x1C */ void *sp1C;                          /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_808A6064 {};              /* size 0x0 */

struct _mips2c_stack_func_808A60E0 {
    /* 0x00 */ char pad_0[0x1A];
    /* 0x1A */ u16 sp1A;                            /* inferred */
    /* 0x1C */ f32 sp1C;                            /* inferred */
    /* 0x20 */ f32 sp20;                            /* inferred */
    /* 0x24 */ char pad_24[0x4];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_808A61F4 {};              /* size 0x0 */

struct _mips2c_stack_func_808A6220 {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ CollisionCheckContext *sp20;         /* inferred */
    /* 0x24 */ void (**sp24)(Actor *, GlobalContext *); /* inferred */
    /* 0x28 */ f32 *sp28;                           /* inferred */
    /* 0x2C */ ColliderCylinder *sp2C;              /* inferred */
    /* 0x30 */ char pad_30[0x8];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_808A63E8 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_808A6468 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_808A650C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_808A6580 {
    /* 0x00 */ char pad_0[0x38];
    /* 0x38 */ s32 sp38;                            /* inferred */
    /* 0x3C */ Actor *sp3C;                         /* inferred */
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_808A6A3C {};              /* size 0x0 */

struct _mips2c_stack_func_808A6A78 {
    /* 0x00 */ char pad_0[0x34];
    /* 0x34 */ SkelAnime *sp34;                     /* inferred */
    /* 0x38 */ char pad_38[0x8];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_808A6C04 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ SkelAnime *sp24;                     /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_808A6D84 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_808A6E24 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_808A701C {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_808A73E8 {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ u8 sp20;                             /* inferred */
    /* 0x21 */ u8 sp21;                             /* inferred */
    /* 0x22 */ u8 sp22;                             /* inferred */
    /* 0x23 */ char pad_23[0x5];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_808A7478 {
    /* 0x00 */ char pad_0[0x40];
};                                                  /* size = 0x40 */

? EffectSsBlast_SpawnWhiteCustomScale(GlobalContext *, f32 *, Vec3f *, Vec3f *, s32, s32, s32); /* extern */
void func_808A5050(EnSt *arg0, GlobalContext *arg1); /* static */
void func_808A52A8(EnSt *arg0, GlobalContext *arg1); /* static */
void func_808A54B0(Actor *arg0, GraphicsContext **arg1); /* static */
? func_808A576C(Actor *arg0, s32, s32, s32);        /* static */
s16 func_808A5988(Actor *arg0, GlobalContext *arg1, s32 arg2); /* static */
void func_808A5AF8(Actor *arg0, GlobalContext *arg1, GlobalContext *); /* static */
s16 func_808A5BEC(Actor *arg0);                     /* static */
void func_808A5CCC(Actor *arg0);                    /* static */
void func_808A5D7C(EnSt *arg0);                     /* static */
void func_808A5DCC(Vec3s *arg0, u8 *arg1);          /* static */
s32 func_808A5F28(EnSt *arg0, GlobalContext *arg1); /* static */
