typedef struct EnJa {
    /* 0x000 */ Actor actor;
    /* 0x144 */ SkelAnime unk144;                   /* inferred */
    /* 0x188 */ void (*actionFunc)(EnJa *, GlobalContext *);
    /* 0x18C */ ColliderCylinder unk18C;            /* inferred */
    /* 0x1D8 */ u8 unk1D8;                          /* inferred */
    /* 0x1D9 */ char pad1D9[0x3];                   /* maybe part of unk1D8[4]? */
    /* 0x1DC */ s32 unk1DC;                         /* inferred */
    /* 0x1E0 */ char pad1E0[0xA0];                  /* maybe part of unk1DC[41]? */
    /* 0x280 */ Vec3s unk280;                       /* inferred */
    /* 0x286 */ char pad286[0x5A];                  /* maybe part of unk280[16]? */
    /* 0x2E0 */ Vec3s unk2E0;                       /* inferred */
    /* 0x2E6 */ char pad2E6[0x5A];                  /* maybe part of unk2E0[16]? */
    /* 0x340 */ u16 unk340;                         /* inferred */
    /* 0x342 */ char pad342[0x1A];                  /* maybe part of unk340[14]? */
    /* 0x35C */ s16 unk35C;                         /* inferred */
    /* 0x35E */ char pad35E[0x4];                   /* maybe part of unk35C[3]? */
    /* 0x362 */ s16 unk362;                         /* inferred */
    /* 0x364 */ char pad364[0x4];                   /* maybe part of unk362[3]? */
    /* 0x368 */ void *unk368;                       /* inferred */
    /* 0x36C */ s32 unk36C;                         /* inferred */
    /* 0x370 */ char pad370[0x8];                   /* maybe part of unk36C[3]? */
} EnJa;                                             /* size = 0x378 */

struct _mips2c_stack_EnJa_Destroy {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnJa_Draw {
    /* 0x00 */ char pad0[0x30];
    /* 0x30 */ s32 sp30;                            /* inferred */
    /* 0x34 */ char pad34[0x4];
    /* 0x38 */ Gfx *sp38;                           /* inferred */
    /* 0x3C */ Gfx *sp3C;                           /* inferred */
    /* 0x40 */ Gfx *sp40;                           /* inferred */
    /* 0x44 */ char pad44[0x8];                     /* maybe part of sp40[3]? */
    /* 0x4C */ s32 sp4C;                            /* inferred */
    /* 0x50 */ char pad50[0x8];
};                                                  /* size = 0x58 */

struct _mips2c_stack_EnJa_Init {
    /* 0x00 */ char pad0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_EnJa_Update {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80BC1900 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80BC192C {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80BC1984 {
    /* 0x00 */ char pad0[0x1C];
    /* 0x1C */ ColliderCylinder *sp1C;              /* inferred */
    /* 0x20 */ char pad20[0x8];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80BC19FC {
    /* 0x00 */ char pad0[0x1C];
    /* 0x1C */ s32 sp1C;                            /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80BC1A68 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80BC1AE0 {
    /* 0x00 */ char pad0[0x24];
    /* 0x24 */ ? sp24;                              /* inferred */
    /* 0x24 */ char pad24[0xC];
    /* 0x30 */ ? sp30;                              /* inferred */
    /* 0x30 */ char pad30[0x10];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80BC1B50 {};              /* size 0x0 */

struct _mips2c_stack_func_80BC1B60 {
    /* 0x00 */ char pad0[0x32];
    /* 0x32 */ s16 sp32;                            /* inferred */
    /* 0x34 */ ? sp34;                              /* inferred */
    /* 0x34 */ char pad34[0xC];
    /* 0x40 */ ? sp40;                              /* inferred */
    /* 0x40 */ char pad40[0x4];
    /* 0x44 */ f32 sp44;                            /* inferred */
    /* 0x48 */ char pad48[0x8];
};                                                  /* size = 0x50 */

struct _mips2c_stack_func_80BC1D70 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80BC1E40 {
    /* 0x00 */ char pad0[0x20];
    /* 0x20 */ s32 sp20;                            /* inferred */
    /* 0x24 */ void *sp24;                          /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80BC1FC8 {
    /* 0x00 */ char pad0[0x24];
    /* 0x24 */ s32 sp24;                            /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80BC203C {
    /* 0x00 */ char pad0[0x24];
    /* 0x24 */ s32 sp24;                            /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80BC20D0 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80BC213C {};              /* size 0x0 */

struct _mips2c_stack_func_80BC2150 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80BC21A8 {
    /* 0x00 */ char pad0[0x18];
    /* 0x18 */ u8 sp18;                             /* inferred */
    /* 0x19 */ char pad19[0xF];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80BC2274 {};              /* size 0x0 */

struct _mips2c_stack_func_80BC22F4 {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80BC25E0 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80BC2620 {
    /* 0x00 */ char pad0[0x18];
    /* 0x18 */ Gfx *sp18;                           /* inferred */
    /* 0x1C */ char pad1C[0x1C];                    /* maybe part of sp18[8]? */
    /* 0x38 */ GraphicsContext *sp38;               /* inferred */
    /* 0x3C */ char pad3C[0x4];
    /* 0x40 */ Gfx *sp40;                           /* inferred */
    /* 0x44 */ char pad44[0x1C];                    /* maybe part of sp40[8]? */
    /* 0x60 */ GraphicsContext *sp60;               /* inferred */
    /* 0x64 */ char pad64[0x4];
    /* 0x68 */ Gfx *sp68;                           /* inferred */
    /* 0x6C */ char pad6C[0x4];
    /* 0x70 */ GraphicsContext *sp70;               /* inferred */
    /* 0x74 */ char pad74[0xC];
};                                                  /* size = 0x80 */

struct _mips2c_stack_func_80BC2B30 {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80BC2EA4 {
    /* 0x00 */ char pad0[0x28];
    /* 0x28 */ ? sp28;                              /* inferred */
    /* 0x28 */ char pad28[0x14];
    /* 0x3C */ f32 sp3C;                            /* inferred */
    /* 0x40 */ f32 sp40;                            /* inferred */
    /* 0x44 */ f32 sp44;                            /* inferred */
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_80BC3154 {};              /* size 0x0 */

struct _mips2c_stack_func_80BC32D8 {
    /* 0x00 */ char pad0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80BC33C0 {
    /* 0x00 */ char pad0[0x1C];
    /* 0x1C */ Gfx *sp1C;                           /* inferred */
    /* 0x20 */ char pad20[0x18];                    /* maybe part of sp1C[7]? */
    /* 0x38 */ GraphicsContext *sp38;               /* inferred */
    /* 0x3C */ char pad3C[0x4];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80BC3594 {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

? func_8013AD9C(s16, s16, void *, void *, s32, s32); /* extern */
void func_80BC1900(EnJa *arg0);                     /* static */
s32 func_80BC192C(Actor *arg0, s32 arg1);           /* static */
void func_80BC1984(Actor *arg0, GlobalContext *arg1); /* static */
s32 func_80BC19FC(Actor *arg0, GlobalContext *arg1); /* static */
void func_80BC1A68(EnJa *arg0);                     /* static */
Actor *func_80BC1AE0(Actor *arg0, GlobalContext *arg1); /* static */
s32 func_80BC1B50(GlobalContext *arg0, void *arg1); /* static */
? func_80BC1B60(EnJa *arg0, GlobalContext *arg1);   /* static */
? func_80BC1D70(EnJa *arg0, GlobalContext *arg1);   /* static */
void func_80BC1E40(Vec3s *arg0, GlobalContext *arg1, GlobalContext *); /* static */
s32 func_80BC1FC8(Actor *arg0, ? arg2);             /* static */
s32 func_80BC203C(Actor *arg0, ? arg2);             /* static */
