typedef struct EnTest7 {
    /* 0x0000 */ Actor actor;
    /* 0x0144 */ s32 unk_144;                       /* inferred */
    /* 0x0148 */ ? unk_148;                         /* inferred */
    /* 0x0148 */ char pad_148[0x8];
    /* 0x0150 */ f32 unk_150;                       /* inferred */
    /* 0x0154 */ f32 unk_154;                       /* inferred */
    /* 0x0158 */ s16 unk_158;                       /* inferred */
    /* 0x015A */ char pad_15A[0x2];
    /* 0x015C */ s32 unk_15C;                       /* inferred */
    /* 0x0160 */ char pad_160[0x176C];              /* maybe part of unk_15C[1500]? */
    /* 0x18CC */ LightInfo unk_18CC;                /* inferred */
    /* 0x18DA */ char pad_18DA[0x2];
    /* 0x18DC */ f32 unk_18DC;                      /* inferred */
    /* 0x18E0 */ char pad_18E0[0x4];
    /* 0x18E4 */ void *unk_18E4;                    /* inferred */
    /* 0x18E8 */ char pad_18E8[0x14];               /* maybe part of unk_18E4[6]? */
    /* 0x18FC */ ? unk_18FC;                        /* inferred */
    /* 0x18FC */ char pad_18FC[0x8];
    /* 0x1904 */ s16 unk_1904;                      /* inferred */
    /* 0x1906 */ char pad_1906[0x2A2];              /* maybe part of unk_1904[338]? */
    /* 0x1BA8 */ ? unk_1BA8;                        /* inferred */
    /* 0x1BA8 */ char pad_1BA8[0x2AC];
    /* 0x1E54 */ s32 unk_1E54;                      /* inferred */
    /* 0x1E58 */ ? (*unk_1E58)(EnTest7 *, GlobalContext *, EnTest7 *); /* inferred */
    /* 0x1E5C */ void (*actionFunc)(EnTest7 *, GlobalContext *);
    /* 0x1E60 */ s32 unk_1E60;                      /* inferred */
    /* 0x1E64 */ f32 unk_1E64;                      /* inferred */
    /* 0x1E68 */ f32 unk_1E68;                      /* inferred */
    /* 0x1E6C */ f32 unk_1E6C;                      /* inferred */
    /* 0x1E70 */ f32 unk_1E70;                      /* inferred */
    /* 0x1E74 */ f32 unk_1E74;                      /* inferred */
    /* 0x1E78 */ char pad_1E78[0x4];
    /* 0x1E7C */ LightNode *unk_1E7C;               /* inferred */
    /* 0x1E80 */ LightInfo unk_1E80;                /* inferred */
    /* 0x1E8E */ s16 unk_1E8E;                      /* inferred */
    /* 0x1E90 */ f32 unk_1E90;                      /* inferred */
    /* 0x1E94 */ f32 unk_1E94;                      /* inferred */
    /* 0x1E98 */ char pad_1E98[0x4];
} EnTest7;                                          /* size = 0x1E9C */

struct _mips2c_stack_EnTest7_Destroy {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnTest7_Draw {
    /* 0x00 */ char pad_0[0x40];
    /* 0x40 */ s32 sp40;                            /* inferred */
    /* 0x44 */ char pad_44[0xC];
};                                                  /* size = 0x50 */

struct _mips2c_stack_EnTest7_Init {
    /* 0x00 */ char pad_0[0x30];
    /* 0x30 */ LightInfo *sp30;                     /* inferred */
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ char pad_38[0x8];                    /* maybe part of sp34[3]? */
    /* 0x40 */ Actor *sp40;                         /* inferred */
    /* 0x44 */ char pad_44[0xC];
};                                                  /* size = 0x50 */

struct _mips2c_stack_EnTest7_SetupAction {};        /* size 0x0 */

struct _mips2c_stack_EnTest7_Update {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80AF082C {};              /* size 0x0 */

struct _mips2c_stack_func_80AF0838 {};              /* size 0x0 */

struct _mips2c_stack_func_80AF0984 {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ f32 sp20;                            /* inferred */
    /* 0x24 */ char pad_24[0x2];
    /* 0x26 */ s16 sp26;                            /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80AF0C30 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ s32 sp1C;                            /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80AF0CDC {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ s32 sp24;                            /* inferred */
    /* 0x28 */ s32 sp28;                            /* inferred */
    /* 0x2C */ s32 sp2C;                            /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80AF10D8 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80AF118C {
    /* 0x00 */ char pad_0[0x8C];
    /* 0x8C */ f32 sp8C;                            /* inferred */
    /* 0x90 */ f32 sp90;                            /* inferred */
    /* 0x94 */ f32 sp94;                            /* inferred */
    /* 0x98 */ char pad_98[0x20];
};                                                  /* size = 0xB8 */

struct _mips2c_stack_func_80AF14FC {
    /* 0x00 */ char pad_0[0x6C];
    /* 0x6C */ ? sp6C;                              /* inferred */
    /* 0x6C */ char pad_6C[0x5C];
};                                                  /* size = 0xC8 */

struct _mips2c_stack_func_80AF1730 {};              /* size 0x0 */

struct _mips2c_stack_func_80AF19A8 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ s32 sp1C;                            /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80AF1A2C {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ f32 sp2C;                            /* inferred */
    /* 0x30 */ ? sp30;                              /* inferred */
    /* 0x30 */ char pad_30[0x4];
    /* 0x34 */ ? sp34;                              /* inferred */
    /* 0x34 */ char pad_34[0x4];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80AF1B68 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80AF1CA0 {
    /* 0x00 */ char pad_0[0x30];
    /* 0x30 */ Camera *sp30;                        /* inferred */
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ f32 sp3C;                            /* inferred */
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80AF1E44 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ s32 *sp24;                           /* inferred */
    /* 0x28 */ char pad_28[0x8];                    /* maybe part of sp24[3]? */
    /* 0x30 */ Camera *sp30;                        /* inferred */
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ f32 sp3C;                            /* inferred */
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80AF1F48 {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ f32 sp20;                            /* inferred */
    /* 0x24 */ char pad_24[0x14];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80AF2030 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ f32 sp1C;                            /* inferred */
    /* 0x20 */ char pad_20[0x8];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80AF21E8 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ f32 sp1C;                            /* inferred */
    /* 0x20 */ ? sp20;                              /* inferred */
    /* 0x20 */ char pad_20[0x4];
    /* 0x24 */ ? sp24;                              /* inferred */
    /* 0x24 */ char pad_24[0x8];
    /* 0x2C */ s32 sp2C;                            /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80AF2318 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80AF2350 {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ f32 sp2C;                            /* inferred */
    /* 0x30 */ char pad_30[0x8];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80AF24D8 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ void *sp24;                          /* inferred */
    /* 0x28 */ f32 sp28;                            /* inferred */
    /* 0x2C */ char pad_2C[0x8];                    /* maybe part of sp28[3]? */
    /* 0x34 */ void *sp34;                          /* inferred */
    /* 0x38 */ char pad_38[0x4];
    /* 0x3C */ f32 sp3C;                            /* inferred */
    /* 0x40 */ f32 sp40;                            /* inferred */
    /* 0x44 */ char pad_44[0x4];
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_80AF2654 {
    /* 0x00 */ char pad_0[0x28];
    /* 0x28 */ f32 sp28;                            /* inferred */
    /* 0x2C */ char pad_2C[0x4];
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ char pad_38[0x8];                    /* maybe part of sp34[3]? */
    /* 0x40 */ void *sp40;                          /* inferred */
    /* 0x44 */ char pad_44[0x4];
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_80AF2808 {};              /* size 0x0 */

struct _mips2c_stack_func_80AF2854 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80AF2938 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80AF29C0 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ void *sp24;                          /* inferred */
    /* 0x28 */ f32 sp28;                            /* inferred */
    /* 0x2C */ char pad_2C[0xC];                    /* maybe part of sp28[4]? */
    /* 0x38 */ void *sp38;                          /* inferred */
    /* 0x3C */ char pad_3C[0x4];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80AF2AE8 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80AF2BAC {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80AF2C48 {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ Camera *sp20;                        /* inferred */
    /* 0x24 */ f32 sp24;                            /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80AF2DB4 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ void *sp1C;                          /* inferred */
    /* 0x20 */ char pad_20[0x8];                    /* maybe part of sp1C[3]? */
    /* 0x28 */ void *sp28;                          /* inferred */
    /* 0x2C */ Camera *sp2C;                        /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80AF2EC8 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80AF2F98 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ s32 *sp24;                           /* inferred */
    /* 0x28 */ char pad_28[0x4];
    /* 0x2C */ f32 sp2C;                            /* inferred */
    /* 0x30 */ char pad_30[0x8];                    /* maybe part of sp2C[3]? */
    /* 0x38 */ void *sp38;                          /* inferred */
    /* 0x3C */ void *sp3C;                          /* inferred */
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80AF30F4 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80AF31D0 {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ f32 sp18;                            /* inferred */
    /* 0x1C */ char pad_1C[0xC];
};                                                  /* size = 0x28 */

? func_800FD698(GlobalContext *, ?, ?, f32);        /* extern */
? func_8016566C(?);                                 /* extern */
? func_80165690();                                  /* extern */
? func_80169F78(void *);                            /* extern */
? func_80183430(LightInfo *, ? *, s32 *, ? *, ? *, s32); /* extern */
? func_801834A8(LightInfo *, s32 *);                /* extern */
s32 func_80183DE0(s32);                             /* extern */
? func_8018450C(GlobalContext *, LightInfo *, Gfx *, ? (*)(s32, ?, ?, s32 *, s32), s32, EnTest7 *); /* extern */
void func_80AF082C(EnTest7 *arg0, void (*arg1)(EnTest7 *, ?), void (*)(EnTest7 *, ?), void (*)(EnTest7 *, GlobalContext *), void (*)(EnTest7 *, ?)); /* static */
void func_80AF0838(s32 *arg0);                      /* static */
void func_80AF0984(s32 *arg0, f32 *arg1, s32 *arg2, s32 *); /* static */
