CRASHED

/*
Failed to decompile function func_80B00B8C:

Label L80B00C64 refers to a delay slot; this is currently not supported.
Please modify the assembly to work around it (e.g. copy the instruction
to all jump sources and move the label, or add a nop to the delay slot).
*/
void func_80AFEB38(EnTalkGibud *arg0);              /* static */
void func_80AFEB7C(EnTalkGibud *arg0, GlobalContext *arg1); /* static */
void func_80AFEC08(EnTalkGibud *arg0);              /* static */
void func_80AFEC4C(Actor *arg0, GlobalContext *arg1); /* static */
void func_80AFED08(Actor *arg0);                    /* static */
void func_80AFED7C(Actor *arg0, GlobalContext *arg1); /* static */
void func_80AFEFD4(Actor *arg0);                    /* static */
void func_80AFF030(Actor *arg0, void *arg1);        /* static */
void func_80AFF22C(Actor *arg0, Actor *);           /* static */
void func_80AFF288(void *arg0, ? arg1);             /* static */
void func_80AFF330(void *arg0);                     /* static */
void func_80AFF378(Actor *arg0, ? arg1);            /* static */
void func_80AFF45C(Actor *arg0);                    /* static */
void func_80AFF4AC(Actor *arg0, GlobalContext *arg1); /* static */
void func_80AFF618(Actor *arg0);                    /* static */
void func_80AFF6A0(void *arg0, ? arg1);             /* static */
void func_80AFF700(Actor *arg0);                    /* static */
void func_80AFF76C(Actor *arg0, GlobalContext *arg1); /* static */

s32 func_80B00484(Actor *arg0, GlobalContext *arg1); /* static */
void func_80B004D0(Actor *arg0, GlobalContext *arg1); /* static */
void func_80B005EC(Actor *arg0, GlobalContext *arg1); /* static */
s32 func_80B00760(Actor *arg0, void *arg1, void *); /* static */
void func_80B008BC(EnTalkGibud *arg0, GlobalContext *arg1); /* static */
void func_80B008FC(Actor *arg0, GlobalContext *arg1); /* static */
void func_80B0094C(Actor *arg0, GlobalContext *arg1); /* static */
? func_80B00B8C(EnTalkGibud *, GlobalContext *);    /* static */
void func_80B00C94(Actor *arg0, GlobalContext *arg1); /* static */
void func_80B00D9C(EnTalkGibud *arg0, GlobalContext *arg1); /* static */
s32 func_80B00F08(GlobalContext *arg0, s32 arg1, Gfx **arg2, Vec3f *arg3, Vec3s *arg4, Actor *arg5, Gfx **gfx); /* static */
void func_80B00F64(GlobalContext *arg0, s32 arg1, Gfx **arg2, Vec3s *arg3, Actor *arg4, Gfx **gfx); /* static */
extern FlexSkeletonHeader D_060053E8;
extern AnimationHeaderCommon D_06009298;
extern AnimationHeader D_0600ABE0;
extern FlexSkeletonHeader D_06010B88;
static ActorAnimationEntry D_80B01200 = {
    {(AnimationHeader *)0x6006678, 1.0f, 0.0f, 0.0f, 0, -8.0f},
    {(AnimationHeader *)0x6006B08, 0.5f, 0.0f, 0.0f, 3, 0.0f},
    {(AnimationHeader *)0x6006EEC, 1.0f, 0.0f, 0.0f, 2, -8.0f},
    {(AnimationHeader *)0x60073A4, 0.0f, 0.0f, 0.0f, 2, -8.0f},
    {(AnimationHeader *)0x6007BBC, 1.0f, 0.0f, 0.0f, 2, -8.0f},
    {(AnimationHeader *)0x60081A8, 1.0f, 0.0f, 0.0f, 0, -8.0f},
    {(AnimationHeader *)0x6009298, 1.0f, 0.0f, 0.0f, 2, -8.0f},
    {(AnimationHeader *)0x6009900, 1.0f, 0.0f, 0.0f, 2, -8.0f},
    {(AnimationHeader *)0x600A450, 1.0f, 0.0f, 0.0f, 2, -8.0f},
    {(AnimationHeader *)0x600ABE0, 1.0f, 0.0f, 0.0f, 0, -8.0f},
    {(AnimationHeader *)0x60113EC, 0.4f, 0.0f, 0.0f, 1, -8.0f},
    {(AnimationHeader *)0x601216C, 1.0f, 0.0f, 0.0f, 0, -8.0f},
    {(AnimationHeader *)0x60118D8, 1.0f, 0.0f, 0.0f, 0, -8.0f},
    {(AnimationHeader *)0x6011DB8, 1.0f, 0.0f, 0.0f, 0, -8.0f},
};
static ColliderCylinderInit D_80B01350 = {
    {0, 0, 9, 0x39, 0x10, 1},
    {1, {0, 0, 0}, {0xF7EFFFFF, 0, 0}, 0, 5, 1},
    {0x14, 0x46, 0, {0, 0, 0}},
};
static DamageTable D_80B0137C = {
    {
        0,
        0xF2,
        0,
        0xF1,
        0xD0,
        0xD0,
        0xF2,
        0xD0,
        0xF1,
        0xF1,
        0xF1,
        0x21,
        0xD0,
        0x42,
        0xF1,
        0x10,
        0xD0,
        0xF2,
        0,
        0xC0,
        0,
        0xE0,
        0xF1,
        0xF1,
        0xF1,
        0,
        0,
        0,
        0,
        0,
        0,
        0xF1,
    },
};
static CollisionCheckInfoInit2 D_80B0139C = {8, 0, 0, 0, 0xFE};
static ? D_80B013A8;                                /* unable to generate initializer */
static InitChainEntry D_80B01448;                   /* unable to generate initializer */
static ? D_80B01454;                                /* unable to generate initializer */
static ? D_80B01460;                                /* unable to generate initializer */

typedef struct EnTalkGibud {
    /* 0x0000 */ Actor actor;
    /* 0x0144 */ ColliderCylinder unk144;           /* inferred */
    /* 0x0190 */ SkelAnime unk190;                  /* inferred */
    /* 0x01D4 */ void (*actionFunc)(EnTalkGibud *, GlobalContext *);
    /* 0x01D8 */ f32 unk1D8;                        /* inferred */
    /* 0x01DC */ f32 unk1DC;                        /* inferred */
    /* 0x01E0 */ f32 unk1E0;                        /* inferred */
    /* 0x01E4 */ f32 unk1E4;                        /* inferred */
    /* 0x01E8 */ f32 unk1E8;                        /* inferred */
    /* 0x01EC */ f32 unk1EC;                        /* inferred */
    /* 0x01F0 */ f32 unk1F0;                        /* inferred */
    /* 0x01F4 */ f32 unk1F4;                        /* inferred */
    /* 0x01F8 */ f32 unk1F8;                        /* inferred */
    /* 0x01FC */ char pad1FC[0x90];                 /* maybe part of unk1F8[37]? */
    /* 0x028C */ s32 unk28C;                        /* inferred */
    /* 0x0290 */ s32 unk290;                        /* inferred */
    /* 0x0294 */ s32 unk294;                        /* inferred */
    /* 0x0298 */ s32 unk298;                        /* inferred */
    /* 0x029C */ f32 unk29C;                        /* inferred */
    /* 0x02A0 */ f32 unk2A0;                        /* inferred */
    /* 0x02A4 */ Vec3s unk2A4;                      /* inferred */
    /* 0x02AA */ char pad2AA[0x96];                 /* maybe part of unk2A4[26]? */
    /* 0x0340 */ Vec3s unk340;                      /* inferred */
    /* 0x0346 */ char pad346[0xA4];
    /* 0x03EA */ s16 unk3EA;                        /* inferred */
    /* 0x03EC */ s16 unk3EC;                        /* inferred */
    /* 0x03EE */ s16 unk3EE;                        /* inferred */
    /* 0x03F0 */ s16 unk3F0;                        /* inferred */
    /* 0x03F2 */ s16 unk3F2;                        /* inferred */
    /* 0x03F4 */ s16 unk3F4;                        /* inferred */
    /* 0x03F6 */ u8 unk3F6;                         /* inferred */
    /* 0x03F7 */ char pad3F7[0x1];                  /* maybe part of unk3F6[2]? */
} EnTalkGibud;                                      /* size 0x3F8 */

void EnTalkGibud_Init(Actor *thisx, GlobalContext *globalCtx) {
    EnTalkGibud *this = (EnTalkGibud *) thisx;
    ColliderCylinder *sp30;
    ColliderCylinder *temp_a1;
    PosRot *temp_t0;
    s32 temp_a1_3;
    s32 temp_v0;
    s32 temp_v1;
    void *temp_a0;
    void *temp_a1_2;
    void *temp_a2;
    void *temp_a3;
    void *phi_a0;
    void *phi_a1;
    void *phi_a2;
    void *phi_a3;
    s32 phi_v1;
    s32 phi_v0;
    s32 phi_a1_2;

    Actor_ProcessInitChain(&this->actor, &D_80B01448);
    this->actor.targetMode = 0;
    this->actor.hintId = 0x2D;
    this->actor.textId = 0;
    ActorShape_Init(&this->actor.shape, 0.0f, func_800B3FC0, 28.0f);
    SkelAnime_InitSV(globalCtx, &this->unk190, &D_060053E8, &D_0600ABE0, &this->unk2A4, &this->unk340, 0x1A);
    temp_a1 = &this->unk144;
    sp30 = temp_a1;
