f32 func_800C40B4(CollisionContext *, CollisionPoly **, s32 *, Vec3f *); /* extern */
s32 func_800C5A64(s32, Vec3f *, f32);               /* extern */
? func_8013E640(GlobalContext *, Actor *, ?, ?, s32, s32 *, ? (*)(s32, Actor *, Actor *, void *)); /* extern */
? func_8013E8F8(Actor *, GlobalContext *, f32, f32, s32, s32, s32); /* extern */
void func_80AEC460(Actor *arg0);                    /* static */
f32 func_80AEC524(f32 arg0, f32);                   /* static */
void func_80AEC658(SkelAnime *arg0, f32 arg1, f32 arg2, f32 *arg3, f32 *arg4); /* static */
void func_80AECA3C(EnTk *arg0, GlobalContext *arg1, GlobalContext *); /* static */
void func_80AECB0C(EnTk *arg0, GlobalContext *arg1); /* static */
void func_80AECE0C(EnTk *arg0, GlobalContext *);    /* static */
? func_80AECE60(EnTk *arg0, GlobalContext *arg1);   /* static */
s32 func_80AED354(EnTk *arg2, GlobalContext *, struct_80133038_arg2 *); /* static */
s32 func_80AED38C(void *arg0, GlobalContext *arg1, void *arg2); /* static */
void func_80AED4F8(EnTk *arg0, GlobalContext *arg1); /* static */
void func_80AED544(Actor *arg0, GlobalContext *arg1); /* static */
void func_80AED898(EnTk *arg0, GlobalContext *arg1, GlobalContext *); /* static */
void func_80AEDBEC(EnTk *arg0, GlobalContext *arg1); /* static */
void func_80AEDCBC(EnTk *arg0, GlobalContext *arg1); /* static */
void func_80AEDDA0(EnTk *arg0, GlobalContext *arg1); /* static */
void func_80AEDE10(EnTk *arg0, GlobalContext *arg1); /* static */

? func_80AEE300(s32 arg0, Actor *arg1, Actor *arg2, void *arg3); /* static */
void func_80AEE374(EnTk *arg0, GlobalContext *arg1); /* static */
void func_80AEE478(EnTk *arg0, GlobalContext *arg1); /* static */
void func_80AEE650(EnTk *arg0, GlobalContext *arg1); /* static */
void func_80AEE784(EnTk *arg0, GlobalContext *arg1, GlobalContext *); /* static */
s32 func_80AEE7E0(Vec3f *arg0, f32 arg1, Vec3f *arg2, s32 arg3); /* static */
s32 func_80AEE86C(EnTk *arg0, GlobalContext *arg1); /* static */
u32 func_80AEEA4C(EnTk *arg0, void *arg1);          /* static */
void func_80AEEAD4(EnTk *arg0, GlobalContext *arg1); /* static */
void func_80AEEB88(EnTk *arg0, GlobalContext *arg1); /* static */
void func_80AEED38(EnTk *arg0, GlobalContext *arg1); /* static */
void func_80AEF048(EnTk *arg0, GlobalContext *arg1); /* static */
void func_80AEF094(EnTk *arg0, GlobalContext *arg1); /* static */
void func_80AEF15C(EnTk *arg0, GlobalContext *arg1); /* static */
void func_80AEF1B4(EnTk *arg0, GlobalContext *arg1); /* static */
void func_80AEF1C4(EnTk *arg0, GlobalContext *arg1); /* static */
void func_80AEF210(EnTk *arg0, GlobalContext *arg1); /* static */
void func_80AEF220(EnTk *arg0, GlobalContext *arg1); /* static */
void func_80AEF278(EnTk *arg0, GlobalContext *arg1); /* static */
void func_80AEF2C8(Actor *this, GlobalContext *globalCtx); /* static */
void func_80AEF2D8(Actor *this, GlobalContext *globalCtx); /* static */
void func_80AEF5F4(Actor *this, GlobalContext *globalCtx); /* static */
s32 func_80AEF65C(GlobalContext *arg0, s32 arg1, Gfx **arg2, Vec3f *arg3, Vec3s *arg4, Actor *arg5); /* static */
void func_80AEF6A4(void **arg0, s32 arg1, Gfx **arg2, Vec3s *arg3, Actor *arg4); /* static */
extern AnimationHeaderCommon D_060030A4;
extern ? D_0600B530;
extern FlexSkeletonHeader D_0600B9E8;
static void D_80AEF800;                             /* unable to generate initializer */
static ColliderCylinderInit D_80AEF830 = {
    {0xA, 0, 0, 0x39, 0x20, 1},
    {0, {0, 0, 0}, {0, 0, 0}, 0, 0, 1},
    {0x1E, 0x34, 0, {0, 0, 0}},
}; /* extra bytes: 9 */
static struct_80B8E1A8 D_80AEF868 = {
    {(AnimationHeader *)0x6001FA8, 1.0f, 0, -10.0f},
    {(AnimationHeader *)0x6001FA8, 2.0f, 0, -10.0f},
    {(AnimationHeader *)0x60030A4, 1.0f, 0, -10.0f},
    {(AnimationHeader *)0x6001144, 1.0f, 2, -10.0f},
    {(AnimationHeader *)0x6003724, 1.0f, 2, -10.0f},
    {(AnimationHeader *)0x6003FB8, 1.0f, 0, -10.0f},
    {(AnimationHeader *)0x60020C8, 1.0f, 0, -10.0f},
    {(AnimationHeader *)0x6003B10, 1.0f, 0, -10.0f},
};
static ? D_80AEF8EC;                                /* unable to generate initializer */
static ? D_80AEF8F0;                                /* unable to generate initializer */
static ? D_80AEF9B4;                                /* unable to generate initializer */
static Vec3f D_80AEFA78 = {0.0f, 20.0f, 32.0f};
static Vec3f D_80AEFA84 = {0.0f, 0.0f, 4600.0f};
static ? D_80AEFA90;                                /* unable to generate initializer */
static s32 D_80AF0050;

typedef struct EnTk {
    /* 0x0000 */ Actor actor;
    /* 0x0144 */ SkelAnime unk144;                  /* inferred */
    /* 0x0188 */ void (*actionFunc)(EnTk *, GlobalContext *);
    /* 0x018C */ ColliderCylinder unk18C;           /* inferred */
    /* 0x01D8 */ Vec3s unk1D8;                      /* inferred */
    /* 0x01DE */ char pad1DE[0x66];                 /* maybe part of unk1D8[18]? */
    /* 0x0244 */ Vec3s unk244;                      /* inferred */
    /* 0x024A */ char pad24A[0x66];                 /* maybe part of unk244[18]? */
    /* 0x02B0 */ s8 unk2B0;                         /* inferred */
    /* 0x02B1 */ s8 unk2B1;                         /* inferred */
    /* 0x02B2 */ char pad2B2[0x2];                  /* maybe part of unk2B1[3]? */
    /* 0x02B4 */ Vec3f unk2B4;                      /* inferred */
    /* 0x02C0 */ char pad2C0[0x2];
    /* 0x02C2 */ s16 unk2C2;                        /* inferred */
    /* 0x02C4 */ char pad2C4[0x2];                  /* maybe part of unk2C2[2]? */
    /* 0x02C6 */ s16 unk2C6;                        /* inferred */
    /* 0x02C8 */ char pad2C8[0x2];                  /* maybe part of unk2C6[2]? */
    /* 0x02CA */ u16 unk2CA;                        /* inferred */
    /* 0x02CC */ s16 unk2CC;                        /* inferred */
    /* 0x02CE */ char pad2CE[0x2];                  /* maybe part of unk2CC[2]? */
    /* 0x02D0 */ u32 unk2D0;                        /* inferred */
    /* 0x02D4 */ s32 unk2D4;                        /* inferred */
    /* 0x02D8 */ f32 unk2D8;                        /* inferred */
    /* 0x02DC */ f32 unk2DC;                        /* inferred */
    /* 0x02E0 */ s32 unk2E0;                        /* inferred */
    /* 0x02E4 */ s16 unk2E4;                        /* inferred */
    /* 0x02E6 */ u16 unk2E6;                        /* inferred */
    /* 0x02E8 */ s16 unk2E8;                        /* inferred */
    /* 0x02EA */ char pad2EA[0x2];                  /* maybe part of unk2E8[2]? */
    /* 0x02EC */ Vec3f unk2EC;                      /* inferred */
    /* 0x02F8 */ Vec3s unk2F8;                      /* inferred */
    /* 0x02FE */ char pad2FE[0x2];
    /* 0x0300 */ Vec3f unk300;                      /* inferred */
    /* 0x030C */ void (*unk30C)(EnTk *, GlobalContext *); /* inferred */
    /* 0x0310 */ s16 unk310;                        /* inferred */
    /* 0x0312 */ s16 unk312;                        /* inferred */
    /* 0x0314 */ s16 unk314;                        /* inferred */
    /* 0x0316 */ s16 unk316;                        /* inferred */
    /* 0x0318 */ s16 unk318;                        /* inferred */
    /* 0x031A */ s16 unk31A;                        /* inferred */
    /* 0x031C */ s16 unk31C;                        /* inferred */
    /* 0x031E */ char pad31E[0x2];                  /* maybe part of unk31C[2]? */
    /* 0x0320 */ f32 unk320;                        /* inferred */
    /* 0x0324 */ char pad324[0x48];                 /* maybe part of unk320[19]? */
    /* 0x036C */ s32 unk36C;                        /* inferred */
    /* 0x0370 */ char pad370[0x5C];                 /* maybe part of unk36C[24]? */
    /* 0x03CC */ u8 unk3CC;                         /* inferred */
    /* 0x03CD */ char pad3CD[0x1];                  /* maybe part of unk3CC[2]? */
    /* 0x03CE */ u16 unk3CE;                        /* inferred */
    /* 0x03D0 */ s32 unk3D0;                        /* inferred */
    /* 0x03D4 */ char pad3D4[0x20];                 /* maybe part of unk3D0[9]? */
} EnTk;                                             /* size 0x3F4 */

void func_80AEC460(Actor *arg0) {
    s16 temp_v0;
    s16 phi_v1;

    temp_v0 = arg0->unk2C4;
    if (temp_v0 == 0) {
        phi_v1 = 0;
    } else {
        arg0->unk2C4 = (s16) (temp_v0 - 1);
        phi_v1 = arg0->unk2C4;
    }
    if (phi_v1 == 0) {
        arg0->unk2C2 = (s16) (arg0->unk2C2 + 1);
        if ((s32) arg0->unk2C2 >= 3) {
            arg0->unk2C0 = (s16) (arg0->unk2C0 - 1);
            if ((s32) arg0->unk2C0 < 0) {
                arg0 = arg0;
                arg0->unk2C4 = Rand_S16Offset(0x1E, 0x1E);
                arg0->unk2C0 = 2;
                if (Rand_ZeroOne() > 0.5f) {
                    arg0->unk2C0 = (s16) (arg0->unk2C0 + 1);
                }
            }
            arg0->unk2C2 = 0;
        }
    }
}

f32 func_80AEC524(f32 arg0) {
    f32 temp_f0;
    f32 temp_f12;
    f32 temp_f12_2;
