typedef struct EnTk {
    /* 0x000 */ Actor actor;
    /* 0x144 */ SkelAnime unk_144;                  /* inferred */
    /* 0x188 */ void (*actionFunc)(EnTk *, GlobalContext *);
    /* 0x18C */ ColliderCylinder unk_18C;           /* inferred */
    /* 0x1D8 */ Vec3s unk_1D8;                      /* inferred */
    /* 0x1DE */ char pad_1DE[0x66];                 /* maybe part of unk_1D8[18]? */
    /* 0x244 */ Vec3s unk_244;                      /* inferred */
    /* 0x24A */ char pad_24A[0x66];                 /* maybe part of unk_244[18]? */
    /* 0x2B0 */ s8 unk_2B0;                         /* inferred */
    /* 0x2B1 */ s8 unk_2B1;                         /* inferred */
    /* 0x2B2 */ char pad_2B2[0x2];                  /* maybe part of unk_2B1[3]? */
    /* 0x2B4 */ Vec3f unk_2B4;                      /* inferred */
    /* 0x2C0 */ char pad_2C0[0x2];
    /* 0x2C2 */ s16 unk_2C2;                        /* inferred */
    /* 0x2C4 */ char pad_2C4[0x6];                  /* maybe part of unk_2C2[4]? */
    /* 0x2CA */ u16 unk_2CA;                        /* inferred */
    /* 0x2CC */ s16 unk_2CC;                        /* inferred */
    /* 0x2CE */ char pad_2CE[0x2];
    /* 0x2D0 */ s32 unk_2D0;                        /* inferred */
    /* 0x2D4 */ s32 unk_2D4;                        /* inferred */
    /* 0x2D8 */ f32 unk_2D8;                        /* inferred */
    /* 0x2DC */ f32 unk_2DC;                        /* inferred */
    /* 0x2E0 */ s32 unk_2E0;                        /* inferred */
    /* 0x2E4 */ s16 unk_2E4;                        /* inferred */
    /* 0x2E6 */ u16 unk_2E6;                        /* inferred */
    /* 0x2E8 */ s16 unk_2E8;                        /* inferred */
    /* 0x2EA */ char pad_2EA[0x2];
    /* 0x2EC */ Vec3f unk_2EC;                      /* inferred */
    /* 0x2F8 */ Vec3s unk_2F8;                      /* inferred */
    /* 0x2FE */ char pad_2FE[0x2];
    /* 0x300 */ Vec3f unk_300;                      /* inferred */
    /* 0x30C */ ? (*unk_30C)(EnTk *, GlobalContext *); /* inferred */
    /* 0x310 */ s16 unk_310;                        /* inferred */
    /* 0x312 */ s16 unk_312;                        /* inferred */
    /* 0x314 */ s16 unk_314;                        /* inferred */
    /* 0x316 */ s16 unk_316;                        /* inferred */
    /* 0x318 */ s16 unk_318;                        /* inferred */
    /* 0x31A */ s16 unk_31A;                        /* inferred */
    /* 0x31C */ s16 unk_31C;                        /* inferred */
    /* 0x31E */ char pad_31E[0x2];
    /* 0x320 */ f32 unk_320;                        /* inferred */
    /* 0x324 */ char pad_324[0xA8];                 /* maybe part of unk_320[43]? */
    /* 0x3CC */ u8 unk_3CC;                         /* inferred */
    /* 0x3CD */ char pad_3CD[0x1];
    /* 0x3CE */ u16 unk_3CE;                        /* inferred */
    /* 0x3D0 */ s32 unk_3D0;                        /* inferred */
    /* 0x3D4 */ char pad_3D4[0x20];                 /* maybe part of unk_3D0[9]? */
} EnTk;                                             /* size = 0x3F4 */

struct _mips2c_stack_EnTk_Destroy {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnTk_Draw {
    /* 0x00 */ char pad_0[0x34];
    /* 0x34 */ Gfx *sp34;                           /* inferred */
    /* 0x38 */ char pad_38[0x4];
    /* 0x3C */ GraphicsContext *sp3C;               /* inferred */
    /* 0x40 */ char pad_40[0x8];
};                                                  /* size = 0x48 */

struct _mips2c_stack_EnTk_Init {
    /* 0x00 */ char pad_0[0x30];
    /* 0x30 */ SkelAnime *sp30;                     /* inferred */
    /* 0x34 */ ColliderCylinder *sp34;              /* inferred */
    /* 0x38 */ char pad_38[0x10];
};                                                  /* size = 0x48 */

struct _mips2c_stack_EnTk_Update {
    /* 0x00 */ char pad_0[0x28];
    /* 0x28 */ ColliderCylinder *sp28;              /* inferred */
    /* 0x2C */ char pad_2C[0xC];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80AEC460 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80AEC524 {};              /* size 0x0 */

struct _mips2c_stack_func_80AEC658 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ f32 sp1C;                            /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80AECA3C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80AECA90 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80AECB0C {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80AECB6C {
    /* 0x00 */ char pad_0[0x34];
    /* 0x34 */ u8 sp34;                             /* inferred */
    /* 0x35 */ char pad_35[0xF];                    /* maybe part of sp34[16]? */
    /* 0x44 */ f32 sp44;                            /* inferred */
    /* 0x48 */ f32 sp48;                            /* inferred */
    /* 0x4C */ char pad_4C[0xC];
};                                                  /* size = 0x58 */

struct _mips2c_stack_func_80AECE0C {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80AECE60 {
    /* 0x000 */ char pad_0[0x44];
    /* 0x044 */ void *sp44;                         /* inferred */
    /* 0x048 */ char pad_48[0x4];
    /* 0x04C */ s32 *sp4C;                          /* inferred */
    /* 0x050 */ s32 *sp50;                          /* inferred */
    /* 0x054 */ char pad_54[0x8];                   /* maybe part of sp50[3]? */
    /* 0x05C */ ? sp5C;                             /* inferred */
    /* 0x05C */ char pad_5C[0x8];
    /* 0x064 */ f32 sp64;                           /* inferred */
    /* 0x068 */ char pad_68[0xC];                   /* maybe part of sp64[4]? */
    /* 0x074 */ s32 sp74;                           /* inferred */
    /* 0x078 */ s32 sp78;                           /* inferred */
    /* 0x07C */ f32 sp7C;                           /* inferred */
    /* 0x080 */ f32 sp80;                           /* inferred */
    /* 0x084 */ f32 sp84;                           /* inferred */
    /* 0x088 */ ? sp88;                             /* inferred */
    /* 0x088 */ char pad_88[0xC];
    /* 0x094 */ ? sp94;                             /* inferred */
    /* 0x094 */ char pad_94[0xC];
    /* 0x0A0 */ ? spA0;                             /* inferred */
    /* 0x0A0 */ char pad_A0[0x424];
    /* 0x4C4 */ Actor *sp4C4;                       /* inferred */
};                                                  /* size = 0x4C8 */

struct _mips2c_stack_func_80AED354 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80AED38C {
    /* 0x00 */ char pad_0[0x1E];
    /* 0x1E */ u16 sp1E;                            /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80AED4F8 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80AED544 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80AED610 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ SkelAnime *sp24;                     /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80AED898 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ SkelAnime *sp24;                     /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80AED940 {
    /* 0x00 */ char pad_0[0x44];
    /* 0x44 */ ? sp44;                              /* inferred */
    /* 0x44 */ char pad_44[0x4];
    /* 0x48 */ f32 sp48;                            /* inferred */
    /* 0x4C */ char pad_4C[0xC];
};                                                  /* size = 0x58 */

struct _mips2c_stack_func_80AEDBEC {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80AEDC4C {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80AEDCBC {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ Vec3f *sp24;                         /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80AEDD4C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80AEDDA0 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80AEDE10 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80AEDF5C {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ SkelAnime *sp2C;                     /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80AEE2A8 {};              /* size 0x0 */

struct _mips2c_stack_func_80AEE2C0 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80AEE300 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80AEE374 {
    /* 0x00 */ char pad_0[0x30];
    /* 0x30 */ s32 sp30;                            /* inferred */
    /* 0x34 */ f32 sp34;                            /* inferred */
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80AEE414 {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80AEE478 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80AEE4D0 {
    /* 0x00 */ char pad_0[0x48];
    /* 0x48 */ SkelAnime *sp48;                     /* inferred */
    /* 0x4C */ char pad_4C[0x4];
};                                                  /* size = 0x50 */

struct _mips2c_stack_func_80AEE650 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80AEE6B8 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80AEE784 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80AEE7E0 {
    /* 0x00 */ char pad_0[0x30];
    /* 0x30 */ s32 sp30;                            /* inferred */
    /* 0x34 */ char pad_34[0x4];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80AEE86C {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ CollisionContext *sp20;              /* inferred */
    /* 0x24 */ Vec3f *sp24;                         /* inferred */
    /* 0x28 */ f32 sp28;                            /* inferred */
    /* 0x2C */ char pad_2C[0x8];                    /* maybe part of sp28[3]? */
    /* 0x34 */ s32 sp34;                            /* inferred */
    /* 0x38 */ CollisionPoly *sp38;                 /* inferred */
    /* 0x3C */ char pad_3C[0x4];
    /* 0x40 */ s32 sp40;                            /* inferred */
    /* 0x44 */ char pad_44[0x4];
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_80AEE9B0 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80AEEA4C {};              /* size 0x0 */

struct _mips2c_stack_func_80AEEAD4 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ u32 sp24;                            /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80AEEB88 {
    /* 0x00 */ char pad_0[0x68];
    /* 0x68 */ f32 sp68;                            /* inferred */
    /* 0x6C */ f32 sp6C;                            /* inferred */
    /* 0x70 */ f32 sp70;                            /* inferred */
    /* 0x74 */ s32 sp74;                            /* inferred */
};                                                  /* size = 0x78 */

struct _mips2c_stack_func_80AEED38 {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ s32 sp2C;                            /* inferred */
    /* 0x30 */ Vec3f *sp30;                         /* inferred */
    /* 0x34 */ char pad_34[0x8];                    /* maybe part of sp30[3]? */
    /* 0x3C */ f32 sp3C;                            /* inferred */
    /* 0x40 */ f32 sp40;                            /* inferred */
    /* 0x44 */ f32 sp44;                            /* inferred */
    /* 0x48 */ f32 sp48;                            /* inferred */
    /* 0x4C */ f32 sp4C;                            /* inferred */
    /* 0x50 */ f32 sp50;                            /* inferred */
    /* 0x54 */ char pad_54[0x2];
    /* 0x56 */ s16 sp56;                            /* inferred */
    /* 0x58 */ f32 sp58;                            /* inferred */
    /* 0x5C */ f32 sp5C;                            /* inferred */
    /* 0x60 */ f32 sp60;                            /* inferred */
    /* 0x64 */ f32 sp64;                            /* inferred */
};                                                  /* size = 0x68 */

struct _mips2c_stack_func_80AEF048 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80AEF094 {
    /* 0x00 */ char pad_0[0x28];
    /* 0x28 */ SkelAnime *sp28;                     /* inferred */
    /* 0x2C */ f32 sp2C;                            /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80AEF15C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80AEF1B4 {};              /* size 0x0 */

struct _mips2c_stack_func_80AEF1C4 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80AEF210 {};              /* size 0x0 */

struct _mips2c_stack_func_80AEF220 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80AEF278 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80AEF2C8 {};              /* size 0x0 */

struct _mips2c_stack_func_80AEF2D8 {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ Vec3s *sp2C;                         /* inferred */
    /* 0x30 */ char pad_30[0x8];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80AEF5F4 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80AEF65C {};              /* size 0x0 */

struct _mips2c_stack_func_80AEF6A4 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

f32 func_800C40B4(CollisionContext *, CollisionPoly **, s32 *, f32 *); /* extern */
s32 func_800C5A64(s32, f32 *, f32);                 /* extern */
? func_8013E640(GlobalContext *, Actor *, ?, ?, s32, s32 *, ? (*)(s32, Actor *, Actor *, void *)); /* extern */
? func_8013E8F8(Actor *, GlobalContext *, f32, f32, s32, s32, s32); /* extern */
void func_80AEC460(Actor *arg0);                    /* static */
f32 func_80AEC524(f32 arg0, f32);                   /* static */
void func_80AEC658(SkelAnime *arg0, f32 arg1, f32 arg2, f32 *arg3, f32 *arg4); /* static */
void func_80AECA3C(EnTk *arg0, GlobalContext *arg1, GlobalContext *); /* static */
void func_80AECB0C(EnTk *arg0, GlobalContext *arg1); /* static */
void func_80AECE0C(EnTk *arg0, GlobalContext *);    /* static */
? func_80AECE60(EnTk *arg0, GlobalContext *arg1);   /* static */
