typedef struct ObjGrass {
    /* 0x0000 */ Actor actor;
    /* 0x0144 */ char pad144[0x2804];               /* maybe part of actor[32]? */
    /* 0x2948 */ ColliderCylinder unk2948;          /* inferred */
    /* 0x2994 */ char pad2994[0x8F4];               /* maybe part of unk2948[31]? */
    /* 0x3288 */ s16 unk3288;                       /* inferred */
    /* 0x328A */ s16 unk328A;                       /* inferred */
    /* 0x328C */ s16 unk328C;                       /* inferred */
    /* 0x328E */ s16 unk328E;                       /* inferred */
    /* 0x3290 */ s16 unk3290;                       /* inferred */
    /* 0x3292 */ char pad3292[0xE];                 /* maybe part of unk3290[8]? */
} ObjGrass;                                         /* size = 0x32A0 */

struct _mips2c_stack_ObjGrass_Destroy {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_ObjGrass_Draw {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_ObjGrass_Init {
    /* 0x00 */ char pad0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_ObjGrass_Update {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809A9110 {
    /* 0x00 */ char pad0[0x20];
    /* 0x20 */ f32 sp20;                            /* inferred */
    /* 0x24 */ f32 sp24;                            /* inferred */
    /* 0x28 */ f32 sp28;                            /* inferred */
    /* 0x2C */ f32 sp2C;                            /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_809A91FC {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809A92D0 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809A9314 {
    /* 0x00 */ char pad0[0xB0];
    /* 0xB0 */ f32 spB0;                            /* inferred */
    /* 0xB4 */ f32 spB4;                            /* inferred */
    /* 0xB8 */ f32 spB8;                            /* inferred */
    /* 0xBC */ f32 spBC;                            /* inferred */
    /* 0xC0 */ f32 spC0;                            /* inferred */
    /* 0xC4 */ f32 spC4;                            /* inferred */
};                                                  /* size = 0xC8 */

struct _mips2c_stack_func_809A9790 {
    /* 0x00 */ char pad0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_809A983C {
    /* 0x00 */ char pad0[0x48];
    /* 0x48 */ void **sp48;                         /* inferred */
    /* 0x4C */ char pad4C[0x34];
};                                                  /* size = 0x80 */

struct _mips2c_stack_func_809A9DB8 {
    /* 0x00 */ char pad0[0x6C];
    /* 0x6C */ f32 sp6C;                            /* inferred */
    /* 0x70 */ f32 sp70;                            /* inferred */
    /* 0x74 */ f32 sp74;                            /* inferred */
    /* 0x78 */ f32 sp78;                            /* inferred */
    /* 0x7C */ f32 sp7C;                            /* inferred */
    /* 0x80 */ f32 sp80;                            /* inferred */
    /* 0x84 */ f32 sp84;                            /* inferred */
    /* 0x88 */ f32 sp88;                            /* inferred */
    /* 0x8C */ char pad8C[0x4];
    /* 0x90 */ f32 sp90;                            /* inferred */
    /* 0x94 */ f32 sp94;                            /* inferred */
    /* 0x98 */ char pad98[0x8];                     /* maybe part of sp94[3]? */
    /* 0xA0 */ f32 spA0;                            /* inferred */
    /* 0xA4 */ f32 spA4;                            /* inferred */
    /* 0xA8 */ char padA8[0x10];
};                                                  /* size = 0xB8 */

struct _mips2c_stack_func_809AA278 {
    /* 0x00 */ char pad0[0x70];
};                                                  /* size = 0x70 */

struct _mips2c_stack_func_809AA54C {
    /* 0x00 */ char pad0[0x48];
    /* 0x48 */ Vec3f *sp48;                         /* inferred */
    /* 0x4C */ ObjGrass *sp4C;                      /* inferred */
    /* 0x50 */ char pad50[0x20];                    /* maybe part of sp4C[9]? */
    /* 0x70 */ ? sp70;                              /* inferred */
    /* 0x70 */ char pad70[0x2];
    /* 0x72 */ s16 sp72;                            /* inferred */
    /* 0x74 */ char pad74[0x8];                     /* maybe part of sp72[5]? */
    /* 0x7C */ s32 sp7C;                            /* inferred */
    /* 0x80 */ char pad80[0xC];                     /* maybe part of sp7C[4]? */
    /* 0x8C */ ObjGrass *sp8C;                      /* inferred */
};                                                  /* size = 0x90 */

struct _mips2c_stack_func_809AA798 {
    /* 0x00 */ char pad0[0x48];
    /* 0x48 */ void *sp48;                          /* inferred */
    /* 0x4C */ ObjGrass *sp4C;                      /* inferred */
    /* 0x50 */ char pad50[0x1C];                    /* maybe part of sp4C[8]? */
    /* 0x6C */ ? sp6C;                              /* inferred */
    /* 0x6C */ char pad6C[0x2];
    /* 0x6E */ s16 sp6E;                            /* inferred */
    /* 0x70 */ char pad70[0x8];                     /* maybe part of sp6E[5]? */
    /* 0x78 */ s32 sp78;                            /* inferred */
    /* 0x7C */ char pad7C[0x8];                     /* maybe part of sp78[3]? */
    /* 0x84 */ ObjGrass *sp84;                      /* inferred */
};                                                  /* size = 0x88 */

s32 func_809A9110(GlobalContext *arg0, Vec3f *arg1); /* static */
void func_809A91FC(f32 *arg0);                      /* static */
void func_809A92D0(Vec3f *arg0, GlobalContext *arg1); /* static */
void func_809A9314(Vec3f *arg0, GlobalContext *arg1); /* static */
void func_809A9790(ObjGrass *arg0, GlobalContext *arg1); /* static */
void func_809A983C(ObjGrass *arg0, GlobalContext *arg1); /* static */
void func_809A9DB8(ObjGrass *arg0);                 /* static */
void func_809AA278(ObjGrass *arg0, GlobalContext *arg1); /* static */
void func_809AA54C(ObjGrass *arg0, GlobalContext *arg1); /* static */
void func_809AA798(ObjGrass *arg0, GraphicsContext **arg1); /* static */
extern ? func_809AAE60;
static ? D_809AA9F0;                                /* unable to generate initializer */
