s32 func_809A9110(GlobalContext *arg0, Vec3f *arg1); /* static */
void func_809A91FC(f32 *arg0);                      /* static */
void func_809A92D0(Vec3f *arg0, GlobalContext *arg1); /* static */
void func_809A9314(Vec3f *arg0, GlobalContext *arg1); /* static */
void func_809A9790(ObjGrass *arg0, GlobalContext *arg1); /* static */
void func_809A983C(ObjGrass *arg0, GlobalContext *arg1); /* static */
void func_809A9DB8(ObjGrass *arg0);                 /* static */
void func_809AA278(ObjGrass *arg0, GlobalContext *arg1); /* static */
void func_809AA54C(ObjGrass *arg0, GlobalContext *arg1); /* static */
void func_809AA798(ObjGrass *arg0, GraphicsContext **arg1); /* static */
extern ? func_809AAE60;
static ? D_809AA9F0;                                /* unable to generate initializer */
static ? D_809AAA68;                                /* unable to generate initializer */
static ? D_809AAAE0;                                /* unable to generate initializer */
static ColliderCylinderInit D_809AAB20 = {
    {0xA, 0, 9, 0x29, 0x20, 1},
    {0, {0, 0, 0}, {0x580C71C, 0, 0}, 0, 1, 1},
    {6, 0x2C, 0, {0, 0, 0}},
};
static ? D_809AAB4C;                                /* unable to generate initializer */
static ? D_809AAB7C;                                /* unable to generate initializer */
static ? D_809AAB8C;                                /* unable to generate initializer */
static ? D_809AAB94;                                /* unable to generate initializer */
static void *D_809AADA0;
static f32 D_809AADB0;
static void *D_809AADC0;
static f32 D_809AAE10;

typedef struct ObjGrass {
    /* 0x0000 */ Actor actor;
    /* 0x0144 */ char pad144[0xFC];
    /* 0x0240 */ s16 unk240;                        /* inferred */
    /* 0x0242 */ u8 unk242;                         /* inferred */
    /* 0x0243 */ char pad243[0x2701];               /* maybe part of unk242[9986]? */
    /* 0x2944 */ s16 unk2944;                       /* inferred */
    /* 0x2946 */ char pad2946[0x2];                 /* maybe part of unk2944[2]? */
    /* 0x2948 */ ColliderCylinder unk2948;          /* inferred */
    /* 0x2994 */ Vec3f *unk2994;                    /* inferred */
    /* 0x2998 */ char pad2998[0x5D8];               /* maybe part of unk2994[375]? */
    /* 0x2F70 */ f32 unk2F70;                       /* inferred */
    /* 0x2F74 */ char pad2F74[0x14];                /* maybe part of unk2F70[6]? */
    /* 0x2F88 */ f32 unk2F88;                       /* inferred */
    /* 0x2F8C */ f32 unk2F8C;                       /* inferred */
    /* 0x2F90 */ f32 unk2F90;                       /* inferred */
    /* 0x2F94 */ f32 unk2F94;                       /* inferred */
    /* 0x2F98 */ f32 unk2F98;                       /* inferred */
    /* 0x2F9C */ f32 unk2F9C;                       /* inferred */
    /* 0x2FA0 */ f32 unk2FA0;                       /* inferred */
    /* 0x2FA4 */ f32 unk2FA4;                       /* inferred */
    /* 0x2FA8 */ f32 unk2FA8;                       /* inferred */
    /* 0x2FAC */ f32 unk2FAC;                       /* inferred */
    /* 0x2FB0 */ f32 unk2FB0;                       /* inferred */
    /* 0x2FB4 */ f32 unk2FB4;                       /* inferred */
    /* 0x2FB8 */ f32 unk2FB8;                       /* inferred */
    /* 0x2FBC */ f32 unk2FBC;                       /* inferred */
    /* 0x2FC0 */ f32 unk2FC0;                       /* inferred */
    /* 0x2FC4 */ f32 unk2FC4;                       /* inferred */
    /* 0x2FC8 */ f32 unk2FC8;                       /* inferred */
    /* 0x2FCC */ f32 unk2FCC;                       /* inferred */
    /* 0x2FD0 */ f32 unk2FD0;                       /* inferred */
    /* 0x2FD4 */ f32 unk2FD4;                       /* inferred */
    /* 0x2FD8 */ f32 unk2FD8;                       /* inferred */
    /* 0x2FDC */ f32 unk2FDC;                       /* inferred */
    /* 0x2FE0 */ f32 unk2FE0;                       /* inferred */
    /* 0x2FE4 */ f32 unk2FE4;                       /* inferred */
    /* 0x2FE8 */ f32 unk2FE8;                       /* inferred */
    /* 0x2FEC */ f32 unk2FEC;                       /* inferred */
    /* 0x2FF0 */ f32 unk2FF0;                       /* inferred */
    /* 0x2FF4 */ f32 unk2FF4;                       /* inferred */
    /* 0x2FF8 */ f32 unk2FF8;                       /* inferred */
    /* 0x2FFC */ f32 unk2FFC;                       /* inferred */
    /* 0x3000 */ f32 unk3000;                       /* inferred */
    /* 0x3004 */ f32 unk3004;                       /* inferred */
    /* 0x3008 */ f32 unk3008;                       /* inferred */
    /* 0x300C */ f32 unk300C;                       /* inferred */
    /* 0x3010 */ f32 unk3010;                       /* inferred */
    /* 0x3014 */ f32 unk3014;                       /* inferred */
    /* 0x3018 */ f32 unk3018;                       /* inferred */
    /* 0x301C */ f32 unk301C;                       /* inferred */
    /* 0x3020 */ f32 unk3020;                       /* inferred */
    /* 0x3024 */ f32 unk3024;                       /* inferred */
    /* 0x3028 */ f32 unk3028;                       /* inferred */
    /* 0x302C */ f32 unk302C;                       /* inferred */
    /* 0x3030 */ f32 unk3030;                       /* inferred */
    /* 0x3034 */ f32 unk3034;                       /* inferred */
    /* 0x3038 */ f32 unk3038;                       /* inferred */
    /* 0x303C */ f32 unk303C;                       /* inferred */
    /* 0x3040 */ f32 unk3040;                       /* inferred */
    /* 0x3044 */ f32 unk3044;                       /* inferred */
    /* 0x3048 */ f32 unk3048;                       /* inferred */
    /* 0x304C */ f32 unk304C;                       /* inferred */
    /* 0x3050 */ f32 unk3050;                       /* inferred */
    /* 0x3054 */ f32 unk3054;                       /* inferred */
    /* 0x3058 */ f32 unk3058;                       /* inferred */
    /* 0x305C */ f32 unk305C;                       /* inferred */
    /* 0x3060 */ f32 unk3060;                       /* inferred */
    /* 0x3064 */ f32 unk3064;                       /* inferred */
    /* 0x3068 */ f32 unk3068;                       /* inferred */
    /* 0x306C */ f32 unk306C;                       /* inferred */
    /* 0x3070 */ char pad3070[0x4];                 /* maybe part of unk306C[2]? */
    /* 0x3074 */ f32 unk3074;                       /* inferred */
    /* 0x3078 */ f32 unk3078;                       /* inferred */
    /* 0x307C */ f32 unk307C;                       /* inferred */
    /* 0x3080 */ f32 unk3080;                       /* inferred */
    /* 0x3084 */ f32 unk3084;                       /* inferred */
    /* 0x3088 */ char pad3088[0x200];               /* maybe part of unk3084[129]? */
    /* 0x3288 */ s16 unk3288;                       /* inferred */
    /* 0x328A */ s16 unk328A;                       /* inferred */
    /* 0x328C */ s16 unk328C;                       /* inferred */
    /* 0x328E */ s16 unk328E;                       /* inferred */
    /* 0x3290 */ s16 unk3290;                       /* inferred */
    /* 0x3292 */ char pad3292[0x2];                 /* maybe part of unk3290[2]? */
    /* 0x3294 */ Vec3f *unk3294;                    /* inferred */
    /* 0x3298 */ s32 unk3298;                       /* inferred */
    /* 0x329C */ char pad329C[0x4];                 /* maybe part of unk3298[2]? */
} ObjGrass;                                         /* size 0x32A0 */

s32 func_809A9110(GlobalContext *arg0, Vec3f *arg1) {
    f32 sp2C;
    Vec3f sp20;

    SkinMatrix_Vec3fMtxFMultXYZW(arg0 + 0x187B0, arg1, &sp20, &sp2C);
    if ((arg0->unk_187F0.z * -130.13191f) < sp20.z) {
        if (sp2C < 1.0f) {
            sp2C = 1.0f;
        }
        if (((fabsf(sp20.x) - (130.13191f * arg0->unk_187F0.x)) < sp2C) && ((fabsf(sp20.y) - (130.13191f * arg0->unk_187F0.y)) < sp2C)) {
            return 1;
        }
        goto block_6;
    }
block_6:
    return 0;
}

void func_809A91FC(f32 *arg0) {
    MtxF *temp_v0;
    MtxF *temp_v1;
    f32 *temp_a0;
    f32 temp_f18;
    f32 temp_f18_2;
    s32 temp_a1;
    void *temp_a0_2;
    void *temp_v1_2;
    f32 phi_f18;
    f32 *phi_a0;
    MtxF *phi_v1;
    s32 phi_a1;
    f32 phi_f18_2;
    f32 *phi_a0_2;
    MtxF *phi_v1_2;

