typedef struct EnTru {
    /* 0x000 */ Actor actor;
    /* 0x144 */ SkelAnime unk144;                   /* inferred */
    /* 0x154 */ f32 unk154;                         /* overlap; inferred */
    /* 0x158 */ char pad158[0x30];                  /* maybe part of unk154[13]? */
    /* 0x188 */ void (*actionFunc)(EnTru *, GlobalContext *);
    /* 0x18C */ ColliderSphere unk18C;              /* inferred */
    /* 0x1E4 */ s32 unk1E4;                         /* inferred */
    /* 0x1E8 */ s32 unk1E8;                         /* inferred */
    /* 0x1EC */ char pad1EC[0xC];                   /* maybe part of unk1E8[4]? */
    /* 0x1F8 */ ? unk1F8;                           /* inferred */
    /* 0x1F8 */ char pad1F8[0x12];
    /* 0x20A */ Vec3s unk20A;                       /* inferred */
    /* 0x210 */ char pad210[0x9C];                  /* maybe part of unk20A[27]? */
    /* 0x2AC */ Vec3s unk2AC;                       /* inferred */
    /* 0x2B2 */ char pad2B2[0x9C];                  /* maybe part of unk2AC[27]? */
    /* 0x34E */ u16 unk34E;                         /* inferred */
    /* 0x350 */ char pad350[0x4];                   /* maybe part of unk34E[3]? */
    /* 0x354 */ s32 *unk354;                        /* inferred */
    /* 0x358 */ char pad358[0xA];                   /* maybe part of unk354[3]? */
    /* 0x362 */ s16 unk362;                         /* inferred */
    /* 0x364 */ char pad364[0xA];                   /* maybe part of unk362[6]? */
    /* 0x36E */ s16 unk36E;                         /* inferred */
    /* 0x370 */ char pad370[0x8];                   /* maybe part of unk36E[5]? */
    /* 0x378 */ void *unk378;                       /* inferred */
    /* 0x37C */ s32 unk37C;                         /* inferred */
    /* 0x380 */ char pad380[0x4];
    /* 0x384 */ ? unk384;                           /* inferred */
    /* 0x384 */ char pad384[0x4];
    /* 0x388 */ s32 unk388;                         /* inferred */
    /* 0x38C */ char pad38C[0x8];                   /* maybe part of unk388[3]? */
    /* 0x394 */ ? unk394;                           /* inferred */
    /* 0x394 */ char pad394[0x5A0];
} EnTru;                                            /* size = 0x934 */

struct _mips2c_stack_EnTru_Destroy {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnTru_Draw {
    /* 0x00 */ char pad0[0x34];
    /* 0x34 */ ? *sp34;                             /* inferred */
    /* 0x38 */ Gfx *sp38;                           /* inferred */
    /* 0x3C */ Gfx *sp3C;                           /* inferred */
    /* 0x40 */ char pad40[0x4];
    /* 0x44 */ GraphicsContext *sp44;               /* inferred */
    /* 0x48 */ char pad48[0x8];
};                                                  /* size = 0x50 */

struct _mips2c_stack_EnTru_Init {
    /* 0x00 */ char pad0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_EnTru_Update {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80A85620 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A85788 {
    /* 0x00 */ char pad0[0x80];
};                                                  /* size = 0x80 */

struct _mips2c_stack_func_80A85AA4 {};              /* size 0x0 */

struct _mips2c_stack_func_80A85BCC {
    /* 0x00 */ char pad0[0x50];
};                                                  /* size = 0x50 */

struct _mips2c_stack_func_80A85E2C {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A85F84 {
    /* 0x00 */ char pad0[0x40];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80A86384 {};              /* size 0x0 */

struct _mips2c_stack_func_80A86460 {
    /* 0x00 */ char pad0[0x8C];
    /* 0x8C */ ? sp8C;                              /* inferred */
    /* 0x8C */ char pad8C[0xC];
    /* 0x98 */ ? sp98;                              /* inferred */
    /* 0x98 */ char pad98[0xC];
    /* 0xA4 */ ? spA4;                              /* inferred */
    /* 0xA4 */ char padA4[0xC];
    /* 0xB0 */ ? spB0;                              /* inferred */
    /* 0xB0 */ char padB0[0x4];
    /* 0xB4 */ f32 spB4;                            /* inferred */
    /* 0xB8 */ f32 spB8;                            /* inferred */
    /* 0xBC */ char padBC[0x4];
};                                                  /* size = 0xC0 */

struct _mips2c_stack_func_80A86674 {
    /* 0x00 */ char pad0[0x34];
    /* 0x34 */ ? sp34;                              /* inferred */
    /* 0x34 */ char pad34[0xC];
    /* 0x40 */ ? sp40;                              /* inferred */
    /* 0x40 */ char pad40[0x10];
};                                                  /* size = 0x50 */

struct _mips2c_stack_func_80A86770 {
    /* 0x00 */ char pad0[0x8C];
    /* 0x8C */ f32 sp8C;                            /* inferred */
    /* 0x90 */ f32 sp90;                            /* inferred */
    /* 0x94 */ f32 sp94;                            /* inferred */
    /* 0x98 */ ? sp98;                              /* inferred */
    /* 0x98 */ char pad98[0x4];
    /* 0x9C */ f32 sp9C;                            /* inferred */
    /* 0xA0 */ char padA0[0x8];
};                                                  /* size = 0xA8 */

struct _mips2c_stack_func_80A868F8 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A86924 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A8697C {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A869DC {
    /* 0x00 */ char pad0[0x2C];
    /* 0x2C */ ? sp2C;                              /* inferred */
    /* 0x2C */ char pad2C[0x4];
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ char pad34[0x4];
    /* 0x38 */ ? sp38;                              /* inferred */
    /* 0x38 */ char pad38[0x4];
    /* 0x3C */ f32 sp3C;                            /* inferred */
    /* 0x40 */ char pad40[0x4];
    /* 0x44 */ void *sp44;                          /* inferred */
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_80A86B0C {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A86BAC {
    /* 0x00 */ char pad0[0x1C];
    /* 0x1C */ Gfx *sp1C;                           /* inferred */
    /* 0x20 */ char pad20[0x8];                     /* maybe part of sp1C[3]? */
    /* 0x28 */ GraphicsContext *sp28;               /* inferred */
    /* 0x2C */ char pad2C[0x4];
    /* 0x30 */ Gfx *sp30;                           /* inferred */
    /* 0x34 */ char pad34[0x10];                    /* maybe part of sp30[5]? */
    /* 0x44 */ GraphicsContext *sp44;               /* inferred */
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_80A86DB8 {
    /* 0x00 */ char pad0[0x1C];
    /* 0x1C */ SkelAnime *sp1C;                     /* inferred */
    /* 0x20 */ char pad20[0x8];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80A871E0 {};              /* size 0x0 */

struct _mips2c_stack_func_80A872AC {
    /* 0x00 */ char pad0[0x20];
    /* 0x20 */ s32 sp20;                            /* inferred */
    /* 0x24 */ void *sp24;                          /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80A873B8 {};              /* size 0x0 */

struct _mips2c_stack_func_80A87400 {
    /* 0x00 */ char pad0[0x2C];
    /* 0x2C */ s32 sp2C;                            /* inferred */
    /* 0x30 */ char pad30[0x4];
    /* 0x34 */ ? sp34;                              /* inferred */
    /* 0x34 */ char pad34[0xC];
    /* 0x40 */ ? sp40;                              /* inferred */
    /* 0x40 */ char pad40[0xC];
    /* 0x4C */ void *sp4C;                          /* inferred */
};                                                  /* size = 0x50 */

struct _mips2c_stack_func_80A875AC {
    /* 0x00 */ char pad0[0x20];
    /* 0x20 */ s32 sp20;                            /* inferred */
    /* 0x24 */ char pad24[0x4];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80A8777C {
    /* 0x00 */ char pad0[0x18];
    /* 0x18 */ s32 sp18;                            /* inferred */
    /* 0x1C */ char pad1C[0x4];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80A87880 {
    /* 0x00 */ char pad0[0x20];
    /* 0x20 */ Actor *sp20;                         /* inferred */
    /* 0x24 */ s32 sp24;                            /* inferred */
    /* 0x28 */ char pad28[0x4];
    /* 0x2C */ Player *sp2C;                        /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80A87B48 {
    /* 0x00 */ char pad0[0x2C];
    /* 0x2C */ SkelAnime *sp2C;                     /* inferred */
    /* 0x30 */ char pad30[0x4];
    /* 0x34 */ s32 sp34;                            /* inferred */
    /* 0x38 */ char pad38[0x6];                     /* maybe part of sp34[2]? */
    /* 0x3E */ s16 sp3E;                            /* inferred */
    /* 0x40 */ ? sp40;                              /* inferred */
    /* 0x40 */ char pad40[0xC];
    /* 0x4C */ ? sp4C;                              /* inferred */
    /* 0x4C */ char pad4C[0x8];
    /* 0x54 */ f32 sp54;                            /* inferred */
    /* 0x58 */ char pad58[0x8];
};                                                  /* size = 0x60 */

struct _mips2c_stack_func_80A87DC0 {
    /* 0x00 */ char pad0[0x20];
    /* 0x20 */ Actor *sp20;                         /* inferred */
    /* 0x24 */ char pad24[0x4];
    /* 0x28 */ s32 sp28;                            /* inferred */
    /* 0x2C */ char pad2C[0x4];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80A87FD0 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80A881E0 {
    /* 0x00 */ char pad0[0x2C];
    /* 0x2C */ Actor *sp2C;                         /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80A885B8 {
    /* 0x00 */ char pad0[0x24];
    /* 0x24 */ Vec3f *sp24;                         /* inferred */
    /* 0x28 */ char pad28[0x8];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80A88698 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A886D4 {
    /* 0x00 */ char pad0[0x2C];
    /* 0x2C */ s32 sp2C;                            /* inferred */
    /* 0x30 */ char pad30[0x10];
};                                                  /* size = 0x40 */

? func_80123AA4(Player *, ?);                       /* extern */
? func_8013AD9C(s16, s16, void *, void *, s32, s32); /* extern */
s32 func_8013BD40(Actor *, void *, s32);            /* extern */
s32 func_8013BEDC(GlobalContext *, s32, ?, ? *);    /* extern */
? func_8016A268(void *, ?, ?, ?, s32, s32);         /* extern */
? func_801A75E8(?);                                 /* extern */
void func_80A85620(u8 *arg0, ? *arg1, f32 arg2, f32 arg3, f32 arg4); /* static */
void func_80A85788(? *arg0, GraphicsContext **arg1); /* static */
void func_80A85AA4(void *arg1, void *arg2, f32 arg3, f32 arg4, f32); /* static */
void func_80A85BCC(? *arg0, GraphicsContext **arg1); /* static */
void func_80A85E2C(u8 *arg0, ? *arg1, Vec3f *arg2, ? *arg3, f32 arg4, f32 arg5, f32 arg6, u8 arg7); /* static */
void func_80A85F84(? *arg0, GraphicsContext **arg1); /* static */
