typedef struct Boss02 {
    /* 0x0000 */ Actor actor;
    /* 0x0144 */ u8 unk144;                         /* inferred */
    /* 0x0145 */ char pad145[0x1];
    /* 0x0146 */ s16 unk146;                        /* inferred */
    /* 0x0148 */ s16 unk148;                        /* inferred */
    /* 0x014A */ char pad14A[0x2];
    /* 0x014C */ s16 unk14C;                        /* inferred */
    /* 0x014E */ s16 unk14E;                        /* inferred */
    /* 0x0150 */ s16 unk150;                        /* inferred */
    /* 0x0152 */ s16 unk152;                        /* inferred */
    /* 0x0154 */ s16 unk154;                        /* inferred */
    /* 0x0156 */ s16 unk156;                        /* inferred */
    /* 0x0158 */ s16 unk158;                        /* inferred */
    /* 0x015A */ s16 unk15A;                        /* inferred */
    /* 0x015C */ u8 unk15C;                         /* inferred */
    /* 0x015D */ char pad15D[0x7];                  /* maybe part of unk15C[8]? */
    /* 0x0164 */ f32 unk164;                        /* inferred */
    /* 0x0168 */ f32 unk168;                        /* inferred */
    /* 0x016C */ s16 unk16C;                        /* inferred */
    /* 0x016E */ char pad16E[0x2];
    /* 0x0170 */ f32 unk170;                        /* inferred */
    /* 0x0174 */ f32 unk174;                        /* inferred */
    /* 0x0178 */ f32 unk178;                        /* inferred */
    /* 0x017C */ f32 unk17C;                        /* inferred */
    /* 0x0180 */ f32 unk180;                        /* inferred */
    /* 0x0184 */ f32 unk184;                        /* inferred */
    /* 0x0188 */ f32 unk188;                        /* inferred */
    /* 0x018C */ f32 unk18C;                        /* inferred */
    /* 0x0190 */ s32 unk190;                        /* inferred */
    /* 0x0194 */ s8 unk194;                         /* inferred */
    /* 0x0195 */ u8 unk195;                         /* inferred */
    /* 0x0196 */ s16 unk196;                        /* inferred */
    /* 0x0198 */ s16 unk198;                        /* inferred */
    /* 0x019A */ s16 unk19A;                        /* inferred */
    /* 0x019C */ f32 unk19C;                        /* inferred */
    /* 0x01A0 */ f32 unk1A0;                        /* inferred */
    /* 0x01A4 */ s16 unk1A4;                        /* inferred */
    /* 0x01A6 */ char pad1A6[0x2];
    /* 0x01A8 */ f32 unk1A8;                        /* inferred */
    /* 0x01AC */ f32 unk1AC;                        /* inferred */
    /* 0x01B0 */ f32 unk1B0;                        /* inferred */
    /* 0x01B4 */ f32 unk1B4;                        /* inferred */
    /* 0x01B8 */ f32 unk1B8;                        /* inferred */
    /* 0x01BC */ char pad1BC[0x12C0];               /* maybe part of unk1B8[1201]? */
    /* 0x147C */ Vec3f unk147C;                     /* inferred */
    /* 0x1488 */ Vec3f unk1488;                     /* inferred */
    /* 0x1494 */ char pad1494[0xFC];                /* maybe part of unk1488[22]? */
    /* 0x1590 */ SkelAnime unk1590;                 /* inferred */
    /* 0x15D4 */ Vec3s unk15D4;                     /* inferred */
    /* 0x15DA */ char pad15DA[0x48];                /* maybe part of unk15D4[13]? */
    /* 0x1622 */ Vec3s unk1622;                     /* inferred */
    /* 0x1628 */ char pad1628[0x48];                /* maybe part of unk1622[13]? */
    /* 0x1670 */ void (*actionFunc)(Boss02 *, GlobalContext *);
    /* 0x1674 */ Actor *unk1674;                    /* inferred */
    /* 0x1678 */ s32 unk1678;                       /* inferred */
    /* 0x167C */ Vec3f unk167C;                     /* inferred */
    /* 0x1688 */ ColliderJntSph unk1688;            /* inferred */
    /* 0x16A8 */ ColliderJntSphElement unk16A8;     /* inferred */
    /* 0x16E8 */ char pad16E8[0x540];               /* maybe part of unk16A8[22]? */
    /* 0x1C28 */ ColliderJntSph unk1C28;            /* inferred */
    /* 0x1C48 */ ColliderJntSphElement unk1C48;     /* inferred */
    /* 0x1C88 */ char pad1C88[0x40];
    /* 0x1CC8 */ ColliderCylinder unk1CC8;          /* inferred */
    /* 0x1D14 */ char pad1D14[0x4];
    /* 0x1D18 */ s16 unk1D18;                       /* inferred */
    /* 0x1D1A */ s16 unk1D1A;                       /* inferred */
    /* 0x1D1C */ s32 unk1D1C;                       /* inferred */
    /* 0x1D20 */ s16 unk1D20;                       /* inferred */
    /* 0x1D22 */ char pad1D22[0x1A];                /* maybe part of unk1D20[14]? */
    /* 0x1D3C */ f32 unk1D3C;                       /* inferred */
    /* 0x1D40 */ f32 unk1D40;                       /* inferred */
    /* 0x1D44 */ f32 unk1D44;                       /* inferred */
    /* 0x1D48 */ char pad1D48[0x14];                /* maybe part of unk1D44[6]? */
    /* 0x1D5C */ f32 unk1D5C;                       /* inferred */
    /* 0x1D60 */ char pad1D60[0x10];                /* maybe part of unk1D5C[5]? */
    /* 0x1D70 */ f32 unk1D70;                       /* inferred */
    /* 0x1D74 */ char pad1D74[0xA];                 /* maybe part of unk1D70[3]? */
    /* 0x1D7E */ s16 unk1D7E;                       /* inferred */
} Boss02;                                           /* size = 0x1D80 */

struct _mips2c_stack_Boss02_Destroy {};             /* size 0x0 */

struct _mips2c_stack_Boss02_Draw {
    /* 0x00 */ char pad0[0x54];
    /* 0x54 */ f32 *sp54;                           /* inferred */
    /* 0x58 */ Vec3f *sp58;                         /* inferred */
    /* 0x5C */ Vec3f *sp5C;                         /* inferred */
    /* 0x60 */ ColliderJntSph *sp60;                /* inferred */
    /* 0x64 */ char pad64[0x4];
    /* 0x68 */ ColliderJntSph *sp68;                /* inferred */
    /* 0x6C */ char pad6C[0x2C];                    /* maybe part of sp68[12]? */
    /* 0x98 */ f32 sp98;                            /* inferred */
    /* 0x9C */ f32 sp9C;                            /* inferred */
    /* 0xA0 */ f32 spA0;                            /* inferred */
    /* 0xA4 */ f32 spA4;                            /* inferred */
    /* 0xA8 */ f32 spA8;                            /* inferred */
    /* 0xAC */ f32 spAC;                            /* inferred */
    /* 0xB0 */ char padB0[0x20];
};                                                  /* size = 0xD0 */

struct _mips2c_stack_Boss02_Init {
    /* 0x00 */ char pad0[0x4C];
    /* 0x4C */ ActorContext *sp4C;                  /* inferred */
    /* 0x50 */ char pad50[0x10];
};                                                  /* size = 0x60 */

struct _mips2c_stack_Boss02_Update {
    /* 0x00 */ char pad0[0x24];
    /* 0x24 */ ColliderJntSph *sp24;                /* inferred */
    /* 0x28 */ CollisionCheckContext *sp28;         /* inferred */
    /* 0x2C */ char pad2C[0x10];                    /* maybe part of sp28[5]? */
    /* 0x3C */ f32 sp3C;                            /* inferred */
    /* 0x40 */ f32 sp40;                            /* inferred */
    /* 0x44 */ f32 sp44;                            /* inferred */
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_809DA1D0 {};              /* size 0x0 */

struct _mips2c_stack_func_809DA22C {};              /* size 0x0 */

struct _mips2c_stack_func_809DA24C {};              /* size 0x0 */

struct _mips2c_stack_func_809DA264 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_809DA344 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_809DA460 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809DA50C {};              /* size 0x0 */

struct _mips2c_stack_func_809DAA74 {};              /* size 0x0 */

struct _mips2c_stack_func_809DAA98 {};              /* size 0x0 */

struct _mips2c_stack_func_809DAAA8 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809DAB78 {
    /* 0x00 */ char pad0[0x4C];
    /* 0x4C */ void *sp4C;                          /* inferred */
    /* 0x50 */ f32 *sp50;                           /* inferred */
    /* 0x54 */ f32 sp54;                            /* inferred */
    /* 0x58 */ char pad58[0xC];                     /* maybe part of sp54[4]? */
    /* 0x64 */ f32 sp64;                            /* inferred */
    /* 0x68 */ f32 sp68;                            /* inferred */
    /* 0x6C */ f32 sp6C;                            /* inferred */
    /* 0x70 */ ? sp70;                              /* inferred */
    /* 0x70 */ char pad70[0x4];
    /* 0x74 */ f32 sp74;                            /* inferred */
    /* 0x78 */ char pad78[0x4];
    /* 0x7C */ f32 sp7C;                            /* inferred */
    /* 0x80 */ f32 sp80;                            /* inferred */
    /* 0x84 */ f32 sp84;                            /* inferred */
    /* 0x88 */ ? sp88;                              /* inferred */
    /* 0x88 */ char pad88[0x4];
    /* 0x8C */ ? sp8C;                              /* inferred */
    /* 0x8C */ char pad8C[0x4];
    /* 0x90 */ f32 sp90;                            /* inferred */
    /* 0x94 */ char pad94[0x4];
    /* 0x98 */ f32 sp98;                            /* inferred */
    /* 0x9C */ f32 sp9C;                            /* inferred */
    /* 0xA0 */ f32 spA0;                            /* inferred */
    /* 0xA4 */ f32 spA4;                            /* inferred */
    /* 0xA8 */ char padA8[0x4];
    /* 0xAC */ f32 spAC;                            /* inferred */
    /* 0xB0 */ Actor *spB0;                         /* inferred */
    /* 0xB4 */ char padB4[0x10];                    /* maybe part of spB0[5]? */
    /* 0xC4 */ f32 spC4;                            /* inferred */
    /* 0xC8 */ f32 spC8;                            /* inferred */
    /* 0xCC */ f32 spCC;                            /* inferred */
    /* 0xD0 */ f32 spD0;                            /* inferred */
    /* 0xD4 */ f32 spD4;                            /* inferred */
    /* 0xD8 */ f32 spD8;                            /* inferred */
    /* 0xDC */ ? spDC;                              /* inferred */
    /* 0xDC */ char padDC[0x4];
    /* 0xE0 */ Actor *spE0;                         /* inferred */
    /* 0xE4 */ char padE4[0x4];
};                                                  /* size = 0xE8 */

struct _mips2c_stack_func_809DBFB4 {
    /* 0x00 */ char pad0[0x58];
};                                                  /* size = 0x58 */

struct _mips2c_stack_func_809DC218 {
    /* 0x00 */ char pad0[0x20];
    /* 0x20 */ ? sp20;                              /* inferred */
    /* 0x20 */ char pad20[0x4];
    /* 0x24 */ f32 sp24;                            /* inferred */
    /* 0x28 */ f32 sp28;                            /* inferred */
    /* 0x2C */ char pad2C[0xC];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_809DC78C {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_809DD0A8 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809DD0CC {
    /* 0x00 */ char pad0[0x58];
};                                                  /* size = 0x58 */

struct _mips2c_stack_func_809DD2F8 {
    /* 0x00 */ char pad0[0x6C];
    /* 0x6C */ void *sp6C;                          /* inferred */
    /* 0x70 */ char pad70[0x4];
    /* 0x74 */ Gfx *sp74;                           /* inferred */
    /* 0x78 */ Gfx *sp78;                           /* inferred */
    /* 0x7C */ char pad7C[0x10];                    /* maybe part of sp78[5]? */
    /* 0x8C */ Gfx *sp8C;                           /* inferred */
    /* 0x90 */ char pad90[0x10];                    /* maybe part of sp8C[5]? */
    /* 0xA0 */ Gfx *spA0;                           /* inferred */
    /* 0xA4 */ char padA4[0xC];                     /* maybe part of spA0[4]? */
    /* 0xB0 */ Gfx *spB0;                           /* inferred */
    /* 0xB4 */ Gfx *spB4;                           /* inferred */
    /* 0xB8 */ char padB8[0x20];
};                                                  /* size = 0xD8 */

struct _mips2c_stack_func_809DD934 {
    /* 0x00 */ char pad0[0x40];
    /* 0x40 */ CutsceneContext *sp40;               /* inferred */
    /* 0x44 */ char pad44[0x13];                    /* maybe part of sp40[5]? */
    /* 0x57 */ u8 sp57;                             /* inferred */
    /* 0x58 */ f32 sp58;                            /* inferred */
    /* 0x5C */ f32 sp5C;                            /* inferred */
    /* 0x60 */ f32 sp60;                            /* inferred */
    /* 0x64 */ char pad64[0xC];
};                                                  /* size = 0x70 */

struct _mips2c_stack_func_809DEAC4 {
    /* 0x00 */ char pad0[0x48];
    /* 0x48 */ ActorContext *sp48;                  /* inferred */
    /* 0x4C */ char pad4C[0xC];                     /* maybe part of sp48[4]? */
    /* 0x58 */ f32 sp58;                            /* inferred */
    /* 0x5C */ ? sp5C;                              /* inferred */
    /* 0x5C */ char pad5C[0x4];
    /* 0x60 */ f32 sp60;                            /* inferred */
    /* 0x64 */ char pad64[0x4];
    /* 0x68 */ Boss02 *sp68;                        /* inferred */
    /* 0x6C */ Player *sp6C;                        /* inferred */
};                                                  /* size = 0x70 */

f32 func_800C3FA0(CollisionContext *, ? *, f32 *, Actor *); /* extern */
f32 func_800C40B4(f32 *, ? *, ? *, f32 *);          /* extern */
? func_8013EC44(?, ?, ?, ?);                        /* extern */
? func_8016566C(?);                                 /* extern */
? func_80165690();                                  /* extern */
? func_8016981C(GlobalContext *, s16, void *, ? *, CutsceneContext *); /* extern */
void func_809DA1D0(GlobalContext *arg0, s32 arg1, s32 arg2, s32 arg3, u8 arg4, ?, s32); /* static */
void func_809DA22C(GlobalContext *arg0, s32 arg1, GlobalContext *, s32); /* static */
void func_809DA24C(GlobalContext *arg0, s32, GlobalContext *, s32); /* static */
void func_809DA264(void *arg0, f32 *arg1, f32 arg2); /* static */
void func_809DA344(void *arg0, f32 *arg1);          /* static */
