typedef struct EnRz {
    /* 0x000 */ Actor actor;
    /* 0x144 */ SkelAnime unk_144;                  /* inferred */
    /* 0x188 */ ? unk_188;                          /* inferred */
    /* 0x188 */ char pad_188[0x118];
    /* 0x2A0 */ ? unk_2A0;                          /* inferred */
    /* 0x2A0 */ char pad_2A0[0x120];
    /* 0x3C0 */ ColliderCylinder unk_3C0;           /* inferred */
    /* 0x40C */ EnRz *unk_40C;                      /* inferred */
    /* 0x410 */ s16 unk_410;                        /* inferred */
    /* 0x412 */ s16 unk_412;                        /* inferred */
    /* 0x414 */ char pad_414[0xC];                  /* maybe part of unk_412[7]? */
    /* 0x420 */ u16 unk_420;                        /* inferred */
    /* 0x422 */ s16 unk_422;                        /* inferred */
    /* 0x424 */ s16 unk_424;                        /* inferred */
    /* 0x426 */ s16 unk_426;                        /* inferred */
    /* 0x428 */ s16 unk_428;                        /* inferred */
    /* 0x42A */ s16 unk_42A;                        /* inferred */
    /* 0x42C */ s16 unk_42C;                        /* inferred */
    /* 0x42E */ char pad_42E[0x2];
    /* 0x430 */ void (*actionFunc)(EnRz *, GlobalContext *);
} EnRz;                                             /* size = 0x434 */

struct _mips2c_stack_EnRz_Destroy {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnRz_Draw {
    /* 0x00 */ char pad_0[0x30];
    /* 0x30 */ Gfx *sp30;                           /* inferred */
    /* 0x34 */ Gfx *sp34;                           /* inferred */
    /* 0x38 */ Gfx *sp38;                           /* inferred */
    /* 0x3C */ char pad_3C[0xC];
};                                                  /* size = 0x48 */

struct _mips2c_stack_EnRz_Init {
    /* 0x00 */ char pad_0[0x40];
};                                                  /* size = 0x40 */

struct _mips2c_stack_EnRz_Update {
    /* 0x00 */ char pad_0[0x28];
    /* 0x28 */ ColliderCylinder *sp28;              /* inferred */
    /* 0x2C */ char pad_2C[0xC];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80BFB780 {
    /* 0x00 */ char pad_0[0x28];
    /* 0x28 */ PosRot *sp28;                        /* inferred */
    /* 0x2C */ char pad_2C[0x8];                    /* maybe part of sp28[3]? */
    /* 0x34 */ ? sp34;                              /* inferred */
    /* 0x34 */ char pad_34[0x4];
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ char pad_3C[0x4];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80BFB864 {
    /* 0x00 */ char pad_0[0x34];
    /* 0x34 */ void *sp34;                          /* inferred */
    /* 0x38 */ s32 sp38;                            /* inferred */
    /* 0x3C */ char pad_3C[0xC];
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_80BFB9E4 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80BFBA1C {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80BFBA50 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ u8 *sp1C;                            /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80BFBB44 {
    /* 0x00 */ char pad_0[0x28];
    /* 0x28 */ f32 sp28;                            /* inferred */
    /* 0x2C */ f32 sp2C;                            /* inferred */
    /* 0x30 */ char pad_30[0x4];
    /* 0x34 */ u8 *sp34;                            /* inferred */
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80BFBC78 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80BFBCEC {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ void *sp18;                          /* inferred */
    /* 0x1C */ char pad_1C[0x4];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80BFBD54 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80BFBDA0 {};              /* size 0x0 */

struct _mips2c_stack_func_80BFBDFC {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80BFBE70 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80BFBFAC {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80BFC058 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80BFC078 {
    /* 0x00 */ char pad_0[0x28];
    /* 0x28 */ f32 sp28;                            /* inferred */
    /* 0x2C */ f32 sp2C;                            /* inferred */
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ char pad_34[0x4];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80BFC19C {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80BFC214 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80BFC270 {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80BFC2F4 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80BFC36C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80BFC3F8 {
    /* 0x00 */ char pad_0[0x30];
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ char pad_3C[0x4];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80BFC608 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80BFC674 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80BFC728 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80BFC7E0 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80BFC8AC {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80BFC8F8 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80BFCAD0 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

? func_801A1FB4(?, f32 *, ?, ?);                    /* extern */
void func_80BFB780(Actor *actor, Lights *mapper, GlobalContext *globalCtx); /* static */
void func_80BFB864(GlobalContext *arg0, EnRz *arg1, s16 arg2, u8 arg3, f32 arg4); /* static */
void func_80BFB9E4(s16 arg2, EnRz *, ?, s16);       /* static */
void func_80BFBA1C(s16 arg2, Actor *, ?);           /* static */
? func_80BFBA50(EnRz *arg0, GlobalContext *arg1);   /* static */
s32 func_80BFBB44(EnRz *arg0);                      /* static */
s32 func_80BFBC78(Actor *arg0, GlobalContext *arg1); /* static */
s32 func_80BFBCEC(Actor *arg0, GlobalContext *arg1); /* static */
void func_80BFBD54(EnRz *arg0, GlobalContext *arg1); /* static */
EnRz *func_80BFBDA0(EnRz *arg0, GlobalContext *arg1); /* static */
void func_80BFBDFC(GlobalContext *arg0, GlobalContext *); /* static */
