typedef struct EnZos {
    /* 0x000 */ Actor actor;
    /* 0x144 */ Vec3s unk_144;                      /* inferred */
    /* 0x14A */ char pad_14A[0x66];                 /* maybe part of unk_144[18]? */
    /* 0x1B0 */ Vec3s unk_1B0;                      /* inferred */
    /* 0x1B6 */ char pad_1B6[0x66];                 /* maybe part of unk_1B0[18]? */
    /* 0x21C */ SkelAnime unk_21C;                  /* inferred */
    /* 0x260 */ ColliderCylinder unk_260;           /* inferred */
    /* 0x2AC */ s16 unk_2AC;                        /* inferred */
    /* 0x2AE */ s16 unk_2AE;                        /* inferred */
    /* 0x2B0 */ char pad_2B0[0x6];                  /* maybe part of unk_2AE[4]? */
    /* 0x2B6 */ u16 unk_2B6;                        /* inferred */
    /* 0x2B8 */ s16 unk_2B8;                        /* inferred */
    /* 0x2BA */ char pad_2BA[0x2];
    /* 0x2BC */ s16 unk_2BC;                        /* inferred */
    /* 0x2BE */ char pad_2BE[0x2];
    /* 0x2C0 */ void (*actionFunc)(EnZos *, GlobalContext *);
} EnZos;                                            /* size = 0x2C4 */

struct _mips2c_stack_EnZos_Destroy {};              /* size 0x0 */

struct _mips2c_stack_EnZos_Draw {
    /* 0x00 */ char pad_0[0x38];
};                                                  /* size = 0x38 */

struct _mips2c_stack_EnZos_Init {
    /* 0x00 */ char pad_0[0x34];
    /* 0x34 */ SkelAnime *sp34;                     /* inferred */
    /* 0x38 */ char pad_38[0x8];
};                                                  /* size = 0x40 */

struct _mips2c_stack_EnZos_Update {
    /* 0x00 */ char pad_0[0x28];
    /* 0x28 */ ColliderCylinder *sp28;              /* inferred */
    /* 0x2C */ char pad_2C[0xC];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80BBAE84 {
    /* 0x00 */ char pad_0[0x30];
    /* 0x30 */ AnimationHeaderCommon **sp30;        /* inferred */
    /* 0x34 */ char pad_34[0x4];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80BBAF5C {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80BBAFFC {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80BBB0D4 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ SkelAnime *sp1C;                     /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80BBB15C {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80BBB2C4 {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80BBB354 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80BBB414 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80BBB4CC {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80BBB574 {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80BBB718 {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ void *sp20;                          /* inferred */
    /* 0x24 */ s32 sp24;                            /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80BBB8AC {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ void *sp2C;                          /* inferred */
    /* 0x30 */ Actor *sp30;                         /* inferred */
    /* 0x34 */ char pad_34[0x4];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80BBBB84 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80BBBCBC {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80BBBD5C {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80BBBDE0 {
    /* 0x00 */ char pad_0[0x28];
    /* 0x28 */ f32 sp28;                            /* inferred */
    /* 0x2C */ f32 sp2C;                            /* inferred */
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ char pad_34[0x4];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80BBBFBC {
    /* 0x00 */ char pad_0[0x1E];
    /* 0x1E */ u16 sp1E;                            /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80BBC070 {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80BBC14C {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80BBC22C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80BBC24C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80BBC298 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80BBC37C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80BBC4E4 {};              /* size 0x0 */

struct _mips2c_stack_func_80BBC500 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

? func_801A1FB4(?, f32 *, ?, ?);                    /* extern */
void func_80BBAE84(EnZos *arg0, s16 arg1, u8 arg2, EnZos *); /* static */
s32 func_80BBAF5C(Actor *arg0, GlobalContext *arg1); /* static */
s32 func_80BBAFFC(EnZos *arg0, GlobalContext *arg1, EnZos *); /* static */
void func_80BBB0D4(EnZos *arg0, GlobalContext *arg1); /* static */
void func_80BBB15C(EnZos *arg0, GlobalContext *arg1); /* static */
void func_80BBB2C4(Actor *arg0, GlobalContext *arg1); /* static */
void func_80BBB354(Actor *arg0, GlobalContext *arg1); /* static */
void func_80BBB414(EnZos *arg0, GlobalContext *arg1); /* static */
void func_80BBB4CC(EnZos *arg0, GlobalContext *arg1); /* static */
void func_80BBB574(EnZos *arg0, GlobalContext *arg1); /* static */
void func_80BBB718(EnZos *arg0, GlobalContext *arg1); /* static */
void func_80BBB8AC(EnZos *arg0, GlobalContext *arg1); /* static */
