typedef struct DemoKankyo {
    /* 0x0000 */ Actor actor;
    /* 0x0144 */ char pad_144[0x1500];              /* maybe part of actor[17]? */
    /* 0x1644 */ void (*actionFunc)(DemoKankyo *, GlobalContext *);
    /* 0x1648 */ s32 unk_1648;                      /* inferred */
    /* 0x164C */ s8 unk_164C;                       /* inferred */
    /* 0x164D */ char pad_164D[0x3];                /* maybe part of unk_164C[4]? */
} DemoKankyo;                                       /* size = 0x1650 */

struct _mips2c_stack_DemoKankyo_Destroy {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_DemoKankyo_Draw {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_DemoKankyo_Init {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ s32 sp20;                            /* inferred */
    /* 0x24 */ char pad_24[0xC];
};                                                  /* size = 0x30 */

struct _mips2c_stack_DemoKankyo_SetupAction {};     /* size 0x0 */

struct _mips2c_stack_DemoKankyo_Update {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_808CE45C {
    /* 0x00 */ char pad_0[0x7C];
    /* 0x7C */ f32 *sp7C;                           /* inferred */
    /* 0x80 */ char pad_80[0x4];
    /* 0x84 */ f32 *sp84;                           /* inferred */
    /* 0x88 */ f32 *sp88;                           /* inferred */
    /* 0x8C */ f32 *sp8C;                           /* inferred */
    /* 0x90 */ f32 *sp90;                           /* inferred */
    /* 0x94 */ char pad_94[0x10];                   /* maybe part of sp90[5]? */
    /* 0xA4 */ void *spA4;                          /* inferred */
    /* 0xA8 */ char pad_A8[0xC];                    /* maybe part of spA4[4]? */
    /* 0xB4 */ f32 spB4;                            /* inferred */
    /* 0xB8 */ f32 spB8;                            /* inferred */
    /* 0xBC */ f32 spBC;                            /* inferred */
    /* 0xC0 */ char pad_C0[0x4];
    /* 0xC4 */ f32 spC4;                            /* inferred */
    /* 0xC8 */ f32 spC8;                            /* inferred */
    /* 0xCC */ f32 spCC;                            /* inferred */
    /* 0xD0 */ char pad_D0[0x10];
};                                                  /* size = 0xE0 */

struct _mips2c_stack_func_808CF06C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_808CF0CC {
    /* 0x00 */ char pad_0[0xA4];
    /* 0xA4 */ f32 spA4;                            /* inferred */
    /* 0xA8 */ f32 spA8;                            /* inferred */
    /* 0xAC */ f32 spAC;                            /* inferred */
    /* 0xB0 */ char pad_B0[0x24];                   /* maybe part of spAC[10]? */
    /* 0xD4 */ f32 spD4;                            /* inferred */
    /* 0xD8 */ f32 spD8;                            /* inferred */
    /* 0xDC */ f32 spDC;                            /* inferred */
    /* 0xE0 */ char pad_E0[0x10];
};                                                  /* size = 0xF0 */

struct _mips2c_stack_func_808CF970 {
    /* 0x00 */ char pad_0[0x64];
    /* 0x64 */ void *sp64;                          /* inferred */
    /* 0x68 */ char pad_68[0x30];                   /* maybe part of sp64[13]? */
    /* 0x98 */ f32 sp98;                            /* inferred */
    /* 0x9C */ f32 sp9C;                            /* inferred */
    /* 0xA0 */ char pad_A0[0x4];
    /* 0xA4 */ f32 spA4;                            /* inferred */
    /* 0xA8 */ f32 spA8;                            /* inferred */
    /* 0xAC */ f32 spAC;                            /* inferred */
    /* 0xB0 */ char pad_B0[0x10];
};                                                  /* size = 0xC0 */

struct _mips2c_stack_func_808CFE04 {
    /* 0x00 */ char pad_0[0x54];
    /* 0x54 */ MtxF *sp54;                          /* inferred */
    /* 0x58 */ char pad_58[0x10];                   /* maybe part of sp54[5]? */
    /* 0x68 */ void *sp68;                          /* inferred */
    /* 0x6C */ char pad_6C[0x3C];                   /* maybe part of sp68[16]? */
    /* 0xA8 */ f32 spA8;                            /* inferred */
    /* 0xAC */ f32 spAC;                            /* inferred */
    /* 0xB0 */ char pad_B0[0x4];
    /* 0xB4 */ f32 spB4;                            /* inferred */
    /* 0xB8 */ f32 spB8;                            /* inferred */
    /* 0xBC */ f32 spBC;                            /* inferred */
    /* 0xC0 */ char pad_C0[0x10];
};                                                  /* size = 0xD0 */

void func_808CE45C(Actor *arg0, GlobalContext *arg1); /* static */
void func_808CF970(s32 arg0, GlobalContext *arg1);  /* static */
void func_808CFE04(void *arg0, GlobalContext *arg1); /* static */
extern ? D_04023428;
extern ? D_06001000;
static u8 D_808D03C0 = 0;
static s16 D_808D03C4 = 0;
static s16 D_808D03EA = 0xE;

void DemoKankyo_SetupAction(DemoKankyo *this, void (*actionFunc)(DemoKankyo *, GlobalContext *)) {
    this->actionFunc = actionFunc;
}

void func_808CE45C(Actor *arg0, GlobalContext *arg1) {
    f32 spCC;
    f32 spC8;
    f32 spC4;
    f32 spBC;
    f32 spB8;
    f32 spB4;
    void *spA4;
    f32 *sp90;
    f32 *sp8C;
    f32 *sp88;
    f32 *sp84;
    f32 *sp7C;
    f32 *temp_s1;
    f32 temp_f0;
    f32 temp_f0_2;
    f32 temp_f0_3;
    f32 temp_f0_4;
    f32 temp_f0_5;
    f32 temp_f0_6;
    f32 temp_f0_7;
    f32 temp_f0_8;
    f32 temp_f10;
