void func_808CE45C(Actor *arg0, GlobalContext *arg1); /* static */
void func_808CF970(s32 arg0, GlobalContext *arg1);  /* static */
void func_808CFE04(void *arg0, GlobalContext *arg1); /* static */
extern ? D_04023428;
extern ? D_06001000;
static u8 D_808D03C0 = 0;
static s16 D_808D03C4 = 0;
static s16 D_808D03EA = 0xE;

typedef struct DemoKankyo {
    /* 0x0000 */ Actor actor;
    /* 0x0144 */ u8 unk144;                         /* inferred */
    /* 0x0145 */ char pad145[0x3];                  /* maybe part of unk144[4]? */
    /* 0x0148 */ f32 unk148;                        /* inferred */
    /* 0x014C */ f32 unk14C;                        /* inferred */
    /* 0x0150 */ f32 unk150;                        /* inferred */
    /* 0x0154 */ char pad154[0xC];                  /* maybe part of unk150[4]? */
    /* 0x0160 */ f32 unk160;                        /* inferred */
    /* 0x0164 */ f32 unk164;                        /* inferred */
    /* 0x0168 */ f32 unk168;                        /* inferred */
    /* 0x016C */ f32 unk16C;                        /* inferred */
    /* 0x0170 */ f32 unk170;                        /* inferred */
    /* 0x0174 */ f32 unk174;                        /* inferred */
    /* 0x0178 */ f32 unk178;                        /* inferred */
    /* 0x017C */ f32 unk17C;                        /* inferred */
    /* 0x0180 */ u16 unk180;                        /* inferred */
    /* 0x0182 */ char pad182[0x2];                  /* maybe part of unk180[2]? */
    /* 0x0184 */ s8 unk184;                         /* inferred */
    /* 0x0185 */ char pad185[0x3];                  /* maybe part of unk184[4]? */
    /* 0x0188 */ f32 unk188;                        /* inferred */
    /* 0x018C */ char pad18C[0x8];                  /* maybe part of unk188[3]? */
    /* 0x0194 */ s16 unk194;                        /* inferred */
    /* 0x0196 */ char pad196[0x2];                  /* maybe part of unk194[2]? */
    /* 0x0198 */ s8 unk198;                         /* inferred */
    /* 0x0199 */ char pad199[0x53];                 /* maybe part of unk198[84]? */
    /* 0x01EC */ s8 unk1EC;                         /* inferred */
    /* 0x01ED */ char pad1ED[0x53];                 /* maybe part of unk1EC[84]? */
    /* 0x0240 */ s8 unk240;                         /* inferred */
    /* 0x0241 */ char pad241[0x1403];               /* maybe part of unk240[5124]? */
    /* 0x1644 */ void (*actionFunc)(DemoKankyo *, GlobalContext *);
    /* 0x1648 */ s32 unk1648;                       /* inferred */
    /* 0x164C */ s8 unk164C;                        /* inferred */
    /* 0x164D */ char pad164D[0x3];                 /* maybe part of unk164C[4]? */
} DemoKankyo;                                       /* size 0x1650 */

typedef struct {
    /* 0x0000 */ Room currRoom;
    /* 0x0014 */ Room prevRoom;
    /* 0x0028 */ void *roomMemPages[2];
    /* 0x0030 */ u8 activeMemPage;
    /* 0x0031 */ s8 unk31;
    /* 0x0032 */ char pad32[0x2];                   /* maybe part of unk31[3]? */
    /* 0x0034 */ void *activeRoomVram;
    /* 0x0038 */ DmaRequest dmaRequest;
    /* 0x0058 */ OSMesgQueue loadQueue;
    /* 0x0070 */ void *loadMsg[1];
    /* 0x0074 */ void *unk74;
    /* 0x0078 */ s8 unk78;
    /* 0x0079 */ s8 unk79;
    /* 0x007A */ char pad7A[0x2];                   /* maybe part of unk79[3]? */
    /* 0x007C */ s16 unk7C;                         /* inferred */
    /* 0x007E */ char pad7E[0x2];                   /* maybe part of unk7C[2]? */
} RoomContext;                                      /* size 0x80 */

void DemoKankyo_SetupAction(DemoKankyo *this, void (*actionFunc)(DemoKankyo *, GlobalContext *)) {
    DemoKankyo *self = (DemoKankyo *) this;
    self->actionFunc = actionFunc;
}

void func_808CE45C(Actor *arg0, GlobalContext *arg1) {
    f32 spCC;
    f32 spC8;
    f32 spC4;
    f32 spBC;
    f32 spB8;
    f32 spB4;
    void *spA4;
    f32 *sp90;
    f32 *sp8C;
    f32 *sp88;
    f32 *sp84;
    f32 *sp7C;
    f32 *temp_s1;
    f32 temp_f0;
    f32 temp_f0_2;
    f32 temp_f0_3;
    f32 temp_f0_4;
    f32 temp_f0_5;
    f32 temp_f0_6;
    f32 temp_f0_7;
    f32 temp_f0_8;
    f32 temp_f10;
    f32 temp_f10_2;
    f32 temp_f12;
    f32 temp_f12_2;
    f32 temp_f14;
    f32 temp_f16;
    f32 temp_f18;
    f32 temp_f20;
    f32 temp_f22;
    f32 temp_f2;
    f32 temp_f2_2;
    f32 temp_f6;
    f32 temp_f8;
    f32 temp_f8_2;
