typedef struct DoorWarp1 {
    /* 0x000 */ Actor actor;
    /* 0x144 */ s32 unk144;                         /* inferred */
    /* 0x148 */ char pad148[0x14];                  /* maybe part of unk144[6]? */
    /* 0x15C */ SkelAnime unk15C;                   /* inferred */
    /* 0x1A0 */ Actor *unk1A0;                      /* inferred */
    /* 0x1A4 */ f32 unk1A4;                         /* inferred */
    /* 0x1A8 */ f32 unk1A8;                         /* inferred */
    /* 0x1AC */ f32 unk1AC;                         /* inferred */
    /* 0x1B0 */ f32 unk1B0;                         /* inferred */
    /* 0x1B4 */ f32 unk1B4;                         /* inferred */
    /* 0x1B8 */ f32 unk1B8;                         /* inferred */
    /* 0x1BC */ f32 unk1BC;                         /* inferred */
    /* 0x1C0 */ f32 unk1C0;                         /* inferred */
    /* 0x1C4 */ s16 unk1C4;                         /* inferred */
    /* 0x1C6 */ s16 unk1C6;                         /* inferred */
    /* 0x1C8 */ s16 unk1C8;                         /* inferred */
    /* 0x1CA */ s16 unk1CA;                         /* inferred */
    /* 0x1CC */ s16 unk1CC;                         /* inferred */
    /* 0x1CE */ s16 unk1CE;                         /* inferred */
    /* 0x1D0 */ u16 unk1D0;                         /* inferred */
    /* 0x1D2 */ char pad1D2[0x1];
    /* 0x1D3 */ u8 unk1D3;                          /* inferred */
    /* 0x1D4 */ s8 unk1D4;                          /* inferred */
    /* 0x1D5 */ char pad1D5[0x3];                   /* maybe part of unk1D4[4]? */
    /* 0x1D8 */ void (*actionFunc)(DoorWarp1 *, GlobalContext *);
    /* 0x1DC */ LightNode *unk1DC;                  /* inferred */
    /* 0x1E0 */ LightInfo unk1E0;                   /* inferred */
    /* 0x1EE */ char pad1EE[0x2];
    /* 0x1F0 */ LightNode *unk1F0;                  /* inferred */
    /* 0x1F4 */ LightInfo unk1F4;                   /* inferred */
    /* 0x202 */ s8 unk202;                          /* inferred */
    /* 0x203 */ u8 unk203;                          /* inferred */
    /* 0x204 */ f32 unk204;                         /* inferred */
    /* 0x208 */ char pad208[0x4];
} DoorWarp1;                                        /* size = 0x20C */

struct _mips2c_stack_DoorWarp1_Destroy {
    /* 0x00 */ char pad0[0x18];
    /* 0x18 */ LightContext *sp18;                  /* inferred */
    /* 0x1C */ char pad1C[0xC];
};                                                  /* size = 0x28 */

struct _mips2c_stack_DoorWarp1_Draw {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_DoorWarp1_Init {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_DoorWarp1_SetupAction {};      /* size 0x0 */

struct _mips2c_stack_DoorWarp1_Update {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_808B849C {};              /* size 0x0 */

struct _mips2c_stack_func_808B8568 {
    /* 0x00 */ char pad0[0x30];
    /* 0x30 */ LightContext *sp30;                  /* inferred */
    /* 0x34 */ LightInfo *sp34;                     /* inferred */
    /* 0x38 */ char pad38[0x8];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_808B866C {};              /* size 0x0 */

struct _mips2c_stack_func_808B8924 {
    /* 0x00 */ char pad0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_808B8A7C {
    /* 0x00 */ char pad0[0x34];
    /* 0x34 */ SkelAnime *sp34;                     /* inferred */
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_808B8C48 {
    /* 0x00 */ char pad0[0x40];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_808B8E78 {
    /* 0x00 */ char pad0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_808B900C {
    /* 0x00 */ char pad0[0x1B];
    /* 0x1B */ u8 sp1B;                             /* inferred */
    /* 0x1C */ char pad1C[0x4];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_808B9094 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_808B90CC {
    /* 0x00 */ char pad0[0x2E];
    /* 0x2E */ s16 sp2E;                            /* inferred */
    /* 0x30 */ char pad30[0x8];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_808B921C {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_808B93A0 {
    /* 0x00 */ char pad0[0x20];
    /* 0x20 */ Actor *sp20;                         /* inferred */
    /* 0x24 */ char pad24[0x4];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_808B94A4 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_808B9524 {
    /* 0x00 */ char pad0[0x1C];
    /* 0x1C */ void *sp1C;                          /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_808B958C {
    /* 0x00 */ char pad0[0x2C];
    /* 0x2C */ Actor *sp2C;                         /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_808B96A0 {};              /* size 0x0 */

struct _mips2c_stack_func_808B96B0 {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_808B977C {
    /* 0x00 */ char pad0[0x2C];
    /* 0x2C */ Actor *sp2C;                         /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_808B9840 {
    /* 0x00 */ char pad0[0x1C];
    /* 0x1C */ void *sp1C;                          /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_808B98A8 {
    /* 0x00 */ char pad0[0x38];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_808B9B30 {
    /* 0x00 */ char pad0[0x40];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_808B9BE8 {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_808B9CE8 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_808B9E94 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_808B9ED8 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_808B9F10 {
    /* 0x00 */ char pad0[0x24];
    /* 0x24 */ Actor *sp24;                         /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_808B9FD0 {
    /* 0x00 */ char pad0[0x30];
    /* 0x30 */ void *sp30;                          /* inferred */
    /* 0x34 */ s16 sp34;                            /* inferred */
    /* 0x36 */ char pad36[0x2];
    /* 0x38 */ Actor *sp38;                         /* inferred */
    /* 0x3C */ Actor *sp3C;                         /* inferred */
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_808BA10C {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_808BA550 {
    /* 0x00 */ char pad0[0x30];
    /* 0x30 */ Actor *sp30;                         /* inferred */
    /* 0x34 */ char pad34[0x4];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_808BAAF4 {
    /* 0x00 */ char pad0[0x1A];
    /* 0x1A */ s16 sp1A;                            /* inferred */
    /* 0x1C */ char pad1C[0x4];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_808BABF4 {};              /* size 0x0 */

struct _mips2c_stack_func_808BACCC {
    /* 0x00 */ char pad0[0x30];
    /* 0x30 */ GraphicsContext *sp30;               /* inferred */
    /* 0x34 */ char pad34[0x4];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_808BAE9C {
    /* 0x00 */ char pad0[0x44];
    /* 0x44 */ u32 sp44;                            /* inferred */
    /* 0x48 */ s32 sp48;                            /* inferred */
    /* 0x4C */ ? *sp4C;                             /* inferred */
    /* 0x50 */ char pad50[0x8];                     /* maybe part of sp4C[3]? */
    /* 0x58 */ Gfx *sp58;                           /* inferred */
    /* 0x5C */ char pad5C[0xC];                     /* maybe part of sp58[4]? */
    /* 0x68 */ Gfx *sp68;                           /* inferred */
    /* 0x6C */ Gfx *sp6C;                           /* inferred */
    /* 0x70 */ Gfx *sp70;                           /* inferred */
    /* 0x74 */ char pad74[0x10];                    /* maybe part of sp70[5]? */
    /* 0x84 */ f32 sp84;                            /* inferred */
    /* 0x88 */ char pad88[0x4];
    /* 0x8C */ f32 sp8C;                            /* inferred */
    /* 0x90 */ f32 sp90;                            /* inferred */
    /* 0x94 */ s32 sp94;                            /* inferred */
    /* 0x98 */ char pad98[0x8];
};                                                  /* size = 0xA0 */

struct _mips2c_stack_func_808BB4C4 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_808BB4F4 {
    /* 0x00 */ char pad0[0x28];
    /* 0x28 */ void *sp28;                          /* inferred */
    /* 0x2C */ char pad2C[0x18];                    /* maybe part of sp28[7]? */
    /* 0x44 */ GraphicsContext *sp44;               /* inferred */
    /* 0x48 */ char pad48[0x4];
    /* 0x4C */ Gfx *sp4C;                           /* inferred */
    /* 0x50 */ char pad50[0xC];                     /* maybe part of sp4C[4]? */
    /* 0x5C */ GraphicsContext *sp5C;               /* inferred */
    /* 0x60 */ s32 sp60;                            /* inferred */
    /* 0x64 */ ? sp64;                              /* inferred */
    /* 0x64 */ char pad64[0x14];
};                                                  /* size = 0x78 */

struct _mips2c_stack_func_808BB8D4 {
    /* 0x00 */ char pad0[0x94];
    /* 0x94 */ s8 sp94;                             /* inferred */
    /* 0x95 */ s8 sp95;                             /* inferred */
    /* 0x96 */ s8 sp96;                             /* inferred */
    /* 0x97 */ char pad97[0x1];
    /* 0x98 */ s8 sp98;                             /* inferred */
    /* 0x99 */ s8 sp99;                             /* inferred */
    /* 0x9A */ s8 sp9A;                             /* inferred */
    /* 0x9B */ char pad9B[0x1];
    /* 0x9C */ f32 sp9C;                            /* inferred */
    /* 0xA0 */ f32 spA0;                            /* inferred */
    /* 0xA4 */ f32 spA4;                            /* inferred */
};                                                  /* size = 0xA8 */

? func_80169FDC(GlobalContext *, s32);              /* extern */
s32 func_808B849C(DoorWarp1 *arg0, GlobalContext *arg1, u32, s32); /* static */
void func_808B8568(DoorWarp1 *arg0, GlobalContext *arg1); /* static */
s32 func_808B866C(DoorWarp1 *arg0, GlobalContext *arg1); /* static */
void func_808B8924(DoorWarp1 *arg0, GlobalContext *arg1); /* static */
void func_808B8A7C(DoorWarp1 *arg0, GlobalContext *arg1); /* static */
void func_808B8C48(DoorWarp1 *arg0, GlobalContext *arg1); /* static */
void func_808B8E78(DoorWarp1 *arg0, GlobalContext *arg1); /* static */
u8 func_808B900C(DoorWarp1 *arg0, GlobalContext *arg1); /* static */
void func_808B9094(DoorWarp1 *this, GlobalContext *globalCtx); /* static */
void func_808B90CC(DoorWarp1 *this, GlobalContext *globalCtx); /* static */
