typedef struct ActorListEntry {
    /* 0x0 */ s32 length;
    /* 0x4 */ Actor *first;
    /* 0x8 */ Collider unk_8;                       /* inferred */
} ActorListEntry;                                   /* size = 0xC */

typedef struct EnJso2 {
    /* 0x0000 */ Actor actor;
    /* 0x0144 */ SkelAnime unk_144;                 /* inferred */
    /* 0x0188 */ Vec3s unk_188;                     /* inferred */
    /* 0x018E */ ? unk_18E;                         /* inferred */
    /* 0x018E */ char pad_18E[0x6];
    /* 0x0194 */ ? unk_194;                         /* inferred */
    /* 0x0194 */ char pad_194[0x6];
    /* 0x019A */ ? unk_19A;                         /* inferred */
    /* 0x019A */ char pad_19A[0x66];
    /* 0x0200 */ Vec3s unk_200;                     /* inferred */
    /* 0x0206 */ char pad_206[0x72];                /* maybe part of unk_200[20]? */
    /* 0x0278 */ void (*actionFunc)(EnJso2 *, GlobalContext *);
    /* 0x027C */ ? unk_27C;                         /* inferred */
    /* 0x027C */ char pad_27C[0x8];
    /* 0x0284 */ s16 unk_284;                       /* inferred */
    /* 0x0286 */ s16 unk_286;                       /* inferred */
    /* 0x0288 */ s16 unk_288;                       /* inferred */
    /* 0x028A */ s16 unk_28A;                       /* inferred */
    /* 0x028C */ char pad_28C[0x2];
    /* 0x028E */ s16 unk_28E;                       /* inferred */
    /* 0x0290 */ s16 unk_290;                       /* inferred */
    /* 0x0292 */ char pad_292[0x2];
    /* 0x0294 */ f32 unk_294;                       /* inferred */
    /* 0x0298 */ f32 unk_298;                       /* inferred */
    /* 0x029C */ s32 unk_29C;                       /* inferred */
    /* 0x02A0 */ s16 unk_2A0;                       /* inferred */
    /* 0x02A2 */ s16 unk_2A2;                       /* inferred */
    /* 0x02A4 */ f32 unk_2A4;                       /* inferred */
    /* 0x02A8 */ f32 unk_2A8;                       /* inferred */
    /* 0x02AC */ char pad_2AC[0x4];
    /* 0x02B0 */ s16 unk_2B0;                       /* inferred */
    /* 0x02B2 */ char pad_2B2[0x2];
    /* 0x02B4 */ s32 unk_2B4;                       /* inferred */
    /* 0x02B8 */ Vec3f unk_2B8;                     /* inferred */
    /* 0x02C4 */ f32 unk_2C4;                       /* inferred */
    /* 0x02C8 */ f32 unk_2C8;                       /* inferred */
    /* 0x02CC */ f32 unk_2CC;                       /* inferred */
    /* 0x02D0 */ Actor *unk_2D0;                    /* inferred */
    /* 0x02D4 */ Vec3f unk_2D4;                     /* inferred */
    /* 0x02E0 */ char pad_2E0[0x86];                /* maybe part of unk_2D4[12]? */
    /* 0x0366 */ s16 unk_366;                       /* inferred */
    /* 0x0368 */ s8 unk_368;                        /* inferred */
    /* 0x0369 */ char pad_369[0x3];                 /* maybe part of unk_368[4]? */
    /* 0x036C */ s32 unk_36C;                       /* inferred */
    /* 0x0370 */ s8 unk_370;                        /* inferred */
    /* 0x0371 */ u8 unk_371;                        /* inferred */
    /* 0x0372 */ char pad_372[0x2];                 /* maybe part of unk_371[3]? */
    /* 0x0374 */ f32 unk_374;                       /* inferred */
    /* 0x0378 */ f32 unk_378;                       /* inferred */
    /* 0x037C */ char pad_37C[0x4];
    /* 0x0380 */ s32 unk_380;                       /* inferred */
    /* 0x0384 */ s32 unk_384;                       /* inferred */
    /* 0x0388 */ s32 unk_388;                       /* inferred */
    /* 0x038C */ s16 unk_38C;                       /* inferred */
    /* 0x038E */ s16 unk_38E;                       /* inferred */
    /* 0x0390 */ char pad_390[0xAC8];               /* maybe part of unk_38E[1381]? */
    /* 0x0E58 */ Vec3f unk_E58;                     /* inferred */
    /* 0x0E64 */ char pad_E64[0x48];                /* maybe part of unk_E58[7]? */
    /* 0x0EAC */ ActorContext unk_EAC;              /* inferred */
    /* 0x0EF4 */ ColliderCylinder unk_EF4;          /* overlap; inferred */
    /* 0x0F40 */ ColliderQuad unk_F40;              /* overlap; inferred */
    /* 0x0FC0 */ ColliderQuad unk_FC0;              /* overlap; inferred */
    /* 0x1044 */ s16 unk_1044;                      /* overlap; inferred */
    /* 0x1046 */ s16 unk_1046;                      /* overlap; inferred */
    /* 0x1048 */ s16 unk_1048;                      /* overlap; inferred */
    /* 0x104C */ f32 unk_104C;                      /* overlap; inferred */
    /* 0x1050 */ f32 unk_1050;                      /* overlap; inferred */
    /* 0x1054 */ Vec3f unk_1054;                    /* overlap; inferred */
    /* 0x1060 */ Vec3f unk_1060;                    /* overlap; inferred */
    /* 0x1078 */ Vec3f unk_1078;                    /* overlap; inferred */
    /* 0x107C */ f32 unk_107C;                      /* overlap; inferred */
    /* 0x1080 */ f32 unk_1080;                      /* overlap; inferred */
    /* 0x1084 */ f32 unk_1084;                      /* overlap; inferred */
    /* 0x1088 */ f32 unk_1088;                      /* overlap; inferred */
    /* 0x108C */ f32 unk_108C;                      /* overlap; inferred */
} EnJso2;                                           /* size = 0x1090 */

typedef struct {
    /* 0x00 */ ? unk_0;                             /* inferred */
    /* 0x00 */ char pad_0[0x2];
    /* 0x02 */ ? unk_2;                             /* inferred */
    /* 0x02 */ char pad_2[0x2];
    /* 0x04 */ ? unk_4;                             /* inferred */
    /* 0x04 */ char pad_4[0x2];
    /* 0x06 */ s16 unk_6;                           /* inferred */
    /* 0x08 */ ? unk_8;                             /* inferred */
    /* 0x08 */ char pad_8[0x4];
    /* 0x0C */ f32 unkC;
    /* 0x10 */ Color_RGBA8 unk10;
} TargetContextEntry;                               /* size = 0x14 */

struct _mips2c_stack_EnJso2_Destroy {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_EnJso2_Draw {
    /* 0x00 */ char pad_0[0x5C];
    /* 0x5C */ MtxF *sp5C;                          /* inferred */
    /* 0x60 */ char pad_60[0x4];
    /* 0x64 */ Vec3s *sp64;                         /* inferred */
    /* 0x68 */ f32 sp68;                            /* inferred */
    /* 0x6C */ char pad_6C[0x44];
};                                                  /* size = 0xB0 */

struct _mips2c_stack_EnJso2_Init {
    /* 0x000 */ char pad_0[0x34];
    /* 0x034 */ ? sp34;                             /* inferred */
    /* 0x034 */ char pad_34[0x184];
    /* 0x1B8 */ s8 sp1B8;                           /* inferred */
    /* 0x1B9 */ s8 sp1B9;                           /* inferred */
    /* 0x1BA */ s8 sp1BA;                           /* inferred */
    /* 0x1BB */ s8 sp1BB;                           /* inferred */
    /* 0x1BC */ s8 sp1BC;                           /* inferred */
    /* 0x1BD */ s8 sp1BD;                           /* inferred */
    /* 0x1BE */ s8 sp1BE;                           /* inferred */
    /* 0x1BF */ s8 sp1BF;                           /* inferred */
    /* 0x1C0 */ s8 sp1C0;                           /* inferred */
    /* 0x1C1 */ s8 sp1C1;                           /* inferred */
    /* 0x1C2 */ s8 sp1C2;                           /* inferred */
    /* 0x1C3 */ s8 sp1C3;                           /* inferred */
    /* 0x1C4 */ s8 sp1C4;                           /* inferred */
    /* 0x1C5 */ s8 sp1C5;                           /* inferred */
    /* 0x1C6 */ s8 sp1C6;                           /* inferred */
    /* 0x1C7 */ s8 sp1C7;                           /* inferred */
    /* 0x1C8 */ s32 sp1C8;                          /* inferred */
    /* 0x1CC */ s32 sp1CC;                          /* inferred */
    /* 0x1D0 */ s32 sp1D0;                          /* inferred */
    /* 0x1D4 */ ? sp1D4;                            /* inferred */
    /* 0x1D4 */ char pad_1D4[0x184];
    /* 0x358 */ s8 sp358;                           /* inferred */
    /* 0x359 */ s8 sp359;                           /* inferred */
    /* 0x35A */ s8 sp35A;                           /* inferred */
    /* 0x35B */ s8 sp35B;                           /* inferred */
    /* 0x35C */ s8 sp35C;                           /* inferred */
    /* 0x35D */ s8 sp35D;                           /* inferred */
    /* 0x35E */ s8 sp35E;                           /* inferred */
    /* 0x35F */ s8 sp35F;                           /* inferred */
    /* 0x360 */ s8 sp360;                           /* inferred */
    /* 0x361 */ s8 sp361;                           /* inferred */
    /* 0x362 */ s8 sp362;                           /* inferred */
    /* 0x363 */ s8 sp363;                           /* inferred */
    /* 0x364 */ s8 sp364;                           /* inferred */
    /* 0x365 */ s8 sp365;                           /* inferred */
    /* 0x366 */ s8 sp366;                           /* inferred */
    /* 0x367 */ s8 sp367;                           /* inferred */
    /* 0x368 */ s32 sp368;                          /* inferred */
    /* 0x36C */ s32 sp36C;                          /* inferred */
    /* 0x370 */ s32 sp370;                          /* inferred */
    /* 0x374 */ char pad_374[0x4];
};                                                  /* size = 0x378 */

struct _mips2c_stack_EnJso2_Update {
    /* 0x00 */ char pad_0[0x28];
    /* 0x28 */ Collider *sp28;                      /* inferred */
    /* 0x2C */ CollisionCheckContext *sp2C;         /* inferred */
    /* 0x30 */ char pad_30[0x10];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80A776E0 {
    /* 0x00 */ char pad_0[0x28];
    /* 0x28 */ AnimationHeaderCommon **sp28;        /* inferred */
    /* 0x2C */ char pad_2C[0x4];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80A77790 {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ f32 *sp20;                           /* inferred */
    /* 0x24 */ f32 *sp24;                           /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80A77880 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A778D8 {};              /* size 0x0 */

struct _mips2c_stack_func_80A778F8 {
    /* 0x00 */ char pad_0[0x4C];
    /* 0x4C */ f32 *sp4C;                           /* inferred */
    /* 0x50 */ ActorContext *sp50;                  /* inferred */
    /* 0x54 */ PosRot *sp54;                        /* inferred */
    /* 0x58 */ char pad_58[0x8];                    /* maybe part of sp54[3]? */
    /* 0x60 */ f32 sp60;                            /* inferred */
    /* 0x64 */ f32 sp64;                            /* inferred */
    /* 0x68 */ f32 sp68;                            /* inferred */
    /* 0x6C */ char pad_6C[0x8];                    /* maybe part of sp68[3]? */
    /* 0x74 */ f32 sp74;                            /* inferred */
    /* 0x78 */ f32 sp78;                            /* inferred */
    /* 0x7C */ f32 sp7C;                            /* inferred */
    /* 0x80 */ f32 sp80;                            /* inferred */
    /* 0x84 */ char pad_84[0x4];
};                                                  /* size = 0x88 */

struct _mips2c_stack_func_80A78588 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A785E4 {
    /* 0x00 */ char pad_0[0x5C];
    /* 0x5C */ f32 sp5C;                            /* inferred */
};                                                  /* size = 0x60 */

struct _mips2c_stack_func_80A787FC {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ void *sp1C;                          /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80A78868 {
    /* 0x00 */ char pad_0[0x28];
    /* 0x28 */ SkelAnime *sp28;                     /* inferred */
    /* 0x2C */ char pad_2C[0x8];                    /* maybe part of sp28[3]? */
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ f32 sp3C;                            /* inferred */
    /* 0x40 */ Actor *sp40;                         /* inferred */
    /* 0x44 */ f32 sp44;                            /* inferred */
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_80A78A70 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A78ACC {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A78B04 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A78B70 {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80A78C08 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A78C7C {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ ? sp2C;                              /* inferred */
    /* 0x2C */ char pad_2C[0x10];
    /* 0x3C */ f32 sp3C;                            /* inferred */
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80A78E8C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A78F04 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A78F80 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A79038 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80A790E4 {
    /* 0x00 */ char pad_0[0x38];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80A7919C {
    /* 0x00 */ char pad_0[0x40];
    /* 0x40 */ f32 sp40;                            /* inferred */
    /* 0x44 */ ? sp44;                              /* inferred */
    /* 0x44 */ char pad_44[0xC];
};                                                  /* size = 0x50 */

struct _mips2c_stack_func_80A79300 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A79364 {
    /* 0x00 */ char pad_0[0x38];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80A79450 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A794C8 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A79524 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ ? sp24;                              /* inferred */
    /* 0x24 */ char pad_24[0xC];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80A79600 {
    /* 0x00 */ char pad_0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80A796BC {
    /* 0x00 */ char pad_0[0x30];
    /* 0x30 */ PosRot *sp30;                        /* inferred */
    /* 0x34 */ ? sp34;                              /* inferred */
    /* 0x34 */ char pad_34[0xC];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80A7980C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A79864 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A798C8 {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ f32 sp2C;                            /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80A7998C {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80A79A84 {
    /* 0x00 */ char pad_0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80A79B60 {};              /* size 0x0 */

struct _mips2c_stack_func_80A79BA0 {
    /* 0x00 */ char pad_0[0x4C];
    /* 0x4C */ f32 sp4C;                            /* inferred */
    /* 0x50 */ char pad_50[0x4];
    /* 0x54 */ f32 sp54;                            /* inferred */
    /* 0x58 */ f32 sp58;                            /* inferred */
    /* 0x5C */ Actor *sp5C;                         /* inferred */
};                                                  /* size = 0x60 */

struct _mips2c_stack_func_80A7A0D0 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A7A124 {
    /* 0x00 */ char pad_0[0x44];
    /* 0x44 */ f32 sp44;                            /* inferred */
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_80A7A2EC {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80A7A360 {
    /* 0x00 */ char pad_0[0x3C];
    /* 0x3C */ s32 sp3C;                            /* inferred */
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80A7AA48 {};              /* size 0x0 */

struct _mips2c_stack_func_80A7AA9C {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ Vec3f *sp2C;                         /* inferred */
    /* 0x30 */ Vec3f *sp30;                         /* inferred */
    /* 0x34 */ Vec3f *sp34;                         /* inferred */
    /* 0x38 */ Vec3f *sp38;                         /* inferred */
    /* 0x3C */ char pad_3C[0x8];                    /* maybe part of sp38[3]? */
    /* 0x44 */ Gfx *sp44;                           /* inferred */
    /* 0x48 */ char pad_48[0x8];                    /* maybe part of sp44[3]? */
    /* 0x50 */ f32 sp50;                            /* inferred */
    /* 0x54 */ f32 sp54;                            /* inferred */
    /* 0x58 */ f32 sp58;                            /* inferred */
    /* 0x5C */ ? sp5C;                              /* inferred */
    /* 0x5C */ char pad_5C[0xC];
    /* 0x68 */ ? sp68;                              /* inferred */
    /* 0x68 */ char pad_68[0x10];
};                                                  /* size = 0x78 */

? func_80169940(GlobalContext *, s16, s32);         /* extern */
? func_801A0238(?, ?);                              /* extern */
? func_801A0654(Vec3f *, ?, ?);                     /* extern */
void func_80A776E0(EnJso2 *arg0, s32 arg1, ? *, s32); /* static */
void func_80A77790(EnJso2 *arg0, GlobalContext *arg1); /* static */
s32 func_80A77880(GlobalContext *arg0);             /* static */
void func_80A778D8(EnJso2 *arg0);                   /* static */
void func_80A78588(EnJso2 *arg0);                   /* static */
void func_80A787FC(EnJso2 *arg0, GlobalContext *arg1); /* static */
void func_80A78A70(Actor *arg0, s16, s32);          /* static */
void func_80A78B04(EnJso2 *arg0);                   /* static */
void func_80A78C08(EnJso2 *arg0);                   /* static */
void func_80A78E8C(EnJso2 *arg0);                   /* static */
