CRASHED

typedef struct EnBomjima {
    /* 0x000 */ Actor actor;
    /* 0x144 */ SkelAnime unk144;                   /* inferred */
    /* 0x188 */ Vec3s unk188;                       /* inferred */
    /* 0x18E */ char pad18E[0x78];                  /* maybe part of unk188[21]? */
    /* 0x206 */ Vec3s unk206;                       /* inferred */
    /* 0x20C */ char pad20C[0x78];                  /* maybe part of unk206[21]? */
    /* 0x284 */ void (*actionFunc)(EnBomjima *, GlobalContext *);
    /* 0x288 */ s16 unk288;                         /* inferred */
    /* 0x28A */ s16 unk28A;                         /* inferred */
    /* 0x28C */ char pad28C[0x2];
    /* 0x28E */ s16 unk28E;                         /* inferred */
    /* 0x290 */ s16 unk290;                         /* inferred */
    /* 0x292 */ char pad292[0x2];
    /* 0x294 */ s16 unk294;                         /* inferred */
    /* 0x296 */ char pad296[0x4];                   /* maybe part of unk294[3]? */
    /* 0x29A */ s16 unk29A;                         /* inferred */
    /* 0x29C */ char pad29C[0x4];                   /* maybe part of unk29A[3]? */
    /* 0x2A0 */ s16 unk2A0;                         /* inferred */
    /* 0x2A2 */ s16 unk2A2;                         /* inferred */
    /* 0x2A4 */ Vec3f unk2A4;                       /* inferred */
    /* 0x2B0 */ Vec3f unk2B0;                       /* inferred */
    /* 0x2BC */ s16 unk2BC;                         /* inferred */
    /* 0x2BE */ s16 unk2BE;                         /* inferred */
    /* 0x2C0 */ s16 unk2C0;                         /* inferred */
    /* 0x2C2 */ s16 unk2C2;                         /* inferred */
    /* 0x2C4 */ s16 unk2C4;                         /* inferred */
    /* 0x2C6 */ s16 unk2C6;                         /* inferred */
    /* 0x2C8 */ s16 unk2C8;                         /* inferred */
    /* 0x2CA */ s16 unk2CA;                         /* inferred */
    /* 0x2CC */ f32 unk2CC;                         /* inferred */
    /* 0x2D0 */ char pad2D0[0x4];
    /* 0x2D4 */ s16 unk2D4;                         /* inferred */
    /* 0x2D6 */ s16 unk2D6;                         /* inferred */
    /* 0x2D8 */ char pad2D8[0x4];                   /* maybe part of unk2D6[3]? */
    /* 0x2DC */ s16 unk2DC;                         /* inferred */
    /* 0x2DE */ s16 unk2DE;                         /* inferred */
    /* 0x2E0 */ s16 unk2E0;                         /* inferred */
    /* 0x2E2 */ s16 unk2E2;                         /* inferred */
    /* 0x2E4 */ s16 unk2E4;                         /* inferred */
    /* 0x2E6 */ s16 unk2E6;                         /* inferred */
    /* 0x2E8 */ s16 unk2E8;                         /* inferred */
    /* 0x2EA */ s16 unk2EA;                         /* inferred */
    /* 0x2EC */ s32 unk2EC;                         /* inferred */
    /* 0x2F0 */ Actor *unk2F0;                      /* inferred */
    /* 0x2F4 */ s16 unk2F4;                         /* inferred */
    /* 0x2F6 */ char pad2F6[0x2];
    /* 0x2F8 */ ColliderCylinder unk2F8;            /* inferred */
} EnBomjima;                                        /* size = 0x344 */

struct _mips2c_stack_EnBomjima_Destroy {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnBomjima_Draw {
    /* 0x00 */ char pad0[0x30];
    /* 0x30 */ Gfx *sp30;                           /* inferred */
    /* 0x34 */ Gfx *sp34;                           /* inferred */
    /* 0x38 */ Gfx *sp38;                           /* inferred */
    /* 0x3C */ char pad3C[0xC];
};                                                  /* size = 0x48 */

struct _mips2c_stack_EnBomjima_Init {
    /* 0x00 */ char pad0[0x38];
};                                                  /* size = 0x38 */

struct _mips2c_stack_EnBomjima_Update {
    /* 0x00 */ char pad0[0x2C];
    /* 0x2C */ ColliderCylinder *sp2C;              /* inferred */
    /* 0x30 */ char pad30[0x8];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80BFE494 {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80BFE524 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80BFE65C {};              /* size 0x0 */

struct _mips2c_stack_func_80BFE67C {
    /* 0x00 */ char pad0[0x38];
    /* 0x38 */ s16 *sp38;                           /* inferred */
    /* 0x3C */ Vec3f *sp3C;                         /* inferred */
    /* 0x40 */ Vec3f *sp40;                         /* inferred */
    /* 0x44 */ char pad44[0x8];                     /* maybe part of sp40[3]? */
    /* 0x4C */ u32 sp4C;                            /* inferred */
    /* 0x50 */ CollisionPoly *sp50;                 /* inferred */
    /* 0x54 */ f32 sp54;                            /* inferred */
    /* 0x58 */ char pad58[0x4];
    /* 0x5C */ f32 sp5C;                            /* inferred */
    /* 0x60 */ f32 sp60;                            /* inferred */
    /* 0x64 */ char pad64[0x4];
    /* 0x68 */ f32 sp68;                            /* inferred */
    /* 0x6C */ ? sp6C;                              /* inferred */
    /* 0x6C */ char pad6C[0x18];
    /* 0x84 */ f32 sp84;                            /* inferred */
};                                                  /* size = 0x88 */

struct _mips2c_stack_func_80BFEA94 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80BFEB1C {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80BFEB64 {
    /* 0x00 */ char pad0[0x2C];
    /* 0x2C */ PosRot *sp2C;                        /* inferred */
    /* 0x30 */ char pad30[0x4];
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ char pad38[0x6];                     /* maybe part of sp34[2]? */
    /* 0x3E */ s16 sp3E;                            /* inferred */
    /* 0x40 */ f32 sp40;                            /* inferred */
    /* 0x44 */ f32 sp44;                            /* inferred */
    /* 0x48 */ f32 sp48;                            /* inferred */
    /* 0x4C */ char pad4C[0x8];                     /* maybe part of sp48[3]? */
    /* 0x54 */ Actor *sp54;                         /* inferred */
};                                                  /* size = 0x58 */

struct _mips2c_stack_func_80BFEFF0 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80BFF03C {
    /* 0x00 */ char pad0[0x24];
    /* 0x24 */ Actor *sp24;                         /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80BFF120 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80BFF174 {
    /* 0x00 */ char pad0[0x28];
    /* 0x28 */ Actor *sp28;                         /* inferred */
    /* 0x2C */ f32 sp2C;                            /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80BFF3F0 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80BFF430 {
    /* 0x00 */ char pad0[0x38];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80BFF4F4 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80BFF52C {
    /* 0x00 */ char pad0[0x20];
    /* 0x20 */ Actor *sp20;                         /* inferred */
    /* 0x24 */ Actor *sp24;                         /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80BFF6CC {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80BFF754 {
    /* 0x00 */ char pad0[0xA0];
    /* 0xA0 */ f32 spA0;                            /* inferred */
    /* 0xA4 */ f32 spA4;                            /* inferred */
    /* 0xA8 */ f32 spA8;                            /* inferred */
    /* 0xAC */ char padAC[0x4];
};                                                  /* size = 0xB0 */

struct _mips2c_stack_func_80BFF9B0 {
    /* 0x00 */ char pad0[0x1C];
    /* 0x1C */ Actor *sp1C;                         /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80BFFB40 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80BFFBC4 {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80BFFCFC {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80BFFD48 {
    /* 0x00 */ char pad0[0x2C];
    /* 0x2C */ PosRot *sp2C;                        /* inferred */
    /* 0x30 */ char pad30[0x8];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80BFFE48 {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80BFFF54 {
    /* 0x00 */ char pad0[0x2C];
    /* 0x2C */ f32 sp2C;                            /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80C0011C {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80C00168 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80C00234 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80C00284 {
    /* 0x00 */ char pad0[0x28];
    /* 0x28 */ f32 sp28;                            /* inferred */
    /* 0x2C */ Actor *sp2C;                         /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80C007F4 {};              /* size 0x0 */

? func_80BFE32C(EnBomjima *, GlobalContext *, s16); /* static */
void func_80BFE494(EnBomjima *arg0, s32 arg1, f32 arg2, EnBomjima *); /* static */
void func_80BFE524(Actor *arg0);                    /* static */
void func_80BFE65C(EnBomjima *arg0, EnBomjima *);   /* static */
void func_80BFE67C(EnBomjima *arg0, GlobalContext *arg1); /* static */
void func_80BFEB1C(EnBomjima *arg0);                /* static */
void func_80BFEFF0(EnBomjima *arg0);                /* static */
void func_80BFF120(EnBomjima *arg0);                /* static */
void func_80BFF3F0(EnBomjima *arg0);                /* static */
void func_80BFF4F4(EnBomjima *arg0);                /* static */
void func_80BFFCFC(EnBomjima *arg0);                /* static */
