CRASHED

/*
Failed to decompile function func_80BFE32C:

Label L80BFE400 refers to a delay slot; this is currently not supported.
Please modify the assembly to work around it (e.g. copy the instruction
to all jump sources and move the label, or add a nop to the delay slot).
*/
? func_80BFE32C(EnBomjima *, GlobalContext *, s16); /* static */
void func_80BFE494(EnBomjima *arg0, s32 arg1, f32 arg2, EnBomjima *); /* static */
void func_80BFE524(Actor *arg0);                    /* static */
void func_80BFE65C(EnBomjima *arg0, EnBomjima *);   /* static */
void func_80BFE67C(EnBomjima *arg0, GlobalContext *arg1); /* static */
void func_80BFEB1C(EnBomjima *arg0);                /* static */
void func_80BFEFF0(EnBomjima *arg0);                /* static */
void func_80BFF120(EnBomjima *arg0);                /* static */
void func_80BFF3F0(EnBomjima *arg0);                /* static */
void func_80BFF4F4(EnBomjima *arg0);                /* static */
void func_80BFFCFC(EnBomjima *arg0);                /* static */
void func_80C0011C(EnBomjima *arg0);                /* static */
void func_80C00234(EnBomjima *arg0);                /* static */
s32 func_80C007F4(GlobalContext *arg0, s32 arg1, Gfx **arg2, Vec3f *arg3, Vec3s *arg4, Actor *arg5); /* static */
extern AnimationHeader D_060064B8;
extern FlexSkeletonHeader D_0600F82C;
static s32 D_80C009F0 = 0;
static s32 D_80C009F4 = 0;
static ColliderCylinderInit D_80C00A18 = {
    {0xA, 0, 0, 9, 0x20, 1},
    {0, {0, 0, 0}, {0xF7CFFFFF, 0, 0}, 0, 0, 1},
    {0xA, 0x1E, 0, {0, 0, 0}},
};
static ? D_80C00A54;                                /* unable to generate initializer */
static ? D_80C00A70;                                /* unable to generate initializer */
static ? D_80C00A8C;                                /* unable to generate initializer */
static ? D_80C00A94;                                /* unable to generate initializer */
static ? D_80C00AE4;                                /* unable to generate initializer */
static ? D_80C00AF8;                                /* unable to generate initializer */
static ? D_80C00B28;                                /* unable to generate initializer */
static ? D_80C00B3C;                                /* unable to generate initializer */
static ? D_80C00B48;                                /* unable to generate initializer */

typedef struct EnBomjima {
    /* 0x0000 */ Actor actor;
    /* 0x0144 */ SkelAnime unk144;                  /* inferred */
    /* 0x0188 */ Vec3s unk188;                      /* inferred */
    /* 0x018E */ char pad18E[0x78];                 /* maybe part of unk188[21]? */
    /* 0x0206 */ Vec3s unk206;                      /* inferred */
    /* 0x020C */ char pad20C[0x78];                 /* maybe part of unk206[21]? */
    /* 0x0284 */ void (*actionFunc)(EnBomjima *, GlobalContext *);
    /* 0x0288 */ s16 unk288;                        /* inferred */
    /* 0x028A */ s16 unk28A;                        /* inferred */
    /* 0x028C */ char pad28C[0x2];                  /* maybe part of unk28A[2]? */
    /* 0x028E */ s16 unk28E;                        /* inferred */
    /* 0x0290 */ s16 unk290;                        /* inferred */
    /* 0x0292 */ char pad292[0x2];                  /* maybe part of unk290[2]? */
    /* 0x0294 */ s16 unk294;                        /* inferred */
    /* 0x0296 */ char pad296[0x4];                  /* maybe part of unk294[3]? */
    /* 0x029A */ s16 unk29A;                        /* inferred */
    /* 0x029C */ char pad29C[0x4];                  /* maybe part of unk29A[3]? */
    /* 0x02A0 */ s16 unk2A0;                        /* inferred */
    /* 0x02A2 */ s16 unk2A2;                        /* inferred */
    /* 0x02A4 */ Vec3f unk2A4;                      /* inferred */
    /* 0x02B0 */ Vec3f unk2B0;                      /* inferred */
    /* 0x02BC */ s16 unk2BC;                        /* inferred */
    /* 0x02BE */ s16 unk2BE;                        /* inferred */
    /* 0x02C0 */ s16 unk2C0;                        /* inferred */
    /* 0x02C2 */ s16 unk2C2;                        /* inferred */
    /* 0x02C4 */ s16 unk2C4;                        /* inferred */
    /* 0x02C6 */ s16 unk2C6;                        /* inferred */
    /* 0x02C8 */ s16 unk2C8;                        /* inferred */
    /* 0x02CA */ s16 unk2CA;                        /* inferred */
    /* 0x02CC */ f32 unk2CC;                        /* inferred */
    /* 0x02D0 */ f32 unk2D0;                        /* inferred */
    /* 0x02D4 */ s16 unk2D4;                        /* inferred */
    /* 0x02D6 */ s16 unk2D6;                        /* inferred */
    /* 0x02D8 */ char pad2D8[0x4];                  /* maybe part of unk2D6[3]? */
    /* 0x02DC */ s16 unk2DC;                        /* inferred */
    /* 0x02DE */ s16 unk2DE;                        /* inferred */
    /* 0x02E0 */ s16 unk2E0;                        /* inferred */
    /* 0x02E2 */ s16 unk2E2;                        /* inferred */
    /* 0x02E4 */ s16 unk2E4;                        /* inferred */
    /* 0x02E6 */ s16 unk2E6;                        /* inferred */
    /* 0x02E8 */ s16 unk2E8;                        /* inferred */
    /* 0x02EA */ s16 unk2EA;                        /* inferred */
    /* 0x02EC */ s32 unk2EC;                        /* inferred */
    /* 0x02F0 */ Actor *unk2F0;                     /* inferred */
    /* 0x02F4 */ s16 unk2F4;                        /* inferred */
    /* 0x02F6 */ char pad2F6[0x2];                  /* maybe part of unk2F4[2]? */
    /* 0x02F8 */ ColliderCylinder unk2F8;           /* inferred */
} EnBomjima;                                        /* size 0x344 */

void EnBomjima_Init(Actor *thisx, GlobalContext *globalCtx) {
    EnBomjima *this = (EnBomjima *) thisx;
    s16 temp_v0;
    s16 temp_v0_2;
    s16 temp_v1;
    s8 temp_s0;
    s16 phi_s0;
    EnBomjima *phi_s1;

    this->actor.colChkInfo.mass = 0xFF;
    ActorShape_Init(&this->actor.shape, 0.0f, func_800B3FC0, 19.0f);
    this->actor.gravity = -3.0f;
    SkelAnime_InitSV(globalCtx, &this->unk144, &D_0600F82C, &D_060064B8, &this->unk188, &this->unk206, 0x15);
    Collider_InitAndSetCylinder(globalCtx, &this->unk2F8, &this->actor, &D_80C00A18);
    gSaveContext.weekEventReg[83] &= 0xFB;
    temp_v1 = this->actor.params;
    this->actor.targetMode = 0;
    this->unk2E6 = ((s32) temp_v1 >> 4) & 0xF;
    this->unk2E4 = temp_v1 & 0xF;
    Actor_SetScale(&this->actor, 0.01f);
    temp_v0 = this->unk2E6;
    if (temp_v0 == 0) {
