s32 func_800BE184(GlobalContext *, Actor *, ?, ?, s32, s32); /* extern */
? func_800DFD04(s32, ?, ?, ?);                      /* extern */
? func_800F0590(GlobalContext *, void *, ?, ?);     /* extern */
void func_80929AF8(Actor *arg0);                    /* static */
void func_80929B6C(Actor *arg0, GlobalContext *arg1); /* static */
void func_80929BEC(Actor *arg0, GlobalContext *arg1); /* static */
s32 func_80929C80(Actor *arg0, GlobalContext *arg1); /* static */
s32 func_80929D04(Actor *arg0);                     /* static */
void func_80929E2C(Actor *arg0, GlobalContext *, Actor *); /* static */
void func_80929E88(EnIk *arg0);                     /* static */
void func_80929F20(Actor *arg0, GlobalContext *arg1); /* static */
void func_80929FC8(Actor *arg0);                    /* static */
void func_8092A020(Actor *arg0, GlobalContext *arg1); /* static */
void func_8092A124(Actor *arg0);                    /* static */
void func_8092A188(Actor *arg0, GlobalContext *arg1); /* static */
void func_8092A28C(Actor *arg0);                    /* static */
void func_8092A33C(Actor *arg0, GlobalContext *arg1); /* static */
void func_8092A570(Actor *arg0);                    /* static */
void func_8092A5BC(Actor *arg0, GlobalContext *arg1); /* static */
void func_8092A680(Actor *arg0);                    /* static */
void func_8092A754(Actor *arg0, ? arg1);            /* static */
void func_8092A8D8(Actor *arg0);                    /* static */

extern AnimationHeader D_0600367C;
extern AnimationHeaderCommon D_0600391C;
extern AnimationHeader D_06004A04;
extern AnimationHeader D_06005254;
extern AnimationHeader D_060057F4;
extern AnimationHeader D_06006294;
extern FlexSkeletonHeader D_060136A0;
static ? D_8092BFA0;                                /* unable to generate initializer */
static ? D_8092BFA4;                                /* unable to generate initializer */
static ? D_8092BFD8;                                /* unable to generate initializer */
static ColliderCylinderInit D_8092C01C = {
    {9, 0, 9, 0x39, 0x20, 1},
    {2, {0, 0, 0}, {0xF7CFFFFF, 0, 0}, 0, 5, 1},
    {0x19, 0x50, 0, {0, 0, 0}},
};
static ColliderTrisElementInit D_8092C048 = {
    {
        {2, {0, 0, 0}, {0xF7CFFFFF, 0, 0}, 0, 1, 0},
        {{{-10.0f, 14.0f, 2.0f}, {-10.0f, -6.0f, 2.0f}, {9.0f, 14.0f, 2.0f}}},
    },
    {
        {2, {0, 0, 0}, {0xF7CFFFFF, 0, 0}, 0, 1, 0},
        {{{-10.0f, -6.0f, 2.0f}, {9.0f, -6.0f, 2.0f}, {9.0f, 14.0f, 2.0f}}},
    },
};
static ColliderTrisInit D_8092C0C0 = {{9, 0, 0xD, 0, 0x20, 2}, 2, &D_8092C048};
static ColliderQuadInit D_8092C0D0 = {
    {0xA, 0x10, 0, 0, 0x20, 3},
    {0, {0x20000000, 4, 0x40}, {0, 0, 0}, 0x81, 0, 0},
    {
        {
            {0.0f, 0.0f, 0.0f},
            {0.0f, 0.0f, 0.0f},
            {0.0f, 0.0f, 0.0f},
            {0.0f, 0.0f, 0.0f},
        },
    },
};
static DamageTable D_8092C120 = {
    {
        0xF0,
        0xF0,
        0,
        1,
        0xF0,
        0xF0,
        0,
        0xF0,
        2,
        1,
        3,
        0xF0,
        0xF0,
        0x41,
        0xF0,
        0xF0,
        0xF0,
        0xF0,
        0xF0,
        0,
        0,
        0,
        1,
        0xF0,
        1,
        0,
        0,
        0,
        0,
        0,
        0,
        1,
    },
};
static DamageTable D_8092C140 = {
    {
        0,
        1,
        0,
        1,
        1,
        1,
        0,
        0xF0,
        2,
        1,
        3,
        0x22,
        0x32,
        0x42,
        1,
        0,
        1,
        0,
        0,
        0,
        0,
        0,
        1,
        1,
        1,
        0,
        0,
        0,
        0,
        0,
        0,
        1,
    },
};
static CollisionCheckInfoInit D_8092C160 = {0x12, 0x19, 0x50, 0xFE};
static InitChainEntry D_8092C168;                   /* unable to generate initializer */
static void D_8092C174;                             /* unable to generate initializer */
static s32 D_8092C198 = 0;
static Vec3f D_8092C19C = {0.0f, 0.5f, 0.0f};
static ? D_8092C1A8;                                /* unable to generate initializer */
static Vec3f D_8092C1C8 = {2000.0f, -200.0f, -5200.0f};
static Vec3f D_8092C1D4 = {300.0f, -200.0f, 0.0f};
static ? D_8092C1E0;                                /* unable to generate initializer */
static Vec3f D_8092C200 = {0.53f, 0.53f, 0.53f};
ActorInit En_Ik_InitVars = {0x84, 5, 0x405, 0xD8, 0x668, EnIk_Init, EnIk_Destroy, EnIk_Update, EnIk_Draw};

typedef struct EnIk {
    /* 0x0000 */ Actor actor;
    /* 0x0144 */ SkelAnime unk144;                  /* inferred */
    /* 0x0188 */ Vec3s unk188;                      /* inferred */
    /* 0x018E */ char pad18E[0xAE];                 /* maybe part of unk188[30]? */
    /* 0x023C */ Vec3s unk23C;                      /* inferred */
    /* 0x0242 */ char pad242[0xAE];                 /* maybe part of unk23C[30]? */
    /* 0x02F0 */ void (*actionFunc)(EnIk *, GlobalContext *);
    /* 0x02F4 */ u8 unk2F4;                         /* inferred */
    /* 0x02F5 */ u8 unk2F5;                         /* inferred */
    /* 0x02F6 */ s16 unk2F6;                        /* inferred */
    /* 0x02F8 */ char pad2F8[0x2];                  /* maybe part of unk2F6[2]? */
    /* 0x02FA */ s16 unk2FA;                        /* inferred */
    /* 0x02FC */ s16 unk2FC;                        /* inferred */
    /* 0x02FE */ char pad2FE[0x2];                  /* maybe part of unk2FC[2]? */
    /* 0x0300 */ s32 unk300;                        /* inferred */
    /* 0x0304 */ f32 unk304;                        /* inferred */
    /* 0x0308 */ f32 unk308;                        /* inferred */
    /* 0x030C */ f32 unk30C;                        /* inferred */
    /* 0x0310 */ Vec3f unk310;                      /* inferred */
    /* 0x031C */ char pad31C[0x90];                 /* maybe part of unk310[13]? */
    /* 0x03AC */ ColliderCylinder unk3AC;           /* inferred */
    /* 0x03F8 */ ColliderQuad unk3F8;               /* inferred */
    /* 0x0478 */ ColliderTris unk478;               /* inferred */
    /* 0x0498 */ ColliderTrisElement unk498;        /* inferred */
    /* 0x04F4 */ char pad4F4[0x80];
    /* 0x0574 */ s32 unk574;                        /* inferred */
    /* 0x0578 */ char pad578[0xF0];                 /* maybe part of unk574[61]? */
} EnIk;                                             /* size 0x668 */

void EnIk_Init(Actor *thisx, GlobalContext *globalCtx) {
    EnIk *this = (EnIk *) thisx;
    ? *temp_s0;
    ColliderCylinder *temp_s1;
    ? *phi_s0;

    Actor_ProcessInitChain(&this->actor, &D_8092C168);
    SkelAnime_InitSV(globalCtx, &this->unk144, &D_060136A0, &D_06006294, &this->unk188, &this->unk23C, 0x1E);
    temp_s1 = &this->unk3AC;
    Collider_InitAndSetCylinder(globalCtx, temp_s1, &this->actor, &D_8092C01C);
    Collider_UpdateCylinder(&this->actor, temp_s1);
    Collider_InitAndSetTris(globalCtx, &this->unk478, &this->actor, &D_8092C0C0, &this->unk498);
    Collider_InitAndSetQuad(globalCtx, &this->unk3F8, &this->actor, &D_8092C0D0);
    CollisionCheck_SetInfo(&this->actor.colChkInfo, &D_8092C120, &D_8092C160);
    this->actor.params &= 0xFF;
    this->actor.params += -1;
