typedef struct BgIkanaRotaryroom {
    /* 0x000 */ Actor actor;
    /* 0x144 */ s32 unk_144;                        /* inferred */
    /* 0x148 */ char pad_148[0x14];                 /* maybe part of unk_144[6]? */
    /* 0x15C */ ColliderJntSph unk_15C;             /* inferred */
    /* 0x17C */ ColliderJntSphElement unk_17C;      /* inferred */
    /* 0x1BC */ char pad_1BC[0x40];
    /* 0x1FC */ void *unk_1FC;                      /* inferred */
    /* 0x200 */ ? (*unk_200)(BgIkanaRotaryroom *, GlobalContext *, BgIkanaRotaryroom *); /* inferred */
    /* 0x204 */ void *unk_204;                      /* inferred */
    /* 0x208 */ char pad_208[0x370];                /* maybe part of unk_204[221]? */
    /* 0x578 */ ? (*unk_578)(BgIkanaRotaryroom *, GlobalContext *, BgIkanaRotaryroom *); /* inferred */
    /* 0x57C */ char pad_57C[0x4];
    /* 0x580 */ void (*actionFunc)(BgIkanaRotaryroom *, GlobalContext *);
    /* 0x584 */ char pad_584[0x4];
} BgIkanaRotaryroom;                                /* size = 0x588 */

struct _mips2c_stack_BgIkanaRotaryroom_Destroy {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_BgIkanaRotaryroom_Draw {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_BgIkanaRotaryroom_Init {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ ColliderJntSph *sp2C;                /* inferred */
    /* 0x30 */ CollisionHeader **sp30;              /* inferred */
    /* 0x34 */ s32 sp34;                            /* inferred */
    /* 0x38 */ char pad_38[0x8];
};                                                  /* size = 0x40 */

struct _mips2c_stack_BgIkanaRotaryroom_Update {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B802E0 {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ ColliderJntSph *sp20;                /* inferred */
    /* 0x24 */ char pad_24[0x4];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80B80358 {};              /* size 0x0 */

struct _mips2c_stack_func_80B80440 {
    /* 0x00 */ char pad_0[0x50];
    /* 0x50 */ f32 sp50;                            /* inferred */
    /* 0x54 */ f32 sp54;                            /* inferred */
    /* 0x58 */ f32 sp58;                            /* inferred */
    /* 0x5C */ char pad_5C[0x4];
};                                                  /* size = 0x60 */

struct _mips2c_stack_func_80B80550 {
    /* 0x00 */ char pad_0[0x60];
    /* 0x60 */ s16 sp60;                            /* inferred */
    /* 0x62 */ s16 sp62;                            /* inferred */
    /* 0x64 */ s16 sp64;                            /* inferred */
    /* 0x66 */ char pad_66[0x2];
    /* 0x68 */ ? sp68;                              /* inferred */
    /* 0x68 */ char pad_68[0x4C];
    /* 0xB4 */ f32 spB4;                            /* inferred */
    /* 0xB8 */ f32 spB8;                            /* inferred */
    /* 0xBC */ f32 spBC;                            /* inferred */
    /* 0xC0 */ char pad_C0[0x4];
    /* 0xC4 */ s32 spC4;                            /* inferred */
    /* 0xC8 */ s32 spC8;                            /* inferred */
    /* 0xCC */ char pad_CC[0x4];
};                                                  /* size = 0xD0 */

struct _mips2c_stack_func_80B80778 {
    /* 0x00 */ char pad_0[0x58];
    /* 0x58 */ void *sp58;                          /* inferred */
    /* 0x5C */ char pad_5C[0xC];                    /* maybe part of sp58[4]? */
    /* 0x68 */ ? sp68;                              /* inferred */
    /* 0x68 */ char pad_68[0x10];
};                                                  /* size = 0x78 */

struct _mips2c_stack_func_80B80894 {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ MtxF *sp2C;                          /* inferred */
    /* 0x30 */ char pad_30[0x28];
};                                                  /* size = 0x58 */

struct _mips2c_stack_func_80B80C88 {
    /* 0x00 */ char pad_0[0x3C];
    /* 0x3C */ ? sp3C;                              /* inferred */
    /* 0x3C */ char pad_3C[0x6C];
};                                                  /* size = 0xA8 */

struct _mips2c_stack_func_80B80F08 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ s32 sp24;                            /* inferred */
    /* 0x28 */ ? sp28;                              /* inferred */
    /* 0x28 */ char pad_28[0xC];
    /* 0x34 */ ? sp34;                              /* inferred */
    /* 0x34 */ char pad_34[0xC];
    /* 0x40 */ void *sp40;                          /* inferred */
    /* 0x44 */ char pad_44[0x4];
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_80B81010 {
    /* 0x00 */ char pad_0[0x78];
    /* 0x78 */ ? sp78;                              /* inferred */
    /* 0x78 */ char pad_78[0x4];
    /* 0x7C */ ? sp7C;                              /* inferred */
    /* 0x7C */ char pad_7C[0x8];
    /* 0x84 */ f32 sp84;                            /* inferred */
    /* 0x88 */ f32 sp88;                            /* inferred */
    /* 0x8C */ f32 sp8C;                            /* inferred */
    /* 0x90 */ char pad_90[0x18];
};                                                  /* size = 0xA8 */

struct _mips2c_stack_func_80B81234 {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ Vec3f *sp2C;                         /* inferred */
    /* 0x30 */ Vec3f *sp30;                         /* inferred */
    /* 0x34 */ char pad_34[0x8];                    /* maybe part of sp30[3]? */
    /* 0x3C */ ? sp3C;                              /* inferred */
    /* 0x3C */ char pad_3C[0x4];
    /* 0x40 */ ? sp40;                              /* inferred */
    /* 0x40 */ char pad_40[0x4];
    /* 0x44 */ f32 sp44;                            /* inferred */
    /* 0x48 */ char pad_48[0x4];
    /* 0x4C */ f32 sp4C;                            /* inferred */
    /* 0x50 */ f32 sp50;                            /* inferred */
    /* 0x54 */ f32 sp54;                            /* inferred */
    /* 0x58 */ f32 sp58;                            /* inferred */
    /* 0x5C */ f32 sp5C;                            /* inferred */
    /* 0x60 */ f32 sp60;                            /* inferred */
    /* 0x64 */ s32 sp64;                            /* inferred */
    /* 0x68 */ char pad_68[0x10];
};                                                  /* size = 0x78 */

struct _mips2c_stack_func_80B814B8 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80B81570 {
    /* 0x00 */ char pad_0[0x64];
    /* 0x64 */ f32 sp64;                            /* inferred */
    /* 0x68 */ f32 sp68;                            /* inferred */
    /* 0x6C */ f32 sp6C;                            /* inferred */
    /* 0x70 */ f32 sp70;                            /* inferred */
    /* 0x74 */ f32 sp74;                            /* inferred */
    /* 0x78 */ f32 sp78;                            /* inferred */
    /* 0x7C */ char pad_7C[0x4];
};                                                  /* size = 0x80 */

struct _mips2c_stack_func_80B816A4 {};              /* size 0x0 */

struct _mips2c_stack_func_80B818B4 {};              /* size 0x0 */

struct _mips2c_stack_func_80B818C8 {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ s32 sp20;                            /* inferred */
    /* 0x24 */ char pad_24[0x4];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80B81978 {};              /* size 0x0 */

struct _mips2c_stack_func_80B8198C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B819DC {};              /* size 0x0 */

struct _mips2c_stack_func_80B819F0 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80B81A64 {};              /* size 0x0 */

struct _mips2c_stack_func_80B81A80 {
    /* 0x00 */ char pad_0[0x26];
    /* 0x26 */ s16 sp26;                            /* inferred */
    /* 0x28 */ char pad_28[0x10];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80B81B84 {};              /* size 0x0 */

struct _mips2c_stack_func_80B81BA0 {
    /* 0x00 */ char pad_0[0x2A];
    /* 0x2A */ s16 sp2A;                            /* inferred */
    /* 0x2C */ char pad_2C[0x4];                    /* maybe part of sp2A[3]? */
    /* 0x30 */ s32 sp30;                            /* inferred */
    /* 0x34 */ char pad_34[0x4];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80B81DAC {};              /* size 0x0 */

struct _mips2c_stack_func_80B81DC8 {
    /* 0x00 */ char pad_0[0x26];
    /* 0x26 */ s16 sp26;                            /* inferred */
    /* 0x28 */ char pad_28[0x8];
};                                                  /* size = 0x30 */

f32 func_800C4188(void *, void *, ? *, ? *, s32, f32 *); /* extern */
void func_80B802E0(BgIkanaRotaryroom *arg0);        /* static */
void func_80B80358(f32 *arg0);                      /* static */
void func_80B80440(BgIkanaRotaryroom *arg0, GlobalContext *arg1); /* static */
void func_80B80550(BgIkanaRotaryroom *arg0, GlobalContext *arg1); /* static */
void *func_80B80778(Actor *arg0, void *arg1, s16 *arg2); /* static */
void func_80B80894(Actor *arg0, void *arg1, Actor *, void *); /* static */
void func_80B80C88(Actor *arg0, GlobalContext *arg1); /* static */
s32 func_80B80F08(BgIkanaRotaryroom *arg0, GlobalContext *arg1, BgIkanaRotaryroom *); /* static */
void func_80B81010(void *arg0, void *arg1);         /* static */
void func_80B81234(void *arg0, void *arg1);         /* static */
void func_80B81570(BgIkanaRotaryroom *arg0, GlobalContext *arg1); /* static */
