f32 func_800C4188(void *, void *, ? *, ? *, s32, f32 *); /* extern */
void func_80B802E0(BgIkanaRotaryroom *arg0);        /* static */
void func_80B80358(Vec3f *arg0);                    /* static */
void func_80B80440(BgIkanaRotaryroom *arg0, GlobalContext *arg1); /* static */
void func_80B80550(BgIkanaRotaryroom *arg0, GlobalContext *arg1); /* static */
void *func_80B80778(Actor *arg0, void *arg1, s16 *arg2); /* static */
void func_80B80894(Actor *arg0, void *arg1, Actor *, void *); /* static */
void func_80B80C88(Actor *arg0, GlobalContext *arg1); /* static */
s32 func_80B80F08(BgIkanaRotaryroom *arg0, GlobalContext *arg1, BgIkanaRotaryroom *); /* static */
void func_80B81010(void *arg0, void *arg1);         /* static */
void func_80B81234(void *arg0, void *arg1);         /* static */
void func_80B81570(BgIkanaRotaryroom *arg0, GlobalContext *arg1); /* static */
s32 func_80B816A4(Actor *arg0, s32, Actor *);       /* static */
void func_80B818B4(BgIkanaRotaryroom *arg0);        /* static */
void func_80B818C8(BgIkanaRotaryroom *arg0, GlobalContext *arg1, BgIkanaRotaryroom *); /* static */
void func_80B81978(BgIkanaRotaryroom *arg0);        /* static */
void func_80B8198C(BgIkanaRotaryroom *arg0, GlobalContext *arg1, BgIkanaRotaryroom *); /* static */
void func_80B819DC(void *arg0);                     /* static */
void func_80B819F0(Actor *arg0, GlobalContext *arg1); /* static */
void func_80B81A64(Actor *arg0);                    /* static */
void func_80B81A80(Actor *arg0, void *arg1);        /* static */
void func_80B81B84(Actor *arg0, s32, Actor *);      /* static */
void func_80B81BA0(Actor *arg0, GlobalContext *arg1); /* static */
void func_80B81DAC(Actor *arg0);                    /* static */
void func_80B81DC8(Actor *arg0, void *arg1);        /* static */
extern Gfx D_06004710;
extern Gfx D_060048A0;
extern Gfx D_06007360;
extern Gfx D_06007448;
extern void D_06007B68;
static ColliderJntSphElementInit D_80B820E0 = {
    {
        {4, {0, 0, 0}, {0x2000, 0, 0}, 0, 1, 0},
        {0, {{0xF286, 0x1C2, 0}, 0x3C}, 0x64},
    },
    {{4, {0, 0, 0}, {0x2000, 0, 0}, 0, 1, 0}, {0, {{0xD7A, 0x1C2, 0}, 0x3C}, 0x64}},
};
static ColliderJntSphInit D_80B82128 = {{0xA, 0, 9, 0, 0, 0}, 2, &D_80B820E0};
static ColliderJntSphElementInit D_80B82138 = {
    {4, {0, 0, 0}, {0x2000, 0, 0}, 0, 1, 0},
    {0, {{0xF15A, 0x4B0, 0}, 0x3C}, 0x64},
};
static ColliderJntSphInit D_80B8215C = {{0xA, 0, 9, 0, 0, 0}, 1, &D_80B82138};
static ? D_80B8216C;                                /* unable to generate initializer */
static ? D_80B82178;                                /* unable to generate initializer */
static ? D_80B82184;                                /* unable to generate initializer */
static ? D_80B821C4;                                /* unable to generate initializer */
static ? D_80B82200;                                /* unable to generate initializer */
static InitChainEntry D_80B82214;                   /* unable to generate initializer */
static ? D_80B82218;                                /* unable to generate initializer */
static ? D_80B8221C;                                /* unable to generate initializer */

typedef struct BgIkanaRotaryroom {
    /* 0x0000 */ Actor actor;
    /* 0x0144 */ s32 unk144;                        /* inferred */
    /* 0x0148 */ char pad148[0x14];                 /* maybe part of unk144[6]? */
    /* 0x015C */ ColliderJntSph unk15C;             /* inferred */
    /* 0x017C */ ColliderJntSphElement unk17C;      /* inferred */
    /* 0x01BC */ char pad1BC[0x40];                 /* maybe part of unk17C[2]? */
    /* 0x01FC */ void *unk1FC;                      /* inferred */
    /* 0x0200 */ void (*unk200)(BgIkanaRotaryroom *, GlobalContext *, BgIkanaRotaryroom *); /* inferred */
    /* 0x0204 */ Actor *unk204;                     /* inferred */
    /* 0x0208 */ char pad208[0x40];                 /* maybe part of unk204[17]? */
    /* 0x0248 */ s32 unk248;                        /* inferred */
    /* 0x024C */ char pad24C[0x84];                 /* maybe part of unk248[34]? */
    /* 0x02D0 */ s32 unk2D0;                        /* inferred */
    /* 0x02D4 */ char pad2D4[0x10C];                /* maybe part of unk2D0[68]? */
    /* 0x03E0 */ s32 unk3E0;                        /* inferred */
    /* 0x03E4 */ char pad3E4[0x194];                /* maybe part of unk3E0[102]? */
    /* 0x0578 */ ? (*unk578)(BgIkanaRotaryroom *, GlobalContext *, BgIkanaRotaryroom *); /* inferred */
    /* 0x057C */ ? (*unk57C)(BgIkanaRotaryroom *, GlobalContext *, BgIkanaRotaryroom *); /* inferred */
    /* 0x0580 */ void (*actionFunc)(BgIkanaRotaryroom *, GlobalContext *, BgIkanaRotaryroom *);
    /* 0x0584 */ char pad584[0x4];                  /* maybe part of actionFunc[2]? */
} BgIkanaRotaryroom;                                /* size 0x588 */

void func_80B802E0(BgIkanaRotaryroom *arg0) {
    ColliderJntSph *sp20;
    ColliderJntSph *temp_a1;

    SysMatrix_SetStateRotationAndTranslation(arg0->actor.world.pos.x, arg0->actor.world.pos.y, arg0->actor.world.pos.z, arg0 + 0xBC);
    Matrix_Scale(arg0->actor.scale.x, arg0->actor.scale.y, arg0->actor.scale.z, 1);
    temp_a1 = arg0 + 0x15C;
    sp20 = temp_a1;
    Collider_UpdateSpheres(0, temp_a1);
    if ((arg0->actor.params & 1) == 0) {
        Collider_UpdateSpheres(1, temp_a1);
    }
}

void func_80B80358(Vec3f *arg0) {
    f32 temp_f0;
    f32 temp_f0_2;
    f32 temp_f12;
    f32 phi_f2;
    f32 phi_f2_2;
    f32 phi_f2_3;

    temp_f0 = arg0->x;
    if (temp_f0 >= 0.0f) {
        phi_f2 = 0.5f;
    } else {
        phi_f2 = -0.5f;
    }
    temp_f12 = arg0->y;
    arg0->x = temp_f0 + phi_f2;
    if (temp_f12 >= 0.0f) {
