f32 func_800C3FA0(s32, ? *, void *, void *);        /* extern */
? func_800F415C(Actor *, Vec3f *, ?);               /* extern */
? func_801A3F54(?);                                 /* extern */
void func_80B77770(ObjUm *arg0, GlobalContext *arg1); /* static */
? func_80B77FA4(ObjUm *arg0, GlobalContext *arg1);  /* static */
? func_80B781DC(ObjUm *arg0, Actor *arg1, Actor *arg2, GlobalContext *arg3); /* static */
? func_80B783E0(ObjUm *arg0, GlobalContext *arg1, s32 arg2, Actor *arg3); /* static */
? func_80B78764(ObjUm *arg0, GlobalContext *arg1, Actor *arg2, Actor *arg3); /* static */
? func_80B78A54(ObjUm *arg0, GlobalContext *arg1, s32 arg2, Actor *arg3, Actor *arg4); /* static */
? func_80B78C18(ObjUm *arg0, GlobalContext *arg1);  /* static */
? func_80B78D08(ObjUm *arg0, GlobalContext *arg1);  /* static */
? func_80B78DF0(ObjUm *arg0, GlobalContext *arg1);  /* static */
void func_80B78E38(ObjUm *arg0, GlobalContext *arg1); /* static */
void func_80B78E88(ObjUm *arg0, GlobalContext *arg1, s16 arg2); /* static */
void func_80B78EBC(ObjUm *arg0, GlobalContext *arg1); /* static */
void func_80B78EFC(ObjUm *arg0, GlobalContext *arg1, s16 arg2); /* static */
void func_80B79524(Actor *arg0);                    /* static */
void func_80B79560(GlobalContext *arg0, ObjUm *arg1, s32 arg2, u16 arg3); /* static */
s32 func_80B795A0(GlobalContext *arg0, Actor *arg1, s32 arg2); /* static */
s32 func_80B79734(GlobalContext *arg0, Actor *arg1, s32 arg2, s32 *); /* static */

? func_80B7984C(GlobalContext *arg0, Actor *arg1, s32 arg2, s32 *arg3); /* static */
s32 func_80B79A24(s32 arg0);                        /* static */
s32 func_80B79BA0(ObjUm *arg0, GlobalContext *arg1); /* static */
void func_80B79FFC(ObjUm *this, GlobalContext *globalCtx); /* static */
void func_80B7A1B4(ObjUm *arg0, ObjUm *arg1);       /* static */
void func_80B7A240(ObjUm *arg0, ObjUm *arg1);       /* static */
void func_80B7A860(ObjUm *arg0, GlobalContext *arg1); /* static */
void func_80B7AB78(ObjUm *arg0, ObjUm *arg1);       /* static */
void func_80B7AEFC(ObjUm *this, GlobalContext *globalCtx); /* static */
void func_80B7AF30(ObjUm *arg0, GlobalContext *arg1); /* static */
void func_80B7B154(ObjUm *arg0, GlobalContext *arg1); /* static */
void func_80B7B18C(ObjUm *arg0, GlobalContext *arg1, s32 arg2, ObjUm *); /* static */
s32 func_80B7B598(GlobalContext *arg0, s32 arg1, Gfx **arg2, Vec3f *arg3, Vec3s *arg4, Actor *arg5); /* static */
void func_80B7B93C(GlobalContext *arg0, Vec3f *arg1); /* static */
void func_80B7BABC(GlobalContext *arg0, s32 arg1, Gfx **arg2, Vec3s *arg3, Actor *arg4); /* static */
void func_80B7BEA4(f32 *arg0, s16 arg1, f32 *arg2, u8 arg3, GlobalContext *arg4); /* static */
extern CollisionHeader D_06007E20;
extern CollisionHeader D_06007F50;
extern FlexSkeletonHeader D_06011DF8;
extern AnimationHeader D_06012CC0;
static ? D_80B7C110;                                /* unable to generate initializer */
static ? D_80B7C128;                                /* unable to generate initializer */
static ColliderCylinderInit D_80B7C138 = {
    {3, 0, 9, 0, 0x10, 1},
    {1, {0, 0, 0}, {0x20, 0, 0}, 0, 1, 0},
    {0x28, 0x40, 0, {0, 0, 0}},
};
static ? D_80B7C164;                                /* unable to generate initializer */
static InitChainEntry D_80B7C254;                   /* unable to generate initializer */
static ? D_80B7C25C;                                /* unable to generate initializer */
static ? D_80B7C260;                                /* unable to generate initializer */
static ? D_80B7C274;                                /* unable to generate initializer */
static ? D_80B7C284;                                /* unable to generate initializer */
static ? D_80B7C290;                                /* unable to generate initializer */
static ? D_80B7C29C;                                /* unable to generate initializer */
static ? D_80B7C2A8;                                /* unable to generate initializer */
static ? D_80B7C2B4;                                /* unable to generate initializer */
static ? D_80B7C2CC;                                /* unable to generate initializer */
static ? D_80B7C2E4;                                /* unable to generate initializer */
static ? D_80B7C2FC;                                /* unable to generate initializer */
static ? D_80B7C308;                                /* unable to generate initializer */
static ? D_80B7C314;                                /* unable to generate initializer */

typedef struct ObjUm {
    /* 0x0000 */ Actor actor;
    /* 0x0144 */ s32 unk144;                        /* inferred */
    /* 0x0148 */ char pad148[0x14];                 /* maybe part of unk144[6]? */
    /* 0x015C */ void (*actionFunc)(ObjUm *, GlobalContext *);
    /* 0x0160 */ SkelAnime unk160;                  /* inferred */
    /* 0x01A4 */ Vec3s unk1A4;                      /* inferred */
    /* 0x01AA */ char pad1AA[0x7E];                 /* maybe part of unk1A4[22]? */
    /* 0x0228 */ Vec3s unk228;                      /* inferred */
    /* 0x022E */ char pad22E[0x7E];                 /* maybe part of unk228[22]? */
    /* 0x02AC */ s16 unk2AC;                        /* inferred */
    /* 0x02AE */ s16 unk2AE;                        /* inferred */
    /* 0x02B0 */ s16 unk2B0;                        /* inferred */
    /* 0x02B2 */ char pad2B2[0x2];                  /* maybe part of unk2B0[2]? */
    /* 0x02B4 */ s32 unk2B4;                        /* inferred */
    /* 0x02B8 */ Actor *unk2B8;                     /* inferred */
    /* 0x02BC */ s32 unk2BC;                        /* inferred */
    /* 0x02C0 */ s32 unk2C0;                        /* inferred */
    /* 0x02C4 */ f32 unk2C4;                        /* inferred */
    /* 0x02C8 */ f32 unk2C8;                        /* inferred */
    /* 0x02CC */ f32 unk2CC;                        /* inferred */
    /* 0x02D0 */ f32 unk2D0;                        /* inferred */
    /* 0x02D4 */ f32 unk2D4;                        /* inferred */
    /* 0x02D8 */ f32 unk2D8;                        /* inferred */
    /* 0x02DC */ f32 unk2DC;                        /* inferred */
    /* 0x02E0 */ f32 unk2E0;                        /* inferred */
    /* 0x02E4 */ f32 unk2E4;                        /* inferred */
    /* 0x02E8 */ f32 unk2E8;                        /* inferred */
    /* 0x02EC */ f32 unk2EC;                        /* inferred */
    /* 0x02F0 */ f32 unk2F0;                        /* inferred */
    /* 0x02F4 */ s32 unk2F4;                        /* inferred */
    /* 0x02F8 */ ? unk2F8;                          /* inferred */
    /* 0x02F9 */ char pad2F9[0x3];
    /* 0x02FC */ u16 unk2FC;                        /* inferred */
    /* 0x02FE */ ? unk2FE;                          /* inferred */
    /* 0x02FF */ char pad2FF[0x3];
    /* 0x0302 */ u16 unk302;                        /* inferred */
    /* 0x0304 */ s32 unk304;                        /* inferred */
    /* 0x0308 */ f32 unk308;                        /* inferred */
    /* 0x030C */ f32 unk30C;                        /* inferred */
    /* 0x0310 */ f32 unk310;                        /* inferred */
    /* 0x0314 */ s32 unk314;                        /* inferred */
    /* 0x0318 */ s32 unk318;                        /* inferred */
    /* 0x031C */ s32 unk31C;                        /* inferred */
    /* 0x0320 */ s32 unk320;                        /* inferred */
    /* 0x0324 */ char pad324[0x8];                  /* maybe part of unk320[3]? */
    /* 0x032C */ f32 unk32C;                        /* inferred */
    /* 0x0330 */ char pad330[0x20];                 /* maybe part of unk32C[9]? */
    /* 0x0350 */ s32 unk350;                        /* inferred */
    /* 0x0354 */ s32 unk354;                        /* inferred */
    /* 0x0358 */ Actor *unk358;                     /* inferred */
    /* 0x035C */ Actor *unk35C;                     /* inferred */
    /* 0x0360 */ f32 unk360;                        /* inferred */
    /* 0x0364 */ char pad364[0x4];                  /* maybe part of unk360[2]? */
    /* 0x0368 */ f32 unk368;                        /* inferred */
    /* 0x036C */ f32 unk36C;                        /* inferred */
    /* 0x0370 */ char pad370[0x4];                  /* maybe part of unk36C[2]? */
    /* 0x0374 */ f32 unk374;                        /* inferred */
    /* 0x0378 */ f32 unk378;                        /* inferred */
    /* 0x037C */ char pad37C[0x4];                  /* maybe part of unk378[2]? */
    /* 0x0380 */ f32 unk380;                        /* inferred */
    /* 0x0384 */ f32 unk384;                        /* inferred */
    /* 0x0388 */ char pad388[0x4];                  /* maybe part of unk384[2]? */
    /* 0x038C */ f32 unk38C;                        /* inferred */
    /* 0x0390 */ f32 unk390;                        /* inferred */
    /* 0x0394 */ char pad394[0x4];                  /* maybe part of unk390[2]? */
    /* 0x0398 */ f32 unk398;                        /* inferred */
    /* 0x039C */ f32 unk39C;                        /* inferred */
    /* 0x03A0 */ char pad3A0[0x4];                  /* maybe part of unk39C[2]? */
    /* 0x03A4 */ f32 unk3A4;                        /* inferred */
    /* 0x03A8 */ f32 unk3A8;                        /* inferred */
    /* 0x03AC */ f32 unk3AC;                        /* inferred */
    /* 0x03B0 */ f32 unk3B0;                        /* inferred */
    /* 0x03B4 */ f32 unk3B4;                        /* inferred */
    /* 0x03B8 */ char pad3B8[0x4];                  /* maybe part of unk3B4[2]? */
    /* 0x03BC */ f32 unk3BC;                        /* inferred */
    /* 0x03C0 */ f32 unk3C0;                        /* inferred */
    /* 0x03C4 */ char pad3C4[0x4];                  /* maybe part of unk3C0[2]? */
    /* 0x03C8 */ f32 unk3C8;                        /* inferred */
    /* 0x03CC */ f32 unk3CC;                        /* inferred */
    /* 0x03D0 */ f32 unk3D0;                        /* inferred */
    /* 0x03D4 */ f32 unk3D4;                        /* inferred */
    /* 0x03D8 */ f32 unk3D8;                        /* inferred */
    /* 0x03DC */ char pad3DC[0x4];                  /* maybe part of unk3D8[2]? */
    /* 0x03E0 */ f32 unk3E0;                        /* inferred */
    /* 0x03E4 */ f32 unk3E4;                        /* inferred */
    /* 0x03E8 */ char pad3E8[0x4];                  /* maybe part of unk3E4[2]? */
    /* 0x03EC */ f32 unk3EC;                        /* inferred */
    /* 0x03F0 */ f32 unk3F0;                        /* inferred */
    /* 0x03F4 */ char pad3F4[0x4];                  /* maybe part of unk3F0[2]? */
    /* 0x03F8 */ f32 unk3F8;                        /* inferred */
    /* 0x03FC */ char pad3FC[0x18];                 /* maybe part of unk3F8[7]? */
    /* 0x0414 */ f32 unk414;                        /* inferred */
    /* 0x0418 */ f32 unk418;                        /* inferred */
    /* 0x041C */ f32 unk41C;                        /* inferred */
    /* 0x0420 */ s32 unk420;                        /* inferred */
    /* 0x0424 */ ColliderCylinder unk424;           /* inferred */
    /* 0x0470 */ ColliderCylinder unk470;           /* inferred */
    /* 0x04BC */ f32 unk4BC;                        /* inferred */
    /* 0x04C0 */ f32 unk4C0;                        /* inferred */
    /* 0x04C4 */ f32 unk4C4;                        /* inferred */
    /* 0x04C8 */ u16 unk4C8;                        /* inferred */
    /* 0x04CA */ char pad4CA[0x2];                  /* maybe part of unk4C8[2]? */
    /* 0x04CC */ u32 unk4CC;                        /* inferred */
    /* 0x04D0 */ s32 unk4D0;                        /* inferred */
    /* 0x04D4 */ u32 unk4D4;                        /* inferred */
    /* 0x04D8 */ s32 unk4D8;                        /* inferred */
    /* 0x04DC */ s32 unk4DC;                        /* inferred */
    /* 0x04E0 */ s32 unk4E0;                        /* inferred */
} ObjUm;                                            /* size 0x4E4 */

void func_80B77770(ObjUm *arg0, GlobalContext *arg1) {
    ? sp108;
    ? spFC;
    ? spF0;
    ? spE4;
    ? spD8;
    ? spCC;
    ? spC0;
    ? spB4;
    ? spA8;
    ? sp9C;
    ? sp90;
    ? sp84;
    ? sp78;
    ? sp6C;
    ? sp60;
    void *sp58;
    void *sp54;
    void *sp50;
    void *sp4C;
    Vec3f *sp48;
    Vec3f *sp44;
    Vec3f *sp40;
    Vec3f *sp3C;
    Vec3f *sp38;
    void *sp34;
    Vec3f *sp30;
    Vec3f *sp2C;
    Vec3f *sp28;
    s32 sp24;
    s32 sp20;
    Vec3f *temp_t6_3;
    Vec3f *temp_t6_4;
    Vec3f *temp_t6_5;
    Vec3f *temp_t7;
    Vec3f *temp_t8_3;
    Vec3f *temp_t8_4;
    Vec3f *temp_t8_5;
    Vec3f *temp_t9;
    s16 temp_a0;
    s16 temp_a0_2;
    s16 temp_s1;
    void *temp_t6;
    void *temp_t6_2;
    void *temp_t8;
    void *temp_t8_2;
    void *temp_t8_6;

    temp_s1 = arg0->actor.shape.rot.y;
