typedef struct ObjUm {
    /* 0x000 */ Actor actor;
    /* 0x144 */ s32 unk144;                         /* inferred */
    /* 0x148 */ char pad148[0x14];                  /* maybe part of unk144[6]? */
    /* 0x15C */ void (*actionFunc)(ObjUm *, GlobalContext *);
    /* 0x160 */ SkelAnime unk160;                   /* inferred */
    /* 0x1A4 */ Vec3s unk1A4;                       /* inferred */
    /* 0x1AA */ char pad1AA[0x7E];                  /* maybe part of unk1A4[22]? */
    /* 0x228 */ Vec3s unk228;                       /* inferred */
    /* 0x22E */ char pad22E[0x7E];                  /* maybe part of unk228[22]? */
    /* 0x2AC */ s16 unk2AC;                         /* inferred */
    /* 0x2AE */ s16 unk2AE;                         /* inferred */
    /* 0x2B0 */ s16 unk2B0;                         /* inferred */
    /* 0x2B2 */ char pad2B2[0x2];
    /* 0x2B4 */ s32 unk2B4;                         /* inferred */
    /* 0x2B8 */ Actor *unk2B8;                      /* inferred */
    /* 0x2BC */ s32 unk2BC;                         /* inferred */
    /* 0x2C0 */ char pad2C0[0x4];
    /* 0x2C4 */ f32 unk2C4;                         /* inferred */
    /* 0x2C8 */ f32 unk2C8;                         /* inferred */
    /* 0x2CC */ f32 unk2CC;                         /* inferred */
    /* 0x2D0 */ char pad2D0[0xC];                   /* maybe part of unk2CC[4]? */
    /* 0x2DC */ f32 unk2DC;                         /* inferred */
    /* 0x2E0 */ f32 unk2E0;                         /* inferred */
    /* 0x2E4 */ f32 unk2E4;                         /* inferred */
    /* 0x2E8 */ char pad2E8[0xC];                   /* maybe part of unk2E4[4]? */
    /* 0x2F4 */ s32 unk2F4;                         /* inferred */
    /* 0x2F8 */ ? unk2F8;                           /* inferred */
    /* 0x2F8 */ char pad2F8[0x4];
    /* 0x2FC */ u16 unk2FC;                         /* inferred */
    /* 0x2FE */ ? unk2FE;                           /* inferred */
    /* 0x2FE */ char pad2FE[0x4];
    /* 0x302 */ u16 unk302;                         /* inferred */
    /* 0x304 */ char pad304[0x4];                   /* maybe part of unk302[3]? */
    /* 0x308 */ f32 unk308;                         /* inferred */
    /* 0x30C */ f32 unk30C;                         /* inferred */
    /* 0x310 */ f32 unk310;                         /* inferred */
    /* 0x314 */ char pad314[0x18];                  /* maybe part of unk310[7]? */
    /* 0x32C */ f32 unk32C;                         /* inferred */
    /* 0x330 */ char pad330[0x20];                  /* maybe part of unk32C[9]? */
    /* 0x350 */ s32 unk350;                         /* inferred */
    /* 0x354 */ s32 unk354;                         /* inferred */
    /* 0x358 */ char pad358[0xC8];                  /* maybe part of unk354[51]? */
    /* 0x420 */ s32 unk420;                         /* inferred */
    /* 0x424 */ ColliderCylinder unk424;            /* inferred */
    /* 0x470 */ ColliderCylinder unk470;            /* inferred */
    /* 0x4BC */ f32 unk4BC;                         /* inferred */
    /* 0x4C0 */ f32 unk4C0;                         /* inferred */
    /* 0x4C4 */ f32 unk4C4;                         /* inferred */
    /* 0x4C8 */ u16 unk4C8;                         /* inferred */
    /* 0x4CA */ char pad4CA[0x2];
    /* 0x4CC */ u32 unk4CC;                         /* inferred */
    /* 0x4D0 */ s32 unk4D0;                         /* inferred */
    /* 0x4D4 */ u32 unk4D4;                         /* inferred */
    /* 0x4D8 */ s32 unk4D8;                         /* inferred */
    /* 0x4DC */ s32 unk4DC;                         /* inferred */
    /* 0x4E0 */ s32 unk4E0;                         /* inferred */
} ObjUm;                                            /* size = 0x4E4 */

struct _mips2c_stack_ObjUm_Destroy {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_ObjUm_Draw {
    /* 0x00 */ char pad0[0x34];
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ f32 sp3C;                            /* inferred */
    /* 0x40 */ char pad40[0x8];
};                                                  /* size = 0x48 */

struct _mips2c_stack_ObjUm_Init {
    /* 0x00 */ char pad0[0x44];
    /* 0x44 */ SkelAnime *sp44;                     /* inferred */
    /* 0x48 */ ? sp48;                              /* inferred */
    /* 0x48 */ char pad48[0xC];
    /* 0x54 */ s32 sp54;                            /* inferred */
    /* 0x58 */ char pad58[0x8];
};                                                  /* size = 0x60 */

struct _mips2c_stack_ObjUm_SetupAction {};          /* size 0x0 */

struct _mips2c_stack_ObjUm_Update {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80B77770 {
    /* 0x000 */ char pad0[0x20];
    /* 0x020 */ s32 sp20;                           /* inferred */
    /* 0x024 */ s32 sp24;                           /* inferred */
    /* 0x028 */ Vec3f *sp28;                        /* inferred */
    /* 0x02C */ Vec3f *sp2C;                        /* inferred */
    /* 0x030 */ Vec3f *sp30;                        /* inferred */
    /* 0x034 */ void *sp34;                         /* inferred */
    /* 0x038 */ Vec3f *sp38;                        /* inferred */
    /* 0x03C */ Vec3f *sp3C;                        /* inferred */
    /* 0x040 */ Vec3f *sp40;                        /* inferred */
    /* 0x044 */ Vec3f *sp44;                        /* inferred */
    /* 0x048 */ Vec3f *sp48;                        /* inferred */
    /* 0x04C */ void *sp4C;                         /* inferred */
    /* 0x050 */ void *sp50;                         /* inferred */
    /* 0x054 */ void *sp54;                         /* inferred */
    /* 0x058 */ void *sp58;                         /* inferred */
    /* 0x05C */ char pad5C[0x4];
    /* 0x060 */ ? sp60;                             /* inferred */
    /* 0x060 */ char pad60[0xC];
    /* 0x06C */ ? sp6C;                             /* inferred */
    /* 0x06C */ char pad6C[0xC];
    /* 0x078 */ ? sp78;                             /* inferred */
    /* 0x078 */ char pad78[0xC];
    /* 0x084 */ ? sp84;                             /* inferred */
    /* 0x084 */ char pad84[0xC];
    /* 0x090 */ ? sp90;                             /* inferred */
    /* 0x090 */ char pad90[0xC];
    /* 0x09C */ ? sp9C;                             /* inferred */
    /* 0x09C */ char pad9C[0xC];
    /* 0x0A8 */ ? spA8;                             /* inferred */
    /* 0x0A8 */ char padA8[0xC];
    /* 0x0B4 */ ? spB4;                             /* inferred */
    /* 0x0B4 */ char padB4[0xC];
    /* 0x0C0 */ ? spC0;                             /* inferred */
    /* 0x0C0 */ char padC0[0xC];
    /* 0x0CC */ ? spCC;                             /* inferred */
    /* 0x0CC */ char padCC[0xC];
    /* 0x0D8 */ ? spD8;                             /* inferred */
    /* 0x0D8 */ char padD8[0xC];
    /* 0x0E4 */ ? spE4;                             /* inferred */
    /* 0x0E4 */ char padE4[0xC];
    /* 0x0F0 */ ? spF0;                             /* inferred */
    /* 0x0F0 */ char padF0[0xC];
    /* 0x0FC */ ? spFC;                             /* inferred */
    /* 0x0FC */ char padFC[0xC];
    /* 0x108 */ ? sp108;                            /* inferred */
    /* 0x108 */ char pad108[0x10];
};                                                  /* size = 0x118 */

struct _mips2c_stack_func_80B77FA4 {
    /* 0x00 */ char pad0[0x38];
    /* 0x38 */ ActorContext *sp38;                  /* inferred */
    /* 0x3C */ char pad3C[0x8];                     /* maybe part of sp38[3]? */
    /* 0x44 */ void *sp44;                          /* inferred */
    /* 0x48 */ char pad48[0x8];
};                                                  /* size = 0x50 */

struct _mips2c_stack_func_80B781DC {
    /* 0x00 */ char pad0[0x58];
};                                                  /* size = 0x58 */

struct _mips2c_stack_func_80B783E0 {
    /* 0x00 */ char pad0[0x30];
    /* 0x30 */ Vec3f *sp30;                         /* inferred */
    /* 0x34 */ char pad34[0x8];                     /* maybe part of sp30[3]? */
    /* 0x3C */ f32 sp3C;                            /* inferred */
    /* 0x40 */ char pad40[0x4];
    /* 0x44 */ f32 sp44;                            /* inferred */
    /* 0x48 */ f32 sp48;                            /* inferred */
    /* 0x4C */ f32 sp4C;                            /* inferred */
    /* 0x50 */ ? sp50;                              /* inferred */
    /* 0x50 */ char pad50[0x14];
    /* 0x64 */ void *sp64;                          /* inferred */
    /* 0x68 */ s32 sp68;                            /* inferred */
    /* 0x6C */ u8 *sp6C;                            /* inferred */
};                                                  /* size = 0x70 */

struct _mips2c_stack_func_80B78764 {
    /* 0x00 */ char pad0[0x20];
    /* 0x20 */ Vec3f *sp20;                         /* inferred */
    /* 0x24 */ Vec3f *sp24;                         /* inferred */
    /* 0x28 */ s32 sp28;                            /* inferred */
    /* 0x2C */ char pad2C[0x4];
    /* 0x30 */ ? sp30;                              /* inferred */
    /* 0x30 */ char pad30[0x10];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80B78A54 {
    /* 0x00 */ char pad0[0x2C];
    /* 0x2C */ Vec3f *sp2C;                         /* inferred */
    /* 0x30 */ void *sp30;                          /* inferred */
    /* 0x34 */ char pad34[0x2];
    /* 0x36 */ s16 sp36;                            /* inferred */
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80B78C18 {
    /* 0x00 */ char pad0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80B78D08 {
    /* 0x00 */ char pad0[0x18];
    /* 0x18 */ CollisionCheckContext *sp18;         /* inferred */
    /* 0x1C */ char pad1C[0xC];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80B78DF0 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B78E38 {};              /* size 0x0 */

struct _mips2c_stack_func_80B78E88 {};              /* size 0x0 */

struct _mips2c_stack_func_80B78EBC {};              /* size 0x0 */

struct _mips2c_stack_func_80B78EFC {};              /* size 0x0 */

struct _mips2c_stack_func_80B79524 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B79560 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B795A0 {
    /* 0x00 */ char pad0[0x1C];
    /* 0x1C */ void *sp1C;                          /* inferred */
    /* 0x20 */ char pad20[0x4];
    /* 0x24 */ s32 sp24;                            /* inferred */
    /* 0x28 */ char pad28[0x8];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80B79734 {
    /* 0x00 */ char pad0[0x18];
    /* 0x18 */ MessageContext *sp18;                /* inferred */
    /* 0x1C */ char pad1C[0x4];
    /* 0x20 */ s32 sp20;                            /* inferred */
    /* 0x24 */ char pad24[0x4];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80B797EC {};              /* size 0x0 */

struct _mips2c_stack_func_80B7984C {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80B79A24 {};              /* size 0x0 */

struct _mips2c_stack_func_80B79A50 {
    /* 0x00 */ char pad0[0x24];
    /* 0x24 */ Actor *sp24;                         /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80B79BA0 {
    /* 0x00 */ char pad0[0x3C];
    /* 0x3C */ s32 sp3C;                            /* inferred */
    /* 0x40 */ char pad40[0x4];
    /* 0x44 */ f32 sp44;                            /* inferred */
    /* 0x48 */ f32 sp48;                            /* inferred */
    /* 0x4C */ f32 sp4C;                            /* inferred */
    /* 0x50 */ ? sp50;                              /* inferred */
    /* 0x50 */ char pad50[0x14];
    /* 0x64 */ void *sp64;                          /* inferred */
    /* 0x68 */ s32 sp68;                            /* inferred */
    /* 0x6C */ void *sp6C;                          /* inferred */
};                                                  /* size = 0x70 */

struct _mips2c_stack_func_80B79F10 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80B79FFC {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80B7A070 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B7A0E0 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B7A144 {
    /* 0x00 */ char pad0[0x1C];
    /* 0x1C */ Actor *sp1C;                         /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80B7A1B4 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B7A240 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B7A2AC {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80B7A394 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B7A400 {
    /* 0x00 */ char pad0[0x24];
    /* 0x24 */ Actor *sp24;                         /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80B7A494 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80B7A614 {
    /* 0x00 */ char pad0[0x20];
    /* 0x20 */ s32 sp20;                            /* inferred */
    /* 0x24 */ char pad24[0xC];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80B7A7AC {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80B7A860 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80B7AB78 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B7ABE4 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80B7AC94 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80B7AD34 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80B7AE58 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80B7AEFC {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B7AF30 {
    /* 0x00 */ char pad0[0x24];
    /* 0x24 */ s32 sp24;                            /* inferred */
    /* 0x28 */ void *sp28;                          /* inferred */
    /* 0x2C */ char pad2C[0x4];
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ char pad3C[0x8];                     /* maybe part of sp38[3]? */
    /* 0x44 */ ? sp44;                              /* inferred */
    /* 0x44 */ char pad44[0x4];
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_80B7B154 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B7B18C {
    /* 0x00 */ char pad0[0x24];
    /* 0x24 */ SkelAnime *sp24;                     /* inferred */
    /* 0x28 */ char pad28[0xC];                     /* maybe part of sp24[4]? */
    /* 0x34 */ s32 sp34;                            /* inferred */
    /* 0x38 */ char pad38[0x4];
    /* 0x3C */ s32 sp3C;                            /* inferred */
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80B7B598 {
    /* 0x00 */ char pad0[0x30];
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ char pad3C[0x2];
    /* 0x3E */ s16 sp3E;                            /* inferred */
    /* 0x40 */ s32 *sp40;                           /* inferred */
    /* 0x44 */ s32 *sp44;                           /* inferred */
    /* 0x48 */ char pad48[0x4];
    /* 0x4C */ void *sp4C;                          /* inferred */
    /* 0x50 */ ? sp50;                              /* inferred */
    /* 0x50 */ char pad50[0xC];
    /* 0x5C */ ? sp5C;                              /* inferred */
    /* 0x5C */ char pad5C[0x14];
    /* 0x70 */ void *sp70;                          /* inferred */
    /* 0x74 */ char pad74[0x4];
};                                                  /* size = 0x78 */

struct _mips2c_stack_func_80B7B93C {
    /* 0x00 */ char pad0[0x70];
    /* 0x70 */ f32 sp70;                            /* inferred */
    /* 0x74 */ f32 sp74;                            /* inferred */
    /* 0x78 */ f32 sp78;                            /* inferred */
    /* 0x7C */ char pad7C[0x4];
    /* 0x80 */ ? sp80;                              /* inferred */
    /* 0x80 */ char pad80[0xC];
    /* 0x8C */ ? sp8C;                              /* inferred */
    /* 0x8C */ char pad8C[0xC];
};                                                  /* size = 0x98 */

struct _mips2c_stack_func_80B7BABC {
    /* 0x000 */ char pad0[0x4C];
    /* 0x04C */ MtxF *sp4C;                         /* inferred */
    /* 0x050 */ char pad50[0x20];                   /* maybe part of sp4C[9]? */
    /* 0x070 */ f32 sp70;                           /* inferred */
    /* 0x074 */ char pad74[0xC];                    /* maybe part of sp70[4]? */
    /* 0x080 */ s16 sp80;                           /* inferred */
    /* 0x082 */ s16 sp82;                           /* inferred */
    /* 0x084 */ s16 sp84;                           /* inferred */
    /* 0x086 */ char pad86[0x2];
    /* 0x088 */ f32 sp88;                           /* inferred */
    /* 0x08C */ f32 sp8C;                           /* inferred */
    /* 0x090 */ f32 sp90;                           /* inferred */
    /* 0x094 */ char pad94[0x4];
    /* 0x098 */ ? sp98;                             /* inferred */
    /* 0x098 */ char pad98[0xC];
    /* 0x0A4 */ ? spA4;                             /* inferred */
    /* 0x0A4 */ char padA4[0xC];
    /* 0x0B0 */ f32 spB0;                           /* inferred */
    /* 0x0B4 */ ? spB4;                             /* inferred */
    /* 0x0B4 */ char padB4[0xC];
    /* 0x0C0 */ ? spC0;                             /* inferred */
    /* 0x0C0 */ char padC0[0x4];
    /* 0x0C4 */ f32 spC4;                           /* inferred */
    /* 0x0C8 */ char padC8[0x4];
    /* 0x0CC */ ? spCC;                             /* inferred */
    /* 0x0CC */ char padCC[0x18];
    /* 0x0E4 */ ? spE4;                             /* inferred */
    /* 0x0E4 */ char padE4[0x18];
    /* 0x0FC */ ? spFC;                             /* inferred */
    /* 0x0FC */ char padFC[0x24];
};                                                  /* size = 0x120 */

struct _mips2c_stack_func_80B7BEA4 {
    /* 0x000 */ char pad0[0x40];
    /* 0x040 */ ? sp40;                             /* inferred */
    /* 0x040 */ char pad40[0x40];
    /* 0x080 */ ? sp80;                             /* inferred */
    /* 0x080 */ char pad80[0x40];
    /* 0x0C0 */ ? spC0;                             /* inferred */
    /* 0x0C0 */ char padC0[0x40];
    /* 0x100 */ Mtx *sp100;                         /* inferred */
    /* 0x104 */ s32 sp104;                          /* inferred */
    /* 0x108 */ f32 sp108;                          /* inferred */
    /* 0x10C */ f32 sp10C;                          /* inferred */
    /* 0x110 */ f32 sp110;                          /* inferred */
    /* 0x114 */ char pad114[0x4];
};                                                  /* size = 0x118 */

f32 func_800C3FA0(s32, ? *, void *, void *);        /* extern */
? func_800F415C(void *, ? *, ?);                    /* extern */
? func_801A3F54(?);                                 /* extern */
void func_80B77770(ObjUm *arg0, GlobalContext *arg1); /* static */
? func_80B77FA4(ObjUm *arg0, GlobalContext *arg1);  /* static */
? func_80B781DC(ObjUm *arg0, void *arg1, void *arg2, GlobalContext *arg3); /* static */
? func_80B783E0(ObjUm *arg0, GlobalContext *arg1, s32 arg2, void *arg3); /* static */
? func_80B78764(ObjUm *arg0, GlobalContext *arg1, void *arg2, void *arg3); /* static */
? func_80B78A54(ObjUm *arg0, GlobalContext *arg1, s32 arg2, void *arg3, void *arg4); /* static */
? func_80B78C18(ObjUm *arg0, GlobalContext *arg1);  /* static */
? func_80B78D08(ObjUm *arg0, GlobalContext *arg1);  /* static */
? func_80B78DF0(ObjUm *arg0, GlobalContext *arg1);  /* static */
