s32 func_800B8718(Actor *, GlobalContext *);        /* extern */
? func_800B874C(Actor *, GlobalContext *, ?, ?);    /* extern */
void func_80AB4D10(EnMnk *arg0, s16 arg1, u8 arg2, f32 arg3); /* static */
void func_80AB4E34(Actor *, ?, GlobalContext *);    /* static */
void func_80AB4E58(Actor *arg0, s32 arg1);          /* static */
void func_80AB4E88(Actor *arg0, s32 arg1, u8 arg2, f32 arg3); /* static */
void func_80AB4F68(Actor *, ?, Actor *);            /* static */
void func_80AB4F8C(Actor *arg0, s16 arg1, u8 arg2, f32 arg3); /* static */
void func_80AB50B0(EnMnk *, ?, SaveContext *);      /* static */
void func_80AB50D4(EnMnk *arg0, GlobalContext *arg1, SaveContext *); /* static */
void func_80AB5148(Actor *arg0, GlobalContext *arg1, SaveContext *); /* static */
void func_80AB51C8(EnMnk *arg0, GlobalContext *arg1, SaveContext *); /* static */
void func_80AB52E8(Actor *arg0, GlobalContext *arg1, SaveContext *); /* static */
s32 func_80AB5A64(EnMnk *arg0, GlobalContext *arg1, SaveContext *); /* static */
void func_80AB5B38(GlobalContext *arg0, Actor *arg1); /* static */
void func_80AB5B84(Actor *arg0);                    /* static */
void func_80AB5BCC(Actor *arg0);                    /* static */
void func_80AB5C14(Actor *arg0, GlobalContext *arg1); /* static */
void func_80AB5C74(EnMnk *arg0, GlobalContext *arg1); /* static */
s32 func_80AB5CD8(Actor *arg0, u16 arg1);           /* static */
void func_80AB5F6C(Actor *arg0);                    /* static */

void func_80AB8878(Actor *arg0, GlobalContext *arg1); /* static */
void func_80AB8968(Actor *arg0, ? arg1);            /* static */
void func_80AB89F8(Actor *arg0, ? arg1);            /* static */
void func_80AB8A74(Actor *arg0, GlobalContext *arg1); /* static */
void func_80AB8B18(Actor *arg0, GlobalContext *arg1); /* static */
void func_80AB8BD4(Actor *arg0, void *arg1);        /* static */
void func_80AB8C60(Actor *arg0, GlobalContext *arg1); /* static */
void func_80AB8CFC(EnMnk *arg0);                    /* static */
void func_80AB8E4C(EnMnk *arg0, GlobalContext *arg1); /* static */
void func_80AB8EF4(EnMnk *arg0, GlobalContext *arg1); /* static */
void func_80AB8FD8(EnMnk *arg0, GlobalContext *arg1); /* static */
void func_80AB9084(EnMnk *arg0, GlobalContext *arg1); /* static */
void func_80AB92CC(EnMnk *arg0, GlobalContext *arg1); /* static */
void func_80AB94E4(EnMnk *arg0, GlobalContext *arg1); /* static */
s32 func_80AB96A0(GlobalContext *arg0, s32 arg1, Gfx **arg2, Vec3f *arg3, Vec3s *arg4, Actor *arg5); /* static */
s32 func_80AB96E8(GlobalContext *arg0, s32 arg1, Gfx **arg2, Vec3f *arg3, Vec3s *arg4, Actor *arg5); /* static */
s32 func_80AB9708(GlobalContext *arg0, s32 arg1, Gfx **arg2, Vec3f *arg3, Vec3s *arg4, Actor *arg5); /* static */
void func_80AB973C(GlobalContext *arg0, s32 arg1, Gfx **arg2, Vec3s *arg3, Actor *arg4); /* static */
void func_80AB977C(GlobalContext *arg0, s32 arg1, Gfx **arg2, Vec3s *arg3, Actor *arg4); /* static */
void func_80AB97B4(GraphicsContext **arg0, s32 arg1, u32 *arg2, Vec3s *arg3, Actor *arg4); /* static */
void func_80AB99D4(EnMnk *arg0, GraphicsContext **arg1); /* static */
void func_80AB9BAC(Actor *arg0, GlobalContext *arg1); /* static */
void func_80AB9C4C(Actor *arg0, GlobalContext *arg1); /* static */
extern AnimationHeader D_06003584;
extern FlexSkeletonHeader D_06005150;
extern AnimationHeader D_060082C8;
extern AnimationHeader D_06008814;
extern AnimationHeader D_06009CC0;
extern AnimationHeader D_060105DC;
extern FlexSkeletonHeader D_06019B88;
extern FlexSkeletonHeader D_0601D518;
static ColliderCylinderInit D_80AB9D10 = {
    {0xA, 0, 9, 0x39, 0x10, 1},
    {0, {0, 0, 0}, {0x1000200, 0, 0}, 0, 1, 1},
    {0xF, 0x1E, 0, {0, 0, 0}},
};
static ? D_80AB9D3C;                                /* unable to generate initializer */
static ? D_80AB9D60;                                /* unable to generate initializer */
static ? D_80AB9D84;                                /* unable to generate initializer */
static ? D_80AB9D90;                                /* unable to generate initializer */
static ? D_80AB9D9C;                                /* unable to generate initializer */
static ? D_80AB9DD8;                                /* unable to generate initializer */
static Color_RGBA8 D_80AB9DF4 = {0xFF, 0xFF, 0x9B, 0xFF};
static Color_RGBA8 D_80AB9DF8 = {0xFF, 0x64, 0, 0xFF};
static Vec3f D_80AB9DFC = {300.0f, 400.0f, 0.0f};
static ? D_80AB9E08;                                /* unable to generate initializer */

typedef struct EnMnk {
    /* 0x0000 */ Actor actor;
    /* 0x0144 */ void (*unk144)(GlobalContext *, Actor *); /* inferred */
    /* 0x0148 */ SkelAnime unk148;                  /* inferred */
    /* 0x018C */ Vec3s unk18C;                      /* inferred */
    /* 0x0192 */ char pad192[0x84];                 /* maybe part of unk18C[23]? */
    /* 0x0216 */ Vec3s unk216;                      /* inferred */
    /* 0x021C */ char pad21C[0x104];
    /* 0x0320 */ SkelAnime unk320;                  /* inferred */
    /* 0x0364 */ char pad364[0x48];
    /* 0x03AC */ s32 unk3AC;                        /* inferred */
    /* 0x03B0 */ s16 unk3B0;                        /* inferred */
    /* 0x03B2 */ char pad3B2[0x2];                  /* maybe part of unk3B0[2]? */
    /* 0x03B4 */ s16 unk3B4;                        /* inferred */
    /* 0x03B6 */ char pad3B6[0x6];                  /* maybe part of unk3B4[4]? */
    /* 0x03BC */ s16 unk3BC;                        /* inferred */
    /* 0x03BE */ s16 unk3BE;                        /* inferred */
    /* 0x03C0 */ s32 unk3C0;                        /* inferred */
    /* 0x03C4 */ s32 unk3C4;                        /* inferred */
    /* 0x03C8 */ s32 unk3C8;                        /* inferred */
    /* 0x03CC */ s16 unk3CC;                        /* inferred */
    /* 0x03CE */ s16 unk3CE;                        /* inferred */
    /* 0x03D0 */ s16 unk3D0;                        /* inferred */
    /* 0x03D2 */ char pad3D2[0x2];                  /* maybe part of unk3D0[2]? */
    /* 0x03D4 */ s32 unk3D4;                        /* inferred */
    /* 0x03D8 */ f32 unk3D8;                        /* inferred */
    /* 0x03DC */ s16 unk3DC;                        /* inferred */
    /* 0x03DE */ s16 unk3DE;                        /* inferred */
    /* 0x03E0 */ s32 unk3E0;                        /* inferred */
    /* 0x03E4 */ u16 unk3E4;                        /* inferred */
    /* 0x03E6 */ char pad3E6[0x2];                  /* maybe part of unk3E4[2]? */
    /* 0x03E8 */ void (*actionFunc)(EnMnk *, GlobalContext *);
} EnMnk;                                            /* size 0x3EC */

void func_80AB4D10(EnMnk *arg0, s16 arg1, u8 arg2, f32 arg3) {
    s32 sp34;
    AnimationHeaderCommon **sp30;
    AnimationHeaderCommon **temp_v1;
    AnimationHeaderCommon **temp_v1_2;
    s32 temp_v0;

    temp_v0 = arg1 * 4;
    temp_v1 = temp_v0 + &D_80AB9D3C;
    sp30 = temp_v1;
    sp34 = temp_v0;
    SkelAnime_ChangeAnim(arg0 + 0x148, (AnimationHeader *) *temp_v1, 1.0f, 0.0f, (f32) SkelAnime_GetFrameCount(*temp_v1), (u8) (s32) arg2, arg3);
    temp_v1_2 = sp34 + &D_80AB9D60;
    sp30 = temp_v1_2;
    SkelAnime_ChangeAnim(arg0 + 0x2A0, (AnimationHeader *) *temp_v1_2, 1.0f, 0.0f, (f32) SkelAnime_GetFrameCount(*temp_v1_2), (u8) (s32) arg2, arg3);
    if (arg1 != 0) {
        if (arg1 != 3) {
            if (arg1 != 6) {
                if (arg1 != 8) {
