CRASHED

typedef struct EnFishing {
    /* 0x000 */ Actor actor;
    /* 0x144 */ char pad_144[0x4];
    /* 0x148 */ u8 unk_148;                         /* inferred */
    /* 0x149 */ u8 unk_149;                         /* inferred */
    /* 0x14A */ u8 unk_14A;                         /* inferred */
    /* 0x14B */ char pad_14B[0x1];
    /* 0x14C */ s16 unk_14C;                        /* inferred */
    /* 0x14E */ u8 unk_14E;                         /* inferred */
    /* 0x14F */ char pad_14F[0x1];
    /* 0x150 */ s16 unk_150;                        /* inferred */
    /* 0x152 */ s16 unk_152;                        /* inferred */
    /* 0x154 */ s16 unk_154;                        /* inferred */
    /* 0x156 */ s16 unk_156;                        /* inferred */
    /* 0x158 */ s16 unk_158;                        /* inferred */
    /* 0x15A */ s16 unk_15A;                        /* inferred */
    /* 0x15C */ s16 unk_15C;                        /* inferred */
    /* 0x15E */ s16 unk_15E;                        /* inferred */
    /* 0x160 */ s16 unk_160;                        /* inferred */
    /* 0x162 */ s16 unk_162;                        /* inferred */
    /* 0x164 */ s16 unk_164;                        /* inferred */
    /* 0x166 */ s16 unk_166;                        /* inferred */
    /* 0x168 */ s16 unk_168;                        /* inferred */
    /* 0x16A */ s16 unk_16A;                        /* inferred */
    /* 0x16C */ s16 unk_16C;                        /* inferred */
    /* 0x16E */ s16 unk_16E;                        /* inferred */
    /* 0x170 */ s16 unk_170;                        /* inferred */
    /* 0x172 */ s16 unk_172;                        /* inferred */
    /* 0x174 */ s16 unk_174;                        /* inferred */
    /* 0x176 */ s16 unk_176;                        /* inferred */
    /* 0x178 */ s16 unk_178;                        /* inferred */
    /* 0x17A */ char pad_17A[0x2];
    /* 0x17C */ f32 unk_17C;                        /* inferred */
    /* 0x180 */ f32 unk_180;                        /* inferred */
    /* 0x184 */ f32 unk_184;                        /* inferred */
    /* 0x188 */ f32 unk_188;                        /* inferred */
    /* 0x18C */ f32 unk_18C;                        /* inferred */
    /* 0x190 */ f32 unk_190;                        /* inferred */
    /* 0x194 */ f32 unk_194;                        /* inferred */
    /* 0x198 */ s16 unk_198;                        /* inferred */
    /* 0x19A */ s16 unk_19A;                        /* inferred */
    /* 0x19C */ s16 unk_19C;                        /* inferred */
    /* 0x19E */ char pad_19E[0x2];
    /* 0x1A0 */ f32 unk_1A0;                        /* inferred */
    /* 0x1A4 */ f32 unk_1A4;                        /* inferred */
    /* 0x1A8 */ f32 unk_1A8;                        /* inferred */
    /* 0x1AC */ f32 unk_1AC;                        /* inferred */
    /* 0x1B0 */ f32 unk_1B0;                        /* inferred */
    /* 0x1B4 */ f32 unk_1B4;                        /* inferred */
    /* 0x1B8 */ f32 unk_1B8;                        /* inferred */
    /* 0x1BC */ f32 unk_1BC;                        /* inferred */
    /* 0x1C0 */ f32 unk_1C0;                        /* inferred */
    /* 0x1C4 */ char pad_1C4[0x6];                  /* maybe part of unk_1C0[2]? */
    /* 0x1CA */ u8 unk_1CA;                         /* inferred */
    /* 0x1CB */ char pad_1CB[0x2];                  /* maybe part of unk_1CA[3]? */
    /* 0x1CD */ u8 unk_1CD;                         /* inferred */
    /* 0x1CE */ char pad_1CE[0x2];                  /* maybe part of unk_1CD[3]? */
    /* 0x1D0 */ SkelAnime unk_1D0;                  /* inferred */
    /* 0x214 */ LightNode *unk_214;                 /* inferred */
    /* 0x218 */ LightInfo unk_218;                  /* inferred */
    /* 0x226 */ char pad_226[0x2];
    /* 0x228 */ ColliderJntSph unk_228;             /* inferred */
    /* 0x248 */ ColliderJntSphElement unk_248;      /* inferred */
    /* 0x288 */ char pad_288[0x2C0];                /* maybe part of unk_248[12]? */
} EnFishing;                                        /* size = 0x548 */

typedef struct {
    /* 0x00 */ Room currRoom;
    /* 0x14 */ Room prevRoom;
    /* 0x28 */ void *roomMemPages[2];
    /* 0x30 */ u8 activeMemPage;
    /* 0x31 */ s8 unk31;
    /* 0x32 */ char pad_32[0x2];                    /* maybe part of unk31[3]? */
    /* 0x34 */ void *activeRoomVram;
    /* 0x38 */ DmaRequest dmaRequest;
    /* 0x58 */ OSMesgQueue loadQueue;
    /* 0x70 */ void *loadMsg[1];
    /* 0x74 */ void *unk74;
    /* 0x78 */ s8 unk78;
    /* 0x79 */ s8 unk79;
    /* 0x7A */ s16 unk_7A;                          /* inferred */
    /* 0x7C */ char pad_7C[0x4];                    /* maybe part of unk_7A[3]? */
} RoomContext;                                      /* size = 0x80 */

struct _mips2c_stack_EnFishing_Destroy {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnFishing_Draw {
    /* 0x00 */ char pad_0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_EnFishing_Init {
    /* 0x00 */ char pad_0[0x5C];
    /* 0x5C */ ActorContext *sp5C;                  /* inferred */
    /* 0x60 */ char pad_60[0x18];
};                                                  /* size = 0x78 */

struct _mips2c_stack_EnFishing_Update {
    /* 0x000 */ char pad_0[0x3C];
    /* 0x03C */ f32 *sp3C;                          /* inferred */
    /* 0x040 */ s16 *sp40;                          /* inferred */
    /* 0x044 */ f32 *sp44;                          /* inferred */
    /* 0x048 */ PosRot *sp48;                       /* inferred */
    /* 0x04C */ f32 sp4C;                           /* inferred */
    /* 0x050 */ char pad_50[0x10];                  /* maybe part of sp4C[5]? */
    /* 0x060 */ f32 sp60;                           /* inferred */
    /* 0x064 */ f32 sp64;                           /* inferred */
    /* 0x068 */ f32 sp68;                           /* inferred */
    /* 0x06C */ f32 sp6C;                           /* inferred */
    /* 0x070 */ char pad_70[0x2];
    /* 0x072 */ s16 sp72;                           /* inferred */
    /* 0x074 */ f32 sp74;                           /* inferred */
    /* 0x078 */ f32 sp78;                           /* inferred */
    /* 0x07C */ f32 sp7C;                           /* inferred */
    /* 0x080 */ f32 sp80;                           /* inferred */
    /* 0x084 */ ? sp84;                             /* inferred */
    /* 0x084 */ char pad_84[0x4];
    /* 0x088 */ f32 sp88;                           /* inferred */
    /* 0x08C */ char pad_8C[0x16];                  /* maybe part of sp88[6]? */
    /* 0x0A2 */ u16 spA2;                           /* inferred */
    /* 0x0A4 */ f32 spA4;                           /* inferred */
    /* 0x0A8 */ char pad_A8[0x10];                  /* maybe part of spA4[5]? */
    /* 0x0B8 */ ? spB8;                             /* inferred */
    /* 0x0B8 */ char pad_B8[0x4];
    /* 0x0BC */ f32 spBC;                           /* inferred */
    /* 0x0C0 */ char pad_C0[0x4];
    /* 0x0C4 */ f32 spC4;                           /* inferred */
    /* 0x0C8 */ f32 spC8;                           /* inferred */
    /* 0x0CC */ f32 spCC;                           /* inferred */
    /* 0x0D0 */ char pad_D0[0x8];                   /* maybe part of spCC[3]? */
    /* 0x0D8 */ f32 spD8;                           /* inferred */
    /* 0x0DC */ char pad_DC[0x4];
    /* 0x0E0 */ Actor *spE0;                        /* inferred */
    /* 0x0E4 */ char pad_E4[0xA];                   /* maybe part of spE0[3]? */
    /* 0x0EE */ s16 spEE;                           /* inferred */
    /* 0x0F0 */ s16 spF0;                           /* inferred */
    /* 0x0F2 */ s16 spF2;                           /* inferred */
    /* 0x0F4 */ s16 spF4;                           /* inferred */
    /* 0x0F6 */ s16 spF6;                           /* inferred */
    /* 0x0F8 */ char pad_F8[0x2];
    /* 0x0FA */ s16 spFA;                           /* inferred */
    /* 0x0FC */ s16 spFC;                           /* inferred */
    /* 0x0FE */ s16 spFE;                           /* inferred */
    /* 0x100 */ f32 sp100;                          /* inferred */
    /* 0x104 */ f32 sp104;                          /* inferred */
    /* 0x108 */ f32 sp108;                          /* inferred */
    /* 0x10C */ f32 sp10C;                          /* inferred */
    /* 0x110 */ f32 sp110;                          /* inferred */
    /* 0x114 */ f32 sp114;                          /* inferred */
    /* 0x118 */ f32 sp118;                          /* inferred */
    /* 0x11C */ f32 sp11C;                          /* inferred */
    /* 0x120 */ f32 sp120;                          /* inferred */
    /* 0x124 */ f32 sp124;                          /* inferred */
    /* 0x128 */ f32 sp128;                          /* inferred */
    /* 0x12C */ f32 sp12C;                          /* inferred */
    /* 0x130 */ f32 sp130;                          /* inferred */
    /* 0x134 */ s16 sp134;                          /* inferred */
    /* 0x136 */ s16 sp136;                          /* inferred */
};                                                  /* size = 0x138 */

struct _mips2c_stack_func_808FC6C0 {};              /* size 0x0 */

struct _mips2c_stack_func_808FC770 {};              /* size 0x0 */

struct _mips2c_stack_func_808FC790 {};              /* size 0x0 */

struct _mips2c_stack_func_808FC8B8 {};              /* size 0x0 */

struct _mips2c_stack_func_808FC964 {};              /* size 0x0 */

struct _mips2c_stack_func_808FCABC {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ ? sp20;                              /* inferred */
    /* 0x20 */ char pad_20[0x10];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_808FCC0C {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ ? sp20;                              /* inferred */
    /* 0x20 */ char pad_20[0x10];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_808FCDBC {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ ? sp20;                              /* inferred */
    /* 0x20 */ char pad_20[0x10];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_808FCF60 {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ f32 sp18;                            /* inferred */
    /* 0x1C */ f32 sp1C;                            /* inferred */
    /* 0x20 */ f32 sp20;                            /* inferred */
    /* 0x24 */ char pad_24[0x4];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_808FD054 {
    /* 0x00 */ char pad_0[0x80];
    /* 0x80 */ ? sp80;                              /* inferred */
    /* 0x80 */ char pad_80[0x4];
    /* 0x84 */ f32 sp84;                            /* inferred */
    /* 0x88 */ char pad_88[0x8];
};                                                  /* size = 0x90 */

struct _mips2c_stack_func_808FDCDC {
    /* 0x00 */ char pad_0[0x60];
    /* 0x60 */ ? sp60;                              /* inferred */
    /* 0x60 */ char pad_60[0x4];
    /* 0x64 */ f32 sp64;                            /* inferred */
    /* 0x68 */ char pad_68[0x10];                   /* maybe part of sp64[5]? */
    /* 0x78 */ ? sp78;                              /* inferred */
    /* 0x78 */ char pad_78[0x4];
    /* 0x7C */ f32 sp7C;                            /* inferred */
    /* 0x80 */ char pad_80[0x4];
    /* 0x84 */ ? sp84;                              /* inferred */
    /* 0x84 */ char pad_84[0x4];
    /* 0x88 */ f32 sp88;                            /* inferred */
    /* 0x8C */ char pad_8C[0x8];                    /* maybe part of sp88[3]? */
    /* 0x94 */ f32 sp94;                            /* inferred */
};                                                  /* size = 0x98 */

struct _mips2c_stack_func_808FE3F8 {
    /* 0x000 */ char pad_0[0x6C];
    /* 0x06C */ ? *sp6C;                            /* inferred */
    /* 0x070 */ char pad_70[0x14];                  /* maybe part of sp6C[6]? */
    /* 0x084 */ Gfx *sp84;                          /* inferred */
    /* 0x088 */ char pad_88[0xC];                   /* maybe part of sp84[4]? */
    /* 0x094 */ Gfx *sp94;                          /* inferred */
    /* 0x098 */ char pad_98[0x10];                  /* maybe part of sp94[5]? */
    /* 0x0A8 */ Gfx *spA8;                          /* inferred */
    /* 0x0AC */ char pad_AC[0xC];                   /* maybe part of spA8[4]? */
    /* 0x0B8 */ Gfx *spB8;                          /* inferred */
    /* 0x0BC */ char pad_BC[0x10];                  /* maybe part of spB8[5]? */
    /* 0x0CC */ Gfx *spCC;                          /* inferred */
    /* 0x0D0 */ Gfx *spD0;                          /* inferred */
    /* 0x0D4 */ char pad_D4[0x10];                  /* maybe part of spD0[5]? */
    /* 0x0E4 */ Gfx *spE4;                          /* inferred */
    /* 0x0E8 */ char pad_E8[0x10];                  /* maybe part of spE4[5]? */
    /* 0x0F8 */ Gfx *spF8;                          /* inferred */
    /* 0x0FC */ char pad_FC[0x18];                  /* maybe part of spF8[7]? */
    /* 0x114 */ void *sp114;                        /* inferred */
    /* 0x118 */ char pad_118[0x8];                  /* maybe part of sp114[3]? */
    /* 0x120 */ f32 sp120;                          /* inferred */
    /* 0x124 */ char pad_124[0x4];
};                                                  /* size = 0x128 */

struct _mips2c_stack_func_808FEE1C {
    /* 0x00 */ char pad_0[0x40];
    /* 0x40 */ Gfx *sp40;                           /* inferred */
    /* 0x44 */ char pad_44[0x4];
    /* 0x48 */ Gfx *sp48;                           /* inferred */
    /* 0x4C */ char pad_4C[0xC];
};                                                  /* size = 0x58 */

struct _mips2c_stack_func_808FEF70 {};              /* size 0x0 */

struct _mips2c_stack_func_808FF064 {
    /* 0x000 */ char pad_0[0x90];
    /* 0x090 */ f32 sp90;                           /* inferred */
    /* 0x094 */ f32 sp94;                           /* inferred */
    /* 0x098 */ f32 sp98;                           /* inferred */
    /* 0x09C */ f32 sp9C;                           /* inferred */
    /* 0x0A0 */ f32 spA0;                           /* inferred */
    /* 0x0A4 */ f32 spA4;                           /* inferred */
    /* 0x0A8 */ f32 spA8;                           /* inferred */
    /* 0x0AC */ f32 spAC;                           /* inferred */
    /* 0x0B0 */ f32 spB0;                           /* inferred */
    /* 0x0B4 */ char pad_B4[0x4];
    /* 0x0B8 */ f32 spB8;                           /* inferred */
    /* 0x0BC */ f32 spBC;                           /* inferred */
    /* 0x0C0 */ f32 spC0;                           /* inferred */
    /* 0x0C4 */ ? spC4;                             /* inferred */
    /* 0x0C4 */ char pad_C4[0x8];
    /* 0x0CC */ f32 spCC;                           /* inferred */
    /* 0x0D0 */ char pad_D0[0xC];                   /* maybe part of spCC[4]? */
    /* 0x0DC */ f32 spDC;                           /* inferred */
    /* 0x0E0 */ char pad_E0[0x20];
};                                                  /* size = 0x100 */

struct _mips2c_stack_func_808FF5E0 {
    /* 0x00 */ char pad_0[0x64];
    /* 0x64 */ f32 sp64;                            /* inferred */
    /* 0x68 */ f32 sp68;                            /* inferred */
    /* 0x6C */ f32 sp6C;                            /* inferred */
    /* 0x70 */ ? sp70;                              /* inferred */
    /* 0x70 */ char pad_70[0x8];
    /* 0x78 */ f32 sp78;                            /* inferred */
    /* 0x7C */ char pad_7C[0x1C];
};                                                  /* size = 0x98 */

struct _mips2c_stack_func_808FF750 {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ f32 *sp20;                           /* inferred */
    /* 0x24 */ char pad_24[0x4];
    /* 0x28 */ Gfx *sp28;                           /* inferred */
    /* 0x2C */ ? sp2C;                              /* inferred */
    /* 0x2C */ char pad_2C[0x40];
    /* 0x6C */ Vec3f *sp6C;                         /* inferred */
    /* 0x70 */ char pad_70[0x4];
    /* 0x74 */ Gfx *sp74;                           /* inferred */
    /* 0x78 */ char pad_78[0x4];
    /* 0x7C */ Gfx *sp7C;                           /* inferred */
    /* 0x80 */ char pad_80[0x4];
    /* 0x84 */ GraphicsContext *sp84;               /* inferred */
    /* 0x88 */ void *sp88;                          /* inferred */
    /* 0x8C */ f32 sp8C;                            /* inferred */
    /* 0x90 */ f32 sp90;                            /* inferred */
    /* 0x94 */ f32 sp94;                            /* inferred */
    /* 0x98 */ ? sp98;                              /* inferred */
    /* 0x98 */ char pad_98[0x14];
    /* 0xAC */ f32 spAC;                            /* inferred */
    /* 0xB0 */ f32 spB0;                            /* inferred */
    /* 0xB4 */ f32 spB4;                            /* inferred */
    /* 0xB8 */ f32 spB8;                            /* inferred */
    /* 0xBC */ f32 spBC;                            /* inferred */
};                                                  /* size = 0xC0 */

struct _mips2c_stack_func_808FFC44 {
    /* 0x00 */ char pad_0[0x90];
    /* 0x90 */ f32 sp90;                            /* inferred */
    /* 0x94 */ char pad_94[0x4];
    /* 0x98 */ f32 sp98;                            /* inferred */
    /* 0x9C */ f32 sp9C;                            /* inferred */
    /* 0xA0 */ f32 spA0;                            /* inferred */
    /* 0xA4 */ f32 spA4;                            /* inferred */
    /* 0xA8 */ f32 spA8;                            /* inferred */
    /* 0xAC */ f32 spAC;                            /* inferred */
    /* 0xB0 */ f32 spB0;                            /* inferred */
    /* 0xB4 */ ? spB4;                              /* inferred */
    /* 0xB4 */ char pad_B4[0x8];
    /* 0xBC */ f32 spBC;                            /* inferred */
    /* 0xC0 */ f32 spC0;                            /* inferred */
    /* 0xC4 */ char pad_C4[0x1C];
};                                                  /* size = 0xE0 */

struct _mips2c_stack_func_808FFF3C {
    /* 0x00 */ char pad_0[0x48];
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_80900A04 {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ ? *sp2C;                             /* inferred */
    /* 0x30 */ f32 *sp30;                           /* inferred */
    /* 0x34 */ s32 sp34;                            /* inferred */
    /* 0x38 */ char pad_38[0x5C];                   /* maybe part of sp34[24]? */
    /* 0x94 */ Gfx *sp94;                           /* inferred */
    /* 0x98 */ char pad_98[0x18];                   /* maybe part of sp94[7]? */
    /* 0xB0 */ void *spB0;                          /* inferred */
    /* 0xB4 */ char pad_B4[0x4];
    /* 0xB8 */ f32 spB8;                            /* inferred */
    /* 0xBC */ f32 spBC;                            /* inferred */
    /* 0xC0 */ f32 spC0;                            /* inferred */
    /* 0xC4 */ char pad_C4[0x4];
};                                                  /* size = 0xC8 */

struct _mips2c_stack_func_80901480 {
    /* 0x00 */ char pad_0[0x34];
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ char pad_3C[0x4];
    /* 0x40 */ void *sp40;                          /* inferred */
    /* 0x44 */ char pad_44[0x4];
    /* 0x48 */ ? sp48;                              /* inferred */
    /* 0x48 */ char pad_48[0x10];
    /* 0x58 */ ? sp58;                              /* inferred */
    /* 0x58 */ char pad_58[0xC];
    /* 0x64 */ ?32 sp64;                            /* inferred */
    /* 0x68 */ char pad_68[0x4];
    /* 0x6C */ ?32 sp6C;                            /* inferred */
    /* 0x70 */ f32 sp70;                            /* inferred */
    /* 0x74 */ char pad_74[0x4];
    /* 0x78 */ f32 sp78;                            /* inferred */
    /* 0x7C */ f32 sp7C;                            /* inferred */
    /* 0x80 */ ? sp80;                              /* inferred */
    /* 0x80 */ char pad_80[0x10];
    /* 0x90 */ f32 sp90;                            /* inferred */
    /* 0x94 */ f32 sp94;                            /* inferred */
    /* 0x98 */ f32 sp98;                            /* inferred */
    /* 0x9C */ f32 sp9C;                            /* inferred */
    /* 0xA0 */ f32 spA0;                            /* inferred */
    /* 0xA4 */ f32 spA4;                            /* inferred */
    /* 0xA8 */ f32 spA8;                            /* inferred */
    /* 0xAC */ f32 spAC;                            /* inferred */
    /* 0xB0 */ f32 spB0;                            /* inferred */
    /* 0xB4 */ ? spB4;                              /* inferred */
    /* 0xB4 */ char pad_B4[0xC];
    /* 0xC0 */ void *spC0;                          /* inferred */
    /* 0xC4 */ char pad_C4[0x4];
    /* 0xC8 */ f32 spC8;                            /* inferred */
    /* 0xCC */ char pad_CC[0x4];
    /* 0xD0 */ f32 spD0;                            /* inferred */
    /* 0xD4 */ f32 spD4;                            /* inferred */
    /* 0xD8 */ f32 spD8;                            /* inferred */
    /* 0xDC */ s16 spDC;                            /* inferred */
    /* 0xDE */ char pad_DE[0x2];
    /* 0xE0 */ f32 spE0;                            /* inferred */
    /* 0xE4 */ f32 spE4;                            /* inferred */
};                                                  /* size = 0xE8 */

struct _mips2c_stack_func_809033F0 {
    /* 0x00 */ char pad_0[0x98];
    /* 0x98 */ f32 sp98;                            /* inferred */
    /* 0x9C */ f32 sp9C;                            /* inferred */
    /* 0xA0 */ f32 spA0;                            /* inferred */
    /* 0xA4 */ f32 spA4;                            /* inferred */
    /* 0xA8 */ f32 spA8;                            /* inferred */
    /* 0xAC */ f32 spAC;                            /* inferred */
    /* 0xB0 */ char pad_B0[0x8];
};                                                  /* size = 0xB8 */

struct _mips2c_stack_func_809036BC {
    /* 0x00 */ char pad_0[0x88];
    /* 0x88 */ f32 sp88;                            /* inferred */
    /* 0x8C */ f32 sp8C;                            /* inferred */
    /* 0x90 */ f32 sp90;                            /* inferred */
    /* 0x94 */ f32 sp94;                            /* inferred */
    /* 0x98 */ f32 sp98;                            /* inferred */
    /* 0x9C */ f32 sp9C;                            /* inferred */
    /* 0xA0 */ char pad_A0[0x8];
};                                                  /* size = 0xA8 */

struct _mips2c_stack_func_809038A4 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ f32 sp24;                            /* inferred */
    /* 0x28 */ ? sp28;                              /* inferred */
    /* 0x28 */ char pad_28[0x8];
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ f32 sp3C;                            /* inferred */
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80903C60 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80903E20 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80908554 {};              /* size 0x0 */

struct _mips2c_stack_func_80908674 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809086B4 {};              /* size 0x0 */

struct _mips2c_stack_func_80908734 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809089B8 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ f32 sp1C;                            /* inferred */
    /* 0x20 */ char pad_20[0x8];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80908A64 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ f32 sp1C;                            /* inferred */
    /* 0x20 */ char pad_20[0x8];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80908B4C {
    /* 0x00 */ char pad_0[0x40];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80908E08 {
    /* 0x00 */ char pad_0[0x48];
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_80909234 {
    /* 0x00 */ char pad_0[0x78];
    /* 0x78 */ void *sp78;                          /* inferred */
    /* 0x7C */ char pad_7C[0x1C];                   /* maybe part of sp78[8]? */
    /* 0x98 */ ? sp98;                              /* inferred */
    /* 0x98 */ char pad_98[0x4];
    /* 0x9C */ f32 sp9C;                            /* inferred */
    /* 0xA0 */ char pad_A0[0x4];
    /* 0xA4 */ f32 spA4;                            /* inferred */
    /* 0xA8 */ f32 spA8;                            /* inferred */
    /* 0xAC */ f32 spAC;                            /* inferred */
    /* 0xB0 */ f32 spB0;                            /* inferred */
    /* 0xB4 */ f32 spB4;                            /* inferred */
    /* 0xB8 */ f32 spB8;                            /* inferred */
    /* 0xBC */ f32 spBC;                            /* inferred */
    /* 0xC0 */ f32 spC0;                            /* inferred */
    /* 0xC4 */ f32 spC4;                            /* inferred */
    /* 0xC8 */ char pad_C8[0x4];
    /* 0xCC */ s16 spCC;                            /* inferred */
    /* 0xCE */ s16 spCE;                            /* inferred */
    /* 0xD0 */ f32 spD0;                            /* inferred */
    /* 0xD4 */ char pad_D4[0x4];
    /* 0xD8 */ f32 spD8;                            /* inferred */
    /* 0xDC */ char pad_DC[0x4];
    /* 0xE0 */ f32 spE0;                            /* inferred */
    /* 0xE4 */ char pad_E4[0x4];
    /* 0xE8 */ f32 spE8;                            /* inferred */
    /* 0xEC */ char pad_EC[0xA];                    /* maybe part of spE8[3]? */
    /* 0xF6 */ s16 spF6;                            /* inferred */
};                                                  /* size = 0xF8 */

struct _mips2c_stack_func_80909AD0 {
    /* 0x00 */ char pad_0[0x58];
};                                                  /* size = 0x58 */

struct _mips2c_stack_func_80909CC0 {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ MessageContext *sp20;                /* inferred */
    /* 0x24 */ char pad_24[0x8];                    /* maybe part of sp20[3]? */
    /* 0x2C */ s32 sp2C;                            /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_8090AB6C {
    /* 0x000 */ char pad_0[0x28];
    /* 0x028 */ void *sp28;                         /* inferred */
    /* 0x02C */ void *sp2C;                         /* inferred */
    /* 0x030 */ char pad_30[0x4];
    /* 0x034 */ CutsceneContext *sp34;              /* inferred */
    /* 0x038 */ char pad_38[0x10];                  /* maybe part of sp34[5]? */
    /* 0x048 */ ? sp48;                             /* inferred */
    /* 0x048 */ char pad_48[0x8];
    /* 0x050 */ f32 sp50;                           /* inferred */
    /* 0x054 */ f32 sp54;                           /* inferred */
    /* 0x058 */ f32 sp58;                           /* inferred */
    /* 0x05C */ f32 sp5C;                           /* inferred */
    /* 0x060 */ f32 sp60;                           /* inferred */
    /* 0x064 */ f32 sp64;                           /* inferred */
    /* 0x068 */ f32 sp68;                           /* inferred */
    /* 0x06C */ char pad_6C[0x6];                   /* maybe part of sp68[2]? */
    /* 0x072 */ s16 sp72;                           /* inferred */
    /* 0x074 */ char pad_74[0x8];                   /* maybe part of sp72[5]? */
    /* 0x07C */ f32 sp7C;                           /* inferred */
    /* 0x080 */ f32 sp80;                           /* inferred */
    /* 0x084 */ f32 sp84;                           /* inferred */
    /* 0x088 */ f32 sp88;                           /* inferred */
    /* 0x08C */ f32 sp8C;                           /* inferred */
    /* 0x090 */ f32 sp90;                           /* inferred */
    /* 0x094 */ f32 sp94;                           /* inferred */
    /* 0x098 */ f32 sp98;                           /* inferred */
    /* 0x09C */ char pad_9C[0x2];
    /* 0x09E */ s16 sp9E;                           /* inferred */
    /* 0x0A0 */ f32 spA0;                           /* inferred */
    /* 0x0A4 */ f32 spA4;                           /* inferred */
    /* 0x0A8 */ f32 spA8;                           /* inferred */
    /* 0x0AC */ Camera *spAC;                       /* inferred */
    /* 0x0B0 */ char pad_B0[0x24];                  /* maybe part of spAC[10]? */
    /* 0x0D4 */ Actor *spD4;                        /* inferred */
    /* 0x0D8 */ char pad_D8[0x4];
    /* 0x0DC */ f32 spDC;                           /* inferred */
    /* 0x0E0 */ f32 spE0;                           /* inferred */
    /* 0x0E4 */ char pad_E4[0x4];
    /* 0x0E8 */ s16 spE8;                           /* inferred */
    /* 0x0EA */ char pad_EA[0x2];
    /* 0x0EC */ f32 spEC;                           /* inferred */
    /* 0x0F0 */ char pad_F0[0x4];
    /* 0x0F4 */ f32 spF4;                           /* inferred */
    /* 0x0F8 */ f32 spF8;                           /* inferred */
    /* 0x0FC */ f32 spFC;                           /* inferred */
    /* 0x100 */ f32 sp100;                          /* inferred */
    /* 0x104 */ f32 sp104;                          /* inferred */
    /* 0x108 */ f32 sp108;                          /* inferred */
    /* 0x10C */ f32 sp10C;                          /* inferred */
    /* 0x110 */ char pad_110[0x8];
};                                                  /* size = 0x118 */

struct _mips2c_stack_func_8090C884 {};              /* size 0x0 */

struct _mips2c_stack_func_8090C8BC {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ void *sp1C;                          /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_8090C96C {
    /* 0x00 */ char pad_0[0x30];
    /* 0x30 */ Gfx *sp30;                           /* inferred */
    /* 0x34 */ Gfx *sp34;                           /* inferred */
    /* 0x38 */ Gfx *sp38;                           /* inferred */
    /* 0x3C */ char pad_3C[0x4];
    /* 0x40 */ GraphicsContext *sp40;               /* inferred */
    /* 0x44 */ char pad_44[0xC];
};                                                  /* size = 0x50 */

? func_800F6834(GlobalContext *, ?);                /* extern */
? func_8013EC44(?, s32, s32, ?, ?);                 /* extern */
s32 func_8013EE04();                                /* extern */
void func_808FC6C0(s16 arg0, void *arg1, ? *arg2, f32 arg3); /* static */
void func_808FC770(s32 arg0, s32 arg1, s32 arg2);   /* static */
f32 func_808FC790();                                /* static */
s32 func_808FC8B8(s16 *arg0, s16 arg1, s16 arg2, s16 arg3); /* static */
void func_808FC964(Vec3f *arg0, void *arg2, f32 arg3, f32 arg4, s16 arg5, s16 arg6, ?32, s32, s32); /* static */
void func_808FCABC(void *arg0, void *arg1, f32 *arg2, f32 *arg3, f32 arg4); /* static */
void func_808FCC0C(void *arg0, void *arg1, f32 *arg2, f32 arg3); /* static */
void func_808FCDBC(void *arg0, void *arg1, f32 *arg2, f32 arg3, u8 arg4); /* static */
