typedef struct EnAz {
    /* 0x000 */ Actor actor;
    /* 0x144 */ void (*actionFunc)(EnAz *, GlobalContext *);
    /* 0x148 */ SkelAnime unk148;                   /* inferred */
    /* 0x18C */ ColliderCylinder unk18C;            /* inferred */
    /* 0x1D8 */ Vec3s unk1D8;                       /* inferred */
    /* 0x1DE */ char pad1DE[0x8A];                  /* maybe part of unk1D8[24]? */
    /* 0x268 */ Vec3s unk268;                       /* inferred */
    /* 0x26E */ char pad26E[0x8A];                  /* maybe part of unk268[24]? */
    /* 0x2F8 */ s16 unk2F8;                         /* inferred */
    /* 0x2FA */ s16 unk2FA;                         /* inferred */
    /* 0x2FC */ s32 unk2FC;                         /* inferred */
    /* 0x300 */ EnDno_ActorUnkStruct unk300;        /* inferred */
    /* 0x36C */ char pad36C[0x8];
    /* 0x374 */ u16 unk374;                         /* inferred */
    /* 0x376 */ u16 unk376;                         /* inferred */
    /* 0x378 */ u8 unk378;                          /* inferred */
    /* 0x379 */ char pad379[0x1];
    /* 0x37A */ s16 unk37A;                         /* inferred */
    /* 0x37C */ char pad37C[0x2];
    /* 0x37E */ s16 unk37E;                         /* inferred */
    /* 0x380 */ s16 unk380;                         /* inferred */
    /* 0x382 */ char pad382[0x2];
    /* 0x384 */ s16 unk384;                         /* inferred */
    /* 0x386 */ char pad386[0x2];
    /* 0x388 */ Actor *unk388;                      /* inferred */
    /* 0x38C */ char pad38C[0x10];                  /* maybe part of unk388[5]? */
    /* 0x39C */ s16 unk39C;                         /* inferred */
    /* 0x39E */ s16 unk39E;                         /* inferred */
    /* 0x3A0 */ char pad3A0[0x14];                  /* maybe part of unk39E[11]? */
    /* 0x3B4 */ f32 unk3B4;                         /* inferred */
    /* 0x3B8 */ f32 unk3B8;                         /* inferred */
    /* 0x3BC */ f32 unk3BC;                         /* inferred */
    /* 0x3C0 */ char pad3C0[0xC];                   /* maybe part of unk3BC[4]? */
    /* 0x3CC */ s32 unk3CC;                         /* inferred */
    /* 0x3D0 */ s16 unk3D0;                         /* inferred */
    /* 0x3D2 */ u16 unk3D2;                         /* inferred */
    /* 0x3D4 */ s16 unk3D4;                         /* inferred */
    /* 0x3D6 */ s16 unk3D6;                         /* inferred */
} EnAz;                                             /* size = 0x3D8 */

typedef struct EnDno_ActorUnkStruct {
    /* 0x00 */ Vec3f unk_00;
    /* 0x0C */ char padC[0x4];
    /* 0x10 */ s16 unk_10;
    /* 0x12 */ char pad12[0xA];                     /* maybe part of unk_10[6]? */
    /* 0x1C */ u8 unk_1C;
    /* 0x1D */ u8 unk_1D;
    /* 0x1E */ char pad1E[0x2];                     /* maybe part of unk_1D[3]? */
    /* 0x20 */ Vec3f unk_20;
    /* 0x2C */ Vec3f unk_2C;
    /* 0x38 */ char pad38[0xC];
    /* 0x44 */ void *unk44;                         /* inferred */
    /* 0x48 */ Actor *unk_48;
    /* 0x4C */ f32 unk_4C;
    /* 0x50 */ f32 unk_50;
    /* 0x54 */ s16 unk_54;
    /* 0x56 */ s16 unk_56;
    /* 0x58 */ s32 unk_58;
    /* 0x5C */ s32 (*unk_5C)(GlobalContext *, EnDno_ActorUnkStruct *);
    /* 0x60 */ s32 (*unk_60)(GlobalContext *, EnDno_ActorUnkStruct *);
    /* 0x64 */ s32 (*unk_64)(GlobalContext *, EnDno_ActorUnkStruct *);
    /* 0x68 */ s32 (*unk_68)(GlobalContext *, EnDno_ActorUnkStruct *);
} EnDno_ActorUnkStruct;                             /* size = 0x6C */

struct _mips2c_stack_EnAz_Destroy {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnAz_Draw {
    /* 0x00 */ char pad0[0x94];
    /* 0x94 */ f32 sp94;                            /* inferred */
    /* 0x98 */ f32 sp98;                            /* inferred */
    /* 0x9C */ f32 sp9C;                            /* inferred */
    /* 0xA0 */ f32 spA0;                            /* inferred */
    /* 0xA4 */ char padA4[0x2C];
};                                                  /* size = 0xD0 */

struct _mips2c_stack_EnAz_Init {
    /* 0x00 */ char pad0[0x34];
    /* 0x34 */ SkelAnime *sp34;                     /* inferred */
    /* 0x38 */ char pad38[0x2];
    /* 0x3A */ s16 sp3A;                            /* inferred */
    /* 0x3C */ f32 sp3C;                            /* inferred */
    /* 0x40 */ char pad40[0xE];                     /* maybe part of sp3C[4]? */
    /* 0x4E */ s16 sp4E;                            /* inferred */
    /* 0x50 */ char pad50[0x4];                     /* maybe part of sp4E[3]? */
    /* 0x54 */ EnAz *sp54;                          /* inferred */
};                                                  /* size = 0x58 */

struct _mips2c_stack_EnAz_Update {
    /* 0x00 */ char pad0[0x2C];
    /* 0x2C */ ColliderCylinder *sp2C;              /* inferred */
    /* 0x30 */ char pad30[0x8];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80A94A30 {};              /* size 0x0 */

struct _mips2c_stack_func_80A94A64 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A94A90 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A94AB8 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A94B20 {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80A94B98 {
    /* 0x00 */ char pad0[0x28];
    /* 0x28 */ s32 sp28;                            /* inferred */
    /* 0x2C */ char pad2C[0x4];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80A954AC {
    /* 0x00 */ char pad0[0x1C];
    /* 0x1C */ f32 sp1C;                            /* inferred */
    /* 0x20 */ f32 sp20;                            /* inferred */
    /* 0x24 */ f32 sp24;                            /* inferred */
    /* 0x28 */ f32 sp28;                            /* inferred */
    /* 0x2C */ f32 sp2C;                            /* inferred */
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ char pad34[0x4];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80A95534 {
    /* 0x00 */ char pad0[0x28];
    /* 0x28 */ s32 sp28;                            /* inferred */
    /* 0x2C */ char pad2C[0x4];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80A9565C {
    /* 0x00 */ char pad0[0x20];
    /* 0x20 */ s32 sp20;                            /* inferred */
    /* 0x24 */ char pad24[0x4];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80A95730 {
    /* 0x00 */ char pad0[0x2C];
    /* 0x2C */ s32 sp2C;                            /* inferred */
    /* 0x30 */ s32 sp30;                            /* inferred */
    /* 0x34 */ s32 sp34;                            /* inferred */
    /* 0x38 */ char pad38[0x8];                     /* maybe part of sp34[3]? */
    /* 0x40 */ f32 sp40;                            /* inferred */
    /* 0x44 */ char pad44[0x4];
    /* 0x48 */ s32 sp48;                            /* inferred */
    /* 0x4C */ char pad4C[0x4];
};                                                  /* size = 0x50 */

struct _mips2c_stack_func_80A958B0 {
    /* 0x00 */ char pad0[0x28];
    /* 0x28 */ s32 sp28;                            /* inferred */
    /* 0x2C */ s32 sp2C;                            /* inferred */
    /* 0x30 */ s32 sp30;                            /* inferred */
    /* 0x34 */ char pad34[0x8];                     /* maybe part of sp30[3]? */
    /* 0x3C */ f32 sp3C;                            /* inferred */
    /* 0x40 */ char pad40[0x10];                    /* maybe part of sp3C[5]? */
    /* 0x50 */ s32 sp50;                            /* inferred */
    /* 0x54 */ char pad54[0x4];
};                                                  /* size = 0x58 */

struct _mips2c_stack_func_80A95B34 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80A95C5C {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80A95CEC {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80A95DA0 {
    /* 0x00 */ char pad0[0x3C];
    /* 0x3C */ Vec3f *sp3C;                         /* inferred */
    /* 0x40 */ EnDno_ActorUnkStruct *sp40;          /* inferred */
    /* 0x44 */ char pad44[0x4];
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_80A95E88 {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80A95F94 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80A95FE8 {
    /* 0x00 */ char pad0[0x28];
    /* 0x28 */ PosRot *sp28;                        /* inferred */
    /* 0x2C */ SkelAnime *sp2C;                     /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80A9617C {
    /* 0x00 */ char pad0[0x28];
    /* 0x28 */ s32 sp28;                            /* inferred */
    /* 0x2C */ char pad2C[0x4];
    /* 0x30 */ Actor *sp30;                         /* inferred */
    /* 0x34 */ s32 sp34;                            /* inferred */
    /* 0x38 */ char pad38[0x8];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80A97114 {
    /* 0x00 */ char pad0[0x20];
    /* 0x20 */ s32 sp20;                            /* inferred */
    /* 0x24 */ s32 sp24;                            /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80A97274 {};              /* size 0x0 */

struct _mips2c_stack_func_80A973B4 {};              /* size 0x0 */

struct _mips2c_stack_func_80A97410 {
    /* 0x00 */ char pad0[0x28];
    /* 0x28 */ s16 *sp28;                           /* inferred */
    /* 0x2C */ char pad2C[0xC];                     /* maybe part of sp28[4]? */
    /* 0x38 */ ? sp38;                              /* inferred */
    /* 0x38 */ char pad38[0x4];
    /* 0x3C */ f32 sp3C;                            /* inferred */
    /* 0x40 */ char pad40[0x4];
    /* 0x44 */ Actor *sp44;                         /* inferred */
    /* 0x48 */ char pad48[0xC];                     /* maybe part of sp44[4]? */
    /* 0x54 */ s16 sp54;                            /* inferred */
    /* 0x56 */ s16 sp56;                            /* inferred */
};                                                  /* size = 0x58 */

struct _mips2c_stack_func_80A979DC {};              /* size 0x0 */

struct _mips2c_stack_func_80A979F4 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A97A28 {};              /* size 0x0 */

struct _mips2c_stack_func_80A97A40 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A97A9C {};              /* size 0x0 */

struct _mips2c_stack_func_80A97AB4 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80A97C0C {};              /* size 0x0 */

struct _mips2c_stack_func_80A97C24 {};              /* size 0x0 */

struct _mips2c_stack_func_80A97C4C {
    /* 0x00 */ char pad0[0x24];
    /* 0x24 */ SkelAnime *sp24;                     /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80A97D5C {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A97E48 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A97EAC {
    /* 0x00 */ char pad0[0x38];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80A97F9C {
    /* 0x00 */ char pad0[0x2C];
    /* 0x2C */ Actor *sp2C;                         /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80A982E0 {
    /* 0x00 */ char pad0[0x28];
    /* 0x28 */ f32 sp28;                            /* inferred */
    /* 0x2C */ f32 sp2C;                            /* inferred */
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ char pad34[0x4];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80A98414 {
    /* 0x00 */ char pad0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80A98DA4 {};              /* size 0x0 */

struct _mips2c_stack_func_80A98E48 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80A98EFC {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80A98F94 {};              /* size 0x0 */

? func_80124618(? *, f32, f32 *);                   /* extern */
? func_8013DC40(Path *, s32, s32, ? *);             /* extern */
s32 func_8013E054(GlobalContext *, EnDno_ActorUnkStruct *); /* extern */
void func_80A94A30(Actor *arg0);                    /* static */
void func_80A94A64(Actor *arg0);                    /* static */
? func_80A94A90(s32 arg0, void *arg1);              /* static */
void func_80A94AB8(EnAz *arg0, GlobalContext *arg1, s32 arg2); /* static */
void func_80A94B20(GlobalContext *arg0);            /* static */
s32 func_80A94B98(EnAz *arg0, GlobalContext *arg1); /* static */
void func_80A954AC(void *arg0);                     /* static */
s32 func_80A95534(GlobalContext *arg0, EnDno_ActorUnkStruct *arg1); /* static */
