typedef struct {
    /* 0x00 */ u16 unk0;
    /* 0x02 */ u16 startFrame;
    /* 0x04 */ u16 endFrame;
    /* 0x06 */ u16 unk_6;                           /* inferred */
    /* 0x08 */ u16 unk_8;                           /* inferred */
    /* 0x0A */ char pad_A[0x26];                    /* maybe part of unk_8[20]? */
} CsCmdActorAction;                                 /* size = 0x30 */

typedef struct EnElf {
    /* 0x000 */ Actor actor;
    /* 0x144 */ SkelAnime unk_144;                  /* inferred */
    /* 0x188 */ Vec3s unk_188;                      /* inferred */
    /* 0x18E */ char pad_18E[0x24];                 /* maybe part of unk_188[7]? */
    /* 0x1B2 */ Vec3s unk_1B2;                      /* inferred */
    /* 0x1B8 */ char pad_1B8[0x24];                 /* maybe part of unk_1B2[7]? */
    /* 0x1DC */ ? unk_1DC;                          /* inferred */
    /* 0x1DC */ char pad_1DC[0x4];
    /* 0x1E0 */ f32 unk_1E0;                        /* inferred */
    /* 0x1E4 */ f32 unk_1E4;                        /* inferred */
    /* 0x1E8 */ f32 unk_1E8;                        /* inferred */
    /* 0x1EC */ f32 unk_1EC;                        /* inferred */
    /* 0x1F0 */ f32 unk_1F0;                        /* inferred */
    /* 0x1F4 */ f32 unk_1F4;                        /* inferred */
    /* 0x1F8 */ ?32 unk_1F8;                        /* inferred */
    /* 0x1FC */ LightInfo unk_1FC;                  /* inferred */
    /* 0x20A */ char pad_20A[0x2];
    /* 0x20C */ LightNode *unk_20C;                 /* inferred */
    /* 0x210 */ LightInfo unk_210;                  /* inferred */
    /* 0x21E */ char pad_21E[0x2];
    /* 0x220 */ LightNode *unk_220;                 /* inferred */
    /* 0x224 */ f32 unk_224;                        /* inferred */
    /* 0x228 */ f32 unk_228;                        /* inferred */
    /* 0x22C */ f32 unk_22C;                        /* inferred */
    /* 0x230 */ s32 unk_230;                        /* inferred */
    /* 0x234 */ s32 unk_234;                        /* inferred */
    /* 0x238 */ char pad_238[0x4];
    /* 0x23C */ f32 unk_23C;                        /* inferred */
    /* 0x240 */ f32 unk_240;                        /* inferred */
    /* 0x244 */ s16 unk_244;                        /* inferred */
    /* 0x246 */ s16 unk_246;                        /* inferred */
    /* 0x248 */ s16 unk_248;                        /* inferred */
    /* 0x24A */ s16 unk_24A;                        /* inferred */
    /* 0x24C */ s16 unk_24C;                        /* inferred */
    /* 0x24E */ char pad_24E[0x2];
    /* 0x250 */ f32 unk_250;                        /* inferred */
    /* 0x254 */ f32 unk_254;                        /* inferred */
    /* 0x258 */ s16 unk_258;                        /* inferred */
    /* 0x25A */ u16 unk_25A;                        /* inferred */
    /* 0x25C */ s16 unk_25C;                        /* inferred */
    /* 0x25E */ s16 unk_25E;                        /* inferred */
    /* 0x260 */ s16 unk_260;                        /* inferred */
    /* 0x262 */ u16 unk_262;                        /* inferred */
    /* 0x264 */ u16 unk264;
    /* 0x266 */ u16 unk_266;                        /* inferred */
    /* 0x268 */ char pad_268[0x1];
    /* 0x269 */ u8 unk_269;                         /* inferred */
    /* 0x26A */ char pad_26A[0x2];                  /* maybe part of unk_269[3]? */
    /* 0x26C */ void (*unk_26C)(EnElf *, GlobalContext *); /* inferred */
    /* 0x270 */ void (*actionFunc)(EnElf *, GlobalContext *);
} EnElf;                                            /* size = 0x274 */

struct _mips2c_stack_EnElf_Destroy {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ LightContext *sp1C;                  /* inferred */
    /* 0x20 */ char pad_20[0x8];
};                                                  /* size = 0x28 */

struct _mips2c_stack_EnElf_Draw {
    /* 0x00 */ char pad_0[0x34];
    /* 0x34 */ Gfx *sp34;                           /* inferred */
    /* 0x38 */ char pad_38[0x20];                   /* maybe part of sp34[9]? */
    /* 0x58 */ GraphicsContext *sp58;               /* inferred */
    /* 0x5C */ char pad_5C[0x14];                   /* maybe part of sp58[6]? */
    /* 0x70 */ Actor *sp70;                         /* inferred */
    /* 0x74 */ char pad_74[0x4];
};                                                  /* size = 0x78 */

struct _mips2c_stack_EnElf_Init {
    /* 0x00 */ char pad_0[0x38];
    /* 0x38 */ LightInfo *sp38;                     /* inferred */
    /* 0x3C */ LightContext *sp3C;                  /* inferred */
    /* 0x40 */ s32 sp40;                            /* inferred */
    /* 0x44 */ char pad_44[0x4];
    /* 0x48 */ s32 sp48;                            /* inferred */
    /* 0x4C */ Actor *sp4C;                         /* inferred */
    /* 0x50 */ char pad_50[0x8];
};                                                  /* size = 0x58 */

struct _mips2c_stack_EnElf_SetupAction {};          /* size 0x0 */

struct _mips2c_stack_EnElf_Update {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8088C51C {};              /* size 0x0 */

struct _mips2c_stack_func_8088C804 {};              /* size 0x0 */

struct _mips2c_stack_func_8088C858 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_8088C920 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_8088C9CC {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ f32 sp24;                            /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_8088CBAC {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8088CC48 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_8088CD3C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8088D3EC {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_8088D470 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ f32 sp24;                            /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_8088D504 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ void *sp24;                          /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_8088D5A0 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8088D660 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ f32 sp24;                            /* inferred */
    /* 0x28 */ f32 sp28;                            /* inferred */
    /* 0x2C */ char pad_2C[0x8];                    /* maybe part of sp28[3]? */
    /* 0x34 */ f32 sp34;                            /* inferred */
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_8088D7F8 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8088D864 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8088D8D0 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8088D9BC {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ void *sp2C;                          /* inferred */
    /* 0x30 */ char pad_30[0x8];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_8088DB4C {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ f32 sp20;                            /* inferred */
    /* 0x24 */ f32 sp24;                            /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_8088DCA4 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8088DD34 {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ Actor *sp2C;                         /* inferred */
    /* 0x30 */ char pad_30[0x4];
    /* 0x34 */ Actor *sp34;                         /* inferred */
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_8088E018 {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ f32 sp2C;                            /* inferred */
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ char pad_34[0x4];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_8088E0E0 {};              /* size 0x0 */

struct _mips2c_stack_func_8088E0F0 {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ Actor *sp2C;                         /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_8088E304 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ s32 sp24;                            /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_8088E484 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ Actor *sp24;                         /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_8088E5A8 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8088E60C {
    /* 0x00 */ char pad_0[0x36];
    /* 0x36 */ s16 sp36;                            /* inferred */
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_8088E850 {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ PosRot *sp2C;                        /* inferred */
    /* 0x30 */ Vec3f *sp30;                         /* inferred */
    /* 0x34 */ char pad_34[0x4];
    /* 0x38 */ u32 sp38;                            /* inferred */
    /* 0x3C */ f32 sp3C;                            /* inferred */
    /* 0x40 */ f32 sp40;                            /* inferred */
    /* 0x44 */ Actor *sp44;                         /* inferred */
    /* 0x48 */ Actor *sp48;                         /* inferred */
    /* 0x4C */ f32 sp4C;                            /* inferred */
    /* 0x50 */ f32 sp50;                            /* inferred */
    /* 0x54 */ char pad_54[0x4];
};                                                  /* size = 0x58 */

struct _mips2c_stack_func_8088EF18 {};              /* size 0x0 */

struct _mips2c_stack_func_8088EFA4 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ f32 sp24;                            /* inferred */
    /* 0x28 */ void *sp28;                          /* inferred */
    /* 0x2C */ s32 sp2C;                            /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_8088F214 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ PosRot *sp1C;                        /* inferred */
    /* 0x20 */ Vec3f *sp20;                         /* inferred */
    /* 0x24 */ char pad_24[0x8];                    /* maybe part of sp20[3]? */
    /* 0x2C */ void *sp2C;                          /* inferred */
    /* 0x30 */ char pad_30[0x4];
    /* 0x34 */ EnElf *sp34;                         /* inferred */
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_8088F5F4 {
    /* 0x00 */ char pad_0[0x30];
    /* 0x30 */ s8 sp30;                             /* inferred */
    /* 0x31 */ s8 sp31;                             /* inferred */
    /* 0x32 */ s8 sp32;                             /* inferred */
    /* 0x33 */ char pad_33[0x1];
    /* 0x34 */ s8 sp34;                             /* inferred */
    /* 0x35 */ s8 sp35;                             /* inferred */
    /* 0x36 */ s8 sp36;                             /* inferred */
    /* 0x37 */ char pad_37[0x1];
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ f32 sp3C;                            /* inferred */
    /* 0x40 */ f32 sp40;                            /* inferred */
    /* 0x44 */ char pad_44[0x4];
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_8088F9E4 {
    /* 0x00 */ char pad_0[0x28];
    /* 0x28 */ ? sp28;                              /* inferred */
    /* 0x28 */ char pad_28[0x8];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_8088FA38 {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ void *sp2C;                          /* inferred */
    /* 0x30 */ void *sp30;                          /* inferred */
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ f32 sp3C;                            /* inferred */
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_8088FC34 {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ void *sp2C;                          /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_8088FD04 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_8088FDCC {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8088FE64 {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ void *sp20;                          /* inferred */
    /* 0x24 */ char pad_24[0xC];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_8089010C {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ Actor *sp2C;                         /* inferred */
    /* 0x30 */ char pad_30[0x8];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80890494 {
    /* 0x00 */ char pad_0[0x34];
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ f32 sp3C;                            /* inferred */
    /* 0x40 */ char pad_40[0x8];
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_808908D0 {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ f32 sp18;                            /* inferred */
    /* 0x1C */ f32 sp1C;                            /* inferred */
    /* 0x20 */ f32 sp20;                            /* inferred */
    /* 0x24 */ f32 sp24;                            /* inferred */
    /* 0x28 */ f32 sp28;                            /* inferred */
    /* 0x2C */ f32 sp2C;                            /* inferred */
};                                                  /* size = 0x30 */

? Parameter_AddMagic(GlobalContext *, s16);         /* extern */
f32 func_800C4188(GlobalContext *, s32, s32, ? *, EnElf *, s32); /* extern */
u16 func_800F05C0(GlobalContext *);                 /* extern */
f32 func_800F5A8C(f32, f32, u16, u16, u16, GlobalContext *); /* extern */
s32 func_800FD2B4(GlobalContext *, f32, f32, ?, f32); /* extern */
void func_8088C51C(EnElf *arg0, s16 arg1, EnElf *, Actor *); /* static */
s32 func_8088C804(PosRot *arg0, PosRot *arg1, f32 arg2, EnElf *); /* static */
void func_8088C858(void *arg0, EnElf *arg1);        /* static */
void func_8088C920(void *arg0, EnElf *arg1);        /* static */
void func_8088C9CC(EnElf *arg0, GlobalContext *arg1); /* static */
void func_8088CBAC(EnElf *arg0, GlobalContext *arg1); /* static */
void func_8088CC48(EnElf *arg0, GlobalContext *arg1); /* static */
