struct _mips2c_stack_Fault_AddAddrConvClient {
    /* 0x00 */ char pad_0[0x14];
    /* 0x14 */ s32 sp14;                            /* inferred */
    /* 0x18 */ s32 sp18;                            /* inferred */
    /* 0x1C */ char pad_1C[0x4];
};                                                  /* size = 0x20 */

struct _mips2c_stack_Fault_AddClient {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ s32 sp18;                            /* inferred */
    /* 0x1C */ s32 sp1C;                            /* inferred */
    /* 0x20 */ s32 sp20;                            /* inferred */
    /* 0x24 */ char pad_24[0x4];
};                                                  /* size = 0x28 */

struct _mips2c_stack_Fault_AddHungupAndCrash {
    /* 0x000 */ char pad_0[0x14];
    /* 0x014 */ s32 sp14;                           /* inferred */
    /* 0x018 */ s8 sp18;                            /* inferred */
    /* 0x019 */ char pad_19[0xFF];
};                                                  /* size = 0x118 */

struct _mips2c_stack_Fault_AddHungupAndCrashImpl {
    /* 0x00 */ char pad_0[0x14];
    /* 0x14 */ s32 sp14;                            /* inferred */
    /* 0x18 */ char pad_18[0x8];                    /* maybe part of sp14[3]? */
    /* 0x20 */ ? sp20;                              /* inferred */
    /* 0x20 */ char pad_20[0x10];
};                                                  /* size = 0x30 */

struct _mips2c_stack_Fault_CommitFB {
    /* 0x00 */ char pad_0[0x14];
    /* 0x14 */ s32 sp14;                            /* inferred */
    /* 0x18 */ char pad_18[0x4];
    /* 0x1C */ void *sp1C;                          /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_Fault_ConvertAddress {
    /* 0x00 */ char pad_0[0x14];
    /* 0x14 */ s32 sp14;                            /* inferred */
    /* 0x18 */ s32 sp18;                            /* inferred */
    /* 0x1C */ s32 sp1C;                            /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_Fault_DrawCornerRec {
    /* 0x00 */ char pad_0[0x10];
    /* 0x10 */ s32 sp10;                            /* inferred */
    /* 0x14 */ char pad_14[0x8];                    /* maybe part of sp10[3]? */
    /* 0x1C */ s32 sp1C;                            /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_Fault_DrawMemDump {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ s32 sp18;                            /* inferred */
    /* 0x1C */ s32 sp1C;                            /* inferred */
    /* 0x20 */ s32 sp20;                            /* inferred */
    /* 0x24 */ s32 sp24;                            /* inferred */
    /* 0x28 */ s32 sp28;                            /* inferred */
    /* 0x2C */ s32 sp2C;                            /* inferred */
    /* 0x30 */ s32 sp30;                            /* inferred */
    /* 0x34 */ s32 sp34;                            /* inferred */
};                                                  /* size = 0x38 */

struct _mips2c_stack_Fault_DrawMemDumpPage {
    /* 0x00 */ char pad_0[0x10];
    /* 0x10 */ u32 sp10;                            /* inferred */
    /* 0x14 */ char pad_14[0xC];                    /* maybe part of sp10[4]? */
    /* 0x20 */ s32 sp20;                            /* inferred */
    /* 0x24 */ s32 sp24;                            /* inferred */
    /* 0x28 */ s32 sp28;                            /* inferred */
    /* 0x2C */ s32 sp2C;                            /* inferred */
    /* 0x30 */ s32 sp30;                            /* inferred */
    /* 0x34 */ s32 sp34;                            /* inferred */
    /* 0x38 */ s32 sp38;                            /* inferred */
    /* 0x3C */ s32 sp3C;                            /* inferred */
};                                                  /* size = 0x40 */

struct _mips2c_stack_Fault_DrawRec {
    /* 0x00 */ char pad_0[0x10];
    /* 0x10 */ s32 sp10;                            /* inferred */
    /* 0x14 */ char pad_14[0x8];                    /* maybe part of sp10[3]? */
    /* 0x1C */ s32 sp1C;                            /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_Fault_DrawStackTrace {
    /* 0x00 */ char pad_0[0x10];
    /* 0x10 */ u32 sp10;                            /* inferred */
    /* 0x14 */ char pad_14[0xC];                    /* maybe part of sp10[4]? */
    /* 0x20 */ s32 sp20;                            /* inferred */
    /* 0x24 */ s32 sp24;                            /* inferred */
    /* 0x28 */ s32 sp28;                            /* inferred */
    /* 0x2C */ s32 sp2C;                            /* inferred */
    /* 0x30 */ s32 sp30;                            /* inferred */
    /* 0x34 */ s32 sp34;                            /* inferred */
    /* 0x38 */ s32 sp38;                            /* inferred */
    /* 0x3C */ s32 sp3C;                            /* inferred */
    /* 0x40 */ s32 sp40;                            /* inferred */
    /* 0x44 */ s32 sp44;                            /* inferred */
    /* 0x48 */ char pad_48[0x18];                   /* maybe part of sp44[7]? */
    /* 0x60 */ u32 sp60;                            /* inferred */
    /* 0x64 */ u32 *sp64;                           /* inferred */
    /* 0x68 */ u32 *sp68;                           /* inferred */
    /* 0x6C */ char pad_6C[0x4];
};                                                  /* size = 0x70 */

struct _mips2c_stack_Fault_FillScreenBlack {
    /* 0x00 */ char pad_0[0x14];
    /* 0x14 */ s32 sp14;                            /* inferred */
};                                                  /* size = 0x18 */

struct _mips2c_stack_Fault_FillScreenRed {
    /* 0x00 */ char pad_0[0x14];
    /* 0x14 */ s32 sp14;                            /* inferred */
};                                                  /* size = 0x18 */

struct _mips2c_stack_Fault_FindFaultedThread {
    /* 0x00 */ char pad_0[0x14];
    /* 0x14 */ s32 sp14;                            /* inferred */
};                                                  /* size = 0x18 */

struct _mips2c_stack_Fault_FindNextStackCall {
    /* 0x00 */ char pad_0[0x8];
    /* 0x08 */ s32 sp8;                             /* inferred */
    /* 0x0C */ s32 spC;                             /* inferred */
    /* 0x10 */ s32 sp10;                            /* inferred */
    /* 0x14 */ s32 sp14;                            /* inferred */
};                                                  /* size = 0x18 */

struct _mips2c_stack_Fault_HangupFaultClient {
    /* 0x00 */ char pad_0[0x14];
    /* 0x14 */ s32 sp14;                            /* inferred */
};                                                  /* size = 0x18 */

struct _mips2c_stack_Fault_PadCallback {
    /* 0x00 */ char pad_0[0x14];
    /* 0x14 */ s32 sp14;                            /* inferred */
};                                                  /* size = 0x18 */

struct _mips2c_stack_Fault_PrintFPCR {
    /* 0x00 */ char pad_0[0x14];
    /* 0x14 */ s32 sp14;                            /* inferred */
    /* 0x18 */ u32 sp18;                            /* inferred */
    /* 0x1C */ char pad_1C[0x4];
};                                                  /* size = 0x20 */

struct _mips2c_stack_Fault_PrintFReg {
    /* 0x00 */ char pad_0[0x14];
    /* 0x14 */ s32 sp14;                            /* inferred */
};                                                  /* size = 0x18 */

struct _mips2c_stack_Fault_PrintThreadContext {
    /* 0x00 */ char pad_0[0x10];
    /* 0x10 */ f64 sp10;                            /* inferred */
    /* 0x18 */ char pad_18[0x8];
    /* 0x20 */ s32 sp20;                            /* inferred */
    /* 0x24 */ s32 sp24;                            /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_Fault_ProcessClients {
    /* 0x00 */ char pad_0[0x10];
    /* 0x10 */ s32 sp10;                            /* inferred */
    /* 0x14 */ char pad_14[0xC];                    /* maybe part of sp10[4]? */
    /* 0x20 */ s32 sp20;                            /* inferred */
    /* 0x24 */ s32 sp24;                            /* inferred */
    /* 0x28 */ s32 sp28;                            /* inferred */
    /* 0x2C */ s32 sp2C;                            /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_Fault_RemoveAddrConvClient {
    /* 0x00 */ char pad_0[0x14];
    /* 0x14 */ s32 sp14;                            /* inferred */
    /* 0x18 */ s32 sp18;                            /* inferred */
    /* 0x1C */ char pad_1C[0x4];
    /* 0x20 */ FaultAddrConvClient *sp20;           /* inferred */
    /* 0x24 */ FaultAddrConvClient *sp24;           /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_Fault_RemoveClient {
    /* 0x00 */ char pad_0[0x14];
    /* 0x14 */ s32 sp14;                            /* inferred */
    /* 0x18 */ s32 sp18;                            /* inferred */
    /* 0x1C */ char pad_1C[0x4];
    /* 0x20 */ FaultClient *sp20;                   /* inferred */
    /* 0x24 */ FaultClient *sp24;                   /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_Fault_ResumeThread {
    /* 0x00 */ char pad_0[0x14];
    /* 0x14 */ s32 sp14;                            /* inferred */
};                                                  /* size = 0x18 */

struct _mips2c_stack_Fault_SetFB {
    /* 0x00 */ char pad_0[0x14];
    /* 0x14 */ s32 sp14;                            /* inferred */
};                                                  /* size = 0x18 */

struct _mips2c_stack_Fault_SetOptions {
    /* 0x00 */ char pad_0[0x14];
    /* 0x14 */ s32 sp14;                            /* inferred */
};                                                  /* size = 0x18 */

struct _mips2c_stack_Fault_SetOptionsFromController3 {
    /* 0x00 */ char pad_0[0x10];
    /* 0x10 */ s32 sp10;                            /* inferred */
    /* 0x14 */ s32 sp14;                            /* inferred */
    /* 0x18 */ char pad_18[0x4];
    /* 0x1C */ s32 sp1C;                            /* inferred */
    /* 0x20 */ char pad_20[0x4];
    /* 0x24 */ s32 sp24;                            /* inferred */
    /* 0x28 */ s32 sp28;                            /* inferred */
    /* 0x2C */ u32 sp2C;                            /* inferred */
    /* 0x30 */ char pad_30[0x4];
    /* 0x34 */ Input *sp34;                         /* inferred */
};                                                  /* size = 0x38 */

struct _mips2c_stack_Fault_Sleep {
    /* 0x00 */ char pad_0[0x14];
    /* 0x14 */ s32 sp14;                            /* inferred */
};                                                  /* size = 0x18 */

struct _mips2c_stack_Fault_SleepImpl {
    /* 0x00 */ char pad_0[0x14];
    /* 0x14 */ s32 sp14;                            /* inferred */
};                                                  /* size = 0x18 */

struct _mips2c_stack_Fault_Start {
    /* 0x00 */ char pad_0[0x10];
    /* 0x10 */ StackEntry *sp10;                    /* inferred */
    /* 0x14 */ s8 *sp14;                            /* inferred */
    /* 0x18 */ char pad_18[0x8];                    /* maybe part of sp14[3]? */
    /* 0x20 */ s32 sp20;                            /* inferred */
    /* 0x24 */ s32 sp24;                            /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_Fault_ThreadEntry {
    /* 0x00 */ char pad_0[0x54];
    /* 0x54 */ void *sp54;                          /* inferred */
};                                                  /* size = 0x58 */

struct _mips2c_stack_Fault_UpdatePadImpl {
    /* 0x00 */ char pad_0[0x14];
    /* 0x14 */ s32 sp14;                            /* inferred */
};                                                  /* size = 0x18 */

struct _mips2c_stack_Fault_Wait5Seconds {
    /* 0x00 */ char pad_0[0x14];
    /* 0x14 */ s32 sp14;                            /* inferred */
    /* 0x18 */ s32 sp18;                            /* inferred */
    /* 0x1C */ u32 sp1C;                            /* inferred */
    /* 0x20 */ char pad_20[0x8];
};                                                  /* size = 0x28 */

struct _mips2c_stack_Fault_WaitForButtonCombo {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ s32 sp18;                            /* inferred */
    /* 0x1C */ s32 sp1C;                            /* inferred */
    /* 0x20 */ s32 sp20;                            /* inferred */
    /* 0x24 */ s32 sp24;                            /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_Fault_WaitForInput {
    /* 0x00 */ char pad_0[0x14];
    /* 0x14 */ s32 sp14;                            /* inferred */
};                                                  /* size = 0x18 */

struct _mips2c_stack_Fault_WaitForInputImpl {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ s32 sp18;                            /* inferred */
    /* 0x1C */ s32 sp1C;                            /* inferred */
    /* 0x20 */ s32 sp20;                            /* inferred */
    /* 0x24 */ s32 sp24;                            /* inferred */
    /* 0x28 */ s32 sp28;                            /* inferred */
    /* 0x2C */ s32 sp2C;                            /* inferred */
    /* 0x30 */ s32 sp30;                            /* inferred */
    /* 0x34 */ s32 sp34;                            /* inferred */
    /* 0x38 */ s32 sp38;                            /* inferred */
    /* 0x3C */ s32 sp3C;                            /* inferred */
    /* 0x40 */ char pad_40[0x4];
    /* 0x44 */ Input *sp44;                         /* inferred */
};                                                  /* size = 0x48 */

struct _mips2c_stack_osSyncPrintfFPCR {
    /* 0x00 */ char pad_0[0x14];
    /* 0x14 */ s32 sp14;                            /* inferred */
    /* 0x18 */ u32 sp18;                            /* inferred */
    /* 0x1C */ char pad_1C[0x4];
};                                                  /* size = 0x20 */

struct _mips2c_stack_osSyncPrintfFReg {
    /* 0x00 */ char pad_0[0x14];
    /* 0x14 */ s32 sp14;                            /* inferred */
};                                                  /* size = 0x18 */

struct _mips2c_stack_osSyncPrintfStackTrace {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ s32 sp18;                            /* inferred */
    /* 0x1C */ s32 sp1C;                            /* inferred */
    /* 0x20 */ s32 sp20;                            /* inferred */
    /* 0x24 */ s32 sp24;                            /* inferred */
    /* 0x28 */ s32 sp28;                            /* inferred */
    /* 0x2C */ s32 sp2C;                            /* inferred */
    /* 0x30 */ s32 sp30;                            /* inferred */
    /* 0x34 */ s32 sp34;                            /* inferred */
    /* 0x38 */ s32 sp38;                            /* inferred */
    /* 0x3C */ s32 sp3C;                            /* inferred */
    /* 0x40 */ char pad_40[0x10];                   /* maybe part of sp3C[5]? */
    /* 0x50 */ u32 sp50;                            /* inferred */
    /* 0x54 */ u32 *sp54;                           /* inferred */
    /* 0x58 */ u32 *sp58;                           /* inferred */
    /* 0x5C */ char pad_5C[0x4];
};                                                  /* size = 0x60 */

struct _mips2c_stack_osSyncPrintfThreadContext {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ s32 sp18;                            /* inferred */
    /* 0x1C */ s32 sp1C;                            /* inferred */
};                                                  /* size = 0x20 */

s8 *D_80096B80[18] = {
    "Interrupt",
    "TLB modification",
    "TLB exception on load",
    "TLB exception on store",
    "Address error on load",
    "Address error on store",
    "Bus error on inst.",
    "Bus error on data",
    "System call exception",
    "Breakpoint exception",
    "Reserved instruction",
    "Coprocessor unusable",
    "Arithmetic overflow",
    "Trap exception",
    "Virtual coherency on inst.",
    "Floating point exception",
    "Watchpoint exception",
    "Virtual coherency on data",
};
f32 D_8009BE54;
u32 faultCopyToLog;
u32 faultCustomOptions;
FaultThreadStruct gFaultStruct;
OSViMode osViModeNtscLan1 = {
    2,
    {0x311E, 0x140, 0x3E52239, 0x20D, 0xC15, 0xC150C15, 0x6C02EC, 0x200, 0},
    {{0x280, 0x400, 0x2501FF, 0xE0204, 2}, {0x280, 0x400, 0x2501FF, 0xE0204, 2}},
};
s8 *sExceptionNames[6] = {
