typedef struct EnInvadepohDemo {
    /* 0x000 */ Actor actor;
    /* 0x144 */ void (*actionFunc)(EnInvadepohDemo *, GlobalContext *);
    /* 0x148 */ s32 unk_148;                        /* inferred */
    /* 0x14C */ f32 unk_14C;                        /* inferred */
    /* 0x150 */ u32 unk_150;                        /* inferred */
    /* 0x154 */ s32 unk_154;                        /* inferred */
    /* 0x158 */ s32 unk_158;                        /* inferred */
    /* 0x15C */ s32 unk_15C;                        /* inferred */
    /* 0x160 */ s32 unk_160;                        /* inferred */
    /* 0x164 */ s32 unk_164;                        /* inferred */
    /* 0x168 */ s32 unk_168;                        /* inferred */
    /* 0x16C */ s16 unk_16C;                        /* inferred */
    /* 0x16E */ char pad_16E[0x2];
    /* 0x170 */ SkelAnime unk_170;                  /* inferred */
    /* 0x1B4 */ Vec3s unk_1B4;                      /* inferred */
    /* 0x1BA */ char pad_1BA[0x84];                 /* maybe part of unk_1B4[23]? */
    /* 0x23E */ Vec3s unk_23E;                      /* inferred */
    /* 0x244 */ char pad_244[0x84];                 /* maybe part of unk_23E[23]? */
} EnInvadepohDemo;                                  /* size = 0x2C8 */

struct _mips2c_stack_EnInvadepohDemo_Destroy {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnInvadepohDemo_Draw {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnInvadepohDemo_Init {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnInvadepohDemo_Update {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80C192A0 {};              /* size 0x0 */

struct _mips2c_stack_func_80C192B0 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80C19334 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80C193A8 {
    /* 0x00 */ char pad_0[0x40];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80C19454 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80C19498 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80C1950C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80C19548 {};              /* size 0x0 */

struct _mips2c_stack_func_80C19564 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80C19590 {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ ? sp20;                              /* inferred */
    /* 0x20 */ char pad_20[0x10];
    /* 0x30 */ s32 sp30;                            /* inferred */
    /* 0x34 */ char pad_34[0x4];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80C1965C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80C19688 {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ ? sp20;                              /* inferred */
    /* 0x20 */ char pad_20[0x10];
    /* 0x30 */ s32 sp30;                            /* inferred */
    /* 0x34 */ char pad_34[0x4];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80C19754 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ ? sp24;                              /* inferred */
    /* 0x24 */ char pad_24[0x44];
};                                                  /* size = 0x68 */

struct _mips2c_stack_func_80C1985C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80C1987C {
    /* 0x00 */ char pad_0[0x28];
    /* 0x28 */ ? sp28;                              /* inferred */
    /* 0x28 */ char pad_28[0xC];
    /* 0x34 */ void *sp34;                          /* inferred */
    /* 0x38 */ s32 sp38;                            /* inferred */
    /* 0x3C */ char pad_3C[0x4];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80C199BC {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80C199EC {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ ? sp20;                              /* inferred */
    /* 0x20 */ char pad_20[0x10];
    /* 0x30 */ s32 sp30;                            /* inferred */
    /* 0x34 */ char pad_34[0x4];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80C19AB4 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ u16 *sp1C;                           /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80C19D00 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80C19D48 {
    /* 0x00 */ char pad_0[0x34];
    /* 0x34 */ SkelAnime *sp34;                     /* inferred */
    /* 0x38 */ char pad_38[0x8];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80C19E04 {
    /* 0x00 */ char pad_0[0x34];
    /* 0x34 */ SkelAnime *sp34;                     /* inferred */
    /* 0x38 */ char pad_38[0x8];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80C19EC0 {
    /* 0x00 */ char pad_0[0x34];
    /* 0x34 */ SkelAnime *sp34;                     /* inferred */
    /* 0x38 */ char pad_38[0x8];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80C19F7C {
    /* 0x00 */ char pad_0[0x34];
    /* 0x34 */ SkelAnime *sp34;                     /* inferred */
    /* 0x38 */ char pad_38[0x8];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80C1A038 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80C1A070 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ s32 sp24;                            /* inferred */
    /* 0x28 */ char pad_28[0x8];                    /* maybe part of sp24[3]? */
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ f32 sp3C;                            /* inferred */
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80C1A168 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80C1A244 {
    /* 0x00 */ char pad_0[0x54];
    /* 0x54 */ GraphicsContext *sp54;               /* inferred */
    /* 0x58 */ char pad_58[0x10];                   /* maybe part of sp54[5]? */
    /* 0x68 */ f32 sp68;                            /* inferred */
    /* 0x6C */ f32 sp6C;                            /* inferred */
    /* 0x70 */ f32 sp70;                            /* inferred */
    /* 0x74 */ char pad_74[0x24];                   /* maybe part of sp70[10]? */
    /* 0x98 */ GraphicsContext *sp98;               /* inferred */
    /* 0x9C */ Gfx *sp9C;                           /* inferred */
    /* 0xA0 */ char pad_A0[0x18];
};                                                  /* size = 0xB8 */

struct _mips2c_stack_func_80C1A590 {
    /* 0x00 */ char pad_0[0x28];
    /* 0x28 */ Gfx *sp28;                           /* inferred */
    /* 0x2C */ Gfx *sp2C;                           /* inferred */
    /* 0x30 */ char pad_30[0x4];
    /* 0x34 */ GraphicsContext *sp34;               /* inferred */
    /* 0x38 */ char pad_38[0x8];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80C1A650 {};              /* size 0x0 */

struct _mips2c_stack_func_80C1A670 {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80C1A6C8 {
    /* 0x00 */ char pad_0[0x5C];
    /* 0x5C */ GraphicsContext *sp5C;               /* inferred */
    /* 0x60 */ char pad_60[0x4];
    /* 0x64 */ f32 sp64;                            /* inferred */
    /* 0x68 */ f32 sp68;                            /* inferred */
    /* 0x6C */ f32 sp6C;                            /* inferred */
    /* 0x70 */ char pad_70[0x8];
};                                                  /* size = 0x78 */

struct _mips2c_stack_func_80C1A854 {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

void func_80C192A0(s32 arg0, ? arg1);               /* static */
void func_80C192B0(Actor *arg0, s32 arg1);          /* static */
void func_80C19334(Actor *arg0, s32 arg1);          /* static */
void func_80C193A8(Actor *arg0, GlobalContext *arg1); /* static */
void func_80C19454(Actor *arg0, ? arg1);            /* static */
void func_80C19498(Actor *arg0, s32 arg1);          /* static */
void func_80C1950C(void *arg0, ? arg1);             /* static */
void func_80C19548(void *arg0, ? arg1);             /* static */
void func_80C19564(s32 arg0, ? arg1);               /* static */
void func_80C19590(Actor *arg0, void *arg1);        /* static */
void func_80C1965C(s32 arg0, ? arg1);               /* static */
void func_80C19688(Actor *arg0, void *arg1);        /* static */
void func_80C19754(Actor *arg0, void *arg1);        /* static */
