typedef struct EnMaruta {
    /* 0x000 */ Actor actor;
    /* 0x144 */ void (*actionFunc)(EnMaruta *, GlobalContext *);
    /* 0x148 */ ColliderCylinder unk_148;           /* inferred */
    /* 0x194 */ f32 unk_194;                        /* inferred */
    /* 0x198 */ f32 unk_198;                        /* inferred */
    /* 0x19C */ f32 unk_19C;                        /* inferred */
    /* 0x1A0 */ s32 unk_1A0;                        /* inferred */
    /* 0x1A4 */ Vec3f unk_1A4;                      /* inferred */
    /* 0x1B0 */ ? unk_1B0;                          /* inferred */
    /* 0x1B0 */ char pad_1B0[0xC];
    /* 0x1BC */ ? unk_1BC;                          /* inferred */
    /* 0x1BC */ char pad_1BC[0xC];
    /* 0x1C8 */ ? unk_1C8;                          /* inferred */
    /* 0x1C8 */ char pad_1C8[0x3C];
    /* 0x204 */ Vec3f unk_204;                      /* inferred */
    /* 0x210 */ s32 unk_210;                        /* inferred */
    /* 0x214 */ s32 unk_214;                        /* inferred */
    /* 0x218 */ s16 unk_218;                        /* inferred */
    /* 0x21A */ s16 unk_21A;                        /* inferred */
    /* 0x21C */ s16 unk_21C;                        /* inferred */
    /* 0x21E */ s16 unk_21E;                        /* inferred */
    /* 0x220 */ s16 unk_220;                        /* inferred */
    /* 0x222 */ char pad_222[0x2];
} EnMaruta;                                         /* size = 0x224 */

struct _mips2c_stack_EnMaruta_Destroy {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnMaruta_Draw {
    /* 0x00 */ char pad_0[0x50];
    /* 0x50 */ f32 sp50;                            /* inferred */
    /* 0x54 */ f32 sp54;                            /* inferred */
    /* 0x58 */ f32 sp58;                            /* inferred */
    /* 0x5C */ char pad_5C[0x4];
};                                                  /* size = 0x60 */

struct _mips2c_stack_EnMaruta_Init {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ ColliderCylinder *sp20;              /* inferred */
    /* 0x24 */ char pad_24[0xC];
};                                                  /* size = 0x30 */

struct _mips2c_stack_EnMaruta_Update {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B372B8 {};              /* size 0x0 */

struct _mips2c_stack_func_80B372CC {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B37364 {};              /* size 0x0 */

struct _mips2c_stack_func_80B3738C {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80B373F4 {};              /* size 0x0 */

struct _mips2c_stack_func_80B37428 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B374B8 {};              /* size 0x0 */

struct _mips2c_stack_func_80B374FC {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B37590 {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ s32 sp2C;                            /* inferred */
    /* 0x30 */ char pad_30[0x4];
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ ? sp38;                              /* inferred */
    /* 0x38 */ char pad_38[0xE];
    /* 0x46 */ s16 sp46;                            /* inferred */
    /* 0x48 */ f32 sp48;                            /* inferred */
    /* 0x4C */ f32 sp4C;                            /* inferred */
    /* 0x50 */ f32 sp50;                            /* inferred */
    /* 0x54 */ char pad_54[0x4];
};                                                  /* size = 0x58 */

struct _mips2c_stack_func_80B37950 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B37998 {};              /* size 0x0 */

struct _mips2c_stack_func_80B379C0 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B37A14 {};              /* size 0x0 */

struct _mips2c_stack_func_80B37A64 {};              /* size 0x0 */

struct _mips2c_stack_func_80B37A8C {};              /* size 0x0 */

struct _mips2c_stack_func_80B37AA0 {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80B37B78 {};              /* size 0x0 */

struct _mips2c_stack_func_80B37C04 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80B37C60 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B37CA0 {
    /* 0x00 */ char pad_0[0x40];
    /* 0x40 */ CollisionCheckContext *sp40;         /* inferred */
    /* 0x44 */ ColliderCylinder *sp44;              /* inferred */
    /* 0x48 */ void (*sp48)(EnMaruta *, GlobalContext *); /* inferred */
    /* 0x4C */ char pad_4C[0x8];                    /* maybe part of sp48[3]? */
    /* 0x54 */ void *sp54;                          /* inferred */
};                                                  /* size = 0x58 */

struct _mips2c_stack_func_80B37EC0 {
    /* 0x00 */ char pad_0[0x34];
    /* 0x34 */ ? sp34;                              /* inferred */
    /* 0x34 */ char pad_34[0x4];
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ char pad_3C[0x4];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80B38028 {};              /* size 0x0 */

struct _mips2c_stack_func_80B38060 {
    /* 0x00 */ char pad_0[0x44];
    /* 0x44 */ ? sp44;                              /* inferred */
    /* 0x44 */ char pad_44[0xC];
};                                                  /* size = 0x50 */

struct _mips2c_stack_func_80B3828C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B382E4 {
    /* 0x00 */ char pad_0[0x64];
    /* 0x64 */ s32 sp64;                            /* inferred */
    /* 0x68 */ s32 sp68;                            /* inferred */
    /* 0x6C */ f32 sp6C;                            /* inferred */
    /* 0x70 */ f32 sp70;                            /* inferred */
    /* 0x74 */ f32 sp74;                            /* inferred */
    /* 0x78 */ f32 sp78;                            /* inferred */
    /* 0x7C */ f32 sp7C;                            /* inferred */
    /* 0x80 */ f32 sp80;                            /* inferred */
    /* 0x84 */ ? sp84;                              /* inferred */
    /* 0x84 */ char pad_84[0x4];
    /* 0x88 */ f32 sp88;                            /* inferred */
    /* 0x8C */ char pad_8C[0x4];
};                                                  /* size = 0x90 */

void func_80B372B8(EnMaruta *arg0);                 /* static */
void func_80B37364(EnMaruta *arg0);                 /* static */
void func_80B373F4(void *arg0);                     /* static */
void func_80B374B8(Actor *arg0);                    /* static */
void func_80B37590(EnMaruta *arg0, GlobalContext *arg1); /* static */
void func_80B37998(Actor *arg0);                    /* static */
void func_80B37A14(EnMaruta *arg0, EnMaruta *);     /* static */
void func_80B37A8C(void *arg0);                     /* static */
s32 func_80B37B78(Actor *arg0, GlobalContext *arg1); /* static */
void func_80B37C04(s16 *arg0, EnMaruta *);          /* static */
void func_80B37C60(EnMaruta *arg0);                 /* static */
void func_80B37CA0(Actor *arg0, GlobalContext *arg1); /* static */
void func_80B37EC0(Actor *arg0, s32 arg1);          /* static */
