? func_800BC8B8(GlobalContext *, s8, ?);            /* extern */
? func_800DFFAC(s32, DoorShutter *, s16, f32, s32, s32, s32); /* extern */
? func_801226E0(GlobalContext *, s8);               /* extern */
void func_808A08F0(DoorShutter *arg0, void (*arg1)(DoorShutter *, GlobalContext *, DoorShutter *), GlobalContext *, GlobalContext *); /* static */
s32 func_808A0900(DoorShutter *arg0, GlobalContext *arg1, GlobalContext *, GlobalContext *); /* static */
s32 func_808A0974(DoorShutter *arg0, GlobalContext *arg1, DoorShutter *); /* static */
void func_808A0D0C(DoorShutter *arg0, GlobalContext *arg1, DoorShutter *); /* static */
f32 func_808A0D90(GlobalContext *arg0, Actor *arg1, f32 arg2, f32 arg3, f32 arg4); /* static */
s32 func_808A0E28(Actor *arg0, GlobalContext *arg1, DoorShutter *); /* static */
void func_808A0F88(DoorShutter *arg0, GlobalContext *arg1, DoorShutter *); /* static */
void func_808A1080(DoorShutter *arg0, GlobalContext *arg1, DoorShutter *); /* static */
void func_808A1090(DoorShutter *arg0, GlobalContext *arg1, DoorShutter *); /* static */
void func_808A1288(DoorShutter *arg0, void *arg1);  /* static */
s32 func_808A1340(DoorShutter *arg0);               /* static */
s32 func_808A1478(Actor *arg0, GlobalContext *arg1, f32 arg2, Actor *); /* static */
void func_808A1548(DoorShutter *arg0, GlobalContext *arg1, DoorShutter *); /* static */
void func_808A1618(DoorShutter *arg0, GlobalContext *arg1, DoorShutter *); /* static */
void func_808A1684(DoorShutter *arg0, GlobalContext *arg1, DoorShutter *); /* static */
void func_808A1784(DoorShutter *arg0, GlobalContext *arg1, DoorShutter *); /* static */
void func_808A1884(Actor *arg0, GlobalContext *arg1); /* static */
s32 func_808A1A70(Actor *arg0);                     /* static */
void func_808A1B48(DoorShutter *arg0, GlobalContext *arg1, DoorShutter *); /* static */
void func_808A1C50(DoorShutter *arg0, GlobalContext *arg1, DoorShutter *); /* static */
s32 func_808A1D68(Actor *arg0, GlobalContext *arg1); /* static */
void func_808A1E14(Actor *arg0, GlobalContext *arg1); /* static */
static ? D_808A2180;                                /* unable to generate initializer */
static ? D_808A21B0;                                /* unable to generate initializer */
static ? D_808A2240;                                /* unable to generate initializer */
static InitChainEntry D_808A2248;                   /* unable to generate initializer */
static s16 D_808A2258 = {
    0x1B,
    0x200,
    0x21,
    0x300,
    0x49,
    0x400,
    0x16,
    0x500,
    0x18,
    0x500,
    0x4B,
    0x600,
    0x56,
    0x700,
    0x1D,
    0x700,
    0x60,
    0x900,
    0x27,
    0xA00,
    0x14,
    0xB00,
    0x23,
    0xB00,
    0x3B,
    0xB00,
    0x2A,
    0x800,
    0x3F,
    0x800,
    0x47,
    0x800,
    0x66,
    0x800,
    0xFFFF,
    0x100,
};
static ? D_808A22A0;                                /* unable to generate initializer */
static Vec3f D_808A22C4 = {120.0f, 0.0f, 0.0f};
static Vec3f D_808A22D0 = {-90.0f, 0.0f, 0.0f};
static ? D_808A22DC;                                /* unable to generate initializer */

typedef struct DoorShutter {
    /* 0x0000 */ Actor actor;
    /* 0x0144 */ char pad144[0x18];
    /* 0x015C */ s16 unk15C;                        /* inferred */
    /* 0x015E */ s16 unk15E;                        /* inferred */
    /* 0x0160 */ char pad160[0x2];                  /* maybe part of unk15E[2]? */
    /* 0x0162 */ u8 unk162;                         /* inferred */
    /* 0x0163 */ u8 unk163;                         /* inferred */
    /* 0x0164 */ u8 unk164;                         /* inferred */
    /* 0x0165 */ s8 unk165;                         /* inferred */
    /* 0x0166 */ s8 unk166;                         /* inferred */
    /* 0x0167 */ s8 unk167;                         /* inferred */
    /* 0x0168 */ f32 unk168;                        /* inferred */
    /* 0x016C */ void (*actionFunc)(DoorShutter *, GlobalContext *, DoorShutter *);
} DoorShutter;                                      /* size 0x170 */

void func_808A08F0(DoorShutter *arg0, void (*arg1)(DoorShutter *, GlobalContext *, DoorShutter *)) {
    arg0->actionFunc = arg1;
    arg0->unk167 = 0;
}

s32 func_808A0900(DoorShutter *arg0, GlobalContext *arg1) {
    s16 temp_v0_2;
    s8 temp_v1;
    void *temp_v0;
    s32 phi_a1;
    s8 phi_v1;

    temp_v0 = arg1->doorCtx.transitionActorList + (((s32) arg0->actor.params >> 0xA) * 0x10);
    temp_v1 = temp_v0->unk0;
    phi_v1 = temp_v1;
    if (temp_v1 == temp_v0->unk2) {
        temp_v0_2 = arg0->actor.shape.rot.y - arg0->actor.yawTowardsPlayer;
        phi_a1 = (s32) temp_v0_2;
        if ((s32) temp_v0_2 < 0) {
            phi_a1 = -(s32) temp_v0_2;
        }
        if (phi_a1 < 0x4000) {
            phi_v1 = -1;
        }
    }
