typedef struct EnOsn {
    /* 0x000 */ Actor actor;
    /* 0x144 */ ColliderCylinder unk_144;           /* inferred */
    /* 0x190 */ SkelAnime unk_190;                  /* inferred */
    /* 0x1D4 */ void (*actionFunc)(EnOsn *, GlobalContext *);
    /* 0x1D8 */ Vec3s unk_1D8;                      /* inferred */
    /* 0x1DE */ Vec3s unk_1DE;                      /* inferred */
    /* 0x1E4 */ char pad_1E4[0x6];
    /* 0x1EA */ u16 unk_1EA;                        /* inferred */
    /* 0x1EC */ u8 unk_1EC;                         /* inferred */
    /* 0x1ED */ char pad_1ED[0x3];                  /* maybe part of unk_1EC[4]? */
    /* 0x1F0 */ s8 unk_1F0;                         /* inferred */
    /* 0x1F1 */ char pad_1F1[0xB];                  /* maybe part of unk_1F0[12]? */
    /* 0x1FC */ u8 unk_1FC;                         /* inferred */
    /* 0x1FD */ char pad_1FD[0x3];                  /* maybe part of unk_1FC[4]? */
} EnOsn;                                            /* size = 0x200 */

struct _mips2c_stack_EnOsn_Destroy {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnOsn_Draw {
    /* 0x00 */ char pad_0[0x34];
    /* 0x34 */ Gfx *sp34;                           /* inferred */
    /* 0x38 */ Gfx *sp38;                           /* inferred */
    /* 0x3C */ char pad_3C[0x4];
    /* 0x40 */ Gfx *sp40;                           /* inferred */
    /* 0x44 */ Gfx *sp44;                           /* inferred */
    /* 0x48 */ Gfx *sp48;                           /* inferred */
    /* 0x4C */ Gfx *sp4C;                           /* inferred */
    /* 0x50 */ Gfx *sp50;                           /* inferred */
    /* 0x54 */ Gfx *sp54;                           /* inferred */
    /* 0x58 */ char pad_58[0x10];
};                                                  /* size = 0x68 */

struct _mips2c_stack_EnOsn_Init {
    /* 0x00 */ char pad_0[0x34];
    /* 0x34 */ ColliderCylinder *sp34;              /* inferred */
    /* 0x38 */ SkelAnime *sp38;                     /* inferred */
    /* 0x3C */ char pad_3C[0xC];
};                                                  /* size = 0x48 */

struct _mips2c_stack_EnOsn_Update {
    /* 0x00 */ char pad_0[0x34];
    /* 0x34 */ u32 sp34;                            /* inferred */
    /* 0x38 */ char pad_38[0x8];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80AD0830 {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ Collider *sp18;                      /* inferred */
    /* 0x1C */ CollisionCheckContext *sp1C;         /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80AD08B0 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80AD0998 {
    /* 0x00 */ char pad_0[0x1E];
    /* 0x1E */ s16 sp1E;                            /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80AD0A24 {
    /* 0x00 */ char pad_0[0x1E];
    /* 0x1E */ s16 sp1E;                            /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80AD0AB0 {
    /* 0x00 */ char pad_0[0x1E];
    /* 0x1E */ s16 sp1E;                            /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80AD0B38 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80AD0E10 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80AD10FC {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80AD1398 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80AD144C {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ u32 sp1C;                            /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80AD14C8 {
    /* 0x00 */ char pad_0[0x26];
    /* 0x26 */ s16 sp26;                            /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80AD1634 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80AD16A8 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ s16 *sp24;                           /* inferred */
    /* 0x28 */ u32 sp28;                            /* inferred */
    /* 0x2C */ char pad_2C[0x4];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80AD19A0 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80AD1A4C {};              /* size 0x0 */

struct _mips2c_stack_func_80AD1DA8 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80AD1E28 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ s32 *sp24;                           /* inferred */
    /* 0x28 */ s16 sp28;                            /* inferred */
    /* 0x2A */ s16 sp2A;                            /* inferred */
    /* 0x2C */ s16 sp2C;                            /* inferred */
    /* 0x2E */ char pad_2E[0x2];
    /* 0x30 */ ? sp30;                              /* inferred */
    /* 0x30 */ char pad_30[0x10];
};                                                  /* size = 0x40 */

void func_80AD0830(EnOsn *arg0, GlobalContext *arg1); /* static */
u16 func_80AD08B0(GlobalContext *arg0, Actor *, u16); /* static */
void func_80AD0998(Actor *arg0);                    /* static */
void func_80AD0A24(Actor *arg0);                    /* static */
void func_80AD0AB0(Actor *arg0);                    /* static */
s16 func_80AD0B38(Actor *arg0, GlobalContext *arg1, SaveContext *, Actor *); /* static */
s16 func_80AD0E10(Actor *arg0, GlobalContext *arg1); /* static */
void func_80AD10FC(Actor *arg0, GlobalContext *arg1, Actor *); /* static */
void func_80AD1398(EnOsn *arg0, GlobalContext *);   /* static */
void func_80AD144C(Actor *arg0, GlobalContext *arg1); /* static */
void func_80AD14C8(Actor *arg0, GlobalContext *arg1); /* static */
void func_80AD1634(Actor *arg0, GlobalContext *arg1); /* static */
void func_80AD16A8(Actor *arg0, GlobalContext *arg1); /* static */
