s32 func_800C5650(s32, Vec3f *, Vec3f *, f32 *, void *, s32, s32, s32, s32, ? *, ObjBean *); /* extern */
s32 func_800FE9B4(GlobalContext *);                 /* extern */
void func_80936CF0(Actor *arg0, GlobalContext *arg1); /* static */
s32 func_80936D58(ObjBean *arg0, GlobalContext *arg1); /* static */
void func_80936F04(Actor *arg0);                    /* static */
void func_80936F24(DynaPolyActor *arg0);            /* static */
void func_80937130(Actor *arg0);                    /* static */
void func_80937160(Actor *arg0);                    /* static */
void func_80937238(ObjBean *arg0);                  /* static */
void func_80937268(ObjBean *arg0, GlobalContext *arg1); /* static */
void func_809372A8(ObjBean *arg0);                  /* static */
void func_809372D0(ObjBean *arg0);                  /* static */
s32 func_80937468(Actor *arg0, GlobalContext *arg1); /* static */
Actor *func_809374F8(Actor *arg0, GlobalContext *arg1); /* static */
void func_809375C8(Actor *, GlobalContext *);       /* static */
void func_809375F4(ObjBean *arg0, GlobalContext *arg1); /* static */
void func_80937B54(Actor *arg0);                    /* static */
void func_80937C10(ObjBean *arg0);                  /* static */
void func_80937C24(s32 arg0);                       /* static */
void func_80937C30(Actor *arg0);                    /* static */
void func_80937CA0(void *arg0);                     /* static */
void func_80937CE4(void *arg0);                     /* static */

void func_809381C4(Actor *arg0, GlobalContext *arg1); /* static */
void func_80938284(Actor *arg0);                    /* static */
void func_80938298(Actor *arg0, GlobalContext *arg1); /* static */
void func_8093833C(Actor *arg0);                    /* static */
void func_80938358(Actor *arg0, ? arg1);            /* static */
void func_809383B4(Actor *arg0);                    /* static */
void func_809383D0(void *arg0, ? arg1);             /* static */
void func_80938408(Actor *arg0);                    /* static */
void func_80938444(Actor *arg0, ? arg1);            /* static */
void func_809384E8(Actor *arg0);                    /* static */
void func_80938504(void *arg0, ? arg1);             /* static */
void func_80938588(void *arg0, void *);             /* static */
void func_809385A8(Actor *arg0, ? arg1);            /* static */
void func_80938670(Actor *arg0);                    /* static */
void func_8093868C(Actor *arg0, ? arg1);            /* static */
void func_80938704(ObjBean *arg0);                  /* static */
void func_80938728(ObjBean *arg0, GlobalContext *arg1); /* static */
void func_8093876C(ObjBean *arg0);                  /* static */
void func_80938780(Actor *arg0, GlobalContext *arg1); /* static */
void func_80938804(ObjBean *arg0);                  /* static */
void func_80938834(DynaPolyActor *arg0, GlobalContext *arg1); /* static */
void func_80938874(DynaPolyActor *arg0);            /* static */
void func_809388A8(ObjBean *arg0, GlobalContext *arg1); /* static */
void func_8093892C(ObjBean *arg0);                  /* static */
void func_80938958(DynaPolyActor *arg0, GlobalContext *arg1); /* static */
void func_80938998(ObjBean *arg0);                  /* static */
void func_809389BC(DynaPolyActor *arg0, GlobalContext *arg1); /* static */
void func_80938A14(DynaPolyActor *arg0);            /* static */
void func_80938A5C(Actor *arg0);                    /* static */
void func_80938AA4(Actor *arg0);                    /* static */
void func_80938AD8(Actor *arg0, GlobalContext *arg1); /* static */
void func_80938C1C(Actor *this, GlobalContext *globalCtx); /* static */
void func_80938E00(Actor *this, GlobalContext *globalCtx); /* static */
void func_80938F50(Actor *this, GlobalContext *globalCtx); /* static */
extern ? D_06000090;
extern ? D_060002D0;
extern CollisionHeader D_060004BC;
extern ? D_06000530;
extern Gfx D_06002208;
static ColliderCylinderInit D_80938FA0 = {
    {0xA, 0, 0, 9, 0x20, 1},
    {0, {0, 0, 0}, {0, 0, 0}, 0, 0, 1},
    {0x40, 0x1E, 0xFFE1, {0, 0, 0}},
};
static ColliderCylinderInit D_80938FCC = {
    {0xA, 0, 0x21, 0, 0x20, 1},
    {0, {0, 0, 0}, {0xF7CFFFFF, 0, 0}, 0, 1, 0},
    {0xA, 0xA, 0, {0, 0, 0}},
};
static ? D_80938FF8;                                /* unable to generate initializer */
static Vec3f D_80939018 = {0.0f, 30.0f, 0.0f};
static ? D_80939024;                                /* unable to generate initializer */
static InitChainEntry D_8093902C;                   /* unable to generate initializer */

typedef struct ObjBean {
    /* 0x0000 */ Actor actor;
    /* 0x0144 */ s32 unk144;                        /* inferred */
    /* 0x0148 */ char pad148[0x14];                 /* maybe part of unk144[6]? */
    /* 0x015C */ void (*actionFunc)(ObjBean *, GlobalContext *);
    /* 0x0160 */ ColliderCylinder unk160;           /* inferred */
    /* 0x01AC */ char pad1AC[0x6];
    /* 0x01B2 */ s16 unk1B2;                        /* inferred */
    /* 0x01B4 */ s8 unk1B4;                         /* inferred */
    /* 0x01B5 */ char pad1B5[0x3];                  /* maybe part of unk1B4[4]? */
    /* 0x01B8 */ f32 unk1B8;                        /* inferred */
    /* 0x01BC */ f32 unk1BC;                        /* inferred */
    /* 0x01C0 */ f32 unk1C0;                        /* inferred */
    /* 0x01C4 */ f32 unk1C4;                        /* inferred */
    /* 0x01C8 */ char pad1C8[0x4];                  /* maybe part of unk1C4[2]? */
    /* 0x01CC */ f32 unk1CC;                        /* inferred */
    /* 0x01D0 */ f32 unk1D0;                        /* inferred */
    /* 0x01D4 */ void *unk1D4;                      /* inferred */
    /* 0x01D8 */ s16 unk1D8;                        /* inferred */
    /* 0x01DA */ s16 unk1DA;                        /* inferred */
    /* 0x01DC */ s16 unk1DC;                        /* inferred */
    /* 0x01DE */ s8 unk1DE;                         /* inferred */
    /* 0x01DF */ char pad1DF[0x9];                  /* maybe part of unk1DE[10]? */
    /* 0x01E8 */ void (*unk1E8)(s32);               /* inferred */
    /* 0x01EC */ char pad1EC[0x12];
    /* 0x01FE */ u8 unk1FE;                         /* inferred */
    /* 0x01FF */ char pad1FF[0x1];                  /* maybe part of unk1FE[2]? */
    /* 0x0200 */ u8 unk200;                         /* inferred */
    /* 0x0201 */ char pad201[0x3];                  /* maybe part of unk200[4]? */
} ObjBean;                                          /* size 0x204 */

void func_80936CF0(Actor *arg0, GlobalContext *arg1) {
    f32 sp2C;
    f32 sp28;
    f32 sp24;
    s32 sp20;
    Actor *temp_a3;
    CollisionPoly **temp_a1;
    f32 temp_f16;

    temp_a3 = arg0;
    sp24 = temp_a3->world.pos.x;
    temp_a1 = temp_a3 + 0x80;
    sp28 = temp_a3->world.pos.y + 29.999998f;
    temp_f16 = temp_a3->world.pos.z;
    arg0 = temp_a3;
    sp2C = temp_f16;
    arg0->floorHeight = func_800C411C(arg1 + 0x830, temp_a1, &sp20, temp_a3, (Vec3f *) &sp24);
}

s32 func_80936D58(ObjBean *arg0, GlobalContext *arg1) {
    ? spB8;
    Vec3f spAC;
    Vec3f spA0;
    Vec3f sp94;
    f32 sp88;
    MtxF sp48;
    Vec3f *sp44;
    CollisionPoly *temp_a0_2;
    Vec3f *temp_a0;

    Matrix_RotateY(arg0->actor.shape.rot.y, 0U);
    SysMatrix_InsertXRotation_s(arg0->actor.shape.rot.x, 1);
