typedef struct ObjBean {
    /* 0x000 */ Actor actor;
    /* 0x144 */ s32 unk_144;                        /* inferred */
    /* 0x148 */ char pad_148[0x14];                 /* maybe part of unk_144[6]? */
    /* 0x15C */ void (*actionFunc)(ObjBean *, GlobalContext *);
    /* 0x160 */ ColliderCylinder unk_160;           /* inferred */
    /* 0x1AC */ char pad_1AC[0x6];
    /* 0x1B2 */ s16 unk_1B2;                        /* inferred */
    /* 0x1B4 */ s8 unk_1B4;                         /* inferred */
    /* 0x1B5 */ char pad_1B5[0x3];                  /* maybe part of unk_1B4[4]? */
    /* 0x1B8 */ f32 unk_1B8;                        /* inferred */
    /* 0x1BC */ char pad_1BC[0x18];                 /* maybe part of unk_1B8[7]? */
    /* 0x1D4 */ void *unk_1D4;                      /* inferred */
    /* 0x1D8 */ char pad_1D8[0x6];                  /* maybe part of unk_1D4[2]? */
    /* 0x1DE */ s8 unk_1DE;                         /* inferred */
    /* 0x1DF */ char pad_1DF[0x1F];                 /* maybe part of unk_1DE[32]? */
    /* 0x1FE */ u8 unk_1FE;                         /* inferred */
    /* 0x1FF */ char pad_1FF[0x5];                  /* maybe part of unk_1FE[6]? */
} ObjBean;                                          /* size = 0x204 */

struct _mips2c_stack_ObjBean_Destroy {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_ObjBean_Init {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ ColliderCylinder *sp20;              /* inferred */
    /* 0x24 */ Path *sp24;                          /* inferred */
    /* 0x28 */ char pad_28[0x4];
    /* 0x2C */ s32 sp2C;                            /* inferred */
    /* 0x30 */ char pad_30[0x8];
};                                                  /* size = 0x38 */

struct _mips2c_stack_ObjBean_Update {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ ColliderCylinder *sp24;              /* inferred */
    /* 0x28 */ char pad_28[0x8];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80936CF0 {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ s32 sp20;                            /* inferred */
    /* 0x24 */ f32 sp24;                            /* inferred */
    /* 0x28 */ f32 sp28;                            /* inferred */
    /* 0x2C */ f32 sp2C;                            /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80936D58 {
    /* 0x00 */ char pad_0[0x44];
    /* 0x44 */ Vec3f *sp44;                         /* inferred */
    /* 0x48 */ ? sp48;                              /* inferred */
    /* 0x48 */ char pad_48[0x40];
    /* 0x88 */ f32 sp88;                            /* inferred */
    /* 0x8C */ f32 sp8C;                            /* inferred */
    /* 0x90 */ f32 sp90;                            /* inferred */
    /* 0x94 */ ? sp94;                              /* inferred */
    /* 0x94 */ char pad_94[0xC];
    /* 0xA0 */ ? spA0;                              /* inferred */
    /* 0xA0 */ char pad_A0[0xC];
    /* 0xAC */ ? spAC;                              /* inferred */
    /* 0xAC */ char pad_AC[0xC];
    /* 0xB8 */ ? spB8;                              /* inferred */
    /* 0xB8 */ char pad_B8[0x8];
};                                                  /* size = 0xC0 */

struct _mips2c_stack_func_80936F04 {};              /* size 0x0 */

struct _mips2c_stack_func_80936F24 {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80937130 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80937160 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80937238 {};              /* size 0x0 */

struct _mips2c_stack_func_80937268 {};              /* size 0x0 */

struct _mips2c_stack_func_809372A8 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809372D0 {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ Vec3f *sp20;                         /* inferred */
    /* 0x24 */ char pad_24[0x4];
    /* 0x28 */ Vec3f *sp28;                         /* inferred */
    /* 0x2C */ char pad_2C[0x8];                    /* maybe part of sp28[3]? */
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ ? sp38;                              /* inferred */
    /* 0x38 */ char pad_38[0x10];
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_80937468 {
    /* 0x00 */ char pad_0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_809374F8 {
    /* 0x00 */ char pad_0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_809375C8 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809375F4 {
    /* 0x00 */ char pad_0[0xB8];
    /* 0xB8 */ f32 spB8;                            /* inferred */
    /* 0xBC */ f32 spBC;                            /* inferred */
    /* 0xC0 */ f32 spC0;                            /* inferred */
    /* 0xC4 */ f32 spC4;                            /* inferred */
    /* 0xC8 */ f32 spC8;                            /* inferred */
    /* 0xCC */ f32 spCC;                            /* inferred */
};                                                  /* size = 0xD0 */

struct _mips2c_stack_func_80937B54 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80937C10 {};              /* size 0x0 */

struct _mips2c_stack_func_80937C24 {};              /* size 0x0 */

struct _mips2c_stack_func_80937C30 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80937CA0 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80937CE4 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80937D54 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80937DD8 {};              /* size 0x0 */

struct _mips2c_stack_func_80937DEC {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ s32 sp20;                            /* inferred */
    /* 0x24 */ char pad_24[0x4];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80937FB0 {};              /* size 0x0 */

struct _mips2c_stack_func_80937FC8 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_809381B0 {};              /* size 0x0 */

struct _mips2c_stack_func_809381C4 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80938284 {};              /* size 0x0 */

struct _mips2c_stack_func_80938298 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_8093833C {};              /* size 0x0 */

struct _mips2c_stack_func_80938358 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809383B4 {};              /* size 0x0 */

struct _mips2c_stack_func_809383D0 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80938408 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80938444 {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ s32 sp20;                            /* inferred */
    /* 0x24 */ char pad_24[0x4];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_809384E8 {};              /* size 0x0 */

struct _mips2c_stack_func_80938504 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80938588 {};              /* size 0x0 */

struct _mips2c_stack_func_809385A8 {
    /* 0x00 */ char pad_0[0x22];
    /* 0x22 */ s16 sp22;                            /* inferred */
    /* 0x24 */ char pad_24[0x4];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80938670 {};              /* size 0x0 */

struct _mips2c_stack_func_8093868C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80938704 {};              /* size 0x0 */

struct _mips2c_stack_func_80938728 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8093876C {};              /* size 0x0 */

struct _mips2c_stack_func_80938780 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80938804 {};              /* size 0x0 */

struct _mips2c_stack_func_80938834 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80938874 {};              /* size 0x0 */

struct _mips2c_stack_func_809388A8 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_8093892C {};              /* size 0x0 */

struct _mips2c_stack_func_80938958 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80938998 {};              /* size 0x0 */

struct _mips2c_stack_func_809389BC {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80938A14 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80938A5C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80938AA4 {};              /* size 0x0 */

struct _mips2c_stack_func_80938AD8 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ f32 sp24;                            /* inferred */
    /* 0x28 */ f32 sp28;                            /* inferred */
    /* 0x2C */ Actor *sp2C;                         /* inferred */
    /* 0x30 */ s32 sp30;                            /* inferred */
    /* 0x34 */ char pad_34[0x4];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80938C1C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80938E00 {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ Gfx *sp20;                           /* inferred */
    /* 0x24 */ char pad_24[0xC];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80938F50 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

s32 func_800C5650(s32, ? *, ? *, f32 *, void *, s32, s32, s32, s32, ? *, ObjBean *); /* extern */
s32 func_800FE9B4(GlobalContext *);                 /* extern */
void func_80936CF0(Actor *arg0, GlobalContext *arg1); /* static */
s32 func_80936D58(ObjBean *arg0, GlobalContext *arg1); /* static */
void func_80936F04(Actor *arg0);                    /* static */
void func_80936F24(DynaPolyActor *arg0);            /* static */
void func_80937130(Actor *arg0);                    /* static */
void func_80937160(Actor *arg0);                    /* static */
void func_80937238(ObjBean *arg0);                  /* static */
void func_80937268(ObjBean *arg0, GlobalContext *arg1); /* static */
void func_809372A8(ObjBean *arg0);                  /* static */
void func_809372D0(ObjBean *arg0);                  /* static */
s32 func_80937468(Actor *arg0, GlobalContext *arg1); /* static */
