typedef struct EnSth {
    /* 0x000 */ Actor actor;
    /* 0x144 */ ColliderCylinder unk144;            /* inferred */
    /* 0x190 */ SkelAnime unk190;                   /* inferred */
    /* 0x1D4 */ Vec3s unk1D4;                       /* inferred */
    /* 0x1DA */ char pad1DA[0x5A];                  /* maybe part of unk1D4[16]? */
    /* 0x234 */ Vec3s unk234;                       /* inferred */
    /* 0x23A */ char pad23A[0x60];                  /* maybe part of unk234[17]? */
    /* 0x29A */ s16 unk29A;                         /* inferred */
    /* 0x29C */ u16 unk29C;                         /* inferred */
    /* 0x29E */ u8 unk29E;                          /* inferred */
    /* 0x29F */ s8 unk29F;                          /* inferred */
    /* 0x2A0 */ void (*unk2A0)(Actor *, GlobalContext *); /* inferred */
} EnSth;                                            /* size = 0x2A4 */

struct _mips2c_stack_EnSth_Destroy {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnSth_Init {
    /* 0x00 */ char pad0[0x20];
    /* 0x20 */ ObjectContext *sp20;                 /* inferred */
    /* 0x24 */ char pad24[0xC];
};                                                  /* size = 0x30 */

struct _mips2c_stack_EnSth_Update {
    /* 0x00 */ char pad0[0x30];
    /* 0x30 */ SkelAnime *sp30;                     /* inferred */
    /* 0x34 */ char pad34[0xC];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80B6703C {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B670A4 {
    /* 0x00 */ char pad0[0x30];
    /* 0x30 */ AnimationHeaderCommon **sp30;        /* inferred */
    /* 0x34 */ char pad34[0x4];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80B67148 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B671A0 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B67208 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80B672A4 {
    /* 0x00 */ char pad0[0x1E];
    /* 0x1E */ u16 sp1E;                            /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80B67348 {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80B67458 {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80B67540 {
    /* 0x00 */ char pad0[0x2C];
    /* 0x2C */ s32 sp2C;                            /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80B677BC {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80B67838 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B678A8 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80B67958 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B67984 {
    /* 0x00 */ char pad0[0x1E];
    /* 0x1E */ u16 sp1E;                            /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80B67AB4 {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80B67B50 {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80B67C1C {
    /* 0x00 */ char pad0[0x18];
    /* 0x18 */ void *sp18;                          /* inferred */
    /* 0x1C */ char pad1C[0x4];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80B67DA0 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80B67E20 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B680A8 {
    /* 0x00 */ char pad0[0x34];
    /* 0x34 */ Actor *sp34;                         /* inferred */
    /* 0x38 */ s16 sp38;                            /* inferred */
    /* 0x3A */ s16 sp3A;                            /* inferred */
    /* 0x3C */ s16 sp3C;                            /* inferred */
    /* 0x3E */ char pad3E[0xA];
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_80B681E8 {
    /* 0x00 */ char pad0[0x18];
    /* 0x18 */ s32 sp18;                            /* inferred */
    /* 0x1C */ char pad1C[0xC];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80B68310 {
    /* 0x00 */ char pad0[0x18];
    /* 0x18 */ Gfx *sp18;                           /* inferred */
    /* 0x1C */ char pad1C[0x4];
    /* 0x20 */ GraphicsContext *sp20;               /* inferred */
    /* 0x24 */ char pad24[0x14];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80B6849C {
    /* 0x00 */ char pad0[0x28];
    /* 0x28 */ Gfx *sp28;                           /* inferred */
    /* 0x2C */ Gfx *sp2C;                           /* inferred */
    /* 0x30 */ char pad30[0x4];
    /* 0x34 */ GraphicsContext *sp34;               /* inferred */
    /* 0x38 */ char pad38[0x8];
};                                                  /* size = 0x40 */

s32 func_80B6703C(Actor *arg0, GlobalContext *arg1); /* static */
void func_80B670A4(Actor *arg0, s16 arg1, Actor *, u16); /* static */
void func_80B67148(Actor *arg0, GlobalContext *arg1); /* static */
void func_80B671A0(void *arg0, GlobalContext *arg1); /* static */
void func_80B67208(Actor *arg0, GlobalContext *arg1); /* static */
void func_80B672A4(Actor *arg0, GlobalContext *arg1); /* static */
void func_80B67348(Actor *arg0, GlobalContext *arg1); /* static */
void func_80B67458(Actor *arg0, GlobalContext *arg1); /* static */
void func_80B67540(Actor *arg0, GlobalContext *arg1); /* static */
void func_80B677BC(Actor *arg0, GlobalContext *arg1); /* static */
void func_80B67838(void *arg0, GlobalContext *arg1); /* static */
void func_80B678A8(Actor *arg0, GlobalContext *arg1); /* static */
void func_80B67958(Actor *arg0, GlobalContext *arg1); /* static */
