struct _mips2c_stack_func_8018B0F0 {};              /* size 0x0 */

struct _mips2c_stack_func_8018B10C {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_8018B250 {};              /* size 0x0 */

struct _mips2c_stack_func_8018B318 {
    /* 0x00 */ char pad0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_8018B3FC {};              /* size 0x0 */

struct _mips2c_stack_func_8018B474 {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_8018B4F8 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8018B520 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8018B578 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8018B5D0 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8018B608 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8018B640 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8018B69C {
    /* 0x00 */ char pad0[0x1C];
    /* 0x1C */ s32 sp1C;                            /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_8018B6E8 {};              /* size 0x0 */

struct _mips2c_stack_func_8018B740 {};              /* size 0x0 */

struct _mips2c_stack_func_8018B768 {};              /* size 0x0 */

struct _mips2c_stack_func_8018B77C {};              /* size 0x0 */

struct _mips2c_stack_func_8018B7AC {};              /* size 0x0 */

struct _mips2c_stack_func_8018B7BC {
    /* 0x00 */ char pad0[0x1C];
    /* 0x1C */ ? *sp1C;                             /* inferred */
    /* 0x20 */ char pad20[0xC];                     /* maybe part of sp1C[4]? */
    /* 0x2C */ u32 *sp2C;                           /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_8018B8FC {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8018B95C {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8018B9E0 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8018BA64 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_8018BB28 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_8018BBEC {
    /* 0x00 */ char pad0[0x20];
    /* 0x20 */ void *sp20;                          /* inferred */
    /* 0x24 */ s32 *sp24;                           /* inferred */
    /* 0x28 */ char pad28[0x4];
    /* 0x2C */ s32 sp2C;                            /* inferred */
    /* 0x30 */ ? *sp30;                             /* inferred */
    /* 0x34 */ char pad34[0x6];                     /* maybe part of sp30[2]? */
    /* 0x3A */ u8 sp3A;                             /* inferred */
    /* 0x3B */ u8 sp3B;                             /* inferred */
    /* 0x3C */ char pad3C[0x10];                    /* maybe part of sp3B[17]? */
    /* 0x4C */ u32 *sp4C;                           /* inferred */
};                                                  /* size = 0x50 */

struct _mips2c_stack_func_8018C380 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8018C3D8 {
    /* 0x00 */ char pad0[0x18];
    /* 0x18 */ u32 *sp18;                           /* inferred */
    /* 0x1C */ char pad1C[0x4];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_8018C4E4 {
    /* 0x00 */ char pad0[0xC];
    /* 0x0C */ f32 spC;                             /* inferred */
    /* 0x10 */ f32 sp10;                            /* inferred */
    /* 0x14 */ ? sp14;                              /* inferred */
    /* 0x14 */ char pad14[0x18];
    /* 0x2C */ f32 sp2C;                            /* inferred */
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ char pad34[0x18];                    /* maybe part of sp30[7]? */
    /* 0x4C */ ? sp4C;                              /* inferred */
    /* 0x4C */ char pad4C[0x4];
};                                                  /* size = 0x50 */

struct _mips2c_stack_func_8018C8B8 {};              /* size 0x0 */

struct _mips2c_stack_func_8018C8E8 {};              /* size 0x0 */

struct _mips2c_stack_func_8018C93C {};              /* size 0x0 */

struct _mips2c_stack_func_8018C994 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8018CB70 {};              /* size 0x0 */

struct _mips2c_stack_func_8018CB78 {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_8018CC3C {};              /* size 0x0 */

struct _mips2c_stack_func_8018CCA8 {
    /* 0x00 */ char pad0[0x24];
    /* 0x24 */ s32 sp24;                            /* inferred */
    /* 0x28 */ char pad28[0x4];
    /* 0x2C */ s32 sp2C;                            /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_8018CFAC {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_8018D57C {};              /* size 0x0 */

struct _mips2c_stack_func_8018D5D4 {
    /* 0x00 */ char pad0[0x18];
    /* 0x18 */ s32 sp18;                            /* inferred */
    /* 0x1C */ char pad1C[0x4];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_8018D658 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8018D6C8 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8018D760 {
    /* 0x00 */ char pad0[0x28];
    /* 0x28 */ s32 sp28;                            /* inferred */
    /* 0x2C */ s32 sp2C;                            /* inferred */
    /* 0x30 */ char pad30[0x8];                     /* maybe part of sp2C[3]? */
    /* 0x38 */ u32 sp38;                            /* inferred */
    /* 0x3C */ char pad3C[0x8];                     /* maybe part of sp38[3]? */
    /* 0x44 */ u32 sp44;                            /* inferred */
    /* 0x48 */ char pad48[0x8];
};                                                  /* size = 0x50 */

struct _mips2c_stack_func_8018DA50 {
    /* 0x00 */ char pad0[0x38];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_8018DBC4 {
    /* 0x00 */ char pad0[0x38];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_8018DCB4 {};              /* size 0x0 */

struct _mips2c_stack_func_8018DCF8 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8018DD98 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8018DDD4 {
    /* 0x00 */ char pad0[0x40];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_8018DF24 {};              /* size 0x0 */

struct _mips2c_stack_func_8018DFE0 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8018E00C {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8018E03C {
    /* 0x00 */ char pad0[0x78];
    /* 0x78 */ u32 sp78;                            /* inferred */
    /* 0x7C */ u32 sp7C;                            /* inferred */
    /* 0x80 */ s32 sp80;                            /* inferred */
    /* 0x84 */ s8 sp84;                             /* inferred */
    /* 0x85 */ char pad85[0xF];                     /* maybe part of sp84[16]? */
    /* 0x94 */ s32 sp94;                            /* inferred */
    /* 0x98 */ char pad98[0x8];
};                                                  /* size = 0xA0 */

struct _mips2c_stack_func_8018E2A8 {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_8018E344 {
    /* 0x00 */ char pad0[0x1C];
    /* 0x1C */ void *sp1C;                          /* inferred */
    /* 0x20 */ char pad20[0x8];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_8018E8C8 {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

? func_8018EF88(s32);                               /* extern */
s32 func_8018F220(s32);                             /* extern */
? func_8018F388(s16, ?, s16, s32 *);                /* extern */
? func_80190F50();                                  /* extern */
? func_80191568();                                  /* extern */
? func_80192990();                                  /* extern */
? func_80192BAC();                                  /* extern */
? func_80194750();                                  /* extern */
? func_80194F20(void *);                            /* extern */
void *func_80195508(s32, s32);                      /* extern */
void *func_801955DC(s32, s32);                      /* extern */
void **func_801956C0(s32, s32);                     /* extern */
? func_80195E3C();                                  /* extern */
