struct _mips2c_stack_func_801877D0 {};              /* size 0x0 */

struct _mips2c_stack_func_80187B64 {};              /* size 0x0 */

struct _mips2c_stack_func_80187BEC {
    /* 0x00 */ char pad_0[0x40];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80187DE8 {};              /* size 0x0 */

struct _mips2c_stack_func_80187E58 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ void *sp24;                          /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80187F00 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ void *sp24;                          /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80187FA8 {};              /* size 0x0 */

struct _mips2c_stack_func_80187FB0 {};              /* size 0x0 */

struct _mips2c_stack_func_80187FD0 {};              /* size 0x0 */

struct _mips2c_stack_func_80187FD8 {};              /* size 0x0 */

struct _mips2c_stack_func_80187FE0 {};              /* size 0x0 */

struct _mips2c_stack_func_80187FE8 {};              /* size 0x0 */

struct _mips2c_stack_func_8018801C {};              /* size 0x0 */

struct _mips2c_stack_func_80188024 {};              /* size 0x0 */

struct _mips2c_stack_func_8018802C {};              /* size 0x0 */

struct _mips2c_stack_func_80188034 {};              /* size 0x0 */

struct _mips2c_stack_func_80188068 {};              /* size 0x0 */

struct _mips2c_stack_func_80188070 {};              /* size 0x0 */

struct _mips2c_stack_func_80188078 {};              /* size 0x0 */

struct _mips2c_stack_func_801880A4 {};              /* size 0x0 */

struct _mips2c_stack_func_801880AC {};              /* size 0x0 */

struct _mips2c_stack_func_801880B4 {};              /* size 0x0 */

struct _mips2c_stack_func_801880BC {};              /* size 0x0 */

struct _mips2c_stack_func_801880C4 {};              /* size 0x0 */

struct _mips2c_stack_func_801880E8 {};              /* size 0x0 */

struct _mips2c_stack_func_8018811C {};              /* size 0x0 */

struct _mips2c_stack_func_80188124 {};              /* size 0x0 */

struct _mips2c_stack_func_8018814C {};              /* size 0x0 */

struct _mips2c_stack_func_80188174 {};              /* size 0x0 */

struct _mips2c_stack_func_80188190 {};              /* size 0x0 */

struct _mips2c_stack_func_80188198 {};              /* size 0x0 */

struct _mips2c_stack_func_801881A0 {};              /* size 0x0 */

struct _mips2c_stack_func_801881A8 {};              /* size 0x0 */

struct _mips2c_stack_func_801881C4 {};              /* size 0x0 */

struct _mips2c_stack_func_801881F8 {};              /* size 0x0 */

struct _mips2c_stack_func_80188224 {};              /* size 0x0 */

struct _mips2c_stack_func_8018822C {};              /* size 0x0 */

struct _mips2c_stack_func_80188234 {};              /* size 0x0 */

struct _mips2c_stack_func_8018823C {};              /* size 0x0 */

struct _mips2c_stack_func_80188244 {};              /* size 0x0 */

struct _mips2c_stack_func_8018824C {};              /* size 0x0 */

struct _mips2c_stack_func_80188254 {};              /* size 0x0 */

struct _mips2c_stack_func_8018825C {};              /* size 0x0 */

struct _mips2c_stack_func_80188264 {};              /* size 0x0 */

struct _mips2c_stack_func_80188288 {};              /* size 0x0 */

struct _mips2c_stack_func_801882A0 {};              /* size 0x0 */

struct _mips2c_stack_func_80188304 {
    /* 0x00 */ char pad_0[0x28];
    /* 0x28 */ s16 sp28;                            /* inferred */
    /* 0x2A */ s16 sp2A;                            /* inferred */
    /* 0x2C */ void *sp2C;                          /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_801884A0 {
    /* 0x00 */ char pad_0[0x28];
    /* 0x28 */ s32 sp28;                            /* inferred */
    /* 0x2C */ char pad_2C[0x24];
};                                                  /* size = 0x50 */

struct _mips2c_stack_func_80188698 {
    /* 0x00 */ char pad_0[0x28];
    /* 0x28 */ s16 sp28;                            /* inferred */
    /* 0x2A */ s16 sp2A;                            /* inferred */
    /* 0x2C */ void *sp2C;                          /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_8018883C {};              /* size 0x0 */

struct _mips2c_stack_func_801888E4 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ s32 sp1C;                            /* inferred */
    /* 0x20 */ char pad_20[0x4];
    /* 0x24 */ void *sp24;                          /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_801889A4 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ void *sp24;                          /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80188A50 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ void *sp24;                          /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80188AFC {};              /* size 0x0 */

struct _mips2c_stack_func_80188C48 {};              /* size 0x0 */

struct _mips2c_stack_func_80188CB4 {};              /* size 0x0 */

struct _mips2c_stack_func_80188D20 {};              /* size 0x0 */

struct _mips2c_stack_func_80188D28 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80188D68 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80188DDC {
    /* 0x00 */ char pad_0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80188FBC {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ void *sp24;                          /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80189064 {
    /* 0x00 */ char pad_0[0x5C];
    /* 0x5C */ void *sp5C;                          /* inferred */
    /* 0x60 */ char pad_60[0x1C];                   /* maybe part of sp5C[8]? */
    /* 0x7C */ s32 sp7C;                            /* inferred */
    /* 0x80 */ char pad_80[0xC];                    /* maybe part of sp7C[4]? */
    /* 0x8C */ s32 sp8C;                            /* inferred */
    /* 0x90 */ s32 sp90;                            /* inferred */
    /* 0x94 */ char pad_94[0x8];                    /* maybe part of sp90[3]? */
    /* 0x9C */ ? sp9C;                              /* inferred */
    /* 0x9C */ char pad_9C[0x5C];
};                                                  /* size = 0xF8 */

struct _mips2c_stack_func_80189620 {
    /* 0x000 */ char pad_0[0x50];
    /* 0x050 */ u32 sp50;                           /* inferred */
    /* 0x054 */ char pad_54[0x34];                  /* maybe part of sp50[14]? */
    /* 0x088 */ u32 sp88;                           /* inferred */
    /* 0x08C */ u32 sp8C;                           /* inferred */
    /* 0x090 */ char pad_90[0xC];                   /* maybe part of sp8C[4]? */
    /* 0x09C */ void *sp9C;                         /* inferred */
    /* 0x0A0 */ char pad_A0[0xE];                   /* maybe part of sp9C[4]? */
    /* 0x0AE */ u16 spAE;                           /* inferred */
    /* 0x0B0 */ s32 spB0;                           /* inferred */
    /* 0x0B4 */ char pad_B4[0x8];                   /* maybe part of spB0[3]? */
    /* 0x0BC */ s32 spBC;                           /* inferred */
    /* 0x0C0 */ s32 spC0;                           /* inferred */
    /* 0x0C4 */ char pad_C4[0x4];
    /* 0x0C8 */ s32 spC8;                           /* inferred */
    /* 0x0CC */ s32 spCC;                           /* inferred */
    /* 0x0D0 */ char pad_D0[0x4];
    /* 0x0D4 */ s32 spD4;                           /* inferred */
    /* 0x0D8 */ char pad_D8[0xC];                   /* maybe part of spD4[4]? */
    /* 0x0E4 */ s32 spE4;                           /* inferred */
    /* 0x0E8 */ s32 spE8;                           /* inferred */
    /* 0x0EC */ char pad_EC[0x10];                  /* maybe part of spE8[5]? */
    /* 0x0FC */ s32 spFC;                           /* inferred */
    /* 0x100 */ s32 sp100;                          /* inferred */
    /* 0x104 */ char pad_104[0xC];                  /* maybe part of sp100[4]? */
    /* 0x110 */ s32 sp110;                          /* inferred */
    /* 0x114 */ char pad_114[0xC];                  /* maybe part of sp110[4]? */
    /* 0x120 */ s32 sp120;                          /* inferred */
    /* 0x124 */ char pad_124[0xA];                  /* maybe part of sp120[3]? */
    /* 0x12E */ u16 sp12E;                          /* inferred */
    /* 0x130 */ s32 sp130;                          /* inferred */
    /* 0x134 */ s32 sp134;                          /* inferred */
    /* 0x138 */ s32 sp138;                          /* inferred */
    /* 0x13C */ char pad_13C[0x8];                  /* maybe part of sp138[3]? */
    /* 0x144 */ void *sp144;                        /* inferred */
    /* 0x148 */ void *sp148;                        /* inferred */
    /* 0x14C */ char pad_14C[0xC];
};                                                  /* size = 0x158 */

struct _mips2c_stack_func_8018A4B4 {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_8018A768 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_8018A808 {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ s32 sp2C;                            /* inferred */
    /* 0x30 */ char pad_30[0x4];
    /* 0x34 */ s32 sp34;                            /* inferred */
    /* 0x38 */ s32 sp38;                            /* inferred */
    /* 0x3C */ char pad_3C[0x1C];                   /* maybe part of sp38[8]? */
    /* 0x58 */ s16 sp58;                            /* inferred */
    /* 0x5A */ s16 sp5A;                            /* inferred */
    /* 0x5C */ s16 sp5C;                            /* inferred */
    /* 0x5E */ s16 sp5E;                            /* inferred */
    /* 0x60 */ char pad_60[0x2];
    /* 0x62 */ s16 sp62;                            /* inferred */
    /* 0x64 */ char pad_64[0xC];
};                                                  /* size = 0x70 */

struct _mips2c_stack_func_8018ACC4 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_8018AE34 {};              /* size 0x0 */

s32 func_8018EC4C(s32, s32, s32, void *, u32);      /* extern */
? func_8019AA3C(s32);                               /* extern */
void func_801877D0(s32 arg0, s32 arg1, s32 arg2);   /* static */
void func_80187B64(s32 arg0);                       /* static */
void *func_80187BEC(void *arg0, s32 *arg1, s32 arg2, s32 arg3); /* static */
void func_80187DE8(s32 arg0, s32 arg1);             /* static */
s32 *func_80187E58(void *arg1, s16 arg2, s32 *);    /* static */
s32 *func_80187F00(s32 *arg1, s16 arg2, s16, s32 *); /* static */
void func_80187FA8();                               /* static */
void func_80187FB0(s32 *arg0, s32 arg1, s32 arg2, s32); /* static */
void func_80187FD0();                               /* static */
void func_80187FD8();                               /* static */
