struct _mips2c_stack_func_801974D0 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80197538 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80197714 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80197880 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ void *sp1C;                          /* inferred */
    /* 0x20 */ char pad_20[0x8];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_801979D8 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80197A54 {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ void *sp18;                          /* inferred */
    /* 0x1C */ void *sp1C;                          /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80197AA4 {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80197B14 {};              /* size 0x0 */

struct _mips2c_stack_func_80197C0C {
    /* 0x00 */ char pad_0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80197C8C {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80197D24 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80197D4C {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80197E08 {};              /* size 0x0 */

struct _mips2c_stack_func_80197E48 {};              /* size 0x0 */

struct _mips2c_stack_func_80197E88 {
    /* 0x00 */ char pad_0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80197F28 {};              /* size 0x0 */

struct _mips2c_stack_func_80197F3C {};              /* size 0x0 */

struct _mips2c_stack_func_80197F74 {};              /* size 0x0 */

struct _mips2c_stack_func_80197FB4 {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_801980D0 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8019815C {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_8019825C {
    /* 0x00 */ char pad_0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80198640 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ void *sp1C;                          /* inferred */
    /* 0x20 */ s32 sp20;                            /* inferred */
    /* 0x24 */ char pad_24[0x1B];                   /* maybe part of sp20[7]? */
    /* 0x3F */ u8 sp3F;                             /* inferred */
    /* 0x40 */ void *sp40;                          /* inferred */
    /* 0x44 */ char pad_44[0x1C];                   /* maybe part of sp40[8]? */
    /* 0x60 */ void *sp60;                          /* inferred */
    /* 0x64 */ char pad_64[0x10];                   /* maybe part of sp60[5]? */
    /* 0x74 */ s32 sp74;                            /* inferred */
};                                                  /* size = 0x78 */

struct _mips2c_stack_func_80198CE0 {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ s32 sp18;                            /* inferred */
    /* 0x1C */ u8 **sp1C;                           /* inferred */
    /* 0x20 */ char pad_20[0xC];                    /* maybe part of sp1C[4]? */
    /* 0x2C */ void *sp2C;                          /* inferred */
    /* 0x30 */ void *sp30;                          /* inferred */
    /* 0x34 */ s32 sp34;                            /* inferred */
    /* 0x38 */ char pad_38[0x2];
    /* 0x3A */ s16 sp3A;                            /* inferred */
    /* 0x3C */ char pad_3C[0x4];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_801990F4 {};              /* size 0x0 */

struct _mips2c_stack_func_80199124 {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ s32 sp18;                            /* inferred */
    /* 0x1C */ char pad_1C[0x4];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80199198 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80199244 {};              /* size 0x0 */

struct _mips2c_stack_func_80199268 {
    /* 0x00 */ char pad_0[0x70];
    /* 0x70 */ u32 sp70;                            /* inferred */
    /* 0x74 */ u32 sp74;                            /* inferred */
    /* 0x78 */ char pad_78[0x3];
    /* 0x7B */ u8 sp7B;                             /* inferred */
    /* 0x7C */ char pad_7C[0x1C];
};                                                  /* size = 0x98 */

struct _mips2c_stack_func_8019A0BC {
    /* 0x00 */ char pad_0[0x28];
    /* 0x28 */ s32 sp28;                            /* inferred */
    /* 0x2C */ char pad_2C[0x42];                   /* maybe part of sp28[17]? */
    /* 0x6E */ u8 sp6E;                             /* inferred */
    /* 0x6F */ char pad_6F[0x1];
};                                                  /* size = 0x70 */

struct _mips2c_stack_func_8019AA3C {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_8019AAF0 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_8019AB40 {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_8019AC10 {
    /* 0x00 */ char pad_0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_8019ACEC {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8019ADBC {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

? *func_8018B640(? *, ?);                           /* extern */
s32 func_8018C380(?, ?, u8);                        /* extern */
? func_8018C994(s32, s32, s32);                     /* extern */
s32 func_8018F220(u8);                              /* extern */
s32 func_8018F298(u8);                              /* extern */
? func_8018F388(u8, ?);                             /* extern */
? func_8018F3B8(u8, ?);                             /* extern */
? func_8018FAD0(s32, u8, ?);                        /* extern */
s32 func_80190F64(u8, s8, void *);                  /* extern */
? func_80191460(s32, s32, void *);                  /* extern */
? func_80192AE8(u8, u8, void *);                    /* extern */
u16 func_80194668();                                /* extern */
? func_80194F84();                                  /* extern */
