struct _mips2c_stack_func_80194930 {
    /* 0x00 */ char pad0[0x20];
    /* 0x20 */ s32 sp20;                            /* inferred */
    /* 0x24 */ s32 sp24;                            /* inferred */
    /* 0x26 */ u8 sp26;                             /* overlap; inferred */
    /* 0x27 */ u8 sp27;                             /* inferred */
    /* 0x28 */ f32 sp28;                            /* inferred */
    /* 0x2C */ char pad2C[0x1C];
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_80194DB0 {};              /* size 0x0 */

struct _mips2c_stack_func_80194E60 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80194F20 {};              /* size 0x0 */

struct _mips2c_stack_func_80194F84 {
    /* 0x00 */ char pad0[0x60];
    /* 0x60 */ f32 sp60;                            /* inferred */
    /* 0x64 */ char pad64[0x3];
    /* 0x67 */ u8 sp67;                             /* inferred */
    /* 0x68 */ u8 sp68;                             /* inferred */
    /* 0x69 */ u8 sp69;                             /* inferred */
    /* 0x6A */ u8 sp6A;                             /* inferred */
    /* 0x6B */ u8 sp6B;                             /* inferred */
    /* 0x6C */ u8 sp6C;                             /* inferred */
    /* 0x6D */ char pad6D[0x3];                     /* maybe part of sp6C[4]? */
    /* 0x70 */ f32 sp70;                            /* inferred */
    /* 0x74 */ f32 sp74;                            /* inferred */
    /* 0x78 */ char pad78[0x4];
    /* 0x7C */ s32 sp7C;                            /* inferred */
    /* 0x80 */ u8 sp80;                             /* inferred */
    /* 0x81 */ char pad81[0x1];
    /* 0x82 */ u16 sp82;                            /* inferred */
    /* 0x84 */ char pad84[0xC];                     /* maybe part of sp82[7]? */
    /* 0x90 */ void *sp90;                          /* inferred */
    /* 0x94 */ char pad94[0xC];
};                                                  /* size = 0xA0 */

struct _mips2c_stack_func_801954CC {};              /* size 0x0 */

struct _mips2c_stack_func_80195508 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_801955DC {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_801956C0 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_801957B4 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_801958F8 {
    /* 0x00 */ char pad0[0x1C];
    /* 0x1C */ ? *sp1C;                             /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80195C40 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80195C60 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80195C80 {};              /* size 0x0 */

struct _mips2c_stack_func_80195D84 {
    /* 0x00 */ char pad0[0x1C];
    /* 0x1C */ s32 sp1C;                            /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80195DDC {};              /* size 0x0 */

struct _mips2c_stack_func_80195DEC {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80195E3C {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80195EE0 {
    /* 0x00 */ char pad0[0x40];
    /* 0x40 */ ? *sp40;                             /* inferred */
    /* 0x44 */ char pad44[0x4];
    /* 0x48 */ void *sp48;                          /* inferred */
    /* 0x4C */ char pad4C[0x4];
};                                                  /* size = 0x50 */

struct _mips2c_stack_func_80196040 {
    /* 0x00 */ char pad0[0x44];
    /* 0x44 */ ? *sp44;                             /* inferred */
    /* 0x48 */ ? *sp48;                             /* inferred */
    /* 0x4C */ char pad4C[0xC];
};                                                  /* size = 0x58 */

struct _mips2c_stack_func_8019617C {};              /* size 0x0 */

struct _mips2c_stack_func_801961BC {};              /* size 0x0 */

struct _mips2c_stack_func_801961E8 {};              /* size 0x0 */

struct _mips2c_stack_func_80196268 {
    /* 0x00 */ char pad0[0x1C];
    /* 0x1C */ void *sp1C;                          /* inferred */
    /* 0x20 */ char pad20[0xC];                     /* maybe part of sp1C[4]? */
    /* 0x2C */ void *sp2C;                          /* inferred */
    /* 0x30 */ char pad30[0x10];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_801963E8 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8019641C {};              /* size 0x0 */

struct _mips2c_stack_func_80196448 {
    /* 0x00 */ char pad0[0x1C];
    /* 0x1C */ ? *sp1C;                             /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80196494 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_801964F8 {
    /* 0x00 */ char pad0[0x24];
    /* 0x24 */ ? *sp24;                             /* inferred */
    /* 0x28 */ s32 sp28;                            /* inferred */
    /* 0x2C */ s32 sp2C;                            /* inferred */
    /* 0x30 */ char pad30[0x4];
    /* 0x34 */ ? *sp34;                             /* inferred */
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_801965F0 {
    /* 0x00 */ char pad0[0x24];
    /* 0x24 */ ? *sp24;                             /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_801968C4 {
    /* 0x00 */ char pad0[0x40];
};                                                  /* size = 0x40 */

s32 func_8018B5D0(? *, ?);                          /* extern */
s32 func_8018F220(s32);                             /* extern */
? func_80196FEC(? *);                               /* extern */
? func_80197048(? *);                               /* extern */
? func_80197138(? *);                               /* extern */
? func_80197164(void *, s32, void *, void *);       /* extern */
f32 func_80197188(void *);                          /* extern */
? func_80197AA4(void *, void *);                    /* extern */
? func_80197E08(? *, ? *);                          /* extern */
? *func_80197E48(? *);                              /* extern */
void func_80194930(? *arg0, void *arg1, u8 *arg2, u8); /* static */
void func_80194DB0(void *arg0, f32 arg1, void *);   /* static */
void func_80194E60(void *arg0);                     /* static */
