struct _mips2c_stack_func_801830A0 {};              /* size 0x0 */

struct _mips2c_stack_func_801830C8 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_801830E8 {};              /* size 0x0 */

struct _mips2c_stack_func_80183148 {};              /* size 0x0 */

struct _mips2c_stack_func_80183224 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ f32 sp1C;                            /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_801832B0 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ f32 sp1C;                            /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_8018332C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8018340C {};              /* size 0x0 */

struct _mips2c_stack_func_80183430 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_8018349C {};              /* size 0x0 */

struct _mips2c_stack_func_801834A8 {
    /* 0x00 */ char pad_0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80183510 {
    /* 0x00 */ char pad_0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80183580 {
    /* 0x00 */ char pad_0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_801835EC {
    /* 0x00 */ char pad_0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80183658 {
    /* 0x00 */ char pad_0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_801836CC {
    /* 0x00 */ char pad_0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_8018373C {
    /* 0x00 */ char pad_0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_801837CC {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80183808 {};              /* size 0x0 */

struct _mips2c_stack_func_80183880 {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80183A3C {
    /* 0x00 */ f32 sp0;                             /* inferred */
    /* 0x04 */ char pad_4[0x1C];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80183B08 {};              /* size 0x0 */

struct _mips2c_stack_func_80183B68 {
    /* 0x00 */ char pad_0[0x50];
};                                                  /* size = 0x50 */

struct _mips2c_stack_func_80183DE0 {
    /* 0x00 */ char pad_0[0x64];
    /* 0x64 */ void *sp64;                          /* inferred */
    /* 0x68 */ char pad_68[0xC];                    /* maybe part of sp64[4]? */
    /* 0x74 */ void *sp74;                          /* inferred */
    /* 0x78 */ void *sp78;                          /* inferred */
    /* 0x7C */ void *sp7C;                          /* inferred */
    /* 0x80 */ char pad_80[0x1C];                   /* maybe part of sp7C[8]? */
    /* 0x9C */ s32 sp9C;                            /* inferred */
};                                                  /* size = 0xA0 */

struct _mips2c_stack_func_8018410C {
    /* 0x00 */ char pad_0[0x6C];
    /* 0x6C */ void *sp6C;                          /* inferred */
    /* 0x70 */ char pad_70[0x4];
    /* 0x74 */ f32 sp74;                            /* inferred */
    /* 0x78 */ f32 sp78;                            /* inferred */
    /* 0x7C */ f32 sp7C;                            /* inferred */
    /* 0x80 */ s16 sp80;                            /* inferred */
    /* 0x82 */ s16 sp82;                            /* inferred */
    /* 0x84 */ s16 sp84;                            /* inferred */
    /* 0x86 */ char pad_86[0x2];
    /* 0x88 */ f32 sp88;                            /* inferred */
    /* 0x8C */ f32 sp8C;                            /* inferred */
    /* 0x90 */ f32 sp90;                            /* inferred */
    /* 0x94 */ char pad_94[0x3];
    /* 0x97 */ u8 sp97;                             /* inferred */
    /* 0x98 */ char pad_98[0x4];                    /* maybe part of sp97[5]? */
    /* 0x9C */ s32 sp9C;                            /* inferred */
    /* 0xA0 */ s32 spA0;                            /* inferred */
    /* 0xA4 */ char pad_A4[0x4];
};                                                  /* size = 0xA8 */

struct _mips2c_stack_func_8018450C {
    /* 0x00 */ char pad_0[0x3C];
    /* 0x3C */ s32 sp3C;                            /* inferred */
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_801845A4 {};              /* size 0x0 */

struct _mips2c_stack_func_801845C8 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_8018462C {};              /* size 0x0 */

struct _mips2c_stack_func_80184638 {
    /* 0x00 */ char pad_0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_801846AC {
    /* 0x00 */ char pad_0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80184728 {
    /* 0x00 */ char pad_0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_801847A0 {
    /* 0x00 */ char pad_0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80184818 {
    /* 0x00 */ char pad_0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80184898 {
    /* 0x00 */ char pad_0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80184914 {
    /* 0x00 */ char pad_0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_801849A0 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_801849DC {
    /* 0x00 */ char pad_0[0x50];
};                                                  /* size = 0x50 */

struct _mips2c_stack_func_80184C48 {
    /* 0x00 */ char pad_0[0x60];
    /* 0x60 */ void *sp60;                          /* inferred */
    /* 0x64 */ void *sp64;                          /* inferred */
    /* 0x68 */ void *sp68;                          /* inferred */
    /* 0x6C */ char pad_6C[0x10];                   /* maybe part of sp68[5]? */
    /* 0x7C */ void *sp7C;                          /* inferred */
    /* 0x80 */ char pad_80[0x4];
    /* 0x84 */ s32 sp84;                            /* inferred */
};                                                  /* size = 0x88 */

struct _mips2c_stack_func_801850A0 {
    /* 0x00 */ char pad_0[0x68];
    /* 0x68 */ f32 sp68;                            /* inferred */
    /* 0x6C */ f32 sp6C;                            /* inferred */
    /* 0x70 */ f32 sp70;                            /* inferred */
    /* 0x74 */ char pad_74[0x4];
    /* 0x78 */ s16 sp78;                            /* inferred */
    /* 0x7A */ s16 sp7A;                            /* inferred */
    /* 0x7C */ s16 sp7C;                            /* inferred */
    /* 0x7E */ char pad_7E[0x1];
    /* 0x7F */ u8 sp7F;                             /* inferred */
    /* 0x80 */ char pad_80[0x4];                    /* maybe part of sp7F[5]? */
    /* 0x84 */ s32 sp84;                            /* inferred */
    /* 0x88 */ char pad_88[0x8];
};                                                  /* size = 0x90 */

struct _mips2c_stack_func_801853C8 {
    /* 0x00 */ char pad_0[0x3C];
    /* 0x3C */ s32 sp3C;                            /* inferred */
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80185460 {
    /* 0x00 */ char pad_0[0x40];
    /* 0x40 */ void *sp40;                          /* inferred */
    /* 0x44 */ s32 sp44;                            /* inferred */
    /* 0x48 */ s32 sp48;                            /* inferred */
    /* 0x4C */ char pad_4C[0xC];                    /* maybe part of sp48[4]? */
    /* 0x58 */ void *sp58;                          /* inferred */
    /* 0x5C */ void *sp5C;                          /* inferred */
    /* 0x60 */ char pad_60[0x18];                   /* maybe part of sp5C[7]? */
    /* 0x78 */ s32 sp78;                            /* inferred */
    /* 0x7C */ char pad_7C[0x4];
};                                                  /* size = 0x80 */

f64 func_80086D24(f64);                             /* extern */
void func_801830A0(void *arg0);                     /* static */
void func_801830C8(void *);                         /* static */
void func_801830E8(void *arg0, ?32 arg1, f32 arg2, f32 arg3, ?32 arg4, ?32 arg5, s32 arg6); /* static */
s32 func_80183148(void *arg0, f32 arg1, f32 *arg2); /* static */
s32 func_80183224(void *arg0);                      /* static */
s32 func_801832B0(void *arg0);                      /* static */
s32 func_8018332C(void *arg0);                      /* static */
void func_8018340C(void *arg0);                     /* static */
void func_80183430(void *arg0, void *arg1, void *arg2, s32 arg3, s32 arg4, s32 arg5); /* static */
void func_8018349C(s32 arg0);                       /* static */
void func_801834A8(void *arg0, void *arg1);         /* static */
