CRASHED

struct _mips2c_stack_func_801A7D04 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_801A7D84 {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ u8 *sp2C;                            /* inferred */
    /* 0x30 */ char pad_30[0x4];
    /* 0x34 */ s32 sp34;                            /* inferred */
    /* 0x38 */ s32 sp38;                            /* inferred */
    /* 0x3C */ s32 sp3C;                            /* inferred */
    /* 0x40 */ void *sp40;                          /* inferred */
    /* 0x44 */ u32 sp44;                            /* inferred */
    /* 0x48 */ char pad_48[0x4];
    /* 0x4C */ ? sp4C;                              /* inferred */
    /* 0x4C */ char pad_4C[0x15];
    /* 0x61 */ u8 sp61;                             /* inferred */
    /* 0x62 */ char pad_62[0xE];
};                                                  /* size = 0x70 */

struct _mips2c_stack_func_801A89A8 {};              /* size 0x0 */

struct _mips2c_stack_func_801A89D0 {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_801A8A50 {};              /* size 0x0 */

struct _mips2c_stack_func_801A8ABC {};              /* size 0x0 */

struct _mips2c_stack_func_801A8B14 {};              /* size 0x0 */

struct _mips2c_stack_func_801A8B2C {};              /* size 0x0 */

struct _mips2c_stack_func_801A8BD0 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_801A8D5C {
    /* 0x00 */ char pad_0[0x70];
    /* 0x70 */ ? sp70;                              /* inferred */
    /* 0x70 */ char pad_70[0x20];
};                                                  /* size = 0x90 */

struct _mips2c_stack_func_801A9768 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_801A982C {
    /* 0x00 */ char pad_0[0x37];
    /* 0x37 */ u8 sp37;                             /* inferred */
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_801A99B8 {};              /* size 0x0 */

struct _mips2c_stack_func_801A9A74 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_801A9B10 {};              /* size 0x0 */

struct _mips2c_stack_func_801A9B78 {
    /* 0x0 */ char pad_0[0x4];
    /* 0x4 */ s32 sp4;                              /* inferred */
};                                                  /* size = 0x8 */

struct _mips2c_stack_func_801A9C68 {
    /* 0x0 */ char pad_0[0x4];
    /* 0x4 */ s32 sp4;                              /* inferred */
};                                                  /* size = 0x8 */

struct _mips2c_stack_func_801A9D10 {
    /* 0x00 */ char pad_0[0x1E];
    /* 0x1E */ s16 sp1E;                            /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_801A9DCC {
    /* 0x00 */ char pad_0[0x40];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_801A9EA4 {
    /* 0x00 */ char pad_0[0x8];
    /* 0x08 */ s32 sp8;                             /* inferred */
    /* 0x0C */ s32 spC;                             /* inferred */
};                                                  /* size = 0x10 */

struct _mips2c_stack_func_801A9F4C {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ s16 sp2C;                            /* inferred */
    /* 0x2E */ char pad_2E[0x1];
    /* 0x2F */ u8 sp2F;                             /* inferred */
};                                                  /* size = 0x30 */

? func_80193858(s32, f32, s32);                     /* extern */
? func_8019387C(s32, s32, s32);                     /* extern */
? func_801938A0(s32, s8, s32);                      /* extern */
? func_801938D0(s32, s32, s32);                     /* extern */
? func_80193900();                                  /* extern */
s32 func_80193BA0(? *);                             /* extern */
u8 *func_80193C04(u32, ? *, s32, u32);              /* extern */
s32 func_80193C5C();                                /* extern */
? func_80193D08(u8, s32);                           /* extern */
? func_801A4D50();                                  /* extern */
? func_801A4DA4();                                  /* extern */
? func_801A4DF4(u8);                                /* extern */
? func_801A7B10(u8, u8, s32, u32);                  /* static */
