struct _mips2c_stack_func_801A5BD0 {};              /* size 0x0 */

struct _mips2c_stack_func_801A5C28 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_801A5C8C {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_801A5CFC {
    /* 0x0 */ char pad0[0x4];
    /* 0x4 */ s32 sp4;                              /* inferred */
};                                                  /* size = 0x8 */

struct _mips2c_stack_func_801A5DDC {};              /* size 0x0 */

struct _mips2c_stack_func_801A5F7C {
    /* 0x00 */ char pad0[0x30];
    /* 0x30 */ s32 sp30;                            /* inferred */
    /* 0x34 */ char pad34[0x4];
    /* 0x38 */ void **sp38;                         /* inferred */
    /* 0x3C */ char pad3C[0x7];                     /* maybe part of sp38[2]? */
    /* 0x43 */ u8 sp43;                             /* inferred */
    /* 0x44 */ char pad44[0x4];                     /* maybe part of sp43[5]? */
    /* 0x48 */ void *sp48;                          /* inferred */
    /* 0x4C */ char pad4C[0x4];
    /* 0x50 */ s801FE7C0 *sp50;                     /* inferred */
    /* 0x54 */ char pad54[0x1];
    /* 0x55 */ u8 sp55;                             /* inferred */
    /* 0x56 */ char pad56[0x2];
};                                                  /* size = 0x58 */

struct _mips2c_stack_func_801A6430 {
    /* 0x00 */ char pad0[0x24];
    /* 0x24 */ void **sp24;                         /* inferred */
    /* 0x28 */ char pad28[0x4];
    /* 0x2C */ void *sp2C;                          /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_801A65C8 {
    /* 0x00 */ char pad0[0x48];
    /* 0x48 */ s32 sp48;                            /* inferred */
    /* 0x4C */ char pad4C[0xC];                     /* maybe part of sp48[4]? */
    /* 0x58 */ s32 sp58;                            /* inferred */
    /* 0x5C */ char pad5C[0x10];                    /* maybe part of sp58[5]? */
    /* 0x6C */ ? sp6C;                              /* inferred */
    /* 0x6C */ char pad6C[0x18];
    /* 0x84 */ void *sp84;                          /* inferred */
    /* 0x88 */ char pad88[0xC];                     /* maybe part of sp84[4]? */
    /* 0x94 */ u8 sp94;                             /* inferred */
    /* 0x95 */ char pad95[0x1];
    /* 0x96 */ u8 sp96;                             /* inferred */
    /* 0x97 */ char pad97[0x1];
};                                                  /* size = 0x98 */

struct _mips2c_stack_func_801A6D0C {
    /* 0x00 */ char pad0[0x44];
    /* 0x44 */ void *sp44;                          /* inferred */
    /* 0x48 */ char pad48[0x18];
};                                                  /* size = 0x60 */

struct _mips2c_stack_func_801A7084 {
    /* 0x00 */ char pad0[0x48];
    /* 0x48 */ Vec3f *sp48;                         /* inferred */
    /* 0x4C */ char pad4C[0x1E];                    /* maybe part of sp48[8]? */
    /* 0x6A */ s16 sp6A;                            /* inferred */
    /* 0x6C */ char pad6C[0x14];
};                                                  /* size = 0x80 */

struct _mips2c_stack_func_801A7168 {
    /* 0x00 */ char pad0[0x40];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_801A7284 {
    /* 0x00 */ char pad0[0x18];
    /* 0x18 */ Vec3f *sp18;                         /* inferred */
    /* 0x1C */ char pad1C[0x1E];                    /* maybe part of sp18[8]? */
    /* 0x3A */ s16 sp3A;                            /* inferred */
    /* 0x3C */ char pad3C[0xC];
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_801A72CC {
    /* 0x00 */ char pad0[0x24];
    /* 0x24 */ Vec3f *sp24;                         /* inferred */
    /* 0x28 */ char pad28[0x30];
};                                                  /* size = 0x58 */

struct _mips2c_stack_func_801A7328 {
    /* 0x00 */ char pad0[0x50];
    /* 0x50 */ Vec3f *sp50;                         /* inferred */
    /* 0x54 */ char pad54[0x1E];                    /* maybe part of sp50[8]? */
    /* 0x72 */ u16 sp72;                            /* inferred */
    /* 0x74 */ char pad74[0x14];
};                                                  /* size = 0x88 */

struct _mips2c_stack_func_801A7484 {
    /* 0x00 */ char pad0[0x44];
    /* 0x44 */ s32 sp44;                            /* inferred */
    /* 0x48 */ char pad48[0x8];                     /* maybe part of sp44[3]? */
    /* 0x50 */ s32 sp50;                            /* inferred */
    /* 0x54 */ char pad54[0x4];
    /* 0x58 */ Vec3f *sp58;                         /* inferred */
    /* 0x5C */ char pad5C[0x1E];                    /* maybe part of sp58[8]? */
    /* 0x7A */ u16 sp7A;                            /* inferred */
    /* 0x7C */ char pad7C[0x8];                     /* maybe part of sp7A[5]? */
    /* 0x84 */ u8 sp84;                             /* inferred */
    /* 0x85 */ char pad85[0xB];
};                                                  /* size = 0x90 */

struct _mips2c_stack_func_801A75E8 {
    /* 0x00 */ char pad0[0x50];
    /* 0x50 */ Vec3f *sp50;                         /* inferred */
    /* 0x54 */ char pad54[0x1E];                    /* maybe part of sp50[8]? */
    /* 0x72 */ s16 sp72;                            /* inferred */
    /* 0x74 */ char pad74[0x14];
};                                                  /* size = 0x88 */

struct _mips2c_stack_func_801A7720 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_801A7794 {};              /* size 0x0 */

struct _mips2c_stack_func_801A7828 {};              /* size 0x0 */

struct _mips2c_stack_func_801A787C {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_801A78E4 {};              /* size 0x0 */

struct _mips2c_stack_func_801A794C {};              /* size 0x0 */

typedef struct {
    /* 0x00 */ u16 unk0;                            /* inferred */
    /* 0x02 */ u8 unk2;                             /* inferred */
    /* 0x03 */ char pad3[0x1];
    /* 0x04 */ s8 *unk4;                            /* inferred */
    /* 0x08 */ Vec3f *unk8;                         /* inferred */
    /* 0x0C */ f32 *unkC;                           /* inferred */
    /* 0x10 */ f32 *unk10;                          /* inferred */
} s801FE7C0;                                        /* size = 0x14 */

? func_801938A0(s32, s8, s32);                      /* extern */
s32 func_80194668();                                /* extern */
? func_8019EB2C(s32, s32, u8);                      /* extern */
? func_801A8BD0(?, ?, ?, ?);                        /* extern */
void func_801A5C28(u8 arg0);                        /* static */
void func_801A5C8C(u8 arg0, u8, void *, void **);   /* static */
void func_801A5DDC(s32 arg0, Vec3f **arg1);         /* static */
void func_801A5F7C();                               /* static */
void func_801A6430(u8 arg0, u8 arg1, s32);          /* static */
void func_801A65C8(u8 arg0);                        /* static */
void func_801A6D0C(s32 arg0);                       /* static */
void func_801A7084(s32 arg0);                       /* static */
void func_801A7168(u8 arg0, Vec3f *arg1);           /* static */
