struct _mips2c_stack_func_80161180 {};              /* size 0x0 */

struct _mips2c_stack_func_8016119C {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8016122C {};              /* size 0x0 */

struct _mips2c_stack_func_801612B8 {
    /* 0x00 */ char pad0[0x2C];
    /* 0x2C */ Vec3f *sp2C;                         /* inferred */
    /* 0x30 */ Vec3f *sp30;                         /* inferred */
    /* 0x34 */ char pad34[0x12];                    /* maybe part of sp30[5]? */
    /* 0x46 */ s16 sp46;                            /* inferred */
    /* 0x48 */ s32 sp48;                            /* inferred */
    /* 0x4C */ void *sp4C;                          /* inferred */
    /* 0x50 */ s16 (*sp50)(Vec3f *, f32 *, s16 *, void *, void *, Vec3f *); /* inferred */
    /* 0x54 */ s16 *sp54;                           /* inferred */
    /* 0x58 */ f32 *sp58;                           /* inferred */
    /* 0x5C */ s32 sp5C;                            /* inferred */
};                                                  /* size = 0x60 */

struct _mips2c_stack_func_80161998 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80161BAC {};              /* size 0x0 */

struct _mips2c_stack_func_80161BE0 {};              /* size 0x0 */

struct _mips2c_stack_func_80161C0C {};              /* size 0x0 */

struct _mips2c_stack_func_80161C20 {
    /* 0x0 */ char pad0[0x4];
    /* 0x4 */ s32 sp4;                              /* inferred */
};                                                  /* size = 0x8 */

struct _mips2c_stack_func_80161E4C {
    /* 0x0 */ char pad0[0x4];
    /* 0x4 */ s32 sp4;                              /* inferred */
};                                                  /* size = 0x8 */

struct _mips2c_stack_func_801620CC {
    /* 0x00 */ char pad0[0x2C];
    /* 0x2C */ f32 sp2C;                            /* inferred */
    /* 0x30 */ char pad30[0xC];                     /* maybe part of sp2C[4]? */
    /* 0x3C */ f32 sp3C;                            /* inferred */
    /* 0x40 */ f32 sp40;                            /* inferred */
    /* 0x44 */ char pad44[0x4];
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_8016237C {};              /* size 0x0 */

struct _mips2c_stack_func_801623E4 {
    /* 0x0 */ char pad0[0x4];
    /* 0x4 */ s32 sp4;                              /* inferred */
};                                                  /* size = 0x8 */

struct _mips2c_stack_func_801624EC {};              /* size 0x0 */

struct _mips2c_stack_func_8016253C {
    /* 0x00 */ char pad0[0x2C];
    /* 0x2C */ s32 sp2C;                            /* inferred */
    /* 0x30 */ s32 sp30;                            /* inferred */
    /* 0x34 */ s16 sp34;                            /* inferred */
    /* 0x36 */ s16 sp36;                            /* inferred */
    /* 0x38 */ s16 sp38;                            /* inferred */
    /* 0x3A */ char pad3A[0x2];
    /* 0x3C */ s32 sp3C;                            /* inferred */
    /* 0x40 */ s32 sp40;                            /* inferred */
    /* 0x44 */ s32 sp44;                            /* inferred */
    /* 0x48 */ f32 sp48;                            /* inferred */
    /* 0x4C */ f32 sp4C;                            /* inferred */
    /* 0x50 */ f32 sp50;                            /* inferred */
    /* 0x54 */ char pad54[0x4];
};                                                  /* size = 0x58 */

struct _mips2c_stack_func_801629BC {};              /* size 0x0 */

struct _mips2c_stack_func_80162A50 {
    /* 0x00 */ char pad0[0x30];
    /* 0x30 */ s32 sp30;                            /* inferred */
    /* 0x34 */ s32 sp34;                            /* inferred */
    /* 0x38 */ s32 sp38;                            /* inferred */
    /* 0x3C */ s16 sp3C;                            /* inferred */
    /* 0x3E */ s16 sp3E;                            /* inferred */
    /* 0x40 */ s16 sp40;                            /* inferred */
    /* 0x42 */ s16 sp42;                            /* inferred */
    /* 0x44 */ s32 sp44;                            /* inferred */
    /* 0x48 */ s32 sp48;                            /* inferred */
    /* 0x4C */ s32 sp4C;                            /* inferred */
    /* 0x50 */ s32 sp50;                            /* inferred */
    /* 0x54 */ f32 sp54;                            /* inferred */
    /* 0x58 */ f32 sp58;                            /* inferred */
    /* 0x5C */ f32 sp5C;                            /* inferred */
    /* 0x60 */ f32 sp60;                            /* inferred */
    /* 0x64 */ char pad64[0x4];
};                                                  /* size = 0x68 */

struct _mips2c_stack_func_80162FF8 {};              /* size 0x0 */

struct _mips2c_stack_func_801631DC {
    /* 0x00 */ char pad0[0x4];
    /* 0x04 */ s32 sp4;                             /* inferred */
    /* 0x08 */ char pad8[0x28];                     /* maybe part of sp4[11]? */
    /* 0x30 */ ? sp30;                              /* inferred */
    /* 0x30 */ char pad30[0x8];
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ ? sp3C;                              /* inferred */
    /* 0x3C */ char pad3C[0x34];
};                                                  /* size = 0x70 */

struct _mips2c_stack_func_80163334 {
    /* 0x00 */ char pad0[0x30];
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ char pad3C[0x4];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80163660 {};              /* size 0x0 */

f32 func_80086760(f32);                             /* extern */
s16 func_80161180(Vec3f *arg0, f32 *arg1, s16 *arg2, void *arg3, void *arg4, Vec3f *arg5); /* static */
? func_8016119C(s32 arg0, void *arg1);              /* static */
s16 (*func_8016122C(u8 arg0, s32, Vec3f *, Vec3f *))(Vec3f *, f32 *, s16 *, void *, void *, Vec3f *); /* static */
s32 func_801612B8(void *arg0, s16, s16);            /* static */
s16 func_80161998(s32 arg0, void *arg1);            /* static */
s16 func_80161BAC();                                /* static */
void func_80161BE0(s16 arg0);                       /* static */
void func_80161C0C();                               /* static */
s16 func_80161C20(Vec3f *arg0, f32 *arg1, s16 *arg2, void *arg3, void *arg4, Vec3f *arg5); /* static */
