struct _mips2c_stack_PreRender_AntiAliasAlgorithm {
    /* 0x000 */ char pad_0[0x8];
    /* 0x008 */ s32 sp8;                            /* inferred */
    /* 0x00C */ s32 spC;                            /* inferred */
    /* 0x010 */ s32 sp10;                           /* inferred */
    /* 0x014 */ s32 sp14;                           /* inferred */
    /* 0x018 */ s32 sp18;                           /* inferred */
    /* 0x01C */ s32 sp1C;                           /* inferred */
    /* 0x020 */ s32 sp20;                           /* inferred */
    /* 0x024 */ s32 sp24;                           /* inferred */
    /* 0x028 */ char pad_28[0x4];
    /* 0x02C */ s32 *sp2C;                          /* inferred */
    /* 0x030 */ char pad_30[0x14];                  /* maybe part of sp2C[6]? */
    /* 0x044 */ s32 sp44;                           /* inferred */
    /* 0x048 */ char pad_48[0xC];                   /* maybe part of sp44[4]? */
    /* 0x054 */ u8 sp54;                            /* inferred */
    /* 0x055 */ u8 sp55;                            /* inferred */
    /* 0x056 */ char pad_56[0x2];                   /* maybe part of sp55[3]? */
    /* 0x058 */ u16 sp58;                           /* inferred */
    /* 0x05A */ char pad_5A[0x26];                  /* maybe part of sp58[20]? */
    /* 0x080 */ ? sp80;                             /* inferred */
    /* 0x080 */ char pad_80[0x4];
    /* 0x084 */ s32 sp84;                           /* inferred */
    /* 0x088 */ char pad_88[0x4];
    /* 0x08C */ s32 sp8C;                           /* inferred */
    /* 0x090 */ char pad_90[0x4];
    /* 0x094 */ s32 sp94;                           /* inferred */
    /* 0x098 */ char pad_98[0x4];
    /* 0x09C */ s32 sp9C;                           /* inferred */
    /* 0x0A0 */ char pad_A0[0x1C];                  /* maybe part of sp9C[8]? */
    /* 0x0BC */ ? spBC;                             /* inferred */
    /* 0x0BC */ char pad_BC[0x4];
    /* 0x0C0 */ s32 spC0;                           /* inferred */
    /* 0x0C4 */ char pad_C4[0x4];
    /* 0x0C8 */ s32 spC8;                           /* inferred */
    /* 0x0CC */ char pad_CC[0x4];
    /* 0x0D0 */ s32 spD0;                           /* inferred */
    /* 0x0D4 */ char pad_D4[0x4];
    /* 0x0D8 */ s32 spD8;                           /* inferred */
    /* 0x0DC */ char pad_DC[0x1C];                  /* maybe part of spD8[8]? */
    /* 0x0F8 */ ? spF8;                             /* inferred */
    /* 0x0F8 */ char pad_F8[0x4];
    /* 0x0FC */ s32 spFC;                           /* inferred */
    /* 0x100 */ char pad_100[0x4];
    /* 0x104 */ s32 sp104;                          /* inferred */
    /* 0x108 */ char pad_108[0x4];
    /* 0x10C */ s32 sp10C;                          /* inferred */
    /* 0x110 */ char pad_110[0x4];
    /* 0x114 */ s32 sp114;                          /* inferred */
    /* 0x118 */ char pad_118[0x1C];                 /* maybe part of sp114[8]? */
    /* 0x134 */ ? sp134;                            /* inferred */
    /* 0x134 */ char pad_134[0x4];
    /* 0x138 */ s32 sp138;                          /* inferred */
    /* 0x13C */ char pad_13C[0x4];
    /* 0x140 */ s32 sp140;                          /* inferred */
    /* 0x144 */ char pad_144[0x4];
    /* 0x148 */ s32 sp148;                          /* inferred */
    /* 0x14C */ char pad_14C[0x4];
    /* 0x150 */ s32 sp150;                          /* inferred */
    /* 0x154 */ char pad_154[0x24];
};                                                  /* size = 0x178 */

struct _mips2c_stack_PreRender_ApplyAntiAliasingFilter {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_PreRender_ApplyFilters {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_PreRender_ApplyFiltersSlowlyDestroy {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_PreRender_ApplyFiltersSlowlyInit {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_PreRender_Destroy {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_PreRender_Init {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_PreRender_SetValues {};        /* size 0x0 */

struct _mips2c_stack_PreRender_SetValuesSave {};    /* size 0x0 */

struct _mips2c_stack_func_8016FDB8 {
    /* 0x00 */ char pad_0[0x64];
    /* 0x64 */ Gfx *sp64;                           /* inferred */
};                                                  /* size = 0x68 */

struct _mips2c_stack_func_8016FF70 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_8016FF90 {
    /* 0x00 */ char pad_0[0x6C];
    /* 0x6C */ Gfx *sp6C;                           /* inferred */
};                                                  /* size = 0x70 */

struct _mips2c_stack_func_80170200 {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_8017023C {
    /* 0x00 */ char pad_0[0x4];
    /* 0x04 */ s32 sp4;                             /* inferred */
    /* 0x08 */ s32 sp8;                             /* inferred */
    /* 0x0C */ s32 spC;                             /* inferred */
};                                                  /* size = 0x10 */

struct _mips2c_stack_func_8017057C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_801705B4 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_801705EC {};              /* size 0x0 */

struct _mips2c_stack_func_80170730 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80170774 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80170798 {
    /* 0x00 */ char pad_0[0x4];
    /* 0x04 */ s32 sp4;                             /* inferred */
    /* 0x08 */ s32 sp8;                             /* inferred */
    /* 0x0C */ s32 spC;                             /* inferred */
    /* 0x10 */ s32 sp10;                            /* inferred */
    /* 0x14 */ s32 sp14;                            /* inferred */
    /* 0x18 */ s32 sp18;                            /* inferred */
    /* 0x1C */ s32 sp1C;                            /* inferred */
    /* 0x20 */ s32 sp20;                            /* inferred */
    /* 0x24 */ s32 sp24;                            /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80170AE0 {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80170B28 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_801716C4 {
    /* 0x00 */ char pad_0[0x8];
    /* 0x08 */ s32 sp8;                             /* inferred */
    /* 0x0C */ s32 spC;                             /* inferred */
    /* 0x10 */ s32 sp10;                            /* inferred */
    /* 0x14 */ s32 sp14;                            /* inferred */
    /* 0x18 */ char pad_18[0x10];                   /* maybe part of sp14[5]? */
    /* 0x28 */ s32 sp28;                            /* inferred */
    /* 0x2C */ s32 sp2C;                            /* inferred */
    /* 0x30 */ s32 sp30;                            /* inferred */
    /* 0x34 */ s32 sp34;                            /* inferred */
    /* 0x38 */ s32 sp38;                            /* inferred */
    /* 0x3C */ s32 sp3C;                            /* inferred */
    /* 0x40 */ s32 sp40;                            /* inferred */
    /* 0x44 */ s32 sp44;                            /* inferred */
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_801717F8 {
    /* 0x00 */ char pad_0[0x10];
    /* 0x10 */ ? sp10;                              /* inferred */
    /* 0x10 */ char pad_10[0x60];
    /* 0x70 */ s32 sp70;                            /* inferred */
    /* 0x74 */ s32 sp74;                            /* inferred */
    /* 0x78 */ u32 sp78;                            /* inferred */
    /* 0x7C */ char pad_7C[0x4];
    /* 0x80 */ s32 sp80;                            /* inferred */
    /* 0x84 */ char pad_84[0x28];                   /* maybe part of sp80[11]? */
    /* 0xAC */ u8 spAC;                             /* inferred */
    /* 0xAD */ u8 spAD;                             /* inferred */
    /* 0xAE */ char pad_AE[0x2];                    /* maybe part of spAD[3]? */
    /* 0xB0 */ u16 spB0;                            /* inferred */
    /* 0xB2 */ char pad_B2[0x6];                    /* maybe part of spB0[4]? */
    /* 0xB8 */ void *spB8;                          /* inferred */
    /* 0xBC */ void *spBC;                          /* inferred */
    /* 0xC0 */ void *spC0;                          /* inferred */
    /* 0xC4 */ void *spC4;                          /* inferred */
    /* 0xC8 */ void *spC8;                          /* inferred */
    /* 0xCC */ void *spCC;                          /* inferred */
    /* 0xD0 */ ? *spD0;                             /* inferred */
    /* 0xD4 */ ? *spD4;                             /* inferred */
    /* 0xD8 */ ? *spD8;                             /* inferred */
    /* 0xDC */ ? *spDC;                             /* inferred */
    /* 0xE0 */ char pad_E0[0x8];
};                                                  /* size = 0xE8 */

struct _mips2c_stack_func_801720C4 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_801720FC {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ void *sp1C;                          /* inferred */
    /* 0x20 */ char pad_20[0x3C];                   /* maybe part of sp1C[16]? */
    /* 0x5C */ s32 sp5C;                            /* inferred */
    /* 0x60 */ Gfx *sp60;                           /* inferred */
    /* 0x64 */ s32 sp64;                            /* inferred */
    /* 0x68 */ void *sp68;                          /* inferred */
    /* 0x6C */ void *sp6C;                          /* inferred */
};                                                  /* size = 0x70 */

struct _mips2c_stack_func_80172758 {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ void *sp20;                          /* inferred */
    /* 0x24 */ void *sp24;                          /* inferred */
    /* 0x28 */ s16 sp28;                            /* inferred */
    /* 0x2A */ u16 sp2A;                            /* inferred */
    /* 0x2C */ u8 sp2C;                             /* inferred */
    /* 0x2D */ u8 sp2D;                             /* inferred */
    /* 0x2E */ u16 sp2E;                            /* inferred */
    /* 0x30 */ u16 sp30;                            /* inferred */
    /* 0x32 */ char pad_32[0x2];
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ f32 sp3C;                            /* inferred */
    /* 0x40 */ f32 sp40;                            /* inferred */
    /* 0x44 */ u32 sp44;                            /* inferred */
};                                                  /* size = 0x48 */

s32 func_80182CBC();                                /* extern */
s32 func_80182CCC(void *, void *, PreRenderParams *); /* extern */
? guS2DInitBg(void *, void *, PreRenderParams *);   /* extern */
static ? D_801ABAB0;                                /* unable to generate initializer */
static ? D_801E3BB0;                                /* unable to generate initializer; const */
SlowlyTask D_801F6E00;
s32 D_801F6FC0;
s8 D_801F7FE8;
u8 slowlyStack[4096];
StackEntry slowlyStackEntry;

void PreRender_SetValuesSave(PreRender *this, u32 width, u32 height, void *fbuf, void *zbuf, void *cvg) {
    this->widthSave = (u16) width;
    this->heightSave = (u16) height;
    this->fbufSave = (u16 *) fbuf;
    this->cvgSave = (u8 *) cvg;
    this->ulxSave = 0;
    this->ulySave = 0;
    this->lrxSave = width - 1;
    this->lrySave = height - 1;
