struct _mips2c_stack_Matrix_MtxFCopy {};            /* size 0x0 */

struct _mips2c_stack_Matrix_NewMtx {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Matrix_RotateY {
    /* 0x00 */ char pad0[0x20];
    /* 0x20 */ f32 sp20;                            /* inferred */
    /* 0x24 */ char pad24[0x4];
};                                                  /* size = 0x28 */

struct _mips2c_stack_Matrix_Scale {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_SysMatrix_AppendToPolyOpaDisp {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_SysMatrix_CopyCurrentState {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_SysMatrix_FromRSPMatrix {};    /* size 0x0 */

struct _mips2c_stack_SysMatrix_GetCurrentState {};  /* size 0x0 */

struct _mips2c_stack_SysMatrix_GetStateAsRSPMatrix {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_SysMatrix_GetStateTranslation {}; /* size 0x0 */

struct _mips2c_stack_SysMatrix_GetStateTranslationAndScaledX {}; /* size 0x0 */

struct _mips2c_stack_SysMatrix_GetStateTranslationAndScaledY {}; /* size 0x0 */

struct _mips2c_stack_SysMatrix_GetStateTranslationAndScaledZ {}; /* size 0x0 */

struct _mips2c_stack_SysMatrix_InsertMatrix {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_SysMatrix_InsertRotation {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_SysMatrix_InsertRotationAroundUnitVector_f {
    /* 0x00 */ char pad0[0x40];
};                                                  /* size = 0x40 */

struct _mips2c_stack_SysMatrix_InsertRotationAroundUnitVector_s {
    /* 0x00 */ char pad0[0x40];
};                                                  /* size = 0x40 */

struct _mips2c_stack_SysMatrix_InsertTranslation {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_SysMatrix_InsertXRotation_f {
    /* 0x00 */ char pad0[0x20];
    /* 0x20 */ f32 sp20;                            /* inferred */
    /* 0x24 */ char pad24[0x4];
};                                                  /* size = 0x28 */

struct _mips2c_stack_SysMatrix_InsertXRotation_s {
    /* 0x00 */ char pad0[0x20];
    /* 0x20 */ f32 sp20;                            /* inferred */
    /* 0x24 */ char pad24[0x4];
};                                                  /* size = 0x28 */

struct _mips2c_stack_SysMatrix_InsertYRotation_f {
    /* 0x00 */ char pad0[0x20];
    /* 0x20 */ f32 sp20;                            /* inferred */
    /* 0x24 */ char pad24[0x4];
};                                                  /* size = 0x28 */

struct _mips2c_stack_SysMatrix_InsertZRotation_f {
    /* 0x00 */ char pad0[0x20];
    /* 0x20 */ f32 sp20;                            /* inferred */
    /* 0x24 */ char pad24[0x4];
};                                                  /* size = 0x28 */

struct _mips2c_stack_SysMatrix_InsertZRotation_s {
    /* 0x00 */ char pad0[0x20];
    /* 0x20 */ f32 sp20;                            /* inferred */
    /* 0x24 */ char pad24[0x4];
};                                                  /* size = 0x28 */

struct _mips2c_stack_SysMatrix_MultiplyVector3fByMatrix {}; /* size 0x0 */

struct _mips2c_stack_SysMatrix_MultiplyVector3fByState {}; /* size 0x0 */

struct _mips2c_stack_SysMatrix_MultiplyVector3fXZByCurrentState {}; /* size 0x0 */

struct _mips2c_stack_SysMatrix_NormalizeXYZ {};     /* size 0x0 */

struct _mips2c_stack_SysMatrix_RotateAndTranslateState {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_SysMatrix_RotateStateAroundXAxis {
    /* 0x00 */ char pad0[0x1C];
    /* 0x1C */ s32 sp1C;                            /* inferred */
    /* 0x20 */ char pad20[0x10];                    /* maybe part of sp1C[5]? */
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ MtxF *sp34;                          /* inferred */
};                                                  /* size = 0x38 */

struct _mips2c_stack_SysMatrix_SetCurrentState {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_SysMatrix_SetStateRotationAndTranslation {
    /* 0x00 */ char pad0[0x24];
    /* 0x24 */ f32 sp24;                            /* inferred */
    /* 0x28 */ char pad28[0x4];
    /* 0x2C */ f32 sp2C;                            /* inferred */
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ char pad34[0x4];
};                                                  /* size = 0x38 */

struct _mips2c_stack_SysMatrix_SetStateXRotation {
    /* 0x00 */ char pad0[0x18];
    /* 0x18 */ f32 sp18;                            /* inferred */
    /* 0x1C */ char pad1C[0x8];                     /* maybe part of sp18[3]? */
    /* 0x24 */ MtxF *sp24;                          /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_SysMatrix_StateAlloc {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_SysMatrix_StatePop {};         /* size 0x0 */

struct _mips2c_stack_SysMatrix_StatePush {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_SysMatrix_ToRSPMatrix {};      /* size 0x0 */

struct _mips2c_stack_SysMatrix_TransposeXYZ {};     /* size 0x0 */

struct _mips2c_stack_func_8018219C {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_801822C4 {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80182C90 {};              /* size 0x0 */

struct _mips2c_stack_func_80182CA0 {};              /* size 0x0 */

struct _mips2c_stack_func_80182CBC {};              /* size 0x0 */

struct _mips2c_stack_func_80182CCC {};              /* size 0x0 */

void func_801822C4(void *arg0, void *arg1, s32 arg2); /* static */
s8 *func_80182C90();                                /* static */
s32 func_80182CA0();                                /* static */
void *func_80182CBC();                              /* static */
void *func_80182CCC();                              /* static */
static void D_801E2160;                             /* unable to generate initializer; const */
static void D_801E3790;                             /* unable to generate initializer; const */
void *D_801D1E60 = &D_801E2160;
void *D_801D1E64 = &D_801E3790;
MtxF *sCurrentMatrix;
MtxF *sMatrixStack;
