s32 convert_scene_number_among_shared_scenes(s16);  /* extern */
f32 func_800C4188(f32, CollisionContext *, CollisionPoly **, s32 *, Actor *, PosRot *); /* extern */
s32 func_800C4D3C(void *, Vec3f *, PosRot *, Vec3f *, f32, CollisionPoly **, s32 *, Actor *, f32); /* extern */
s32 func_800C4DA4(void *, Vec3f *, PosRot *, Vec3f *, f32, CollisionPoly **, s32 *, Actor *, f32); /* extern */
s32 func_800C4F84(void *, f32 *, Vec3f *, f32, ? *, s32 *, Actor *); /* extern */
s32 func_800C54AC(CollisionContext *, void *, PosRot *, ? *, s32 *, s32, s32, s32, s32, s32 *); /* extern */
s32 func_800C9C24(CollisionContext *, s32, s32, ?); /* extern */
s32 func_800C9D50(CollisionContext *, s32, s32);    /* extern */
? func_800DF840(Camera *, ?);                       /* extern */
? func_80115D5C();                                  /* extern */
s32 func_80124258(Actor *, Actor *);                /* extern */
void func_80160AF8(Actor *thisx, GlobalContext *globalCtx); /* extern */
void func_80160B40(Actor *thisx, GlobalContext *globalCtx); /* extern */
void func_80160B80(Actor *thisx, GlobalContext *globalCtx); /* extern */
void func_80160BC0(Actor *thisx, GlobalContext *globalCtx); /* extern */
? func_80164C14(? *, ?, ?, s32, s32, f32);          /* extern */
f32 func_80169100(GlobalContext *, MtxF *, s32 *, s32 *, Vec3f *); /* extern */
s32 func_8017D668(f32, f32, s32, s32, f32, f32, f32, f32, s32 *, f32 *, f32 *); /* extern */

    {{0xFC262A60, 0x150C937F}},
    {{0xEF102C30, 0xC184241}},
    {{0xD9000000, 0x400}},
    {{0xDF000000, 0}},
    {{0xE7000000, 0}},
    {{0xD7000002, 0xFFFFFFFF}},
    {{0xFC119623, 0xFF2FFFFF}},
    {{0xEF000C30, 0x504241}},
    {{0xD9000000, 0x200404}},
    {{0xDF000000, 0}},
    {{0xE7000000, 0}},
    {{0xD7000000, 0xFFFFFFFF}},
    {{0xFCFFFFFF, 0xFFFDF6FB}},
    {{0xEF002C30, 0x504341}},
    {{0xD9000000, 0x200000}},
    {{0xDF000000, 0}},
    {{0xE7000000, 0}},
    {{0xD7000000, 0xFFFFFFFF}},
    {{0xFC323864, 0xFF73FFFF}},
    {{0xEF082C00, 0x504340}},
    {{0xD9000000, 0x200405}},
    {{0xDF000000, 0}},
    {{0xE7000000, 0}},
    {{0xD7000002, 0xFFFFFFFF}},
    {{0xFC11E2A1, 0xF0A67800}},
    {{0xEF182C00, 0xC192048}},
    {{0xD9000000, 0x2E0404}},
    {{0xDF000000, 0}},
    {{0xE7000000, 0}},
    {{0xD7000002, 0xFFFFFFFF}},
    {{0xFC30B261, 0x5566FF7F}},
    {{0xEF082C00, 0x504B50}},
    {{0xD9000000, 0x200405}},
    {{0xDF000000, 0}},
    {{0xE7000000, 0}},
    {{0xD7000002, 0xFFFFFFFF}},
    {{0xFC30B261, 0x5566FF7F}},
    {{0xEF082CA0, 0x504B50}},
    {{0xD9000000, 0x200405}},
    {{0xDF000000, 0}},
    {{0xE7000000, 0}},
    {{0xD7000002, 0xFFFFFFFF}},
    {{0xFC127E03, 0xFF0FF3FF}},
    {{0xEF182CC0, 0xC8112078}},
    {{0xD9000000, 0x230405}},
    {{0xDF000000, 0}},
    {{0xE7000000, 0}},
    {{0xD7000002, 0xFFFFFFFF}},
    {{0xFC119623, 0xFF2FFFFF}},
    {{0xEF002C30, 0x504361}},
    {{0xD9000000, 0x200005}},
    {{0xDF000000, 0}},
    {{0xE7000000, 0}},
    {{0xD7000000, 0xFFFFFFFF}},
    {{0xFCFFFFFF, 0xFFFCF238}},
    {{0xEF102C30, 0xC184241}},
    {{0xD9000000, 0x200004}},
    {{0xDF000000, 0}},
    {{0xE7000000, 0}},
    {{0xD7000002, 0xFFFFFFFF}},
    {{0xFC119623, 0xFF2FFFFF}},
    {{0xEF082C00, 0x504341}},
    {{0xD9000000, 0x200004}},
    {{0xDF000000, 0}},
    {{0xE7000000, 0}},
    {{0xD7000002, 0xFFFFFFFF}},
    {{0xFCFFFFFF, 0xFFFCF279}},
    {{0xEF082C00, 0xF0A3231}},
    {{0xD9000000, 0x200005}},
    {{0xDF000000, 0}},
    {{0xE7000000, 0}},
    {{0xD7000002, 0xFFFFFFFF}},
    {{0xFC119623, 0xFF2FFFFF}},
    {{0xEF082C00, 0xF0A3231}},
    {{0xD9000000, 0x200005}},
    {{0xDF000000, 0}},
    {{0xE7000000, 0}},
    {{0xD7000002, 0xFFFFFFFF}},
    {{0xFCFFFFFF, 0xFFFCF279}},
    {{0xEF082C00, 0x553271}},
    {{0xD9000000, 0x200005}},
    {{0xDF000000, 0}},
    {{0xE7000000, 0}},
    {{0xD7000002, 0xFFFFFFFF}},
    {{0xFC119623, 0xFF2FFFFF}},
    {{0xEF082C00, 0x553271}},
    {{0xD9000000, 0x200005}},
    {{0xDF000000, 0}},
    {{0xE7000000, 0}},
    {{0xD7000002, 0xFFFFFFFF}},
    {{0xFCFFFFFF, 0xFFFCF279}},
    {{0xEF082C00, 0xF0A3231}},
    {{0xD9000000, 0x210005}},
    {{0xDF000000, 0}},
    {{0xE7000000, 0}},
    {{0xD7000002, 0xFFFFFFFF}},
    {{0xFC127E03, 0xFF0FF3FF}},
    {{0xEF182C40, 0xC81049D8}},
    {{0xD9000000, 0x230405}},
    {{0xDF000000, 0}},
    {{0xE7000000, 0}},
    {{0xD7000002, 0xFFFFFFFF}},
    {{0xFC127E03, 0xFF0FF3FF}},
    {{0xEF182C40, 0xC8104B50}},
    {{0xD9000000, 0x230005}},
    {{0xDF000000, 0}},
};

typedef struct {
    /* 0x0000 */ Vec3s rot;
    /* 0x0006 */ s16 face;
    /* 0x0008 */ f32 yOffset;
    /* 0x000C */ void (*shadowDraw)(Actor *, Lights *, GlobalContext *);
    /* 0x0010 */ f32 shadowScale;
    /* 0x0014 */ u8 shadowAlpha;
    /* 0x0015 */ u8 feetFloorFlags;
    /* 0x0016 */ char pad16[0x1];                   /* maybe part of feetFloorFlags[2]? */
    /* 0x0017 */ u8 unk17;                          /* inferred */
    /* 0x0018 */ Vec3f feetPos[2];
} ActorShape;                                       /* size 0x30 */

typedef struct GameState {
    /* 0x0000 */ GraphicsContext *gfxCtx;
    /* 0x0004 */ void (*main)(GameState *);
    /* 0x0008 */ void (*destroy)(GameState *);
    /* 0x000C */ void (*nextGameStateInit)(GameState *);
    /* 0x0010 */ u32 nextGameStateSize;
    /* 0x0014 */ Input input[4];
    /* 0x0074 */ TwoHeadArena heap;
    /* 0x0084 */ GameAlloc alloc;
    /* 0x0098 */ f32 unk98;                         /* inferred */
    /* 0x009B */ u8 running;                        /* overlap */
    /* 0x009C */ u32 frames;
    /* 0x00A0 */ char padA0[0x2];
    /* 0x00A2 */ u8 framerateDivisor;
    /* 0x00A3 */ char padA3[0x1];                   /* maybe part of framerateDivisor[2]? */
} GameState;                                        /* size 0xA4 */

typedef struct TargetContext {
    /* 0x0000 */ Vec3f unk0;
    /* 0x000C */ Vec3f unkC;
    /* 0x0018 */ f32 unk18;
    /* 0x001C */ f32 unk1C;
    /* 0x0020 */ f32 unk20;
    /* 0x0024 */ f32 unk24;
    /* 0x0028 */ f32 unk28;
    /* 0x002C */ f32 unk2C;
    /* 0x0030 */ f32 unk30;
    /* 0x0034 */ f32 unk34;
    /* 0x0038 */ Actor *unk38;
    /* 0x003C */ Actor *unk3C;
    /* 0x0040 */ f32 unk40;
    /* 0x0044 */ f32 unk44;
    /* 0x0048 */ s16 unk48;
    /* 0x004A */ u8 unk4A;
    /* 0x004B */ u8 unk4B;
    /* 0x004C */ s8 unk4C;
    /* 0x004D */ char pad4D[0x3];                   /* maybe part of unk4C[4]? */
    /* 0x0050 */ TargetContextEntry unk50[3];
    /* 0x008C */ Actor *unk8C;
    /* 0x0090 */ Actor *unk90;
    /* 0x0094 */ Actor *unk94;                      /* inferred */
} TargetContext;                                    /* size 0x98 */

typedef struct {
    /* 0x0000 */ f32 unk0;                          /* inferred */
    /* 0x0004 */ f32 unk4;                          /* inferred */
    /* 0x0008 */ char pad8[0x4];                    /* maybe part of unk4[2]? */
    /* 0x000C */ f32 unkC;
    /* 0x0010 */ Color_RGBA8 unk10;
} TargetContextEntry;                               /* size 0x14 */

void Actor_PrintLists(ActorContext *actorCtx) {
    Actor *self = (Actor *) actorCtx;
    s32 temp_s1;
    void *temp_s0;
    void *temp_s0_2;
    f32 *phi_s4;
    s32 phi_s1;
    void *phi_s0;

    FaultDrawer_SetCharPad(-2, 0);
    FaultDrawer_Printf("actor\n", gMaxActorId);
    FaultDrawer_Printf("No. Actor   Name Part SegName\n");
    phi_s4 = &self->home.pos.z;
    phi_s1 = 0;
    do {
        temp_s0 = phi_s4->unk4;
        phi_s0 = temp_s0;
        if (temp_s0 != 0) {
            do {
                FaultDrawer_Printf("%3d %08x %04x %3d %s\n", phi_s1, phi_s0, phi_s0->unk0, (s32) phi_s0->unk2, "");
                temp_s0_2 = phi_s0->unk12C;
                phi_s0 = temp_s0_2;
            } while (temp_s0_2 != 0);
        }
        temp_s1 = phi_s1 + 1;
        phi_s4 += 0xC;
        phi_s1 = temp_s1;
    } while (temp_s1 != 0xC);
}

