CRASHED

typedef struct {
    /* 0x00 */ Actor *actor;
    /* 0x04 */ CollisionHeader *colHeader;
    /* 0x08 */ DynaLookup dynaLookup;
    /* 0x10 */ u16 vtxStartIndex;
    /* 0x12 */ s16 unk12;                           /* inferred */
    /* 0x14 */ ScaleRotPos prevTransform;
    /* 0x34 */ ScaleRotPos curTransform;
    /* 0x54 */ Sphere16 boundingSphere;
    /* 0x5C */ f32 minY;
    /* 0x60 */ f32 maxY;
} BgActor;                                          /* size = 0x64 */

typedef struct {
    /* 0x0 */ s32 unk0;                             /* inferred */
    /* 0x4 */ WaterBox *boxes;
} DynaSSWaterboxList;                               /* size = 0x8 */

struct _mips2c_stack_BgCheck_ActorMeshInit {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_BgCheck_ActorMeshInitFromActor {}; /* size 0x0 */

struct _mips2c_stack_BgCheck_ActorMeshParamsInit {}; /* size 0x0 */

struct _mips2c_stack_BgCheck_ActorMeshPolyListsHeadsInit {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_BgCheck_ActorMeshPolyListsInit {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_BgCheck_ActorMeshUpdateParams {}; /* size 0x0 */

struct _mips2c_stack_BgCheck_ActorMeshVerticesIndexInit {}; /* size 0x0 */

struct _mips2c_stack_BgCheck_ActorMeshWaterboxesIndexInit {}; /* size 0x0 */

struct _mips2c_stack_BgCheck_AddActorMesh {
    /* 0x00 */ char pad0[0x1C];
    /* 0x1C */ DynaCollisionContext *sp1C;          /* inferred */
    /* 0x20 */ char pad20[0x4];
    /* 0x24 */ s32 sp24;                            /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_BgCheck_AddActorMeshToLists {
    /* 0x000 */ char pad0[0x74];
    /* 0x074 */ Sphere16 *sp74;                     /* inferred */
    /* 0x078 */ char pad78[0x4];
    /* 0x07C */ ? sp7C;                             /* inferred */
    /* 0x07C */ char pad7C[0xC];
    /* 0x088 */ ? sp88;                             /* inferred */
    /* 0x088 */ char pad88[0x8];
    /* 0x090 */ f32 sp90;                           /* inferred */
    /* 0x094 */ ? sp94;                             /* inferred */
    /* 0x094 */ char pad94[0xC];
    /* 0x0A0 */ f32 spA0;                           /* inferred */
    /* 0x0A4 */ char padA4[0x8];                    /* maybe part of spA0[3]? */
    /* 0x0AC */ ? spAC;                             /* inferred */
    /* 0x0AC */ char padAC[0xC];
    /* 0x0B8 */ ? spB8;                             /* inferred */
    /* 0x0B8 */ char padB8[0x12];
    /* 0x0CA */ s16 spCA;                           /* inferred */
    /* 0x0CC */ s16 spCC;                           /* inferred */
    /* 0x0CE */ s16 spCE;                           /* inferred */
    /* 0x0D0 */ char padD0[0x18];                   /* maybe part of spCE[13]? */
    /* 0x0E8 */ f32 spE8;                           /* inferred */
    /* 0x0EC */ f32 spEC;                           /* inferred */
    /* 0x0F0 */ f32 spF0;                           /* inferred */
    /* 0x0F4 */ ? spF4;                             /* inferred */
    /* 0x0F4 */ char padF4[0x10];
    /* 0x104 */ s16 sp104;                          /* inferred */
    /* 0x106 */ s16 sp106;                          /* inferred */
    /* 0x108 */ s16 sp108;                          /* inferred */
    /* 0x10A */ char pad10A[0xA];                   /* maybe part of sp108[6]? */
    /* 0x114 */ f32 sp114;                          /* inferred */
    /* 0x118 */ f32 sp118;                          /* inferred */
    /* 0x11C */ f32 sp11C;                          /* inferred */
    /* 0x120 */ f32 sp120;                          /* inferred */
    /* 0x124 */ f32 sp124;                          /* inferred */
    /* 0x128 */ f32 sp128;                          /* inferred */
    /* 0x12C */ f32 sp12C;                          /* inferred */
    /* 0x130 */ f32 sp130;                          /* inferred */
    /* 0x134 */ f32 sp134;                          /* inferred */
    /* 0x138 */ f32 sp138;                          /* inferred */
    /* 0x13C */ f32 sp13C;                          /* inferred */
    /* 0x140 */ f32 sp140;                          /* inferred */
    /* 0x144 */ f32 sp144;                          /* inferred */
    /* 0x148 */ f32 sp148;                          /* inferred */
    /* 0x14C */ f32 sp14C;                          /* inferred */
    /* 0x150 */ char pad150[0x4];
    /* 0x154 */ f32 sp154;                          /* inferred */
    /* 0x158 */ f32 sp158;                          /* inferred */
    /* 0x15C */ f32 sp15C;                          /* inferred */
    /* 0x160 */ f32 sp160;                          /* inferred */
    /* 0x164 */ char pad164[0xC];                   /* maybe part of sp160[4]? */
    /* 0x170 */ ? sp170;                            /* inferred */
    /* 0x170 */ char pad170[0x4];
    /* 0x174 */ f32 sp174;                          /* inferred */
    /* 0x178 */ char pad178[0x18];
};                                                  /* size = 0x190 */

struct _mips2c_stack_BgCheck_AllocPolygonLinkedListNode {}; /* size 0x0 */

struct _mips2c_stack_BgCheck_AreActorMeshParamsEqual {}; /* size 0x0 */

struct _mips2c_stack_BgCheck_CalcSubdivisionSize {}; /* size 0x0 */

struct _mips2c_stack_BgCheck_CalcWaterboxDimensions {}; /* size 0x0 */

struct _mips2c_stack_BgCheck_CreateTriNormFromPolygon {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_BgCheck_CreateVec3fFromVertex {}; /* size 0x0 */

struct _mips2c_stack_BgCheck_CreateVertexFromVec3f {}; /* size 0x0 */

struct _mips2c_stack_BgCheck_DynaAlloc {
    /* 0x00 */ char pad0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_BgCheck_DynaInit {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_BgCheck_GetActorMeshHeader {}; /* size 0x0 */

struct _mips2c_stack_BgCheck_GetActorOfMesh {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_BgCheck_GetIsDefaultSpecialScene {}; /* size 0x0 */

struct _mips2c_stack_BgCheck_GetPolyMaxSubdivisions {}; /* size 0x0 */

struct _mips2c_stack_BgCheck_GetPolyMinMaxSubdivisions {
    /* 0x00 */ char pad0[0x34];
    /* 0x34 */ CollisionPoly *sp34;                 /* inferred */
    /* 0x38 */ char pad38[0x14];                    /* maybe part of sp34[6]? */
    /* 0x4C */ f32 sp4C;                            /* inferred */
    /* 0x50 */ f32 sp50;                            /* inferred */
    /* 0x54 */ f32 sp54;                            /* inferred */
    /* 0x58 */ f32 sp58;                            /* inferred */
    /* 0x5C */ f32 sp5C;                            /* inferred */
    /* 0x60 */ f32 sp60;                            /* inferred */
    /* 0x64 */ char pad64[0x4];
};                                                  /* size = 0x68 */

struct _mips2c_stack_BgCheck_GetPolyMinSubdivisions {}; /* size 0x0 */

struct _mips2c_stack_BgCheck_GetPolygonAttributes {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_BgCheck_GetSpecialSceneMaxMemory {}; /* size 0x0 */

struct _mips2c_stack_BgCheck_GetSpecialSceneMaxObjects {}; /* size 0x0 */

struct _mips2c_stack_BgCheck_HasActorMeshChanged {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_BgCheck_Init {
    /* 0x00 */ char pad0[0x40];
    /* 0x40 */ u32 sp40;                            /* inferred */
    /* 0x44 */ char pad44[0xC];                     /* maybe part of sp40[4]? */
    /* 0x50 */ u32 sp50;                            /* inferred */
    /* 0x54 */ s32 sp54;                            /* inferred */
};                                                  /* size = 0x58 */

struct _mips2c_stack_BgCheck_IsActorMeshIndexValid {}; /* size 0x0 */

struct _mips2c_stack_BgCheck_PolygonCollidesWithSphere {
    /* 0x00 */ char pad0[0x1C];
    /* 0x1C */ ? sp1C;                              /* inferred */
    /* 0x1C */ char pad1C[0xC];
};                                                  /* size = 0x28 */

struct _mips2c_stack_BgCheck_PolygonGetMinY {};     /* size 0x0 */

struct _mips2c_stack_BgCheck_PolygonGetNormal {};   /* size 0x0 */

struct _mips2c_stack_BgCheck_PolygonLinkedListAlloc {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_BgCheck_PolygonLinkedListInit {}; /* size 0x0 */

struct _mips2c_stack_BgCheck_PolygonLinkedListNodeInit {}; /* size 0x0 */

struct _mips2c_stack_BgCheck_PolygonLinkedListNodeInsert {
    /* 0x00 */ char pad0[0x1E];
    /* 0x1E */ u16 sp1E;                            /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_BgCheck_PolygonLinkedListReset {}; /* size 0x0 */

struct _mips2c_stack_BgCheck_PolygonLinkedListResetHead {}; /* size 0x0 */

struct _mips2c_stack_BgCheck_PolygonsAlloc {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_BgCheck_PolygonsInit {};       /* size 0x0 */

struct _mips2c_stack_BgCheck_RelocateAllMeshHeaders {
    /* 0x00 */ char pad0[0x38];
};                                                  /* size = 0x38 */

struct _mips2c_stack_BgCheck_RelocateMeshHeader {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_BgCheck_RelocateMeshHeaderPointers {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_BgCheck_RemoveActorMesh {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_BgCheck_ResetFlagsIfLoadedActor {
    /* 0x00 */ char pad0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_BgCheck_ScenePolygonListsAlloc {
    /* 0x00 */ char pad0[0x1C];
    /* 0x1C */ TwoHeadArena *sp1C;                  /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_BgCheck_ScenePolygonListsInit {}; /* size 0x0 */

struct _mips2c_stack_BgCheck_ScenePolygonListsInsert {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_BgCheck_ScenePolygonListsInsertSorted {
    /* 0x00 */ char pad0[0x24];
    /* 0x24 */ SSNode *sp24;                        /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_BgCheck_ScenePolygonListsNodeInsert {
    /* 0x00 */ char pad0[0x1E];
    /* 0x1E */ u16 sp1E;                            /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_BgCheck_ScenePolygonListsReserveNode {}; /* size 0x0 */

struct _mips2c_stack_BgCheck_SetActorMeshParams {}; /* size 0x0 */

struct _mips2c_stack_BgCheck_SplitScenePolygonsIntoSubdivisions {
    /* 0x000 */ char pad0[0x7C];
    /* 0x07C */ s32 sp7C;                           /* inferred */
    /* 0x080 */ char pad80[0x18];                   /* maybe part of sp7C[7]? */
    /* 0x098 */ s32 sp98;                           /* inferred */
    /* 0x09C */ char pad9C[0x8];                    /* maybe part of sp98[3]? */
    /* 0x0A4 */ StaticLookup *spA4;                 /* inferred */
    /* 0x0A8 */ char padA8[0xC];                    /* maybe part of spA4[4]? */
    /* 0x0B4 */ f32 spB4;                           /* inferred */
    /* 0x0B8 */ f32 spB8;                           /* inferred */
    /* 0x0BC */ f32 spBC;                           /* inferred */
    /* 0x0C0 */ f32 spC0;                           /* inferred */
    /* 0x0C4 */ f32 spC4;                           /* inferred */
    /* 0x0C8 */ f32 spC8;                           /* inferred */
    /* 0x0CC */ s32 spCC;                           /* inferred */
    /* 0x0D0 */ s32 spD0;                           /* inferred */
    /* 0x0D4 */ s32 spD4;                           /* inferred */
    /* 0x0D8 */ s32 spD8;                           /* inferred */
    /* 0x0DC */ s32 spDC;                           /* inferred */
    /* 0x0E0 */ s32 spE0;                           /* inferred */
    /* 0x0E4 */ s32 spE4;                           /* inferred */
    /* 0x0E8 */ s32 spE8;                           /* inferred */
    /* 0x0EC */ char padEC[0x4];
    /* 0x0F0 */ s32 spF0;                           /* inferred */
    /* 0x0F4 */ s32 spF4;                           /* inferred */
    /* 0x0F8 */ char padF8[0x8];
};                                                  /* size = 0x100 */

struct _mips2c_stack_BgCheck_Update {
    /* 0x00 */ char pad0[0x50];
    /* 0x50 */ s32 sp50;                            /* inferred */
    /* 0x54 */ s32 sp54;                            /* inferred */
    /* 0x58 */ s32 sp58;                            /* inferred */
    /* 0x5C */ char pad5C[0x4];
};                                                  /* size = 0x60 */

struct _mips2c_stack_BgCheck_UpdateAllActorMeshes {
    /* 0x00 */ char pad0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_BgCheck_VerticesInit {};       /* size 0x0 */

struct _mips2c_stack_BgCheck_VerticesListAlloc {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_BgCheck_WaterboxListAlloc {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_BgCheck_WaterboxListInit {};   /* size 0x0 */

struct _mips2c_stack_func_800BFD84 {};              /* size 0x0 */

struct _mips2c_stack_func_800BFDEC {
    /* 0x00 */ char pad0[0x20];
    /* 0x20 */ ? sp20;                              /* inferred */
    /* 0x20 */ char pad20[0xC];
    /* 0x2C */ s32 sp2C;                            /* inferred */
    /* 0x30 */ char pad30[0x8];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_800C0094 {
    /* 0x00 */ char pad0[0x2C];
    /* 0x2C */ f32 sp2C;                            /* inferred */
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ f32 sp34;                            /* inferred */
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_800C01B8 {};              /* size 0x0 */

struct _mips2c_stack_func_800C02C0 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_800C0340 {
    /* 0x00 */ char pad0[0x40];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_800C0474 {
    /* 0x00 */ char pad0[0x40];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_800C0668 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_800C06A8 {
    /* 0x00 */ char pad0[0x34];
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ f32 sp3C;                            /* inferred */
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_800C074C {
    /* 0x00 */ char pad0[0x34];
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ f32 sp3C;                            /* inferred */
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_800C07F0 {
    /* 0x00 */ char pad0[0x34];
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ CollisionPoly *sp38;                 /* inferred */
    /* 0x3C */ char pad3C[0x10];                    /* maybe part of sp38[5]? */
    /* 0x4C */ f32 sp4C;                            /* inferred */
};                                                  /* size = 0x50 */

struct _mips2c_stack_func_800C0E74 {
    /* 0x00 */ char pad0[0x80];
    /* 0x80 */ f32 sp80;                            /* inferred */
    /* 0x84 */ char pad84[0xC];
};                                                  /* size = 0x90 */

struct _mips2c_stack_func_800C10FC {
    /* 0x00 */ char pad0[0x38];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_800C1238 {};              /* size 0x0 */

struct _mips2c_stack_func_800C12A4 {
    /* 0x000 */ char pad0[0x98];
    /* 0x098 */ f32 sp98;                           /* inferred */
    /* 0x09C */ char pad9C[0x18];                   /* maybe part of sp98[7]? */
    /* 0x0B4 */ f32 spB4;                           /* inferred */
    /* 0x0B8 */ char padB8[0x1C];                   /* maybe part of spB4[8]? */
    /* 0x0D4 */ void *spD4;                         /* inferred */
    /* 0x0D8 */ void *spD8;                         /* inferred */
    /* 0x0DC */ void *spDC;                         /* inferred */
    /* 0x0E0 */ char padE0[0x8];                    /* maybe part of spDC[3]? */
    /* 0x0E8 */ s32 spE8;                           /* inferred */
    /* 0x0EC */ char padEC[0x4];
    /* 0x0F0 */ s32 spF0;                           /* inferred */
    /* 0x0F4 */ f32 spF4;                           /* inferred */
    /* 0x0F8 */ char padF8[0xC];                    /* maybe part of spF4[4]? */
    /* 0x104 */ f32 sp104;                          /* inferred */
    /* 0x108 */ char pad108[0x4];
    /* 0x10C */ f32 sp10C;                          /* inferred */
};                                                  /* size = 0x110 */

struct _mips2c_stack_func_800C1B68 {
    /* 0x00 */ char pad0[0x60];
    /* 0x60 */ s32 sp60;                            /* inferred */
    /* 0x64 */ char pad64[0x18];                    /* maybe part of sp60[7]? */
    /* 0x7C */ s32 sp7C;                            /* inferred */
    /* 0x80 */ char pad80[0x4];
    /* 0x84 */ f32 sp84;                            /* inferred */
    /* 0x88 */ char pad88[0xC];                     /* maybe part of sp84[4]? */
    /* 0x94 */ s32 sp94;                            /* inferred */
};                                                  /* size = 0x98 */

struct _mips2c_stack_func_800C1D7C {
    /* 0x00 */ char pad0[0x50];
    /* 0x50 */ CollisionPoly *sp50;                 /* inferred */
    /* 0x54 */ Vec3s *sp54;                         /* inferred */
    /* 0x58 */ Vec3f *sp58;                         /* inferred */
    /* 0x5C */ void *sp5C;                          /* inferred */
    /* 0x60 */ ? *sp60;                             /* inferred */
    /* 0x64 */ s32 sp64;                            /* inferred */
    /* 0x68 */ f32 sp68;                            /* inferred */
    /* 0x6C */ char pad6C[0x10];                    /* maybe part of sp68[5]? */
    /* 0x7C */ ? sp7C;                              /* inferred */
    /* 0x7C */ char pad7C[0x14];
};                                                  /* size = 0x90 */

struct _mips2c_stack_func_800C2008 {
    /* 0x00 */ char pad0[0x1C];
    /* 0x1C */ s32 sp1C;                            /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_800C20F4 {
    /* 0x00 */ char pad0[0x48];
    /* 0x48 */ s32 sp48;                            /* inferred */
    /* 0x4C */ char pad4C[0x1C];                    /* maybe part of sp48[8]? */
    /* 0x68 */ s32 sp68;                            /* inferred */
    /* 0x6C */ char pad6C[0x4];
};                                                  /* size = 0x70 */

struct _mips2c_stack_func_800C2310 {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_800C2460 {
    /* 0x00 */ char pad0[0x1C];
    /* 0x1C */ s32 sp1C;                            /* inferred */
    /* 0x20 */ s32 sp20;                            /* inferred */
    /* 0x24 */ s32 sp24;                            /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_800C2514 {
    /* 0x00 */ char pad0[0x1C];
    /* 0x1C */ s32 sp1C;                            /* inferred */
    /* 0x20 */ s32 sp20;                            /* inferred */
    /* 0x24 */ s32 sp24;                            /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_800C25E0 {};              /* size 0x0 */

struct _mips2c_stack_func_800C2BE0 {
    /* 0x00 */ char pad0[0x44];
    /* 0x44 */ CollisionPoly *sp44;                 /* inferred */
    /* 0x48 */ char pad48[0x4];
    /* 0x4C */ u32 sp4C;                            /* inferred */
    /* 0x50 */ u32 sp50;                            /* inferred */
    /* 0x54 */ u32 sp54;                            /* inferred */
    /* 0x58 */ ? sp58;                              /* inferred */
    /* 0x58 */ char pad58[0xC];
    /* 0x64 */ ? sp64;                              /* inferred */
    /* 0x64 */ char pad64[0xC];
    /* 0x70 */ ? sp70;                              /* inferred */
    /* 0x70 */ char pad70[0xC];
    /* 0x7C */ f32 sp7C;                            /* inferred */
    /* 0x80 */ f32 sp80;                            /* inferred */
    /* 0x84 */ f32 sp84;                            /* inferred */
    /* 0x88 */ f32 sp88;                            /* inferred */
    /* 0x8C */ char pad8C[0x4];
    /* 0x90 */ ? sp90;                              /* inferred */
    /* 0x90 */ char pad90[0xC];
    /* 0x9C */ ? sp9C;                              /* inferred */
    /* 0x9C */ char pad9C[0xC];
    /* 0xA8 */ ? spA8;                              /* inferred */
    /* 0xA8 */ char padA8[0xC];
    /* 0xB4 */ ? spB4;                              /* inferred */
    /* 0xB4 */ char padB4[0x4];
};                                                  /* size = 0xB8 */

struct _mips2c_stack_func_800C3C00 {};              /* size 0x0 */

struct _mips2c_stack_func_800C3C14 {};              /* size 0x0 */

struct _mips2c_stack_func_800C3C94 {};              /* size 0x0 */

struct _mips2c_stack_func_800C3D50 {
    /* 0x00 */ char pad0[0x68];
    /* 0x68 */ s32 sp68;                            /* inferred */
    /* 0x6C */ CollisionContext *sp6C;              /* inferred */
    /* 0x70 */ s16 sp70;                            /* inferred */
    /* 0x72 */ char pad72[0x2];
    /* 0x74 */ CollisionPoly **sp74;                /* inferred */
    /* 0x78 */ f32 sp78;                            /* inferred */
    /* 0x7C */ Vec3f *sp7C;                         /* inferred */
    /* 0x80 */ s32 *sp80;                           /* inferred */
    /* 0x84 */ s32 sp84;                            /* inferred */
    /* 0x88 */ Actor *sp88;                         /* inferred */
    /* 0x8C */ s32 sp8C;                            /* inferred */
    /* 0x90 */ f32 sp90;                            /* inferred */
    /* 0x94 */ char pad94[0xC];                     /* maybe part of sp90[4]? */
    /* 0xA0 */ ? spA0;                              /* inferred */
    /* 0xA0 */ char padA0[0x4];
    /* 0xA4 */ f32 spA4;                            /* inferred */
    /* 0xA8 */ char padA8[0x10];
};                                                  /* size = 0xB8 */

struct _mips2c_stack_func_800C3F40 {
    /* 0x00 */ char pad0[0x34];
    /* 0x34 */ s32 sp34;                            /* inferred */
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_800C3FA0 {
    /* 0x00 */ char pad0[0x34];
    /* 0x34 */ s32 sp34;                            /* inferred */
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_800C4000 {
    /* 0x00 */ char pad0[0x34];
    /* 0x34 */ s32 sp34;                            /* inferred */
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_800C4058 {
    /* 0x00 */ char pad0[0x34];
    /* 0x34 */ s32 sp34;                            /* inferred */
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_800C40B4 {
    /* 0x00 */ char pad0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_800C411C {
    /* 0x00 */ char pad0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_800C4188 {
    /* 0x00 */ char pad0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_800C41E4 {
    /* 0x00 */ char pad0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_800C4240 {
    /* 0x00 */ char pad0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_800C42A8 {
    /* 0x00 */ char pad0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_800C4314 {
    /* 0x00 */ char pad0[0x34];
    /* 0x34 */ s32 sp34;                            /* inferred */
    /* 0x38 */ char pad38[0x4];
    /* 0x3C */ CollisionPoly *sp3C;                 /* inferred */
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_800C43CC {
    /* 0x00 */ char pad0[0x34];
    /* 0x34 */ CollisionPoly *sp34;                 /* inferred */
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_800C4488 {
    /* 0x00 */ char pad0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_800C44F0 {
    /* 0x00 */ char pad0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_800C455C {
    /* 0x00 */ char pad0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_800C45C4 {
    /* 0x00 */ char pad0[0x40];
    /* 0x40 */ f32 *sp40;                           /* inferred */
    /* 0x44 */ char pad44[0x10];                    /* maybe part of sp40[5]? */
    /* 0x54 */ f32 sp54;                            /* inferred */
    /* 0x58 */ f32 sp58;                            /* inferred */
    /* 0x5C */ char pad5C[0x4];
    /* 0x60 */ f32 sp60;                            /* inferred */
    /* 0x64 */ char pad64[0x18];                    /* maybe part of sp60[7]? */
    /* 0x7C */ ? sp7C;                              /* inferred */
    /* 0x7C */ char pad7C[0x4];
    /* 0x80 */ f32 sp80;                            /* inferred */
    /* 0x84 */ char pad84[0x4];
    /* 0x88 */ ? sp88;                              /* inferred */
    /* 0x88 */ char pad88[0x4];
    /* 0x8C */ f32 sp8C;                            /* inferred */
    /* 0x90 */ char pad90[0x14];                    /* maybe part of sp8C[6]? */
    /* 0xA4 */ s32 spA4;                            /* inferred */
    /* 0xA8 */ f32 spA8;                            /* inferred */
    /* 0xAC */ f32 spAC;                            /* inferred */
    /* 0xB0 */ f32 spB0;                            /* inferred */
    /* 0xB4 */ s32 spB4;                            /* inferred */
    /* 0xB8 */ ? spB8;                              /* inferred */
    /* 0xB8 */ char padB8[0x4];
    /* 0xBC */ f32 spBC;                            /* inferred */
    /* 0xC0 */ char padC0[0x10];                    /* maybe part of spBC[5]? */
    /* 0xD0 */ void *spD0;                          /* inferred */
    /* 0xD4 */ s32 spD4;                            /* inferred */
    /* 0xD8 */ char padD8[0x4];
    /* 0xDC */ StaticLookup *spDC;                  /* inferred */
};                                                  /* size = 0xE0 */

struct _mips2c_stack_func_800C4C74 {
    /* 0x00 */ char pad0[0x3C];
    /* 0x3C */ s32 sp3C;                            /* inferred */
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_800C4CD8 {
    /* 0x00 */ char pad0[0x38];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_800C4D3C {
    /* 0x00 */ char pad0[0x38];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_800C4DA4 {
    /* 0x00 */ char pad0[0x38];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_800C4E10 {
    /* 0x00 */ char pad0[0x3C];
    /* 0x3C */ f32 sp3C;                            /* inferred */
    /* 0x40 */ ? sp40;                              /* inferred */
    /* 0x40 */ char pad40[0x4];
    /* 0x44 */ f32 sp44;                            /* inferred */
    /* 0x48 */ char pad48[0x4];
    /* 0x4C */ s32 sp4C;                            /* inferred */
    /* 0x50 */ char pad50[0x4];
    /* 0x54 */ StaticLookup *sp54;                  /* inferred */
};                                                  /* size = 0x58 */

struct _mips2c_stack_func_800C4F38 {
    /* 0x00 */ char pad0[0x28];
    /* 0x28 */ s32 sp28;                            /* inferred */
    /* 0x2C */ CollisionPoly *sp2C;                 /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_800C4F84 {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_800C4FD4 {
    /* 0x000 */ char pad0[0x68];
    /* 0x068 */ s32 sp68;                           /* inferred */
    /* 0x06C */ char pad6C[0x10];                   /* maybe part of sp68[5]? */
    /* 0x07C */ s32 sp7C;                           /* inferred */
    /* 0x080 */ s32 sp80;                           /* inferred */
    /* 0x084 */ char pad84[0x8];                    /* maybe part of sp80[3]? */
    /* 0x08C */ f32 sp8C;                           /* inferred */
    /* 0x090 */ f32 sp90;                           /* inferred */
    /* 0x094 */ f32 sp94;                           /* inferred */
    /* 0x098 */ f32 sp98;                           /* inferred */
    /* 0x09C */ f32 sp9C;                           /* inferred */
    /* 0x0A0 */ f32 spA0;                           /* inferred */
    /* 0x0A4 */ void *spA4;                         /* inferred */
    /* 0x0A8 */ char padA8[0x4];
    /* 0x0AC */ CollisionContext *spAC;             /* inferred */
    /* 0x0B0 */ u16 spB0;                           /* inferred */
    /* 0x0B2 */ s16 spB2;                           /* inferred */
    /* 0x0B4 */ ? *spB4;                            /* inferred */
    /* 0x0B8 */ ? *spB8;                            /* inferred */
    /* 0x0BC */ Vec3f *spBC;                        /* inferred */
    /* 0x0C0 */ Vec3f *spC0;                        /* inferred */
    /* 0x0C4 */ f32 spC4;                           /* inferred */
    /* 0x0C8 */ s32 *spC8;                          /* inferred */
    /* 0x0CC */ s32 spCC;                           /* inferred */
    /* 0x0D0 */ void **spD0;                        /* inferred */
    /* 0x0D4 */ ? spD4;                             /* inferred */
    /* 0x0D4 */ char padD4[0x10];
    /* 0x0E4 */ s32 spE4;                           /* inferred */
    /* 0x0E8 */ s32 spE8;                           /* inferred */
    /* 0x0EC */ s32 spEC;                           /* inferred */
    /* 0x0F0 */ s32 spF0;                           /* inferred */
    /* 0x0F4 */ s32 spF4;                           /* inferred */
    /* 0x0F8 */ s32 spF8;                           /* inferred */
    /* 0x0FC */ s32 spFC;                           /* inferred */
    /* 0x100 */ StaticLookup *sp100;                /* inferred */
    /* 0x104 */ char pad104[0x4];
};                                                  /* size = 0x108 */

struct _mips2c_stack_func_800C5464 {};              /* size 0x0 */

struct _mips2c_stack_func_800C54AC {
    /* 0x00 */ char pad0[0x38];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_800C5538 {
    /* 0x00 */ char pad0[0x38];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_800C55C4 {
    /* 0x00 */ char pad0[0x38];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_800C5650 {
    /* 0x00 */ char pad0[0x38];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_800C56E0 {
    /* 0x00 */ char pad0[0x38];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_800C576C {
    /* 0x00 */ char pad0[0x38];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_800C57F8 {
    /* 0x00 */ char pad0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_800C583C {
    /* 0x00 */ char pad0[0x3C];
    /* 0x3C */ f32 sp3C;                            /* inferred */
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_800C58C8 {
    /* 0x00 */ char pad0[0x38];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_800C5954 {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_800C5A20 {
    /* 0x00 */ char pad0[0x28];
    /* 0x28 */ s32 sp28;                            /* inferred */
    /* 0x2C */ ? sp2C;                              /* inferred */
    /* 0x2C */ char pad2C[0x4];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_800C5A64 {
    /* 0x00 */ char pad0[0x28];
    /* 0x28 */ s32 sp28;                            /* inferred */
    /* 0x2C */ ? sp2C;                              /* inferred */
    /* 0x2C */ char pad2C[0x4];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_800C5B80 {};              /* size 0x0 */

struct _mips2c_stack_func_800C62BC {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_800C6314 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_800C636C {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_800C63C4 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_800C641C {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_800C6474 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_800C6554 {};              /* size 0x0 */

struct _mips2c_stack_func_800C756C {};              /* size 0x0 */

struct _mips2c_stack_func_800C76EC {
    /* 0x00 */ char pad0[0x78];
    /* 0x78 */ f32 sp78;                            /* inferred */
    /* 0x7C */ char pad7C[0xC];
};                                                  /* size = 0x88 */

struct _mips2c_stack_func_800C7974 {
    /* 0x000 */ char pad0[0x6C];
    /* 0x06C */ f32 sp6C;                           /* inferred */
    /* 0x070 */ ? sp70;                             /* inferred */
    /* 0x070 */ char pad70[0x14];
    /* 0x084 */ s32 sp84;                           /* inferred */
    /* 0x088 */ char pad88[0x4];
    /* 0x08C */ ? sp8C;                             /* inferred */
    /* 0x08C */ char pad8C[0x48];
    /* 0x0D4 */ f32 spD4;                           /* inferred */
    /* 0x0D8 */ f32 spD8;                           /* inferred */
    /* 0x0DC */ f32 spDC;                           /* inferred */
    /* 0x0E0 */ f32 spE0;                           /* inferred */
    /* 0x0E4 */ f32 spE4;                           /* inferred */
    /* 0x0E8 */ f32 spE8;                           /* inferred */
    /* 0x0EC */ ? spEC;                             /* inferred */
    /* 0x0EC */ char padEC[0xC];
    /* 0x0F8 */ ? spF8;                             /* inferred */
    /* 0x0F8 */ char padF8[0xC];
    /* 0x104 */ ? sp104;                            /* inferred */
    /* 0x104 */ char pad104[0x1C];
};                                                  /* size = 0x120 */

struct _mips2c_stack_func_800C7E40 {
    /* 0x00 */ char pad0[0x78];
    /* 0x78 */ f32 sp78;                            /* inferred */
    /* 0x7C */ char pad7C[0x1C];                    /* maybe part of sp78[8]? */
    /* 0x98 */ f32 sp98;                            /* inferred */
    /* 0x9C */ char pad9C[0x18];                    /* maybe part of sp98[7]? */
    /* 0xB4 */ f32 spB4;                            /* inferred */
    /* 0xB8 */ char padB8[0x4];
    /* 0xBC */ f32 spBC;                            /* inferred */
    /* 0xC0 */ f32 spC0;                            /* inferred */
    /* 0xC4 */ f32 spC4;                            /* inferred */
    /* 0xC8 */ f32 spC8;                            /* inferred */
    /* 0xCC */ char padCC[0x8];                     /* maybe part of spC8[3]? */
    /* 0xD4 */ s32 spD4;                            /* inferred */
    /* 0xD8 */ f32 spD8;                            /* inferred */
    /* 0xDC */ char padDC[0x4];
};                                                  /* size = 0xE0 */

struct _mips2c_stack_func_800C8580 {
    /* 0x00 */ char pad0[0x90];
    /* 0x90 */ s32 sp90;                            /* inferred */
    /* 0x94 */ f32 sp94;                            /* inferred */
    /* 0x98 */ f32 sp98;                            /* inferred */
    /* 0x9C */ f32 sp9C;                            /* inferred */
};                                                  /* size = 0xA0 */

struct _mips2c_stack_func_800C87D0 {
    /* 0x00 */ char pad0[0x84];
    /* 0x84 */ f32 sp84;                            /* inferred */
    /* 0x88 */ f32 sp88;                            /* inferred */
    /* 0x8C */ f32 sp8C;                            /* inferred */
    /* 0x90 */ char pad90[0x4];
    /* 0x94 */ f32 sp94;                            /* inferred */
    /* 0x98 */ f32 *sp98;                           /* inferred */
    /* 0x9C */ f32 sp9C;                            /* inferred */
    /* 0xA0 */ s32 spA0;                            /* inferred */
    /* 0xA4 */ char padA4[0xC];
};                                                  /* size = 0xB0 */

struct _mips2c_stack_func_800C8A60 {
    /* 0x00 */ char pad0[0x70];
    /* 0x70 */ CollisionPoly *sp70;                 /* inferred */
    /* 0x74 */ char pad74[0x4];
    /* 0x78 */ f32 sp78;                            /* inferred */
    /* 0x7C */ char pad7C[0xC];
};                                                  /* size = 0x88 */

struct _mips2c_stack_func_800C8BD0 {
    /* 0x00 */ char pad0[0x40];
    /* 0x40 */ CollisionPoly *sp40;                 /* inferred */
    /* 0x44 */ s32 sp44;                            /* inferred */
    /* 0x48 */ Vec3f *sp48;                         /* inferred */
    /* 0x4C */ void *sp4C;                          /* inferred */
    /* 0x50 */ ? *sp50;                             /* inferred */
    /* 0x54 */ s32 sp54;                            /* inferred */
    /* 0x58 */ f32 sp58;                            /* inferred */
    /* 0x5C */ char pad5C[0x4];
    /* 0x60 */ ? sp60;                              /* inferred */
    /* 0x60 */ char pad60[0x18];
};                                                  /* size = 0x78 */

struct _mips2c_stack_func_800C8DC0 {
    /* 0x00 */ char pad0[0x1C];
    /* 0x1C */ s32 sp1C;                            /* inferred */
    /* 0x20 */ CollisionContext *sp20;              /* inferred */
    /* 0x24 */ s16 sp24;                            /* inferred */
    /* 0x26 */ char pad26[0x2];
    /* 0x28 */ s32 sp28;                            /* inferred */
    /* 0x2C */ s32 sp2C;                            /* inferred */
    /* 0x30 */ ? *sp30;                             /* inferred */
    /* 0x34 */ ? *sp34;                             /* inferred */
    /* 0x38 */ Vec3f *sp38;                         /* inferred */
    /* 0x3C */ Vec3f *sp3C;                         /* inferred */
    /* 0x40 */ s32 sp40;                            /* inferred */
    /* 0x44 */ f32 *sp44;                           /* inferred */
    /* 0x48 */ s32 *sp48;                           /* inferred */
    /* 0x4C */ void **sp4C;                         /* inferred */
    /* 0x50 */ s32 sp50;                            /* inferred */
    /* 0x54 */ s32 sp54;                            /* inferred */
};                                                  /* size = 0x58 */

struct _mips2c_stack_func_800C8EEC {
    /* 0x00 */ char pad0[0x7C];
    /* 0x7C */ ? sp7C;                              /* inferred */
    /* 0x7C */ char pad7C[0xC];
    /* 0x88 */ ? sp88;                              /* inferred */
    /* 0x88 */ char pad88[0x18];
};                                                  /* size = 0xA0 */

struct _mips2c_stack_func_800C90AC {
    /* 0x00 */ char pad0[0x48];
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_800C921C {
    /* 0x00 */ char pad0[0x2C];
    /* 0x2C */ s32 sp2C;                            /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_800C9380 {
    /* 0x00 */ char pad0[0x64];
    /* 0x64 */ s16 sp64;                            /* inferred */
    /* 0x66 */ s16 sp66;                            /* inferred */
    /* 0x68 */ s16 sp68;                            /* inferred */
    /* 0x6A */ s16 sp6A;                            /* inferred */
    /* 0x6C */ char pad6C[0x4];
};                                                  /* size = 0x70 */

struct _mips2c_stack_func_800C9704 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_800C9728 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_800C9770 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_800C97F8 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_800C9844 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_800C98CC {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_800C9924 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_800C99AC {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_800C99D4 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_800C99FC {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_800C9A24 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_800C9A4C {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_800C9A7C {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_800C9AB0 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_800C9AE4 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_800C9B18 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_800C9B40 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_800C9B68 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_800C9B90 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_800C9BB8 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_800C9BDC {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_800C9C24 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_800C9C74 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_800C9C9C {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_800C9CC4 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_800C9CEC {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_800C9D14 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_800C9D50 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_800C9D8C {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_800C9DDC {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_800C9E18 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_800C9E40 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_800C9E88 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_800C9EBC {};              /* size 0x0 */

struct _mips2c_stack_func_800CA1AC {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_800CA1E8 {
    /* 0x00 */ char pad0[0x2C];
    /* 0x2C */ s32 sp2C;                            /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_800CA22C {};              /* size 0x0 */

struct _mips2c_stack_func_800CA568 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_800CA634 {};              /* size 0x0 */

struct _mips2c_stack_func_800CA648 {
    /* 0x00 */ char pad0[0x18];
    /* 0x18 */ CollisionHeader *sp18;               /* inferred */
    /* 0x1C */ char pad1C[0xC];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_800CA6B8 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_800CA6D8 {};              /* size 0x0 */

struct _mips2c_stack_func_800CA6F0 {
    /* 0x0 */ char pad0[0x4];
    /* 0x4 */ s32 sp4;                              /* inferred */
};                                                  /* size = 0x8 */

struct _mips2c_stack_func_800CA9D0 {
    /* 0x00 */ char pad0[0x2C];
    /* 0x2C */ s32 sp2C;                            /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_800CAA14 {
    /* 0x00 */ char pad0[0x40];
    /* 0x40 */ f32 sp40;                            /* inferred */
    /* 0x44 */ f32 sp44;                            /* inferred */
    /* 0x48 */ f32 sp48;                            /* inferred */
    /* 0x4C */ f32 sp4C;                            /* inferred */
    /* 0x50 */ f32 sp50;                            /* inferred */
    /* 0x54 */ f32 sp54;                            /* inferred */
};                                                  /* size = 0x58 */

f64 func_80086D24(f64);                             /* extern */
? func_80179678(f32, f32, f32, f32, f32, f32, f32, f32, s32, s32, s32); /* extern */
s32 func_8017A304(Vec3f *, Vec3f *, Vec3f *, ?32, ?32, CollisionContext *); /* extern */
s32 func_8017AD38(Vec3f *, Vec3f *, ? *, ? *);      /* extern */
s32 func_8017BAD0(Vec3f *, Vec3f *, Vec3f *, f32, f32, f32, f32, f32); /* extern */
? func_8017BE30(f32, f32, Vec3f *, Vec3f *, Vec3f *, f32, f32, f32, f32, s32, CollisionPoly *, f32 *, f32); /* extern */
s32 func_8017BEE0(f32, f32 *, ? *, ? *, f32, f32, f32, f32, ?32, ?32, f32 *, f32); /* extern */
s32 func_8017C008(? *, ? *, ? *, f32, f32, f32, f32, f32, f32, ? *, f32, f32); /* extern */
s32 func_8017C494(f32, f32, Vec3f *, Vec3f *, Vec3f *, f32, f32, f32, f32, ?32, ?32, f32 *, CollisionContext *); /* extern */
