typedef struct {
    /* 0x0 */ u32 validModes;
    /* 0x4 */ ? unk_4;                              /* inferred */
    /* 0x4 */ char pad_4[0x4];
    /* 0x8 */ CameraModeParams *modes;
} CameraStateParams;                                /* size = 0xC */

typedef struct {
    /* 0x000 */ u32 magic;
    /* 0x004 */ GraphicsContext *gfxCtx;
    /* 0x008 */ Viewport viewport;
    /* 0x018 */ f32 fovy;
    /* 0x01C */ f32 zNear;
    /* 0x020 */ f32 zFar;
    /* 0x024 */ f32 scale;
    /* 0x028 */ Vec3f eye;
    /* 0x034 */ Vec3f at;
    /* 0x040 */ Vec3f up;
    /* 0x04C */ char pad_4C[0x4];
    /* 0x050 */ Vp vp;
    /* 0x060 */ Mtx projection;
    /* 0x0A0 */ Mtx viewing;
    /* 0x0E0 */ Mtx unkE0;
    /* 0x120 */ Mtx *projectionPtr;
    /* 0x124 */ Mtx *viewingPtr;
    /* 0x128 */ Vec3f quakeRot;
    /* 0x134 */ Vec3f quakeScale;
    /* 0x140 */ f32 quakeSpeed;
    /* 0x144 */ Vec3f currQuakeRot;
    /* 0x150 */ Vec3f currQuakeScale;
    /* 0x15C */ u16 normal;
    /* 0x15E */ char pad_15E[0x2];
    /* 0x160 */ u32 flags;
    /* 0x164 */ s32 unk_164;                        /* inferred */
} View;                                             /* size = 0x168 */

struct _mips2c_stack_Camera_Alloc {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ void *sp1C;                          /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_Camera_ClearFlags {};          /* size 0x0 */

struct _mips2c_stack_Camera_Free {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Camera_Init {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_Camera_LengthVec3f {};         /* size 0x0 */

struct _mips2c_stack_Camera_LerpVec3f {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_Camera_Lerpf {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ f32 sp18;                            /* inferred */
    /* 0x1C */ char pad_1C[0xC];
};                                                  /* size = 0x28 */

struct _mips2c_stack_Camera_Lerps {};               /* size 0x0 */

struct _mips2c_stack_Camera_ModeBATT0 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Camera_ModeBATT1 {
    /* 0x000 */ char pad_0[0x40];
    /* 0x040 */ PosRot *sp40;                       /* inferred */
    /* 0x044 */ char pad_44[0x4];
    /* 0x048 */ Vec3f *sp48;                        /* inferred */
    /* 0x04C */ Vec3f *sp4C;                        /* inferred */
    /* 0x050 */ Vec3f *sp50;                        /* inferred */
    /* 0x054 */ char pad_54[0x8];                   /* maybe part of sp50[3]? */
    /* 0x05C */ s16 sp5C;                           /* inferred */
    /* 0x05E */ s16 sp5E;                           /* inferred */
    /* 0x060 */ char pad_60[0x8];                   /* maybe part of sp5E[5]? */
    /* 0x068 */ f32 sp68;                           /* inferred */
    /* 0x06C */ char pad_6C[0xC];                   /* maybe part of sp68[4]? */
    /* 0x078 */ f32 sp78;                           /* inferred */
    /* 0x07C */ f32 sp7C;                           /* inferred */
    /* 0x080 */ f32 sp80;                           /* inferred */
    /* 0x084 */ s16 sp84;                           /* inferred */
    /* 0x086 */ s16 sp86;                           /* inferred */
    /* 0x088 */ s16 sp88;                           /* inferred */
    /* 0x08A */ s16 sp8A;                           /* inferred */
    /* 0x08C */ PosRot *sp8C;                       /* inferred */
    /* 0x090 */ char pad_90[0x4];
    /* 0x094 */ f32 sp94;                           /* inferred */
    /* 0x098 */ s16 sp98;                           /* inferred */
    /* 0x09A */ s16 sp9A;                           /* inferred */
    /* 0x09C */ f32 sp9C;                           /* inferred */
    /* 0x0A0 */ s16 spA0;                           /* inferred */
    /* 0x0A2 */ s16 spA2;                           /* inferred */
    /* 0x0A4 */ f32 spA4;                           /* inferred */
    /* 0x0A8 */ s16 spA8;                           /* inferred */
    /* 0x0AA */ s16 spAA;                           /* inferred */
    /* 0x0AC */ f32 spAC;                           /* inferred */
    /* 0x0B0 */ s16 spB0;                           /* inferred */
    /* 0x0B2 */ s16 spB2;                           /* inferred */
    /* 0x0B4 */ f32 spB4;                           /* inferred */
    /* 0x0B8 */ s16 spB8;                           /* inferred */
    /* 0x0BA */ s16 spBA;                           /* inferred */
    /* 0x0BC */ f32 spBC;                           /* inferred */
    /* 0x0C0 */ s16 spC0;                           /* inferred */
    /* 0x0C2 */ s16 spC2;                           /* inferred */
    /* 0x0C4 */ f32 spC4;                           /* inferred */
    /* 0x0C8 */ f32 spC8;                           /* inferred */
    /* 0x0CC */ f32 spCC;                           /* inferred */
    /* 0x0D0 */ char pad_D0[0x1C];                  /* maybe part of spCC[8]? */
    /* 0x0EC */ f32 spEC;                           /* inferred */
    /* 0x0F0 */ s32 spF0;                           /* inferred */
    /* 0x0F4 */ f32 spF4;                           /* inferred */
    /* 0x0F8 */ f32 spF8;                           /* inferred */
    /* 0x0FC */ f32 spFC;                           /* inferred */
    /* 0x100 */ char pad_100[0x4];
    /* 0x104 */ f32 sp104;                          /* inferred */
    /* 0x108 */ char pad_108[0xC];                  /* maybe part of sp104[4]? */
    /* 0x114 */ f32 sp114;                          /* inferred */
    /* 0x118 */ f32 sp118;                          /* inferred */
    /* 0x11C */ f32 sp11C;                          /* inferred */
    /* 0x120 */ ? sp120;                            /* inferred */
    /* 0x120 */ char pad_120[0x4];
    /* 0x124 */ f32 sp124;                          /* inferred */
    /* 0x128 */ char pad_128[0x10];
};                                                  /* size = 0x138 */

struct _mips2c_stack_Camera_ModeBATT2 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Camera_ModeBATT3 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Camera_ModeBATT4 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Camera_ModeDATA0 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Camera_ModeDATA1 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Camera_ModeDATA2 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Camera_ModeDATA3 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Camera_ModeDATA4 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Camera_ModeDEMO0 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ s8 *sp1C;                            /* inferred */
    /* 0x20 */ Vec3f *sp20;                         /* inferred */
    /* 0x24 */ Vec3f *sp24;                         /* inferred */
    /* 0x28 */ char pad_28[0x18];                   /* maybe part of sp24[7]? */
    /* 0x40 */ Camera *sp40;                        /* inferred */
    /* 0x44 */ char pad_44[0xC];
};                                                  /* size = 0x50 */

struct _mips2c_stack_Camera_ModeDEMO1 {
    /* 0x00 */ char pad_0[0x38];
    /* 0x38 */ Vec3f *sp38;                         /* inferred */
    /* 0x3C */ Vec3f *sp3C;                         /* inferred */
    /* 0x40 */ char pad_40[0x4];
    /* 0x44 */ ? sp44;                              /* inferred */
    /* 0x44 */ char pad_44[0x1C];
    /* 0x60 */ f32 sp60;                            /* inferred */
    /* 0x64 */ f32 sp64;                            /* inferred */
    /* 0x68 */ f32 sp68;                            /* inferred */
    /* 0x6C */ ? sp6C;                              /* inferred */
    /* 0x6C */ char pad_6C[0x8];
    /* 0x74 */ f32 sp74;                            /* inferred */
    /* 0x78 */ f32 sp78;                            /* inferred */
    /* 0x7C */ f32 sp7C;                            /* inferred */
    /* 0x80 */ char pad_80[0x8];                    /* maybe part of sp7C[3]? */
    /* 0x88 */ f32 sp88;                            /* inferred */
    /* 0x8C */ char pad_8C[0x8];                    /* maybe part of sp88[3]? */
    /* 0x94 */ s16 sp94;                            /* inferred */
    /* 0x96 */ s16 sp96;                            /* inferred */
    /* 0x98 */ Actor *sp98;                         /* inferred */
    /* 0x9C */ char pad_9C[0x14];
};                                                  /* size = 0xB0 */

struct _mips2c_stack_Camera_ModeDEMO2 {
    /* 0x00 */ char pad_0[0x28];
    /* 0x28 */ PosRot *sp28;                        /* inferred */
    /* 0x2C */ char pad_2C[0x4];
    /* 0x30 */ Vec3f *sp30;                         /* inferred */
    /* 0x34 */ Vec3f *sp34;                         /* inferred */
    /* 0x38 */ char pad_38[0x10];                   /* maybe part of sp34[5]? */
    /* 0x48 */ Vec3f *sp48;                         /* inferred */
    /* 0x4C */ ? *sp4C;                             /* inferred */
    /* 0x50 */ char pad_50[0x2];
    /* 0x52 */ s16 sp52;                            /* inferred */
    /* 0x54 */ f32 sp54;                            /* inferred */
    /* 0x58 */ char pad_58[0x3];
    /* 0x5B */ u8 sp5B;                             /* inferred */
    /* 0x5C */ char pad_5C[0x4];                    /* maybe part of sp5B[5]? */
    /* 0x60 */ f32 sp60;                            /* inferred */
    /* 0x64 */ f32 sp64;                            /* inferred */
    /* 0x68 */ f32 sp68;                            /* inferred */
    /* 0x6C */ f32 sp6C;                            /* inferred */
    /* 0x70 */ f32 sp70;                            /* inferred */
    /* 0x74 */ f32 sp74;                            /* inferred */
    /* 0x78 */ f32 sp78;                            /* inferred */
    /* 0x7C */ f32 sp7C;                            /* inferred */
    /* 0x80 */ f32 sp80;                            /* inferred */
    /* 0x84 */ f32 sp84;                            /* inferred */
    /* 0x88 */ f32 sp88;                            /* inferred */
    /* 0x8C */ s16 sp8C;                            /* inferred */
    /* 0x8E */ s16 sp8E;                            /* inferred */
    /* 0x90 */ f32 sp90;                            /* inferred */
    /* 0x94 */ s16 sp94;                            /* inferred */
    /* 0x96 */ s16 sp96;                            /* inferred */
    /* 0x98 */ f32 sp98;                            /* inferred */
    /* 0x9C */ s16 sp9C;                            /* inferred */
    /* 0x9E */ s16 sp9E;                            /* inferred */
    /* 0xA0 */ char pad_A0[0x10];
};                                                  /* size = 0xB0 */

struct _mips2c_stack_Camera_ModeDEMO3 {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ s8 *sp2C;                            /* inferred */
    /* 0x30 */ Vec3f *sp30;                         /* inferred */
    /* 0x34 */ Vec3f *sp34;                         /* inferred */
    /* 0x38 */ char pad_38[0x18];                   /* maybe part of sp34[7]? */
    /* 0x50 */ f32 sp50;                            /* inferred */
    /* 0x54 */ f32 sp54;                            /* inferred */
    /* 0x58 */ f32 sp58;                            /* inferred */
    /* 0x5C */ char pad_5C[0x8];                    /* maybe part of sp58[3]? */
    /* 0x64 */ f32 sp64;                            /* inferred */
    /* 0x68 */ char pad_68[0x10];
};                                                  /* size = 0x78 */

struct _mips2c_stack_Camera_ModeDEMO4 {
    /* 0x00 */ char pad_0[0x30];
    /* 0x30 */ PosRot *sp30;                        /* inferred */
    /* 0x34 */ Vec3f *sp34;                         /* inferred */
    /* 0x38 */ Vec3f *sp38;                         /* inferred */
    /* 0x3C */ char pad_3C[0x1C];                   /* maybe part of sp38[8]? */
    /* 0x58 */ f32 sp58;                            /* inferred */
    /* 0x5C */ f32 sp5C;                            /* inferred */
    /* 0x60 */ f32 sp60;                            /* inferred */
    /* 0x64 */ f32 sp64;                            /* inferred */
    /* 0x68 */ char pad_68[0xC];                    /* maybe part of sp64[4]? */
    /* 0x74 */ f32 sp74;                            /* inferred */
    /* 0x78 */ s16 sp78;                            /* inferred */
    /* 0x7A */ char pad_7A[0xE];
};                                                  /* size = 0x88 */

struct _mips2c_stack_Camera_ModeDEMO5 {
    /* 0x00 */ char pad_0[0x30];
    /* 0x30 */ s8 *sp30;                            /* inferred */
    /* 0x34 */ Vec3f *sp34;                         /* inferred */
    /* 0x38 */ Vec3f *sp38;                         /* inferred */
    /* 0x3C */ char pad_3C[0x1C];                   /* maybe part of sp38[8]? */
    /* 0x58 */ f32 sp58;                            /* inferred */
    /* 0x5C */ f32 sp5C;                            /* inferred */
    /* 0x60 */ f32 sp60;                            /* inferred */
    /* 0x64 */ f32 sp64;                            /* inferred */
    /* 0x68 */ char pad_68[0xC];                    /* maybe part of sp64[4]? */
    /* 0x74 */ f32 sp74;                            /* inferred */
    /* 0x78 */ s16 sp78;                            /* inferred */
    /* 0x7A */ char pad_7A[0xE];
};                                                  /* size = 0x88 */

struct _mips2c_stack_Camera_ModeDEMO6 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Camera_ModeDEMO7 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Camera_ModeDEMO8 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Camera_ModeDEMO9 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Camera_ModeFIXD0 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Camera_ModeFIXD1 {
    /* 0x00 */ char pad_0[0x30];
    /* 0x30 */ PosRot *sp30;                        /* inferred */
    /* 0x34 */ Vec3f *sp34;                         /* inferred */
    /* 0x38 */ Vec3f *sp38;                         /* inferred */
    /* 0x3C */ char pad_3C[0x8];                    /* maybe part of sp38[3]? */
    /* 0x44 */ ? sp44;                              /* inferred */
    /* 0x44 */ char pad_44[0x6];
    /* 0x4A */ s16 sp4A;                            /* inferred */
    /* 0x4C */ PosRot *sp4C;                        /* inferred */
    /* 0x50 */ PosRot *sp50;                        /* inferred */
    /* 0x54 */ s32 sp54;                            /* inferred */
    /* 0x58 */ f32 sp58;                            /* inferred */
    /* 0x5C */ char pad_5C[0xC];                    /* maybe part of sp58[4]? */
    /* 0x68 */ void *sp68;                          /* inferred */
    /* 0x6C */ ? sp6C;                              /* inferred */
    /* 0x6C */ char pad_6C[0x4];
    /* 0x70 */ f32 sp70;                            /* inferred */
    /* 0x74 */ char pad_74[0x8];                    /* maybe part of sp70[3]? */
    /* 0x7C */ ? sp7C;                              /* inferred */
    /* 0x7C */ char pad_7C[0x8];
    /* 0x84 */ ? sp84;                              /* inferred */
    /* 0x84 */ char pad_84[0x4];
    /* 0x88 */ s16 sp88;                            /* inferred */
    /* 0x8A */ s16 sp8A;                            /* inferred */
    /* 0x8C */ f32 sp8C;                            /* inferred */
    /* 0x90 */ s16 sp90;                            /* inferred */
    /* 0x92 */ s16 sp92;                            /* inferred */
    /* 0x94 */ char pad_94[0xC];
};                                                  /* size = 0xA0 */

struct _mips2c_stack_Camera_ModeFIXD2 {
    /* 0x00 */ char pad_0[0x34];
    /* 0x34 */ PosRot *sp34;                        /* inferred */
    /* 0x38 */ PosRot *sp38;                        /* inferred */
    /* 0x3C */ Vec3f *sp3C;                         /* inferred */
    /* 0x40 */ Vec3f *sp40;                         /* inferred */
    /* 0x44 */ ? sp44;                              /* inferred */
    /* 0x44 */ char pad_44[0x1C];
    /* 0x60 */ f32 sp60;                            /* inferred */
    /* 0x64 */ char pad_64[0xC];                    /* maybe part of sp60[4]? */
    /* 0x70 */ f32 sp70;                            /* inferred */
    /* 0x74 */ s16 sp74;                            /* inferred */
    /* 0x76 */ s16 sp76;                            /* inferred */
    /* 0x78 */ PosRot *sp78;                        /* inferred */
    /* 0x7C */ PosRot *sp7C;                        /* inferred */
    /* 0x80 */ f32 sp80;                            /* inferred */
    /* 0x84 */ char pad_84[0x4];
    /* 0x88 */ void *sp88;                          /* inferred */
    /* 0x8C */ char pad_8C[0xC];                    /* maybe part of sp88[4]? */
    /* 0x98 */ f32 sp98;                            /* inferred */
    /* 0x9C */ f32 sp9C;                            /* inferred */
    /* 0xA0 */ f32 spA0;                            /* inferred */
    /* 0xA4 */ ? spA4;                              /* inferred */
    /* 0xA4 */ char pad_A4[0xC];
    /* 0xB0 */ f32 spB0;                            /* inferred */
    /* 0xB4 */ f32 spB4;                            /* inferred */
    /* 0xB8 */ f32 spB8;                            /* inferred */
    /* 0xBC */ char pad_BC[0xC];
};                                                  /* size = 0xC8 */

struct _mips2c_stack_Camera_ModeFIXD3 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Camera_ModeFIXD4 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Camera_ModeJUMP0 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Camera_ModeJUMP1 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Camera_ModeJUMP2 {
    /* 0x00 */ char pad_0[0x28];
    /* 0x28 */ s8 *sp28;                            /* inferred */
    /* 0x2C */ PosRot *sp2C;                        /* inferred */
    /* 0x30 */ Vec3f *sp30;                         /* inferred */
    /* 0x34 */ Vec3f *sp34;                         /* inferred */
    /* 0x38 */ Vec3f *sp38;                         /* inferred */
    /* 0x3C */ char pad_3C[0xC];                    /* maybe part of sp38[4]? */
    /* 0x48 */ f32 sp48;                            /* inferred */
    /* 0x4C */ char pad_4C[0x14];                   /* maybe part of sp48[6]? */
    /* 0x60 */ ? sp60;                              /* inferred */
    /* 0x60 */ char pad_60[0x28];
    /* 0x88 */ s32 sp88;                            /* inferred */
    /* 0x8C */ f32 sp8C;                            /* inferred */
    /* 0x90 */ f32 sp90;                            /* inferred */
    /* 0x94 */ char pad_94[0x8];                    /* maybe part of sp90[3]? */
    /* 0x9C */ ? sp9C;                              /* inferred */
    /* 0x9C */ char pad_9C[0x8];
    /* 0xA4 */ f32 spA4;                            /* inferred */
    /* 0xA8 */ s16 spA8;                            /* inferred */
    /* 0xAA */ s16 spAA;                            /* inferred */
    /* 0xAC */ f32 spAC;                            /* inferred */
    /* 0xB0 */ s16 spB0;                            /* inferred */
    /* 0xB2 */ s16 spB2;                            /* inferred */
    /* 0xB4 */ f32 spB4;                            /* inferred */
    /* 0xB8 */ s16 spB8;                            /* inferred */
    /* 0xBA */ s16 spBA;                            /* inferred */
    /* 0xBC */ ? spBC;                              /* inferred */
    /* 0xBC */ char pad_BC[0xC];
    /* 0xC8 */ f32 spC8;                            /* inferred */
    /* 0xCC */ f32 spCC;                            /* inferred */
    /* 0xD0 */ f32 spD0;                            /* inferred */
    /* 0xD4 */ char pad_D4[0xC];
};                                                  /* size = 0xE0 */

struct _mips2c_stack_Camera_ModeJUMP3 {
    /* 0x00 */ char pad_0[0x38];
    /* 0x38 */ s8 *sp38;                            /* inferred */
    /* 0x3C */ PosRot *sp3C;                        /* inferred */
    /* 0x40 */ Vec3f *sp40;                         /* inferred */
    /* 0x44 */ Vec3f *sp44;                         /* inferred */
    /* 0x48 */ Vec3f *sp48;                         /* inferred */
    /* 0x4C */ f32 sp4C;                            /* inferred */
    /* 0x50 */ char pad_50[0x8];                    /* maybe part of sp4C[3]? */
    /* 0x58 */ s32 sp58;                            /* inferred */
    /* 0x5C */ f32 sp5C;                            /* inferred */
    /* 0x60 */ f32 sp60;                            /* inferred */
    /* 0x64 */ f32 sp64;                            /* inferred */
    /* 0x68 */ f32 sp68;                            /* inferred */
    /* 0x6C */ char pad_6C[0xC];                    /* maybe part of sp68[4]? */
    /* 0x78 */ f32 sp78;                            /* inferred */
    /* 0x7C */ char pad_7C[0x18];                   /* maybe part of sp78[7]? */
    /* 0x94 */ f32 sp94;                            /* inferred */
    /* 0x98 */ s16 sp98;                            /* inferred */
    /* 0x9A */ s16 sp9A;                            /* inferred */
    /* 0x9C */ f32 sp9C;                            /* inferred */
    /* 0xA0 */ s16 spA0;                            /* inferred */
    /* 0xA2 */ s16 spA2;                            /* inferred */
    /* 0xA4 */ char pad_A4[0x8];                    /* maybe part of spA2[5]? */
    /* 0xAC */ f32 spAC;                            /* inferred */
    /* 0xB0 */ s16 spB0;                            /* inferred */
    /* 0xB2 */ s16 spB2;                            /* inferred */
    /* 0xB4 */ ? spB4;                              /* inferred */
    /* 0xB4 */ char pad_B4[0xC];
    /* 0xC0 */ f32 spC0;                            /* inferred */
    /* 0xC4 */ char pad_C4[0x8];                    /* maybe part of spC0[3]? */
    /* 0xCC */ f32 spCC;                            /* inferred */
    /* 0xD0 */ f32 spD0;                            /* inferred */
    /* 0xD4 */ char pad_D4[0xC];
};                                                  /* size = 0xE0 */

struct _mips2c_stack_Camera_ModeJUMP4 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Camera_ModeKEEP0 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Camera_ModeKEEP1 {
    /* 0x000 */ char pad_0[0x30];
    /* 0x030 */ PosRot *sp30;                       /* inferred */
    /* 0x034 */ char pad_34[0x4];
    /* 0x038 */ s8 *sp38;                           /* inferred */
    /* 0x03C */ PosRot *sp3C;                       /* inferred */
    /* 0x040 */ Vec3f *sp40;                        /* inferred */
    /* 0x044 */ Vec3f *sp44;                        /* inferred */
    /* 0x048 */ Vec3f *sp48;                        /* inferred */
    /* 0x04C */ char pad_4C[0x8];                   /* maybe part of sp48[3]? */
    /* 0x054 */ s16 sp54;                           /* inferred */
    /* 0x056 */ s16 sp56;                           /* inferred */
    /* 0x058 */ char pad_58[0x8];                   /* maybe part of sp56[5]? */
    /* 0x060 */ f32 sp60;                           /* inferred */
    /* 0x064 */ char pad_64[0xC];                   /* maybe part of sp60[4]? */
    /* 0x070 */ s16 sp70;                           /* inferred */
    /* 0x072 */ s16 sp72;                           /* inferred */
    /* 0x074 */ f32 sp74;                           /* inferred */
    /* 0x078 */ s32 sp78;                           /* inferred */
    /* 0x07C */ f32 sp7C;                           /* inferred */
    /* 0x080 */ f32 sp80;                           /* inferred */
    /* 0x084 */ f32 sp84;                           /* inferred */
    /* 0x088 */ char pad_88[0x1C];                  /* maybe part of sp84[8]? */
    /* 0x0A4 */ PosRot *spA4;                       /* inferred */
    /* 0x0A8 */ f32 spA8;                           /* inferred */
    /* 0x0AC */ f32 spAC;                           /* inferred */
    /* 0x0B0 */ char pad_B0[0x10];                  /* maybe part of spAC[5]? */
    /* 0x0C0 */ f32 spC0;                           /* inferred */
    /* 0x0C4 */ s16 spC4;                           /* inferred */
    /* 0x0C6 */ s16 spC6;                           /* inferred */
    /* 0x0C8 */ f32 spC8;                           /* inferred */
    /* 0x0CC */ s16 spCC;                           /* inferred */
    /* 0x0CE */ s16 spCE;                           /* inferred */
    /* 0x0D0 */ f32 spD0;                           /* inferred */
    /* 0x0D4 */ s16 spD4;                           /* inferred */
    /* 0x0D6 */ s16 spD6;                           /* inferred */
    /* 0x0D8 */ f32 spD8;                           /* inferred */
    /* 0x0DC */ s16 spDC;                           /* inferred */
    /* 0x0DE */ s16 spDE;                           /* inferred */
    /* 0x0E0 */ f32 spE0;                           /* inferred */
    /* 0x0E4 */ s16 spE4;                           /* inferred */
    /* 0x0E6 */ s16 spE6;                           /* inferred */
    /* 0x0E8 */ f32 spE8;                           /* inferred */
    /* 0x0EC */ s16 spEC;                           /* inferred */
    /* 0x0EE */ s16 spEE;                           /* inferred */
    /* 0x0F0 */ s16 spF0;                           /* inferred */
    /* 0x0F2 */ s16 spF2;                           /* inferred */
    /* 0x0F4 */ f32 spF4;                           /* inferred */
    /* 0x0F8 */ f32 spF8;                           /* inferred */
    /* 0x0FC */ f32 spFC;                           /* inferred */
    /* 0x100 */ char pad_100[0x4];
    /* 0x104 */ f32 sp104;                          /* inferred */
    /* 0x108 */ char pad_108[0xC];                  /* maybe part of sp104[4]? */
    /* 0x114 */ f32 sp114;                          /* inferred */
    /* 0x118 */ ? sp118;                            /* inferred */
    /* 0x118 */ char pad_118[0xC];
    /* 0x124 */ ? sp124;                            /* inferred */
    /* 0x124 */ char pad_124[0x4];
    /* 0x128 */ f32 sp128;                          /* inferred */
    /* 0x12C */ char pad_12C[0x4];
    /* 0x130 */ f32 sp130;                          /* inferred */
    /* 0x134 */ f32 sp134;                          /* inferred */
    /* 0x138 */ f32 sp138;                          /* inferred */
    /* 0x13C */ char pad_13C[0xC];
};                                                  /* size = 0x148 */

struct _mips2c_stack_Camera_ModeKEEP2 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Camera_ModeKEEP3 {
    /* 0x00 */ char pad_0[0x38];
    /* 0x38 */ s8 *sp38;                            /* inferred */
    /* 0x3C */ PosRot *sp3C;                        /* inferred */
    /* 0x40 */ char pad_40[0x8];                    /* maybe part of sp3C[3]? */
    /* 0x48 */ Vec3f *sp48;                         /* inferred */
    /* 0x4C */ char pad_4C[0xC];                    /* maybe part of sp48[4]? */
    /* 0x58 */ f32 sp58;                            /* inferred */
    /* 0x5C */ char pad_5C[0xE];                    /* maybe part of sp58[4]? */
    /* 0x6A */ s16 sp6A;                            /* inferred */
    /* 0x6C */ s16 sp6C;                            /* inferred */
    /* 0x6E */ s16 sp6E;                            /* inferred */
    /* 0x70 */ PosRot *sp70;                        /* inferred */
    /* 0x74 */ char pad_74[0x4];
    /* 0x78 */ s32 sp78;                            /* inferred */
    /* 0x7C */ char pad_7C[0x4];
    /* 0x80 */ f32 sp80;                            /* inferred */
    /* 0x84 */ s16 sp84;                            /* inferred */
    /* 0x86 */ s16 sp86;                            /* inferred */
    /* 0x88 */ ? sp88;                              /* inferred */
    /* 0x88 */ char pad_88[0x8];
    /* 0x90 */ f32 sp90;                            /* inferred */
    /* 0x94 */ s16 sp94;                            /* inferred */
    /* 0x96 */ s16 sp96;                            /* inferred */
    /* 0x98 */ f32 sp98;                            /* inferred */
    /* 0x9C */ s16 sp9C;                            /* inferred */
    /* 0x9E */ s16 sp9E;                            /* inferred */
    /* 0xA0 */ f32 spA0;                            /* inferred */
    /* 0xA4 */ s16 spA4;                            /* inferred */
    /* 0xA6 */ s16 spA6;                            /* inferred */
    /* 0xA8 */ Actor *spA8;                         /* inferred */
    /* 0xAC */ Player *spAC;                        /* inferred */
    /* 0xB0 */ char pad_B0[0x4];
    /* 0xB4 */ f32 spB4;                            /* inferred */
    /* 0xB8 */ f32 spB8;                            /* inferred */
    /* 0xBC */ char pad_BC[0x4];
    /* 0xC0 */ ? spC0;                              /* inferred */
    /* 0xC0 */ char pad_C0[0xC];
    /* 0xCC */ f32 spCC;                            /* inferred */
    /* 0xD0 */ f32 spD0;                            /* inferred */
    /* 0xD4 */ f32 spD4;                            /* inferred */
    /* 0xD8 */ f32 spD8;                            /* inferred */
    /* 0xDC */ f32 spDC;                            /* inferred */
    /* 0xE0 */ f32 spE0;                            /* inferred */
    /* 0xE4 */ char pad_E4[0xC];
};                                                  /* size = 0xF0 */

struct _mips2c_stack_Camera_ModeKEEP4 {
    /* 0x00 */ char pad_0[0x34];
    /* 0x34 */ s8 *sp34;                            /* inferred */
    /* 0x38 */ PosRot *sp38;                        /* inferred */
    /* 0x3C */ Vec3f *sp3C;                         /* inferred */
    /* 0x40 */ Vec3f *sp40;                         /* inferred */
    /* 0x44 */ s16 *sp44;                           /* inferred */
    /* 0x48 */ char pad_48[0x4];
    /* 0x4C */ ? sp4C;                              /* inferred */
    /* 0x4C */ char pad_4C[0x14];
    /* 0x60 */ ? sp60;                              /* inferred */
    /* 0x60 */ char pad_60[0xC];
    /* 0x6C */ s16 sp6C;                            /* inferred */
    /* 0x6E */ s16 sp6E;                            /* inferred */
    /* 0x70 */ char pad_70[0xC];                    /* maybe part of sp6E[7]? */
    /* 0x7C */ Player *sp7C;                        /* inferred */
    /* 0x80 */ char pad_80[0x2];
    /* 0x82 */ s16 sp82;                            /* inferred */
    /* 0x84 */ f32 sp84;                            /* inferred */
    /* 0x88 */ f32 sp88;                            /* inferred */
    /* 0x8C */ char pad_8C[0x10];                   /* maybe part of sp88[5]? */
    /* 0x9C */ s16 sp9C;                            /* inferred */
    /* 0x9E */ char pad_9E[0x4];                    /* maybe part of sp9C[3]? */
    /* 0xA2 */ s16 spA2;                            /* inferred */
    /* 0xA4 */ char pad_A4[0x4];                    /* maybe part of spA2[3]? */
    /* 0xA8 */ ? spA8;                              /* inferred */
    /* 0xA8 */ char pad_A8[0x4];
    /* 0xAC */ s16 spAC;                            /* inferred */
    /* 0xAE */ s16 spAE;                            /* inferred */
    /* 0xB0 */ ? spB0;                              /* inferred */
    /* 0xB0 */ char pad_B0[0x8];
    /* 0xB8 */ f32 spB8;                            /* inferred */
    /* 0xBC */ s16 spBC;                            /* inferred */
    /* 0xBE */ s16 spBE;                            /* inferred */
    /* 0xC0 */ ? spC0;                              /* inferred */
    /* 0xC0 */ char pad_C0[0xC];
    /* 0xCC */ Player *spCC;                        /* inferred */
    /* 0xD0 */ Actor *spD0;                         /* inferred */
    /* 0xD4 */ char pad_D4[0xC];
};                                                  /* size = 0xE0 */

struct _mips2c_stack_Camera_ModeNORM0 {
    /* 0x00 */ char pad_0[0x34];
    /* 0x34 */ PosRot *sp34;                        /* inferred */
    /* 0x38 */ Vec3f *sp38;                         /* inferred */
    /* 0x3C */ Vec3f *sp3C;                         /* inferred */
    /* 0x40 */ Vec3f *sp40;                         /* inferred */
    /* 0x44 */ char pad_44[0x18];                   /* maybe part of sp40[7]? */
    /* 0x5C */ void *sp5C;                          /* inferred */
    /* 0x60 */ char pad_60[0x18];                   /* maybe part of sp5C[7]? */
    /* 0x78 */ f32 sp78;                            /* inferred */
    /* 0x7C */ s16 sp7C;                            /* inferred */
    /* 0x7E */ char pad_7E[0x2];
    /* 0x80 */ ? sp80;                              /* inferred */
    /* 0x80 */ char pad_80[0x4];
    /* 0x84 */ s16 sp84;                            /* inferred */
    /* 0x86 */ s16 sp86;                            /* inferred */
    /* 0x88 */ f32 sp88;                            /* inferred */
    /* 0x8C */ s16 sp8C;                            /* inferred */
    /* 0x8E */ s16 sp8E;                            /* inferred */
    /* 0x90 */ f32 sp90;                            /* inferred */
    /* 0x94 */ char pad_94[0x2];
    /* 0x96 */ s16 sp96;                            /* inferred */
    /* 0x98 */ f32 sp98;                            /* inferred */
    /* 0x9C */ s16 sp9C;                            /* inferred */
    /* 0x9E */ s16 sp9E;                            /* inferred */
    /* 0xA0 */ f32 spA0;                            /* inferred */
    /* 0xA4 */ f32 spA4;                            /* inferred */
    /* 0xA8 */ char pad_A8[0x10];
};                                                  /* size = 0xB8 */

struct _mips2c_stack_Camera_ModeNORM1 {
    /* 0x00 */ char pad_0[0x3C];
    /* 0x3C */ s8 *sp3C;                            /* inferred */
    /* 0x40 */ f32 sp40;                            /* inferred */
    /* 0x44 */ Vec3f *sp44;                         /* inferred */
    /* 0x48 */ Vec3f *sp48;                         /* inferred */
    /* 0x4C */ Vec3f *sp4C;                         /* inferred */
    /* 0x50 */ char pad_50[0x8];                    /* maybe part of sp4C[3]? */
    /* 0x58 */ f32 sp58;                            /* inferred */
    /* 0x5C */ f32 sp5C;                            /* inferred */
    /* 0x60 */ ? sp60;                              /* inferred */
    /* 0x60 */ char pad_60[0x4];
    /* 0x64 */ ? sp64;                              /* inferred */
    /* 0x64 */ char pad_64[0x6];
    /* 0x6A */ s16 sp6A;                            /* inferred */
    /* 0x6C */ f32 sp6C;                            /* inferred */
    /* 0x70 */ char pad_70[0x2];
    /* 0x72 */ s16 sp72;                            /* inferred */
    /* 0x74 */ ? sp74;                              /* inferred */
    /* 0x74 */ char pad_74[0x4];
    /* 0x78 */ s16 sp78;                            /* inferred */
    /* 0x7A */ s16 sp7A;                            /* inferred */
    /* 0x7C */ char pad_7C[0xC];                    /* maybe part of sp7A[7]? */
    /* 0x88 */ f32 sp88;                            /* inferred */
    /* 0x8C */ char pad_8C[0x10];                   /* maybe part of sp88[5]? */
    /* 0x9C */ f32 sp9C;                            /* inferred */
    /* 0xA0 */ s16 spA0;                            /* inferred */
    /* 0xA2 */ s16 spA2;                            /* inferred */
    /* 0xA4 */ ? spA4;                              /* inferred */
    /* 0xA4 */ char pad_A4[0x6];
    /* 0xAA */ s16 spAA;                            /* inferred */
    /* 0xAC */ ? spAC;                              /* inferred */
    /* 0xAC */ char pad_AC[0x4];
    /* 0xB0 */ s16 spB0;                            /* inferred */
    /* 0xB2 */ s16 spB2;                            /* inferred */
    /* 0xB4 */ f32 spB4;                            /* inferred */
    /* 0xB8 */ s16 spB8;                            /* inferred */
    /* 0xBA */ s16 spBA;                            /* inferred */
    /* 0xBC */ char pad_BC[0x4];                    /* maybe part of spBA[3]? */
    /* 0xC0 */ f32 spC0;                            /* inferred */
    /* 0xC4 */ f32 spC4;                            /* inferred */
    /* 0xC8 */ f32 spC8;                            /* inferred */
    /* 0xCC */ char pad_CC[0x4];
    /* 0xD0 */ f32 spD0;                            /* inferred */
    /* 0xD4 */ f32 spD4;                            /* inferred */
    /* 0xD8 */ ? spD8;                              /* inferred */
    /* 0xD8 */ char pad_D8[0x4];
    /* 0xDC */ f32 spDC;                            /* inferred */
    /* 0xE0 */ char pad_E0[0x10];
};                                                  /* size = 0xF0 */

struct _mips2c_stack_Camera_ModeNORM2 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Camera_ModeNORM3 {
    /* 0x00 */ char pad_0[0x30];
    /* 0x30 */ PosRot *sp30;                        /* inferred */
    /* 0x34 */ Vec3f *sp34;                         /* inferred */
    /* 0x38 */ Vec3f *sp38;                         /* inferred */
    /* 0x3C */ Vec3f *sp3C;                         /* inferred */
    /* 0x40 */ char pad_40[0x1C];                   /* maybe part of sp3C[8]? */
    /* 0x5C */ Player *sp5C;                        /* inferred */
    /* 0x60 */ char pad_60[0x2];
    /* 0x62 */ s16 sp62;                            /* inferred */
    /* 0x64 */ char pad_64[0x4];                    /* maybe part of sp62[3]? */
    /* 0x68 */ f32 sp68;                            /* inferred */
    /* 0x6C */ s16 sp6C;                            /* inferred */
    /* 0x6E */ s16 sp6E;                            /* inferred */
    /* 0x70 */ ? sp70;                              /* inferred */
    /* 0x70 */ char pad_70[0x6];
    /* 0x76 */ s16 sp76;                            /* inferred */
    /* 0x78 */ ? sp78;                              /* inferred */
    /* 0x78 */ char pad_78[0x6];
    /* 0x7E */ s16 sp7E;                            /* inferred */
    /* 0x80 */ f32 sp80;                            /* inferred */
    /* 0x84 */ s16 sp84;                            /* inferred */
    /* 0x86 */ s16 sp86;                            /* inferred */
    /* 0x88 */ f32 sp88;                            /* inferred */
    /* 0x8C */ f32 sp8C;                            /* inferred */
    /* 0x90 */ f32 sp90;                            /* inferred */
    /* 0x94 */ char pad_94[0xC];
};                                                  /* size = 0xA0 */

struct _mips2c_stack_Camera_ModeNORM4 {
    /* 0x00 */ char pad_0[0x22];
    /* 0x22 */ s16 sp22;                            /* inferred */
    /* 0x24 */ char pad_24[0x4];
};                                                  /* size = 0x28 */

struct _mips2c_stack_Camera_ModeNop {};             /* size 0x0 */

struct _mips2c_stack_Camera_ModePARA0 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Camera_ModePARA1 {
    /* 0x00 */ char pad_0[0x38];
    /* 0x38 */ PosRot *sp38;                        /* inferred */
    /* 0x3C */ Vec3f *sp3C;                         /* inferred */
    /* 0x40 */ Vec3f *sp40;                         /* inferred */
    /* 0x44 */ Vec3f *sp44;                         /* inferred */
    /* 0x48 */ char pad_48[0x8];                    /* maybe part of sp44[3]? */
    /* 0x50 */ f32 sp50;                            /* inferred */
    /* 0x54 */ char pad_54[0xC];                    /* maybe part of sp50[4]? */
    /* 0x60 */ f32 sp60;                            /* inferred */
    /* 0x64 */ char pad_64[0xE];                    /* maybe part of sp60[4]? */
    /* 0x72 */ s16 sp72;                            /* inferred */
    /* 0x74 */ char pad_74[0x4];                    /* maybe part of sp72[3]? */
    /* 0x78 */ f32 sp78;                            /* inferred */
    /* 0x7C */ s16 sp7C;                            /* inferred */
    /* 0x7E */ s16 sp7E;                            /* inferred */
    /* 0x80 */ f32 sp80;                            /* inferred */
    /* 0x84 */ s16 sp84;                            /* inferred */
    /* 0x86 */ s16 sp86;                            /* inferred */
    /* 0x88 */ ? sp88;                              /* inferred */
    /* 0x88 */ char pad_88[0x6];
    /* 0x8E */ s16 sp8E;                            /* inferred */
    /* 0x90 */ f32 sp90;                            /* inferred */
    /* 0x94 */ s16 sp94;                            /* inferred */
    /* 0x96 */ s16 sp96;                            /* inferred */
    /* 0x98 */ char pad_98[0x4];                    /* maybe part of sp96[3]? */
    /* 0x9C */ f32 sp9C;                            /* inferred */
    /* 0xA0 */ f32 spA0;                            /* inferred */
    /* 0xA4 */ ? spA4;                              /* inferred */
    /* 0xA4 */ char pad_A4[0xC];
    /* 0xB0 */ ? spB0;                              /* inferred */
    /* 0xB0 */ char pad_B0[0x4];
    /* 0xB4 */ f32 spB4;                            /* inferred */
    /* 0xB8 */ char pad_B8[0x10];
};                                                  /* size = 0xC8 */

struct _mips2c_stack_Camera_ModePARA2 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Camera_ModePARA3 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Camera_ModePARA4 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Camera_ModeSPEC0 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Camera_ModeSPEC1 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Camera_ModeSPEC2 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Camera_ModeSPEC3 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Camera_ModeSPEC4 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Camera_ModeSPEC5 {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ PosRot *sp2C;                        /* inferred */
    /* 0x30 */ Vec3f *sp30;                         /* inferred */
    /* 0x34 */ Vec3f *sp34;                         /* inferred */
    /* 0x38 */ Vec3f *sp38;                         /* inferred */
    /* 0x3C */ char pad_3C[0x20];                   /* maybe part of sp38[9]? */
    /* 0x5C */ f32 sp5C;                            /* inferred */
    /* 0x60 */ char pad_60[0x4];
    /* 0x64 */ ? sp64;                              /* inferred */
    /* 0x64 */ char pad_64[0x8];
    /* 0x6C */ f32 sp6C;                            /* inferred */
    /* 0x70 */ s16 sp70;                            /* inferred */
    /* 0x72 */ s16 sp72;                            /* inferred */
    /* 0x74 */ f32 sp74;                            /* inferred */
    /* 0x78 */ s16 sp78;                            /* inferred */
    /* 0x7A */ s16 sp7A;                            /* inferred */
    /* 0x7C */ ? sp7C;                              /* inferred */
    /* 0x7C */ char pad_7C[0xC];
    /* 0x88 */ ? sp88;                              /* inferred */
    /* 0x88 */ char pad_88[0x1C];
    /* 0xA4 */ s16 spA4;                            /* inferred */
    /* 0xA6 */ char pad_A6[0x2];
    /* 0xA8 */ ? spA8;                              /* inferred */
    /* 0xA8 */ char pad_A8[0x20];
};                                                  /* size = 0xC8 */

struct _mips2c_stack_Camera_ModeSPEC6 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Camera_ModeSPEC7 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Camera_ModeSPEC8 {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ s8 *sp2C;                            /* inferred */
    /* 0x30 */ PosRot *sp30;                        /* inferred */
    /* 0x34 */ Vec3f *sp34;                         /* inferred */
    /* 0x38 */ Vec3f *sp38;                         /* inferred */
    /* 0x3C */ char pad_3C[0x18];                   /* maybe part of sp38[7]? */
    /* 0x54 */ f32 sp54;                            /* inferred */
    /* 0x58 */ char pad_58[0x4];
    /* 0x5C */ f32 sp5C;                            /* inferred */
    /* 0x60 */ f32 sp60;                            /* inferred */
    /* 0x64 */ f32 sp64;                            /* inferred */
    /* 0x68 */ f32 sp68;                            /* inferred */
    /* 0x6C */ f32 sp6C;                            /* inferred */
    /* 0x70 */ f32 sp70;                            /* inferred */
    /* 0x74 */ char pad_74[0xC];
};                                                  /* size = 0x80 */

struct _mips2c_stack_Camera_ModeSPEC9 {
    /* 0x00 */ char pad_0[0x30];
    /* 0x30 */ s32 sp30;                            /* inferred */
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ s8 *sp38;                            /* inferred */
    /* 0x3C */ s8 *sp3C;                            /* inferred */
    /* 0x40 */ PosRot *sp40;                        /* inferred */
    /* 0x44 */ Vec3f *sp44;                         /* inferred */
    /* 0x48 */ Vec3f *sp48;                         /* inferred */
    /* 0x4C */ Vec3f *sp4C;                         /* inferred */
    /* 0x50 */ ? sp50;                              /* inferred */
    /* 0x50 */ char pad_50[0x34];
    /* 0x84 */ ? sp84;                              /* inferred */
    /* 0x84 */ char pad_84[0x4];
    /* 0x88 */ f32 sp88;                            /* inferred */
    /* 0x8C */ char pad_8C[0x4];
    /* 0x90 */ s16 sp90;                            /* inferred */
    /* 0x92 */ s16 sp92;                            /* inferred */
    /* 0x94 */ char pad_94[0x10];                   /* maybe part of sp92[9]? */
    /* 0xA4 */ f32 spA4;                            /* inferred */
    /* 0xA8 */ f32 spA8;                            /* inferred */
    /* 0xAC */ s16 spAC;                            /* inferred */
    /* 0xAE */ s16 spAE;                            /* inferred */
    /* 0xB0 */ f32 spB0;                            /* inferred */
    /* 0xB4 */ s16 spB4;                            /* inferred */
    /* 0xB6 */ s16 spB6;                            /* inferred */
    /* 0xB8 */ ? spB8;                              /* inferred */
    /* 0xB8 */ char pad_B8[0x4];
    /* 0xBC */ f32 spBC;                            /* inferred */
    /* 0xC0 */ char pad_C0[0x10];
};                                                  /* size = 0xD0 */

struct _mips2c_stack_Camera_ModeSUBJ0 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Camera_ModeSUBJ1 {
    /* 0x00 */ char pad_0[0x28];
    /* 0x28 */ s8 *sp28;                            /* inferred */
    /* 0x2C */ Vec3f *sp2C;                         /* inferred */
    /* 0x30 */ char pad_30[0x4];
    /* 0x34 */ Vec3f *sp34;                         /* inferred */
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ char pad_3C[0x10];                   /* maybe part of sp38[5]? */
    /* 0x4C */ s16 sp4C;                            /* inferred */
    /* 0x4E */ s16 sp4E;                            /* inferred */
    /* 0x50 */ char pad_50[0x4];                    /* maybe part of sp4E[3]? */
    /* 0x54 */ f32 sp54;                            /* inferred */
    /* 0x58 */ f32 sp58;                            /* inferred */
    /* 0x5C */ f32 sp5C;                            /* inferred */
    /* 0x60 */ f32 sp60;                            /* inferred */
    /* 0x64 */ s16 sp64;                            /* inferred */
    /* 0x66 */ s16 sp66;                            /* inferred */
    /* 0x68 */ char pad_68[0xC];                    /* maybe part of sp66[7]? */
    /* 0x74 */ f32 sp74;                            /* inferred */
    /* 0x78 */ s16 sp78;                            /* inferred */
    /* 0x7A */ s16 sp7A;                            /* inferred */
    /* 0x7C */ f32 sp7C;                            /* inferred */
    /* 0x80 */ s16 sp80;                            /* inferred */
    /* 0x82 */ s16 sp82;                            /* inferred */
    /* 0x84 */ ? sp84;                              /* inferred */
    /* 0x84 */ char pad_84[0xC];
    /* 0x90 */ f32 sp90;                            /* inferred */
    /* 0x94 */ f32 sp94;                            /* inferred */
    /* 0x98 */ f32 sp98;                            /* inferred */
    /* 0x9C */ char pad_9C[0xC];
};                                                  /* size = 0xA8 */

struct _mips2c_stack_Camera_ModeSUBJ2 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Camera_ModeSUBJ3 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Camera_ModeSUBJ4 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Camera_ModeUNIQ0 {
    /* 0x00 */ char pad_0[0x28];
    /* 0x28 */ s8 *sp28;                            /* inferred */
    /* 0x2C */ char pad_2C[0x4];
    /* 0x30 */ Vec3f *sp30;                         /* inferred */
    /* 0x34 */ Vec3f *sp34;                         /* inferred */
    /* 0x38 */ s8 *sp38;                            /* inferred */
    /* 0x3C */ char pad_3C[0x4];
    /* 0x40 */ PosRot *sp40;                        /* inferred */
    /* 0x44 */ ? sp44;                              /* inferred */
    /* 0x44 */ char pad_44[0x10];
    /* 0x54 */ f32 sp54;                            /* inferred */
    /* 0x58 */ f32 sp58;                            /* inferred */
    /* 0x5C */ f32 sp5C;                            /* inferred */
    /* 0x60 */ char pad_60[0x14];                   /* maybe part of sp5C[6]? */
    /* 0x74 */ f32 sp74;                            /* inferred */
    /* 0x78 */ void *sp78;                          /* inferred */
    /* 0x7C */ ? sp7C;                              /* inferred */
    /* 0x7C */ char pad_7C[0x4];
    /* 0x80 */ s16 sp80;                            /* inferred */
    /* 0x82 */ s16 sp82;                            /* inferred */
    /* 0x84 */ f32 sp84;                            /* inferred */
    /* 0x88 */ s16 sp88;                            /* inferred */
    /* 0x8A */ s16 sp8A;                            /* inferred */
    /* 0x8C */ ? sp8C;                              /* inferred */
    /* 0x8C */ char pad_8C[0x4];
    /* 0x90 */ f32 sp90;                            /* inferred */
    /* 0x94 */ char pad_94[0x4];
    /* 0x98 */ Player *sp98;                        /* inferred */
    /* 0x9C */ ? sp9C;                              /* inferred */
    /* 0x9C */ char pad_9C[0x18];
    /* 0xB4 */ f32 spB4;                            /* inferred */
};                                                  /* size = 0xB8 */

struct _mips2c_stack_Camera_ModeUNIQ1 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Camera_ModeUNIQ2 {
    /* 0x00 */ char pad_0[0x34];
    /* 0x34 */ Vec3f *sp34;                         /* inferred */
    /* 0x38 */ char pad_38[0x4];
    /* 0x3C */ Vec3f *sp3C;                         /* inferred */
    /* 0x40 */ char pad_40[0x8];                    /* maybe part of sp3C[3]? */
    /* 0x48 */ f32 sp48;                            /* inferred */
    /* 0x4C */ char pad_4C[0x14];                   /* maybe part of sp48[6]? */
    /* 0x60 */ ? sp60;                              /* inferred */
    /* 0x60 */ char pad_60[0x6];
    /* 0x66 */ s16 sp66;                            /* inferred */
    /* 0x68 */ f32 sp68;                            /* inferred */
    /* 0x6C */ s16 sp6C;                            /* inferred */
    /* 0x6E */ s16 sp6E;                            /* inferred */
    /* 0x70 */ f32 sp70;                            /* inferred */
    /* 0x74 */ f32 sp74;                            /* inferred */
    /* 0x78 */ f32 sp78;                            /* inferred */
    /* 0x7C */ char pad_7C[0xC];
};                                                  /* size = 0x88 */

struct _mips2c_stack_Camera_ModeUNIQ3 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Camera_ModeUNIQ4 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Camera_ModeUNIQ5 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Camera_ModeUNIQ6 {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ PosRot *sp20;                        /* inferred */
    /* 0x24 */ char pad_24[0x8];                    /* maybe part of sp20[3]? */
    /* 0x2C */ ? sp2C;                              /* inferred */
    /* 0x2C */ char pad_2C[0x4];
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ char pad_34[0xC];
};                                                  /* size = 0x40 */

struct _mips2c_stack_Camera_ModeUNIQ7 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Camera_ModeUNIQ8 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Camera_ModeUNIQ9 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Camera_SetFlags {};            /* size 0x0 */

struct _mips2c_stack_Camera_SetMode {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Camera_Update {
    /* 0x00 */ char pad_0[0x3A];
    /* 0x3A */ s16 sp3A;                            /* inferred */
    /* 0x3C */ ? sp3C;                              /* inferred */
    /* 0x3C */ char pad_3C[0x4];
    /* 0x40 */ s16 sp40;                            /* inferred */
    /* 0x42 */ s16 sp42;                            /* inferred */
    /* 0x44 */ Player *sp44;                        /* inferred */
    /* 0x48 */ f32 sp48;                            /* inferred */
    /* 0x4C */ f32 sp4C;                            /* inferred */
    /* 0x50 */ f32 sp50;                            /* inferred */
    /* 0x54 */ f32 sp54;                            /* inferred */
    /* 0x58 */ f32 sp58;                            /* inferred */
    /* 0x5C */ f32 sp5C;                            /* inferred */
    /* 0x60 */ s16 sp60;                            /* inferred */
    /* 0x62 */ s16 sp62;                            /* inferred */
    /* 0x64 */ char pad_64[0x4];                    /* maybe part of sp62[3]? */
    /* 0x68 */ f32 sp68;                            /* inferred */
    /* 0x6C */ f32 sp6C;                            /* inferred */
    /* 0x70 */ f32 sp70;                            /* inferred */
    /* 0x74 */ char pad_74[0xC];                    /* maybe part of sp70[4]? */
    /* 0x80 */ f32 sp80;                            /* inferred */
    /* 0x84 */ f32 sp84;                            /* inferred */
    /* 0x88 */ f32 sp88;                            /* inferred */
    /* 0x8C */ CollisionPoly *sp8C;                 /* inferred */
    /* 0x90 */ CollisionPoly *sp90;                 /* inferred */
    /* 0x94 */ s32 sp94;                            /* inferred */
    /* 0x98 */ s32 sp98;                            /* inferred */
    /* 0x9C */ f32 sp9C;                            /* inferred */
    /* 0xA0 */ f32 spA0;                            /* inferred */
    /* 0xA4 */ f32 spA4;                            /* inferred */
    /* 0xA8 */ char pad_A8[0x4];
    /* 0xAC */ ? spAC;                              /* inferred */
    /* 0xAC */ char pad_AC[0xC];
    /* 0xB8 */ f32 spB8;                            /* inferred */
    /* 0xBC */ f32 spBC;                            /* inferred */
    /* 0xC0 */ f32 spC0;                            /* inferred */
    /* 0xC4 */ f32 spC4;                            /* inferred */
    /* 0xC8 */ f32 spC8;                            /* inferred */
    /* 0xCC */ f32 spCC;                            /* inferred */
};                                                  /* size = 0xD0 */

struct _mips2c_stack_Camera_fabsf {};               /* size 0x0 */

struct _mips2c_stack_func_800CB270 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_800CB42C {};              /* size 0x0 */

struct _mips2c_stack_func_800CB544 {};              /* size 0x0 */

struct _mips2c_stack_func_800CB584 {};              /* size 0x0 */

struct _mips2c_stack_func_800CB5DC {};              /* size 0x0 */

struct _mips2c_stack_func_800CB60C {
    /* 0x00 */ char pad_0[0x4];
    /* 0x04 */ f32 sp4;                             /* inferred */
    /* 0x08 */ f32 sp8;                             /* inferred */
    /* 0x0C */ f32 spC;                             /* inferred */
};                                                  /* size = 0x10 */

struct _mips2c_stack_func_800CB674 {};              /* size 0x0 */

struct _mips2c_stack_func_800CB6C8 {};              /* size 0x0 */

struct _mips2c_stack_func_800CB700 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ f32 sp24;                            /* inferred */
    /* 0x28 */ f32 sp28;                            /* inferred */
    /* 0x2C */ char pad_2C[0xC];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_800CB780 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_800CB7CC {};              /* size 0x0 */

struct _mips2c_stack_func_800CB7F8 {};              /* size 0x0 */

struct _mips2c_stack_func_800CB828 {};              /* size 0x0 */

struct _mips2c_stack_func_800CB854 {};              /* size 0x0 */

struct _mips2c_stack_func_800CB880 {};              /* size 0x0 */

struct _mips2c_stack_func_800CB8C8 {};              /* size 0x0 */

struct _mips2c_stack_func_800CB8F4 {};              /* size 0x0 */

struct _mips2c_stack_func_800CB924 {};              /* size 0x0 */

struct _mips2c_stack_func_800CB950 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_800CBA08 {};              /* size 0x0 */

struct _mips2c_stack_func_800CBA34 {};              /* size 0x0 */

struct _mips2c_stack_func_800CBA7C {};              /* size 0x0 */

struct _mips2c_stack_func_800CBAAC {};              /* size 0x0 */

struct _mips2c_stack_func_800CBAD4 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ ? sp24;                              /* inferred */
    /* 0x24 */ char pad_24[0x14];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_800CBB58 {};              /* size 0x0 */

struct _mips2c_stack_func_800CBB88 {};              /* size 0x0 */

struct _mips2c_stack_func_800CBC00 {};              /* size 0x0 */

struct _mips2c_stack_func_800CBC30 {};              /* size 0x0 */

struct _mips2c_stack_func_800CBC84 {
    /* 0x00 */ char pad_0[0x38];
    /* 0x38 */ Vec3f *sp38;                         /* inferred */
    /* 0x3C */ char pad_3C[0x8];                    /* maybe part of sp38[3]? */
    /* 0x44 */ f32 sp44;                            /* inferred */
    /* 0x48 */ char pad_48[0x8];                    /* maybe part of sp44[3]? */
    /* 0x50 */ f32 sp50;                            /* inferred */
    /* 0x54 */ f32 sp54;                            /* inferred */
    /* 0x58 */ f32 sp58;                            /* inferred */
    /* 0x5C */ f32 sp5C;                            /* inferred */
    /* 0x60 */ f32 sp60;                            /* inferred */
    /* 0x64 */ f32 sp64;                            /* inferred */
    /* 0x68 */ f32 sp68;                            /* inferred */
    /* 0x6C */ f32 sp6C;                            /* inferred */
    /* 0x70 */ f32 sp70;                            /* inferred */
    /* 0x74 */ CollisionContext *sp74;              /* inferred */
};                                                  /* size = 0x78 */

struct _mips2c_stack_func_800CBFA4 {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ ? sp20;                              /* inferred */
    /* 0x20 */ char pad_20[0x28];
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_800CC000 {
    /* 0x00 */ char pad_0[0x34];
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ f32 sp3C;                            /* inferred */
    /* 0x40 */ f32 sp40;                            /* inferred */
    /* 0x44 */ char pad_44[0xC];
};                                                  /* size = 0x50 */

struct _mips2c_stack_func_800CC128 {
    /* 0x00 */ char pad_0[0x30];
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ ? sp34;                              /* inferred */
    /* 0x34 */ char pad_34[0x4];
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ char pad_3C[0xC];
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_800CC1C4 {
    /* 0x00 */ char pad_0[0x34];
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ ? sp38;                              /* inferred */
    /* 0x38 */ char pad_38[0x8];
    /* 0x40 */ f32 sp40;                            /* inferred */
    /* 0x44 */ char pad_44[0xC];
};                                                  /* size = 0x50 */

struct _mips2c_stack_func_800CC260 {
    /* 0x00 */ char pad_0[0x64];
    /* 0x64 */ f32 sp64;                            /* inferred */
    /* 0x68 */ char pad_68[0x8];                    /* maybe part of sp64[3]? */
    /* 0x70 */ f32 sp70;                            /* inferred */
    /* 0x74 */ char pad_74[0x14];                   /* maybe part of sp70[6]? */
    /* 0x88 */ s32 sp88;                            /* inferred */
    /* 0x8C */ char pad_8C[0x4];
    /* 0x90 */ f32 sp90;                            /* inferred */
    /* 0x94 */ s16 sp94;                            /* inferred */
    /* 0x96 */ s16 sp96;                            /* inferred */
};                                                  /* size = 0x98 */

struct _mips2c_stack_func_800CC488 {
    /* 0x00 */ char pad_0[0x28];
    /* 0x28 */ void *sp28;                          /* inferred */
    /* 0x2C */ char pad_2C[0x4];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_800CC56C {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ f32 sp1C;                            /* inferred */
    /* 0x20 */ ? sp20;                              /* inferred */
    /* 0x20 */ char pad_20[0xC];
    /* 0x2C */ ? sp2C;                              /* inferred */
    /* 0x2C */ char pad_2C[0x4];
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ char pad_34[0x4];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_800CC5C8 {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ CollisionContext *sp2C;              /* inferred */
    /* 0x30 */ GlobalContext *sp30;                 /* inferred */
    /* 0x34 */ char pad_34[0x4];
    /* 0x38 */ CollisionContext *sp38;              /* inferred */
    /* 0x3C */ CollisionPoly *sp3C;                 /* inferred */
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_800CC740 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_800CC7A8 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_800CC804 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ u32 sp1C;                            /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_800CC874 {
    /* 0x00 */ char pad_0[0x30];
    /* 0x30 */ s32 sp30;                            /* inferred */
    /* 0x34 */ char pad_34[0x4];
    /* 0x38 */ s32 sp38;                            /* inferred */
    /* 0x3C */ s32 sp3C;                            /* inferred */
    /* 0x40 */ f32 sp40;                            /* inferred */
    /* 0x44 */ s32 sp44;                            /* inferred */
    /* 0x48 */ char pad_48[0x8];
};                                                  /* size = 0x50 */

struct _mips2c_stack_func_800CC938 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_800CC958 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_800CC9C0 {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ f32 sp2C;                            /* inferred */
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ f32 sp3C;                            /* inferred */
    /* 0x40 */ f32 sp40;                            /* inferred */
    /* 0x44 */ char pad_44[0x8];                    /* maybe part of sp40[3]? */
    /* 0x4C */ ? sp4C;                              /* inferred */
    /* 0x4C */ char pad_4C[0xC];
    /* 0x58 */ f32 sp58;                            /* inferred */
    /* 0x5C */ f32 sp5C;                            /* inferred */
    /* 0x60 */ f32 sp60;                            /* inferred */
    /* 0x64 */ f32 sp64;                            /* inferred */
    /* 0x68 */ f32 sp68;                            /* inferred */
    /* 0x6C */ f32 sp6C;                            /* inferred */
};                                                  /* size = 0x70 */

struct _mips2c_stack_func_800CCCEC {
    /* 0x00 */ char pad_0[0x22];
    /* 0x22 */ s16 sp22;                            /* inferred */
    /* 0x24 */ char pad_24[0x4];                    /* maybe part of sp22[3]? */
    /* 0x28 */ f32 sp28;                            /* inferred */
    /* 0x2C */ f32 sp2C;                            /* inferred */
    /* 0x30 */ char pad_30[0x4];
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ f32 sp3C;                            /* inferred */
    /* 0x40 */ char pad_40[0x1C];                   /* maybe part of sp3C[8]? */
    /* 0x5C */ f32 sp5C;                            /* inferred */
    /* 0x60 */ f32 sp60;                            /* inferred */
    /* 0x64 */ f32 sp64;                            /* inferred */
    /* 0x68 */ char pad_68[0x2];
    /* 0x6A */ s16 sp6A;                            /* inferred */
    /* 0x6C */ char pad_6C[0x4];                    /* maybe part of sp6A[3]? */
    /* 0x70 */ f32 sp70;                            /* inferred */
    /* 0x74 */ f32 sp74;                            /* inferred */
    /* 0x78 */ f32 sp78;                            /* inferred */
    /* 0x7C */ f32 sp7C;                            /* inferred */
    /* 0x80 */ f32 sp80;                            /* inferred */
    /* 0x84 */ f32 sp84;                            /* inferred */
};                                                  /* size = 0x88 */

struct _mips2c_stack_func_800CD04C {
    /* 0x00 */ char pad_0[0x28];
    /* 0x28 */ f32 sp28;                            /* inferred */
    /* 0x2C */ f32 sp2C;                            /* inferred */
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ char pad_34[0x8];                    /* maybe part of sp30[3]? */
    /* 0x3C */ f32 sp3C;                            /* inferred */
    /* 0x40 */ f32 sp40;                            /* inferred */
    /* 0x44 */ f32 sp44;                            /* inferred */
    /* 0x48 */ char pad_48[0x4];
    /* 0x4C */ f32 sp4C;                            /* inferred */
    /* 0x50 */ f32 sp50;                            /* inferred */
    /* 0x54 */ f32 sp54;                            /* inferred */
    /* 0x58 */ f32 sp58;                            /* inferred */
    /* 0x5C */ char pad_5C[0x4];
    /* 0x60 */ f32 sp60;                            /* inferred */
    /* 0x64 */ char pad_64[0x40];                   /* maybe part of sp60[17]? */
    /* 0xA4 */ f32 spA4;                            /* inferred */
    /* 0xA8 */ f32 spA8;                            /* inferred */
    /* 0xAC */ f32 spAC;                            /* inferred */
    /* 0xB0 */ char pad_B0[0x4];
    /* 0xB4 */ f32 spB4;                            /* inferred */
    /* 0xB8 */ f32 spB8;                            /* inferred */
    /* 0xBC */ f32 spBC;                            /* inferred */
    /* 0xC0 */ char pad_C0[0x8];
};                                                  /* size = 0xC8 */

struct _mips2c_stack_func_800CD288 {};              /* size 0x0 */

struct _mips2c_stack_func_800CD2E0 {};              /* size 0x0 */

struct _mips2c_stack_func_800CD2F0 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_800CD3E4 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ ? sp24;                              /* inferred */
    /* 0x24 */ char pad_24[0xC];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_800CD44C {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ Vec3f *sp24;                         /* inferred */
    /* 0x28 */ ? *sp28;                             /* inferred */
    /* 0x2C */ ? sp2C;                              /* inferred */
    /* 0x2C */ char pad_2C[0x2C];
    /* 0x58 */ s32 sp58;                            /* inferred */
    /* 0x5C */ s32 sp5C;                            /* inferred */
    /* 0x60 */ s32 sp60;                            /* inferred */
    /* 0x64 */ char pad_64[0xC];
};                                                  /* size = 0x70 */

struct _mips2c_stack_func_800CD634 {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ f32 sp18;                            /* inferred */
    /* 0x1C */ ? sp1C;                              /* inferred */
    /* 0x1C */ char pad_1C[0x4];
    /* 0x20 */ s16 sp20;                            /* inferred */
    /* 0x22 */ s16 sp22;                            /* inferred */
    /* 0x24 */ char pad_24[0x4];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_800CD6CC {};              /* size 0x0 */

struct _mips2c_stack_func_800CD6F8 {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ PosRot *sp2C;                        /* inferred */
    /* 0x30 */ char pad_30[0x8];                    /* maybe part of sp2C[3]? */
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ char pad_3C[0x8];                    /* maybe part of sp38[3]? */
    /* 0x44 */ f32 sp44;                            /* inferred */
    /* 0x48 */ f32 sp48;                            /* inferred */
    /* 0x4C */ f32 sp4C;                            /* inferred */
    /* 0x50 */ f32 sp50;                            /* inferred */
    /* 0x54 */ f32 sp54;                            /* inferred */
    /* 0x58 */ f32 sp58;                            /* inferred */
    /* 0x5C */ char pad_5C[0x4];
};                                                  /* size = 0x60 */

struct _mips2c_stack_func_800CD834 {
    /* 0x00 */ char pad_0[0x30];
    /* 0x30 */ PosRot *sp30;                        /* inferred */
    /* 0x34 */ char pad_34[0x8];                    /* maybe part of sp30[3]? */
    /* 0x3C */ s16 sp3C;                            /* inferred */
    /* 0x3E */ s16 sp3E;                            /* inferred */
    /* 0x40 */ char pad_40[0x4];                    /* maybe part of sp3E[3]? */
    /* 0x44 */ f32 sp44;                            /* inferred */
    /* 0x48 */ char pad_48[0x4];
    /* 0x4C */ f32 sp4C;                            /* inferred */
    /* 0x50 */ f32 sp50;                            /* inferred */
    /* 0x54 */ f32 sp54;                            /* inferred */
    /* 0x58 */ f32 sp58;                            /* inferred */
    /* 0x5C */ f32 sp5C;                            /* inferred */
    /* 0x60 */ f32 sp60;                            /* inferred */
    /* 0x64 */ char pad_64[0x4];
};                                                  /* size = 0x68 */

struct _mips2c_stack_func_800CDA14 {
    /* 0x00 */ char pad_0[0x30];
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ char pad_34[0x4];
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ f32 sp3C;                            /* inferred */
    /* 0x40 */ f32 sp40;                            /* inferred */
    /* 0x44 */ f32 sp44;                            /* inferred */
    /* 0x48 */ f32 sp48;                            /* inferred */
    /* 0x4C */ f32 sp4C;                            /* inferred */
    /* 0x50 */ f32 sp50;                            /* inferred */
    /* 0x54 */ f32 sp54;                            /* inferred */
    /* 0x58 */ f32 sp58;                            /* inferred */
    /* 0x5C */ char pad_5C[0x4];
};                                                  /* size = 0x60 */

struct _mips2c_stack_func_800CDB6C {
    /* 0x00 */ char pad_0[0x34];
    /* 0x34 */ Vec3f *sp34;                         /* inferred */
    /* 0x38 */ char pad_38[0xC];                    /* maybe part of sp34[4]? */
    /* 0x44 */ f32 sp44;                            /* inferred */
    /* 0x48 */ s16 sp48;                            /* inferred */
    /* 0x4A */ s16 sp4A;                            /* inferred */
    /* 0x4C */ f32 sp4C;                            /* inferred */
    /* 0x50 */ char pad_50[0x4];
    /* 0x54 */ f32 sp54;                            /* inferred */
    /* 0x58 */ f32 sp58;                            /* inferred */
    /* 0x5C */ char pad_5C[0x8];                    /* maybe part of sp58[3]? */
    /* 0x64 */ f32 sp64;                            /* inferred */
    /* 0x68 */ f32 sp68;                            /* inferred */
    /* 0x6C */ f32 sp6C;                            /* inferred */
    /* 0x70 */ f32 sp70;                            /* inferred */
    /* 0x74 */ f32 sp74;                            /* inferred */
    /* 0x78 */ f32 sp78;                            /* inferred */
    /* 0x7C */ char pad_7C[0x4];
};                                                  /* size = 0x80 */

struct _mips2c_stack_func_800CDE6C {
    /* 0x00 */ char pad_0[0x38];
    /* 0x38 */ PosRot *sp38;                        /* inferred */
    /* 0x3C */ s32 sp3C;                            /* inferred */
    /* 0x40 */ char pad_40[0x10];                   /* maybe part of sp3C[5]? */
    /* 0x50 */ f32 sp50;                            /* inferred */
    /* 0x54 */ char pad_54[0x8];                    /* maybe part of sp50[3]? */
    /* 0x5C */ f32 sp5C;                            /* inferred */
    /* 0x60 */ char pad_60[0x8];                    /* maybe part of sp5C[3]? */
    /* 0x68 */ f32 sp68;                            /* inferred */
    /* 0x6C */ f32 sp6C;                            /* inferred */
    /* 0x70 */ f32 sp70;                            /* inferred */
    /* 0x74 */ f32 sp74;                            /* inferred */
    /* 0x78 */ f32 sp78;                            /* inferred */
    /* 0x7C */ f32 sp7C;                            /* inferred */
    /* 0x80 */ f32 sp80;                            /* inferred */
    /* 0x84 */ f32 sp84;                            /* inferred */
    /* 0x88 */ f32 sp88;                            /* inferred */
    /* 0x8C */ char pad_8C[0x4];
};                                                  /* size = 0x90 */

struct _mips2c_stack_func_800CE2B8 {
    /* 0x00 */ char pad_0[0x38];
    /* 0x38 */ s32 sp38;                            /* inferred */
    /* 0x3C */ char pad_3C[0x10];                   /* maybe part of sp38[5]? */
    /* 0x4C */ f32 sp4C;                            /* inferred */
    /* 0x50 */ char pad_50[0x8];                    /* maybe part of sp4C[3]? */
    /* 0x58 */ f32 sp58;                            /* inferred */
    /* 0x5C */ char pad_5C[0x4];
    /* 0x60 */ f32 sp60;                            /* inferred */
    /* 0x64 */ f32 sp64;                            /* inferred */
    /* 0x68 */ f32 sp68;                            /* inferred */
    /* 0x6C */ f32 sp6C;                            /* inferred */
    /* 0x70 */ f32 sp70;                            /* inferred */
    /* 0x74 */ f32 sp74;                            /* inferred */
    /* 0x78 */ f32 sp78;                            /* inferred */
    /* 0x7C */ f32 sp7C;                            /* inferred */
    /* 0x80 */ f32 sp80;                            /* inferred */
    /* 0x84 */ char pad_84[0x4];
};                                                  /* size = 0x88 */

struct _mips2c_stack_func_800CE5E0 {
    /* 0x00 */ char pad_0[0x30];
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ char pad_3C[0x8];                    /* maybe part of sp38[3]? */
    /* 0x44 */ Player *sp44;                        /* inferred */
    /* 0x48 */ f32 sp48;                            /* inferred */
    /* 0x4C */ char pad_4C[0x8];                    /* maybe part of sp48[3]? */
    /* 0x54 */ f32 sp54;                            /* inferred */
    /* 0x58 */ f32 sp58;                            /* inferred */
    /* 0x5C */ f32 sp5C;                            /* inferred */
    /* 0x60 */ f32 sp60;                            /* inferred */
    /* 0x64 */ f32 sp64;                            /* inferred */
    /* 0x68 */ f32 sp68;                            /* inferred */
    /* 0x6C */ char pad_6C[0x4];
};                                                  /* size = 0x70 */

struct _mips2c_stack_func_800CE79C {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ f32 sp24;                            /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_800CE930 {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_800CEAD8 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ s32 sp1C;                            /* inferred */
    /* 0x20 */ char pad_20[0x8];                    /* maybe part of sp1C[3]? */
    /* 0x28 */ s16 sp28;                            /* inferred */
    /* 0x2A */ char pad_2A[0xE];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_800CEC38 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ s32 sp1C;                            /* inferred */
    /* 0x20 */ char pad_20[0x14];                   /* maybe part of sp1C[6]? */
    /* 0x34 */ f32 sp34;                            /* inferred */
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_800CED90 {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ f32 *sp2C;                           /* inferred */
    /* 0x30 */ Vec3f *sp30;                         /* inferred */
    /* 0x34 */ Vec3f *sp34;                         /* inferred */
    /* 0x38 */ Vec3f *sp38;                         /* inferred */
    /* 0x3C */ ? sp3C;                              /* inferred */
    /* 0x3C */ char pad_3C[0x14];
    /* 0x50 */ f32 sp50;                            /* inferred */
    /* 0x54 */ s16 sp54;                            /* inferred */
    /* 0x56 */ s16 sp56;                            /* inferred */
    /* 0x58 */ ? sp58;                              /* inferred */
    /* 0x58 */ char pad_58[0x30];
    /* 0x88 */ f32 sp88;                            /* inferred */
    /* 0x8C */ s32 sp8C;                            /* inferred */
    /* 0x90 */ f32 sp90;                            /* inferred */
    /* 0x94 */ f32 sp94;                            /* inferred */
    /* 0x98 */ f32 sp98;                            /* inferred */
    /* 0x9C */ char pad_9C[0xC];
};                                                  /* size = 0xA8 */

struct _mips2c_stack_func_800DDFE0 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_800DE0E0 {};              /* size 0x0 */

struct _mips2c_stack_func_800DE0EC {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ Vec3f *sp20;                         /* inferred */
    /* 0x24 */ Vec3f *sp24;                         /* inferred */
    /* 0x28 */ char pad_28[0x14];                   /* maybe part of sp24[6]? */
    /* 0x3C */ ? sp3C;                              /* inferred */
    /* 0x3C */ char pad_3C[0xC];
    /* 0x48 */ s32 sp48;                            /* inferred */
    /* 0x4C */ f32 sp4C;                            /* inferred */
    /* 0x50 */ s16 sp50;                            /* inferred */
    /* 0x52 */ s16 sp52;                            /* inferred */
    /* 0x54 */ ? sp54;                              /* inferred */
    /* 0x54 */ char pad_54[0xE];
    /* 0x62 */ s16 sp62;                            /* inferred */
    /* 0x64 */ char pad_64[0x4];
};                                                  /* size = 0x68 */

struct _mips2c_stack_func_800DE308 {};              /* size 0x0 */

struct _mips2c_stack_func_800DE324 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ s32 *sp24;                           /* inferred */
    /* 0x28 */ char pad_28[0x2];
    /* 0x2A */ s16 sp2A;                            /* inferred */
    /* 0x2C */ char pad_2C[0xE];                    /* maybe part of sp2A[8]? */
    /* 0x3A */ s16 sp3A;                            /* inferred */
    /* 0x3C */ f32 sp3C;                            /* inferred */
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_800DE62C {
    /* 0x00 */ char pad_0[0x28];
    /* 0x28 */ s32 sp28;                            /* inferred */
    /* 0x2C */ char pad_2C[0x4];
    /* 0x30 */ ? sp30;                              /* inferred */
    /* 0x30 */ char pad_30[0x8];
    /* 0x38 */ u32 sp38;                            /* inferred */
    /* 0x3C */ char pad_3C[0x4];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_800DE840 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_800DE890 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_800DE954 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_800DF498 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_800DF840 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_800DF86C {};              /* size 0x0 */

struct _mips2c_stack_func_800DF8EC {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_800DFAC8 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_800DFB14 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_800DFC1C {};              /* size 0x0 */

struct _mips2c_stack_func_800DFC40 {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ s16 sp18;                            /* inferred */
    /* 0x1A */ char pad_1A[0x6];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_800DFC68 {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ s16 sp18;                            /* inferred */
    /* 0x1A */ s16 sp1A;                            /* inferred */
    /* 0x1C */ char pad_1C[0x4];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_800DFC90 {};              /* size 0x0 */

struct _mips2c_stack_func_800DFCB4 {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ s16 sp18;                            /* inferred */
    /* 0x1A */ char pad_1A[0x6];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_800DFCDC {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ s16 sp18;                            /* inferred */
    /* 0x1A */ s16 sp1A;                            /* inferred */
    /* 0x1C */ char pad_1C[0x4];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_800DFD04 {
    /* 0x00 */ char pad_0[0x26];
    /* 0x26 */ s16 sp26;                            /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_800DFD78 {
    /* 0x00 */ char pad_0[0x4];
    /* 0x04 */ ? sp4;                               /* inferred */
    /* 0x04 */ char pad_4[0x1C];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_800DFEF0 {};              /* size 0x0 */

struct _mips2c_stack_func_800DFF18 {};              /* size 0x0 */

struct _mips2c_stack_func_800DFF34 {};              /* size 0x0 */

struct _mips2c_stack_func_800DFF44 {};              /* size 0x0 */

struct _mips2c_stack_func_800DFFAC {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_800E007C {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ PosRot *sp20;                        /* inferred */
    /* 0x24 */ char pad_24[0x4];
    /* 0x28 */ ? sp28;                              /* inferred */
    /* 0x28 */ char pad_28[0x10];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_800E01AC {};              /* size 0x0 */

struct _mips2c_stack_func_800E01B8 {};              /* size 0x0 */

struct _mips2c_stack_func_800E01DC {};              /* size 0x0 */

struct _mips2c_stack_func_800E0228 {};              /* size 0x0 */

struct _mips2c_stack_func_800E0238 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_800E02AC {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_800E0308 {};              /* size 0x0 */

struct _mips2c_stack_func_800E031C {};              /* size 0x0 */

struct _mips2c_stack_func_800E0348 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

f32 func_80086760(f32, f32);                        /* extern */
f32 func_800B7090(s32, s32);                        /* extern */
? func_800B81E0(f32 *, Player *, Camera *);         /* extern */
f32 func_800C40B4(s32, void **, s32 *, f32 *);      /* extern */
f32 func_800C41E4(GlobalContext *, CollisionContext *, CollisionPoly **, f32 *, Player *, f32 *); /* extern */
f32 func_800C4488(CollisionContext *, Vec3f *, f32 *, f32 *); /* extern */
s32 func_800C54AC(CollisionContext *, Vec3f *, f32 *, f32 *, Vec3f *, s32, s32, s32, ? *, f32 *); /* extern */
s32 func_800C9728(s32, u32, s32, s32);              /* extern */
? func_800C98CC(s32, s32, ?, s16);                  /* extern */
s32 func_800C9EBC(s32, s32, s32, s32, f32 *, s32 *, s32 *); /* extern */
s16 func_800CA648(s32, s32, s32);                   /* extern */
? func_800CAA14(s32, s32, Vec3f *, Vec3f *, ? *);   /* extern */
