CRASHED

typedef struct {
    /* 0x00 */ Actor *actor;
    /* 0x04 */ Actor *at;
    /* 0x08 */ Actor *ac;
    /* 0x0C */ Actor *oc;
    /* 0x10 */ u8 atFlags;
    /* 0x11 */ u8 acFlags;
    /* 0x12 */ u8 ocFlags1;
    /* 0x13 */ u8 ocFlags2;
    /* 0x14 */ u8 colType;
    /* 0x15 */ u8 shape;
    /* 0x16 */ Vec3s unk_16;                        /* inferred */
} Collider;                                         /* size = 0x18 */

struct _mips2c_stack_Collider_DestroyBase {};       /* size 0x0 */

struct _mips2c_stack_Collider_DestroyBump {};       /* size 0x0 */

struct _mips2c_stack_Collider_DestroyCylinder {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Collider_DestroyCylinderDim {}; /* size 0x0 */

struct _mips2c_stack_Collider_DestroyInfo {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Collider_DestroyJntSph {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_Collider_DestroyJntSphElement {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Collider_DestroyJntSphElementDim {}; /* size 0x0 */

struct _mips2c_stack_Collider_DestroyLine {};       /* size 0x0 */

struct _mips2c_stack_Collider_DestroyQuad {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Collider_DestroyQuadDim {};    /* size 0x0 */

struct _mips2c_stack_Collider_DestroySphere {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Collider_DestroyTouch {};      /* size 0x0 */

struct _mips2c_stack_Collider_DestroyTris {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_Collider_DestroyTrisElement {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Collider_DestroyTrisElementDim {}; /* size 0x0 */

struct _mips2c_stack_Collider_FreeJntSph {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_Collider_FreeTris {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_Collider_InitAndSetCylinder {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Collider_InitAndSetJntSph {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_Collider_InitAndSetQuad {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Collider_InitAndSetSphere {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Collider_InitAndSetTris {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_Collider_InitBase {};          /* size 0x0 */

struct _mips2c_stack_Collider_InitBump {};          /* size 0x0 */

struct _mips2c_stack_Collider_InitCylinder {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Collider_InitCylinderDim {};   /* size 0x0 */

struct _mips2c_stack_Collider_InitInfo {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Collider_InitJntSph {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Collider_InitJntSphElement {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Collider_InitJntSphElementDim {}; /* size 0x0 */

struct _mips2c_stack_Collider_InitLine {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Collider_InitQuad {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Collider_InitQuadDim {};       /* size 0x0 */

struct _mips2c_stack_Collider_InitSphere {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Collider_InitTouch {};         /* size 0x0 */

struct _mips2c_stack_Collider_InitTris {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Collider_InitTrisElement {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Collider_InitTrisElementDim {}; /* size 0x0 */

struct _mips2c_stack_Collider_QuadSetNearestAC {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ ? sp20;                              /* inferred */
    /* 0x20 */ char pad_20[0x10];
};                                                  /* size = 0x30 */

struct _mips2c_stack_Collider_ResetACBase {};       /* size 0x0 */

struct _mips2c_stack_Collider_ResetACInfo {};       /* size 0x0 */

struct _mips2c_stack_Collider_ResetATBase {};       /* size 0x0 */

struct _mips2c_stack_Collider_ResetATInfo {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Collider_ResetATInfoUnk {};    /* size 0x0 */

struct _mips2c_stack_Collider_ResetCylinderAC {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Collider_ResetCylinderAT {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Collider_ResetCylinderOC {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Collider_ResetJntSphAC {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_Collider_ResetJntSphAT {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_Collider_ResetJntSphElementAC {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Collider_ResetJntSphElementAT {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Collider_ResetJntSphElementOC {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Collider_ResetJntSphOC {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_Collider_ResetLineOC {};       /* size 0x0 */

struct _mips2c_stack_Collider_ResetOCBase {};       /* size 0x0 */

struct _mips2c_stack_Collider_ResetOCInfo {};       /* size 0x0 */

struct _mips2c_stack_Collider_ResetQuadAC {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Collider_ResetQuadACDist {};   /* size 0x0 */

struct _mips2c_stack_Collider_ResetQuadAT {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Collider_ResetQuadOC {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Collider_ResetSphereAC {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Collider_ResetSphereAT {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Collider_ResetSphereOC {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Collider_ResetTrisAC {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_Collider_ResetTrisAT {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_Collider_ResetTrisElementAC {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Collider_ResetTrisElementAT {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Collider_ResetTrisElementOC {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Collider_ResetTrisOC {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_Collider_SetBase {};           /* size 0x0 */

struct _mips2c_stack_Collider_SetBaseToActor {};    /* size 0x0 */

struct _mips2c_stack_Collider_SetBaseType1 {};      /* size 0x0 */

struct _mips2c_stack_Collider_SetBump {};           /* size 0x0 */

struct _mips2c_stack_Collider_SetCylinder {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Collider_SetCylinderDim {};    /* size 0x0 */

struct _mips2c_stack_Collider_SetCylinderPosition {}; /* size 0x0 */

struct _mips2c_stack_Collider_SetCylinderToActor {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Collider_SetCylinderType1 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Collider_SetInfo {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_Collider_SetJntSph {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_Collider_SetJntSphAllocType1 {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_Collider_SetJntSphElement {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Collider_SetJntSphElementDim {}; /* size 0x0 */

struct _mips2c_stack_Collider_SetJntSphToActor {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_Collider_SetLine {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Collider_SetLinePoints {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Collider_SetQuad {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Collider_SetQuadDim {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Collider_SetQuadMidpoints {};  /* size 0x0 */

struct _mips2c_stack_Collider_SetQuadType1 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Collider_SetQuadVertices {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ ColliderQuadDim *sp1C;               /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_Collider_SetSphere {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Collider_SetTouch {};          /* size 0x0 */

struct _mips2c_stack_Collider_SetTris {
    /* 0x00 */ char pad_0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_Collider_SetTrisAllocType1 {
    /* 0x00 */ char pad_0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_Collider_SetTrisDim {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Collider_SetTrisElement {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Collider_SetTrisElementDim {
    /* 0x00 */ char pad_0[0x38];
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ f32 sp3C;                            /* inferred */
    /* 0x40 */ f32 sp40;                            /* inferred */
    /* 0x44 */ f32 sp44;                            /* inferred */
    /* 0x48 */ char pad_48[0x8];
};                                                  /* size = 0x50 */

struct _mips2c_stack_Collider_SetTrisVertices {
    /* 0x00 */ char pad_0[0x34];
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ f32 sp3C;                            /* inferred */
    /* 0x40 */ f32 sp40;                            /* inferred */
    /* 0x44 */ char pad_44[0x4];
};                                                  /* size = 0x48 */

struct _mips2c_stack_Collider_UpdateCylinder {};    /* size 0x0 */

struct _mips2c_stack_Collider_UpdateSphere {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Collider_UpdateSpheres {
    /* 0x00 */ char pad_0[0x38];
};                                                  /* size = 0x38 */

struct _mips2c_stack_Collider_UpdateSpheresElement {}; /* size 0x0 */

struct _mips2c_stack_CollisionCheck_AC {
    /* 0x00 */ char pad_0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_CollisionCheck_AC_CylVsCyl {
    /* 0x00 */ char pad_0[0x30];
    /* 0x30 */ Collider *sp30;                      /* inferred */
    /* 0x34 */ Collider *sp34;                      /* inferred */
    /* 0x38 */ Vec3s *sp38;                         /* inferred */
    /* 0x3C */ char pad_3C[0x8];                    /* maybe part of sp38[3]? */
    /* 0x44 */ ? sp44;                              /* inferred */
    /* 0x44 */ char pad_44[0xC];
    /* 0x50 */ ? sp50;                              /* inferred */
    /* 0x50 */ char pad_50[0xC];
    /* 0x5C */ f32 sp5C;                            /* inferred */
    /* 0x60 */ f32 sp60;                            /* inferred */
    /* 0x64 */ f32 sp64;                            /* inferred */
    /* 0x68 */ f32 sp68;                            /* inferred */
    /* 0x6C */ f32 sp6C;                            /* inferred */
    /* 0x70 */ char pad_70[0x8];
};                                                  /* size = 0x78 */

struct _mips2c_stack_CollisionCheck_AC_CylVsJntSph {
    /* 0x00 */ char pad_0[0x70];
    /* 0x70 */ f32 sp70;                            /* inferred */
    /* 0x74 */ f32 sp74;                            /* inferred */
    /* 0x78 */ f32 sp78;                            /* inferred */
    /* 0x7C */ f32 sp7C;                            /* inferred */
    /* 0x80 */ f32 sp80;                            /* inferred */
    /* 0x84 */ f32 sp84;                            /* inferred */
    /* 0x88 */ f32 sp88;                            /* inferred */
    /* 0x8C */ f32 sp8C;                            /* inferred */
    /* 0x90 */ f32 sp90;                            /* inferred */
    /* 0x94 */ char pad_94[0x4];
    /* 0x98 */ f32 sp98;                            /* inferred */
    /* 0x9C */ f32 sp9C;                            /* inferred */
    /* 0xA0 */ char pad_A0[0x8];
};                                                  /* size = 0xA8 */

struct _mips2c_stack_CollisionCheck_AC_CylVsQuad {
    /* 0x00 */ char pad_0[0x30];
    /* 0x30 */ u8 *sp30;                            /* inferred */
    /* 0x34 */ Actor **sp34;                        /* inferred */
    /* 0x38 */ Collider *sp38;                      /* inferred */
    /* 0x3C */ Collider *sp3C;                      /* inferred */
    /* 0x40 */ ? sp40;                              /* inferred */
    /* 0x40 */ char pad_40[0xC];
    /* 0x4C */ ? sp4C;                              /* inferred */
    /* 0x4C */ char pad_4C[0xC];
    /* 0x58 */ ? sp58;                              /* inferred */
    /* 0x58 */ char pad_58[0xC];
    /* 0x64 */ ? sp64;                              /* inferred */
    /* 0x64 */ char pad_64[0x14];
};                                                  /* size = 0x78 */

struct _mips2c_stack_CollisionCheck_AC_CylVsSphere {
    /* 0x00 */ char pad_0[0x34];
    /* 0x34 */ Collider *sp34;                      /* inferred */
    /* 0x38 */ Collider *sp38;                      /* inferred */
    /* 0x3C */ Collider *sp3C;                      /* inferred */
    /* 0x40 */ char pad_40[0x4];
    /* 0x44 */ f32 sp44;                            /* inferred */
    /* 0x48 */ f32 sp48;                            /* inferred */
    /* 0x4C */ f32 sp4C;                            /* inferred */
    /* 0x50 */ f32 sp50;                            /* inferred */
    /* 0x54 */ f32 sp54;                            /* inferred */
    /* 0x58 */ f32 sp58;                            /* inferred */
    /* 0x5C */ f32 sp5C;                            /* inferred */
    /* 0x60 */ f32 sp60;                            /* inferred */
    /* 0x64 */ f32 sp64;                            /* inferred */
    /* 0x68 */ f32 sp68;                            /* inferred */
    /* 0x6C */ f32 sp6C;                            /* inferred */
    /* 0x70 */ char pad_70[0x8];
};                                                  /* size = 0x78 */

struct _mips2c_stack_CollisionCheck_AC_CylVsTris {
    /* 0x00 */ char pad_0[0x48];
    /* 0x48 */ ? sp48;                              /* inferred */
    /* 0x48 */ char pad_48[0xC];
    /* 0x54 */ ? sp54;                              /* inferred */
    /* 0x54 */ char pad_54[0xC];
    /* 0x60 */ ? sp60;                              /* inferred */
    /* 0x60 */ char pad_60[0x18];
};                                                  /* size = 0x78 */

struct _mips2c_stack_CollisionCheck_AC_JntSphVsCyl {
    /* 0x00 */ char pad_0[0x58];
    /* 0x58 */ f32 sp58;                            /* inferred */
    /* 0x5C */ f32 sp5C;                            /* inferred */
    /* 0x60 */ f32 sp60;                            /* inferred */
    /* 0x64 */ f32 sp64;                            /* inferred */
    /* 0x68 */ f32 sp68;                            /* inferred */
    /* 0x6C */ f32 sp6C;                            /* inferred */
    /* 0x70 */ f32 sp70;                            /* inferred */
    /* 0x74 */ f32 sp74;                            /* inferred */
    /* 0x78 */ f32 sp78;                            /* inferred */
    /* 0x7C */ f32 sp7C;                            /* inferred */
    /* 0x80 */ f32 sp80;                            /* inferred */
    /* 0x84 */ char pad_84[0xC];
};                                                  /* size = 0x90 */

struct _mips2c_stack_CollisionCheck_AC_JntSphVsJntSph {
    /* 0x00 */ char pad_0[0x60];
    /* 0x60 */ f32 sp60;                            /* inferred */
    /* 0x64 */ f32 sp64;                            /* inferred */
    /* 0x68 */ f32 sp68;                            /* inferred */
    /* 0x6C */ f32 sp6C;                            /* inferred */
    /* 0x70 */ f32 sp70;                            /* inferred */
    /* 0x74 */ f32 sp74;                            /* inferred */
    /* 0x78 */ f32 sp78;                            /* inferred */
    /* 0x7C */ f32 sp7C;                            /* inferred */
    /* 0x80 */ f32 sp80;                            /* inferred */
    /* 0x84 */ char pad_84[0x4];
    /* 0x88 */ f32 sp88;                            /* inferred */
    /* 0x8C */ f32 sp8C;                            /* inferred */
    /* 0x90 */ char pad_90[0xC];                    /* maybe part of sp8C[4]? */
    /* 0x9C */ Collider *sp9C;                      /* inferred */
};                                                  /* size = 0xA0 */

struct _mips2c_stack_CollisionCheck_AC_JntSphVsQuad {
    /* 0x00 */ char pad_0[0x58];
    /* 0x58 */ ? sp58;                              /* inferred */
    /* 0x58 */ char pad_58[0xC];
    /* 0x64 */ ? sp64;                              /* inferred */
    /* 0x64 */ char pad_64[0x10];
    /* 0x74 */ ? sp74;                              /* inferred */
    /* 0x74 */ char pad_74[0x14];
};                                                  /* size = 0x88 */

struct _mips2c_stack_CollisionCheck_AC_JntSphVsSphere {
    /* 0x00 */ char pad_0[0x64];
    /* 0x64 */ f32 sp64;                            /* inferred */
    /* 0x68 */ f32 sp68;                            /* inferred */
    /* 0x6C */ f32 sp6C;                            /* inferred */
    /* 0x70 */ f32 sp70;                            /* inferred */
    /* 0x74 */ f32 sp74;                            /* inferred */
    /* 0x78 */ f32 sp78;                            /* inferred */
    /* 0x7C */ f32 sp7C;                            /* inferred */
    /* 0x80 */ f32 sp80;                            /* inferred */
    /* 0x84 */ f32 sp84;                            /* inferred */
    /* 0x88 */ char pad_88[0x4];
    /* 0x8C */ f32 sp8C;                            /* inferred */
    /* 0x90 */ f32 sp90;                            /* inferred */
    /* 0x94 */ char pad_94[0xC];
};                                                  /* size = 0xA0 */

struct _mips2c_stack_CollisionCheck_AC_JntSphVsTris {
    /* 0x00 */ char pad_0[0x54];
    /* 0x54 */ ? sp54;                              /* inferred */
    /* 0x54 */ char pad_54[0xC];
    /* 0x60 */ ? sp60;                              /* inferred */
    /* 0x60 */ char pad_60[0xC];
    /* 0x6C */ ? sp6C;                              /* inferred */
    /* 0x6C */ char pad_6C[0x1C];
};                                                  /* size = 0x88 */

struct _mips2c_stack_CollisionCheck_AC_QuadVsCyl {
    /* 0x00 */ char pad_0[0x30];
    /* 0x30 */ Actor **sp30;                        /* inferred */
    /* 0x34 */ u8 *sp34;                            /* inferred */
    /* 0x38 */ Collider *sp38;                      /* inferred */
    /* 0x3C */ Collider *sp3C;                      /* inferred */
    /* 0x40 */ ? sp40;                              /* inferred */
    /* 0x40 */ char pad_40[0xC];
    /* 0x4C */ ? sp4C;                              /* inferred */
    /* 0x4C */ char pad_4C[0xC];
    /* 0x58 */ ? sp58;                              /* inferred */
    /* 0x58 */ char pad_58[0xC];
    /* 0x64 */ ? sp64;                              /* inferred */
    /* 0x64 */ char pad_64[0x14];
};                                                  /* size = 0x78 */

struct _mips2c_stack_CollisionCheck_AC_QuadVsJntSph {
    /* 0x00 */ char pad_0[0x60];
    /* 0x60 */ ? sp60;                              /* inferred */
    /* 0x60 */ char pad_60[0xC];
    /* 0x6C */ ? sp6C;                              /* inferred */
    /* 0x6C */ char pad_6C[0x14];
    /* 0x80 */ ? sp80;                              /* inferred */
    /* 0x80 */ char pad_80[0x10];
};                                                  /* size = 0x90 */

struct _mips2c_stack_CollisionCheck_AC_QuadVsQuad {
    /* 0x00 */ char pad_0[0x48];
    /* 0x48 */ Collider *sp48;                      /* inferred */
    /* 0x4C */ char pad_4C[0x8];                    /* maybe part of sp48[3]? */
    /* 0x54 */ Collider *sp54;                      /* inferred */
    /* 0x58 */ ? sp58;                              /* inferred */
    /* 0x58 */ char pad_58[0xC];
    /* 0x64 */ ? sp64;                              /* inferred */
    /* 0x64 */ char pad_64[0x1C];
};                                                  /* size = 0x80 */

struct _mips2c_stack_CollisionCheck_AC_QuadVsSphere {
    /* 0x00 */ char pad_0[0x34];
    /* 0x34 */ Actor **sp34;                        /* inferred */
    /* 0x38 */ u8 *sp38;                            /* inferred */
    /* 0x3C */ Collider *sp3C;                      /* inferred */
    /* 0x40 */ Collider *sp40;                      /* inferred */
    /* 0x44 */ ? sp44;                              /* inferred */
    /* 0x44 */ char pad_44[0xC];
    /* 0x50 */ ? sp50;                              /* inferred */
    /* 0x50 */ char pad_50[0x10];
    /* 0x60 */ ? sp60;                              /* inferred */
    /* 0x60 */ char pad_60[0x10];
};                                                  /* size = 0x70 */

struct _mips2c_stack_CollisionCheck_AC_QuadVsTris {
    /* 0x00 */ char pad_0[0x5C];
    /* 0x5C */ ? sp5C;                              /* inferred */
    /* 0x5C */ char pad_5C[0xC];
    /* 0x68 */ ? sp68;                              /* inferred */
    /* 0x68 */ char pad_68[0x18];
};                                                  /* size = 0x80 */

struct _mips2c_stack_CollisionCheck_AC_SphereVsCylinder {
    /* 0x00 */ char pad_0[0x34];
    /* 0x34 */ Collider *sp34;                      /* inferred */
    /* 0x38 */ Collider *sp38;                      /* inferred */
    /* 0x3C */ Collider *sp3C;                      /* inferred */
    /* 0x40 */ char pad_40[0x4];
    /* 0x44 */ f32 sp44;                            /* inferred */
    /* 0x48 */ f32 sp48;                            /* inferred */
    /* 0x4C */ f32 sp4C;                            /* inferred */
    /* 0x50 */ f32 sp50;                            /* inferred */
    /* 0x54 */ f32 sp54;                            /* inferred */
    /* 0x58 */ f32 sp58;                            /* inferred */
    /* 0x5C */ f32 sp5C;                            /* inferred */
    /* 0x60 */ f32 sp60;                            /* inferred */
    /* 0x64 */ f32 sp64;                            /* inferred */
    /* 0x68 */ f32 sp68;                            /* inferred */
    /* 0x6C */ f32 sp6C;                            /* inferred */
    /* 0x70 */ char pad_70[0x8];
};                                                  /* size = 0x78 */

struct _mips2c_stack_CollisionCheck_AC_SphereVsJntSph {
    /* 0x00 */ char pad_0[0x64];
    /* 0x64 */ f32 sp64;                            /* inferred */
    /* 0x68 */ f32 sp68;                            /* inferred */
    /* 0x6C */ f32 sp6C;                            /* inferred */
    /* 0x70 */ f32 sp70;                            /* inferred */
    /* 0x74 */ f32 sp74;                            /* inferred */
    /* 0x78 */ f32 sp78;                            /* inferred */
    /* 0x7C */ f32 sp7C;                            /* inferred */
    /* 0x80 */ f32 sp80;                            /* inferred */
    /* 0x84 */ f32 sp84;                            /* inferred */
    /* 0x88 */ char pad_88[0x4];
    /* 0x8C */ f32 sp8C;                            /* inferred */
    /* 0x90 */ f32 sp90;                            /* inferred */
    /* 0x94 */ char pad_94[0xC];
};                                                  /* size = 0xA0 */

struct _mips2c_stack_CollisionCheck_AC_SphereVsQuad {
    /* 0x00 */ char pad_0[0x34];
    /* 0x34 */ u8 *sp34;                            /* inferred */
    /* 0x38 */ Actor **sp38;                        /* inferred */
    /* 0x3C */ Collider *sp3C;                      /* inferred */
    /* 0x40 */ Collider *sp40;                      /* inferred */
    /* 0x44 */ ? sp44;                              /* inferred */
    /* 0x44 */ char pad_44[0xC];
    /* 0x50 */ ? sp50;                              /* inferred */
    /* 0x50 */ char pad_50[0x10];
    /* 0x60 */ ? sp60;                              /* inferred */
    /* 0x60 */ char pad_60[0x10];
};                                                  /* size = 0x70 */

struct _mips2c_stack_CollisionCheck_AC_SphereVsSphere {
    /* 0x00 */ char pad_0[0x30];
    /* 0x30 */ Collider *sp30;                      /* inferred */
    /* 0x34 */ Collider *sp34;                      /* inferred */
    /* 0x38 */ Collider *sp38;                      /* inferred */
    /* 0x3C */ Collider *sp3C;                      /* inferred */
    /* 0x40 */ f32 sp40;                            /* inferred */
    /* 0x44 */ f32 sp44;                            /* inferred */
    /* 0x48 */ f32 sp48;                            /* inferred */
    /* 0x4C */ f32 sp4C;                            /* inferred */
    /* 0x50 */ f32 sp50;                            /* inferred */
    /* 0x54 */ f32 sp54;                            /* inferred */
    /* 0x58 */ f32 sp58;                            /* inferred */
    /* 0x5C */ f32 sp5C;                            /* inferred */
    /* 0x60 */ f32 sp60;                            /* inferred */
    /* 0x64 */ char pad_64[0x4];
    /* 0x68 */ f32 sp68;                            /* inferred */
    /* 0x6C */ f32 sp6C;                            /* inferred */
    /* 0x70 */ char pad_70[0x8];
};                                                  /* size = 0x78 */

struct _mips2c_stack_CollisionCheck_AC_SphereVsTris {
    /* 0x00 */ char pad_0[0x50];
    /* 0x50 */ ? sp50;                              /* inferred */
    /* 0x50 */ char pad_50[0xC];
    /* 0x5C */ ? sp5C;                              /* inferred */
    /* 0x5C */ char pad_5C[0xC];
    /* 0x68 */ ? sp68;                              /* inferred */
    /* 0x68 */ char pad_68[0x18];
};                                                  /* size = 0x80 */

struct _mips2c_stack_CollisionCheck_AC_TrisVsCyl {
    /* 0x00 */ char pad_0[0x4C];
    /* 0x4C */ ? sp4C;                              /* inferred */
    /* 0x4C */ char pad_4C[0xC];
    /* 0x58 */ ? sp58;                              /* inferred */
    /* 0x58 */ char pad_58[0x18];
};                                                  /* size = 0x70 */

struct _mips2c_stack_CollisionCheck_AC_TrisVsJntSph {
    /* 0x00 */ char pad_0[0x5C];
    /* 0x5C */ ? sp5C;                              /* inferred */
    /* 0x5C */ char pad_5C[0xC];
    /* 0x68 */ ? sp68;                              /* inferred */
    /* 0x68 */ char pad_68[0xC];
    /* 0x74 */ ? sp74;                              /* inferred */
    /* 0x74 */ char pad_74[0x10];
    /* 0x84 */ Collider *sp84;                      /* inferred */
    /* 0x88 */ char pad_88[0x8];
};                                                  /* size = 0x90 */

struct _mips2c_stack_CollisionCheck_AC_TrisVsQuad {
    /* 0x00 */ char pad_0[0x5C];
    /* 0x5C */ ? sp5C;                              /* inferred */
    /* 0x5C */ char pad_5C[0xC];
    /* 0x68 */ ? sp68;                              /* inferred */
    /* 0x68 */ char pad_68[0x18];
};                                                  /* size = 0x80 */

struct _mips2c_stack_CollisionCheck_AC_TrisVsSphere {
    /* 0x00 */ char pad_0[0x58];
    /* 0x58 */ ? sp58;                              /* inferred */
    /* 0x58 */ char pad_58[0xC];
    /* 0x64 */ ? sp64;                              /* inferred */
    /* 0x64 */ char pad_64[0xC];
    /* 0x70 */ ? sp70;                              /* inferred */
    /* 0x70 */ char pad_70[0x18];
};                                                  /* size = 0x88 */

struct _mips2c_stack_CollisionCheck_AC_TrisVsTris {
    /* 0x00 */ char pad_0[0x50];
    /* 0x50 */ ? sp50;                              /* inferred */
    /* 0x50 */ char pad_50[0xC];
    /* 0x5C */ ? sp5C;                              /* inferred */
    /* 0x5C */ char pad_5C[0x1C];
};                                                  /* size = 0x78 */

struct _mips2c_stack_CollisionCheck_AT {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_CollisionCheck_ApplyBumperDefense {}; /* size 0x0 */

struct _mips2c_stack_CollisionCheck_ApplyDamage {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ u32 sp24;                            /* inferred */
    /* 0x28 */ char pad_28[0x4];
    /* 0x2C */ ColliderInfo *sp2C;                  /* inferred */
    /* 0x30 */ Collider *sp30;                      /* inferred */
    /* 0x34 */ char pad_34[0x4];
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ f32 sp3C;                            /* inferred */
};                                                  /* size = 0x40 */

struct _mips2c_stack_CollisionCheck_ApplyDamageCyl {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_CollisionCheck_ApplyDamageJntSph {
    /* 0x00 */ char pad_0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_CollisionCheck_ApplyDamageQuad {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_CollisionCheck_ApplyDamageSphere {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_CollisionCheck_ApplyDamageTris {
    /* 0x00 */ char pad_0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_CollisionCheck_BlueBlood {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ s32 sp24;                            /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_CollisionCheck_CylSideVsLineSeg {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ f32 sp18;                            /* inferred */
    /* 0x1C */ char pad_1C[0x1C];                   /* maybe part of sp18[8]? */
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ char pad_3C[0x10];                   /* maybe part of sp38[5]? */
    /* 0x4C */ f32 sp4C;                            /* inferred */
    /* 0x50 */ f32 sp50;                            /* inferred */
    /* 0x54 */ f32 sp54;                            /* inferred */
    /* 0x58 */ f32 sp58;                            /* inferred */
    /* 0x5C */ f32 sp5C;                            /* inferred */
    /* 0x60 */ f32 sp60;                            /* inferred */
    /* 0x64 */ f32 sp64;                            /* inferred */
    /* 0x68 */ f32 sp68;                            /* inferred */
    /* 0x6C */ f32 sp6C;                            /* inferred */
    /* 0x70 */ f32 sp70;                            /* inferred */
    /* 0x74 */ f32 sp74;                            /* inferred */
};                                                  /* size = 0x78 */

struct _mips2c_stack_CollisionCheck_Damage {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_CollisionCheck_DestroyContext {}; /* size 0x0 */

struct _mips2c_stack_CollisionCheck_DisableSAC {};  /* size 0x0 */

struct _mips2c_stack_CollisionCheck_EnableSAC {};   /* size 0x0 */

struct _mips2c_stack_CollisionCheck_GetDamageAndEffectOnBumper {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_CollisionCheck_GetMassType {}; /* size 0x0 */

struct _mips2c_stack_CollisionCheck_GetToucherDamage {}; /* size 0x0 */

struct _mips2c_stack_CollisionCheck_GreenBlood {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ s32 sp24;                            /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_CollisionCheck_HitEffects {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_CollisionCheck_HitSolid {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_CollisionCheck_Incompatible {}; /* size 0x0 */

struct _mips2c_stack_CollisionCheck_InitContext {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_CollisionCheck_InitInfo {};    /* size 0x0 */

struct _mips2c_stack_CollisionCheck_LineOC {
    /* 0x00 */ char pad_0[0x48];
};                                                  /* size = 0x48 */

struct _mips2c_stack_CollisionCheck_LineOCCheck {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_CollisionCheck_LineOCCheckAll {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_CollisionCheck_LineOC_Cyl {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_CollisionCheck_LineOC_JntSph {
    /* 0x00 */ char pad_0[0x38];
};                                                  /* size = 0x38 */

struct _mips2c_stack_CollisionCheck_LineOC_Sphere {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_CollisionCheck_NoBlood {};     /* size 0x0 */

struct _mips2c_stack_CollisionCheck_NoSharedFlags {}; /* size 0x0 */

struct _mips2c_stack_CollisionCheck_OC {
    /* 0x00 */ char pad_0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_CollisionCheck_OC_CylVsCyl {
    /* 0x00 */ char pad_0[0x34];
    /* 0x34 */ ? sp34;                              /* inferred */
    /* 0x34 */ char pad_34[0xC];
    /* 0x40 */ ? sp40;                              /* inferred */
    /* 0x40 */ char pad_40[0xC];
    /* 0x4C */ f32 sp4C;                            /* inferred */
    /* 0x50 */ char pad_50[0x8];
};                                                  /* size = 0x58 */

struct _mips2c_stack_CollisionCheck_OC_CylVsJntSph {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_CollisionCheck_OC_CylVsSphere {
    /* 0x00 */ char pad_0[0x30];
    /* 0x30 */ Collider *sp30;                      /* inferred */
    /* 0x34 */ ? sp34;                              /* inferred */
    /* 0x34 */ char pad_34[0xC];
    /* 0x40 */ ? sp40;                              /* inferred */
    /* 0x40 */ char pad_40[0xC];
    /* 0x4C */ f32 sp4C;                            /* inferred */
    /* 0x50 */ char pad_50[0x8];
};                                                  /* size = 0x58 */

struct _mips2c_stack_CollisionCheck_OC_JntSphVsCyl {
    /* 0x00 */ char pad_0[0x60];
    /* 0x60 */ ? sp60;                              /* inferred */
    /* 0x60 */ char pad_60[0xC];
    /* 0x6C */ ? sp6C;                              /* inferred */
    /* 0x6C */ char pad_6C[0xC];
    /* 0x78 */ f32 sp78;                            /* inferred */
    /* 0x7C */ char pad_7C[0xC];
};                                                  /* size = 0x88 */

struct _mips2c_stack_CollisionCheck_OC_JntSphVsJntSph {
    /* 0x00 */ char pad_0[0x5C];
    /* 0x5C */ ? sp5C;                              /* inferred */
    /* 0x5C */ char pad_5C[0xC];
    /* 0x68 */ ? sp68;                              /* inferred */
    /* 0x68 */ char pad_68[0xC];
    /* 0x74 */ f32 sp74;                            /* inferred */
    /* 0x78 */ char pad_78[0xC];                    /* maybe part of sp74[4]? */
    /* 0x84 */ Collider *sp84;                      /* inferred */
};                                                  /* size = 0x88 */

struct _mips2c_stack_CollisionCheck_OC_JntSphVsSphere {
    /* 0x00 */ char pad_0[0x60];
    /* 0x60 */ ? sp60;                              /* inferred */
    /* 0x60 */ char pad_60[0xC];
    /* 0x6C */ ? sp6C;                              /* inferred */
    /* 0x6C */ char pad_6C[0xC];
    /* 0x78 */ f32 sp78;                            /* inferred */
    /* 0x7C */ char pad_7C[0xC];
};                                                  /* size = 0x88 */

struct _mips2c_stack_CollisionCheck_OC_SphereVsCyl {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_CollisionCheck_OC_SphereVsJntSph {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_CollisionCheck_OC_SphereVsSphere {
    /* 0x00 */ char pad_0[0x34];
    /* 0x34 */ Collider *sp34;                      /* inferred */
    /* 0x38 */ Collider *sp38;                      /* inferred */
    /* 0x3C */ ? sp3C;                              /* inferred */
    /* 0x3C */ char pad_3C[0xC];
    /* 0x48 */ ? sp48;                              /* inferred */
    /* 0x48 */ char pad_48[0xC];
    /* 0x54 */ f32 sp54;                            /* inferred */
    /* 0x58 */ char pad_58[0x8];
};                                                  /* size = 0x60 */

struct _mips2c_stack_CollisionCheck_QuadAvgPoint {}; /* size 0x0 */

struct _mips2c_stack_CollisionCheck_RedBlood {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_CollisionCheck_RedBloodUnused {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_CollisionCheck_ResetDamage {}; /* size 0x0 */

struct _mips2c_stack_CollisionCheck_SetAC {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_CollisionCheck_SetAC_SAC {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_CollisionCheck_SetAT {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_CollisionCheck_SetAT_SAC {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_CollisionCheck_SetATvsAC {
    /* 0x00 */ char pad_0[0x38];
    /* 0x38 */ u32 sp38;                            /* inferred */
    /* 0x3C */ char pad_3C[0x4];
};                                                  /* size = 0x40 */

struct _mips2c_stack_CollisionCheck_SetBounce {};   /* size 0x0 */

struct _mips2c_stack_CollisionCheck_SetCylHitFX {
    /* 0x00 */ char pad_0[0x28];
    /* 0x28 */ ? sp28;                              /* inferred */
    /* 0x28 */ char pad_28[0x10];
};                                                  /* size = 0x38 */

struct _mips2c_stack_CollisionCheck_SetHitEffects {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_CollisionCheck_SetInfo {};     /* size 0x0 */

struct _mips2c_stack_CollisionCheck_SetInfo2 {};    /* size 0x0 */

struct _mips2c_stack_CollisionCheck_SetInfoGetDamageTable {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_CollisionCheck_SetInfoNoDamageTable {}; /* size 0x0 */

struct _mips2c_stack_CollisionCheck_SetJntSphHitFX {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ ? sp24;                              /* inferred */
    /* 0x24 */ char pad_24[0xC];
    /* 0x30 */ ColliderInfo *sp30;                  /* inferred */
    /* 0x34 */ char pad_34[0x4];
};                                                  /* size = 0x38 */

struct _mips2c_stack_CollisionCheck_SetOC {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_CollisionCheck_SetOCLine {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_CollisionCheck_SetOC_SAC {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_CollisionCheck_SetOCvsOC {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ s32 sp18;                            /* inferred */
    /* 0x1C */ char pad_1C[0x4];
    /* 0x20 */ Actor *sp20;                         /* inferred */
    /* 0x24 */ Actor *sp24;                         /* inferred */
    /* 0x28 */ char pad_28[0xC];                    /* maybe part of sp24[4]? */
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ char pad_3C[0x4];
    /* 0x40 */ f32 sp40;                            /* inferred */
    /* 0x44 */ char pad_44[0xC];
};                                                  /* size = 0x50 */

struct _mips2c_stack_CollisionCheck_SetQuadHitFX {
    /* 0x00 */ char pad_0[0x28];
    /* 0x28 */ ? sp28;                              /* inferred */
    /* 0x28 */ char pad_28[0x10];
};                                                  /* size = 0x38 */

struct _mips2c_stack_CollisionCheck_SetSphereHitFX {
    /* 0x00 */ char pad_0[0x28];
    /* 0x28 */ ? sp28;                              /* inferred */
    /* 0x28 */ char pad_28[0x10];
};                                                  /* size = 0x38 */

struct _mips2c_stack_CollisionCheck_SetTrisHitFX {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ ? sp24;                              /* inferred */
    /* 0x24 */ char pad_24[0xC];
    /* 0x30 */ ColliderInfo *sp30;                  /* inferred */
    /* 0x34 */ char pad_34[0x4];
};                                                  /* size = 0x38 */

struct _mips2c_stack_CollisionCheck_SkipBump {};    /* size 0x0 */

struct _mips2c_stack_CollisionCheck_SkipOC {};      /* size 0x0 */

struct _mips2c_stack_CollisionCheck_SkipTouch {};   /* size 0x0 */

struct _mips2c_stack_CollisionCheck_SpawnRedBlood {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ s32 sp24;                            /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_CollisionCheck_SpawnShieldParticles {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ s32 sp24;                            /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_CollisionCheck_SpawnShieldParticlesMetal {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_CollisionCheck_SpawnShieldParticlesMetal2 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_CollisionCheck_SpawnShieldParticlesMetalSound {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_CollisionCheck_SpawnShieldParticlesWood {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ s32 sp24;                            /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_CollisionCheck_SpawnWaterDroplets {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ s32 sp24;                            /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_CollisionCheck_SwordHitAudio {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_CollisionCheck_TrisAvgPoint {}; /* size 0x0 */

struct _mips2c_stack_CollisionCheck_WaterBurst {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

static ? D_801EDEBC;
static ? D_801EDFD4;
static TriNorm D_801EE0A4;
static TriNorm D_801EE11C;
Vec3f D_801EDE00;
Vec3f D_801EDE10;
Vec3f D_801EDE20;
Vec3f D_801EDE30;
TriNorm D_801EDE40;
TriNorm D_801EDE78;
LineSegment D_801EDEB0;
TriNorm D_801EDEC8;
TriNorm D_801EDF00;
Vec3f D_801EDF38;
Vec3f D_801EDF48;
TriNorm D_801EDF58;
TriNorm D_801EDF90;
LineSegment D_801EDFC8;
Vec3f D_801EDFE0;
Vec3f D_801EDFF0;
TriNorm D_801EE000;
TriNorm D_801EE038;
TriNorm D_801EE070[2];
Vec3f D_801EE0D8;
TriNorm D_801EE0E8[2];
TriNorm D_801EE150;
TriNorm D_801EE188;
Vec3f D_801EE1C0;
Vec3f D_801EE1D0;
Vec3f D_801EE1E0;
Vec3f D_801EE1F0;
EffSparkParams D_801EE200;
TriNorm D_801EE6C8;
TriNorm D_801EE700;
EffSparkParams D_801EE738;
EffSparkParams D_801EEC00;
EffSparkParams D_801EF0C8;
TriNorm D_801EF590;
TriNorm D_801EF5C8;
TriNorm D_801EF600;
TriNorm D_801EF638;
f32 damageMultipliers[16] = {
    0.0f,
