CRASHED

/*
Failed to decompile function func_800EA324:

Label L800EA37C refers to a delay slot; this is currently not supported.
Please modify the assembly to work around it (e.g. copy the instruction
to all jump sources and move the label, or add a nop to the delay slot).
*/
/*
Failed to decompile function Cutscene_ProcessCommands:

Label L800ED934 refers to a delay slot; this is currently not supported.
Please modify the assembly to work around it (e.g. copy the instruction
to all jump sources and move the label, or add a nop to the delay slot).
*/
/*
Failed to decompile function func_800EDBE0:

Label L800EDD44 refers to a delay slot; this is currently not supported.
Please modify the assembly to work around it (e.g. copy the instruction
to all jump sources and move the label, or add a nop to the delay slot).
*/
f32 func_800F5A8C(u16, u16, u16, CsCmdUnk9B *, u16, GlobalContext *); /* extern */
? func_8016119C(Camera *, ? *);                     /* extern */
? func_80161998(CsCmdUnk5A *, ? *);                 /* extern */
? func_80161BE0(?);                                 /* extern */
? func_80161C0C();                                  /* extern */
? func_80165658(u32);                               /* extern */
? func_8016566C(?, CsCmdBase *);                    /* extern */
? func_80165690();                                  /* extern */
s32 func_8016A168();                                /* extern */
? func_801A25E4(u16, s32);                          /* extern */
? func_801A2C88(s32);                               /* extern */
? func_801A2D54(s32);                               /* extern */
s32 func_801A3950(?, ?, GlobalContext *);           /* extern */
? func_801A3F54(?);                                 /* extern */
? func_801A4428(?);                                 /* extern */
? func_801A4A28(u8, GlobalContext *);               /* extern */
s32 func_800EC6D4(GlobalContext *, CsCmdTextbox *); /* static */
void func_800EDDBC(s32 arg0, ? arg1);               /* static */
static u16 D_801BB124 = 0;
static u16 D_801BB128 = 0;
static u8 D_801BB12C = 0;
static s32 D_801BB160 = 0;
static u16 D_801F4D40;
static ? D_801F4D48;
static u16 D_801F4DC8;
static u16 D_801F4DCA;
static ? D_801F4DCC;
static ? D_801F4DDC;
static s8 D_801F4DE0;
static s16 D_801F4DE2;
u32 gBitFlags[32] = {
    1,
    2,
    4,
    8,
    0x10,
    0x20,
    0x40,
    0x80,
    0x100,
    0x200,
    0x400,
    0x800,
    0x1000,
    0x2000,
    0x4000,
    0x8000,
    0x10000,
    0x20000,
    0x40000,
    0x80000,
    0x100000,
    0x200000,
    0x400000,
    0x800000,
    0x1000000,
    0x2000000,
    0x4000000,
    0x8000000,
    0x10000000,
    0x20000000,
    0x40000000,
    0x80000000,
};
GameInfo *gGameInfo;
u8 gItemSlots[];                                    /* unable to generate initializer */
SaveContext gSaveContext;
void (*sCsStateHandlers1[5])(GlobalContext *, CutsceneContext *) = {
    Cutscene_Nop800EA210,
    func_800EA258,
    Cutscene_Nop800EA210,
    func_800ED9C4,
    Cutscene_Nop800EA210,
};
void (*sCsStateHandlers2[5])(GlobalContext *, CutsceneContext *) = {
    Cutscene_Nop800EA210,
    func_800EA2B8,
    func_800ED980,
    func_800EDA04,
    func_800ED980,
};

typedef struct {
    /* 0x0000 */ u16 unk0;
    /* 0x0002 */ u16 startFrame;
    /* 0x0004 */ u16 endFrame;
    /* 0x0006 */ char pad6[0x2];                    /* maybe part of endFrame[2]? */
    /* 0x0008 */ u16 unk8;                          /* inferred */
    /* 0x000A */ char padA[0x2];                    /* maybe part of unk8[2]? */
    /* 0x000C */ s32 unkC;                          /* inferred */
    /* 0x0010 */ s32 unk10;                         /* inferred */
    /* 0x0014 */ s32 unk14;                         /* inferred */
    /* 0x0018 */ s32 unk18;                         /* inferred */
    /* 0x001C */ s32 unk1C;                         /* inferred */
    /* 0x0020 */ s32 unk20;                         /* inferred */
    /* 0x0024 */ char pad24[0xC];                   /* maybe part of unk20[4]? */
} CsCmdActorAction;                                 /* size 0x30 */

typedef struct {
    /* 0x0000 */ void unk0;                         /* inferred */
    /* 0x0001 */ char pad1[0x3];
    /* 0x0004 */ CsCmdUnk5A unk4;                   /* inferred */
} CsCmdUnk5A;                                       /* size 0x8 */

void Cutscene_Init(GlobalContext *globalCtx, CutsceneContext *csCtx) {
    ? *temp_v0;
    ? *phi_v0;

    csCtx->state = 0;
    csCtx->frames = 0;
    csCtx->unk_0C = 0.0f;
    globalCtx->csCtx.sceneCsCount = 0;
    globalCtx->csCtx.unk_12 = 0;
    D_801F4DCA = 0;
    D_801F4DCA = 0;
    phi_v0 = &D_801F4DCC;
    do {
        temp_v0 = phi_v0 + 8;
        temp_v0->unk-6 = 0;
        temp_v0->unk-4 = 0;
        temp_v0->unk-2 = 0;
        temp_v0->unk-8 = 0;
        phi_v0 = temp_v0;
    } while (temp_v0 != &D_801F4DDC);
    D_801F4DE0 = 0;
    func_801A3F54(0);
}

void func_800EA0D4(GlobalContext *globalCtx, CutsceneContext *csCtx) {
    csCtx->state = 1;
    csCtx->linkAction = NULL;
}

void func_800EA0EC(GlobalContext *globalCtx, CutsceneContext *csCtx) {
    if (csCtx->state != 4) {
        csCtx->state = 3;
    }
}

