struct _mips2c_stack_GetItem_Draw {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_800EE364 {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ Gfx *sp18;                           /* inferred */
    /* 0x1C */ char pad_1C[0x4];
    /* 0x20 */ GraphicsContext *sp20;               /* inferred */
    /* 0x24 */ char pad_24[0x4];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_800EE400 {
    /* 0x00 */ char pad_0[0x40];
    /* 0x40 */ s801BB170 *sp40;                     /* inferred */
    /* 0x44 */ char pad_44[0x8];                    /* maybe part of sp40[3]? */
    /* 0x4C */ Gfx *sp4C;                           /* inferred */
    /* 0x50 */ Gfx *sp50;                           /* inferred */
    /* 0x54 */ char pad_54[0x4];
    /* 0x58 */ Gfx *sp58;                           /* inferred */
    /* 0x5C */ char pad_5C[0x4];
    /* 0x60 */ Gfx *sp60;                           /* inferred */
    /* 0x64 */ char pad_64[0xC];
};                                                  /* size = 0x70 */

struct _mips2c_stack_func_800EE5FC {
    /* 0x00 */ char pad_0[0x44];
    /* 0x44 */ s801BB170 *sp44;                     /* inferred */
    /* 0x48 */ char pad_48[0x4];
    /* 0x4C */ Gfx *sp4C;                           /* inferred */
    /* 0x50 */ Gfx *sp50;                           /* inferred */
    /* 0x54 */ char pad_54[0x4];
    /* 0x58 */ Gfx *sp58;                           /* inferred */
    /* 0x5C */ char pad_5C[0x4];
    /* 0x60 */ Gfx *sp60;                           /* inferred */
    /* 0x64 */ char pad_64[0xC];
};                                                  /* size = 0x70 */

struct _mips2c_stack_func_800EE7D8 {
    /* 0x00 */ char pad_0[0x44];
    /* 0x44 */ s801BB170 *sp44;                     /* inferred */
    /* 0x48 */ char pad_48[0x4];
    /* 0x4C */ Gfx *sp4C;                           /* inferred */
    /* 0x50 */ Gfx *sp50;                           /* inferred */
    /* 0x54 */ char pad_54[0x4];
    /* 0x58 */ Gfx *sp58;                           /* inferred */
    /* 0x5C */ char pad_5C[0xC];
};                                                  /* size = 0x68 */

struct _mips2c_stack_func_800EE940 {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ s801BB170 *sp20;                     /* inferred */
    /* 0x24 */ char pad_24[0x4];
    /* 0x28 */ Gfx *sp28;                           /* inferred */
    /* 0x2C */ char pad_2C[0x4];
    /* 0x30 */ Gfx *sp30;                           /* inferred */
    /* 0x34 */ char pad_34[0xC];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_800EEA48 {
    /* 0x00 */ char pad_0[0x44];
    /* 0x44 */ s801BB170 *sp44;                     /* inferred */
    /* 0x48 */ char pad_48[0x8];                    /* maybe part of sp44[3]? */
    /* 0x50 */ Gfx *sp50;                           /* inferred */
    /* 0x54 */ char pad_54[0x10];                   /* maybe part of sp50[5]? */
    /* 0x64 */ Gfx *sp64;                           /* inferred */
    /* 0x68 */ Gfx *sp68;                           /* inferred */
    /* 0x6C */ char pad_6C[0xC];
};                                                  /* size = 0x78 */

struct _mips2c_stack_func_800EEC18 {
    /* 0x00 */ char pad_0[0x44];
    /* 0x44 */ Gfx *sp44;                           /* inferred */
    /* 0x48 */ Gfx *sp48;                           /* inferred */
    /* 0x4C */ char pad_4C[0xC];
};                                                  /* size = 0x58 */

struct _mips2c_stack_func_800EED20 {
    /* 0x00 */ char pad_0[0x44];
    /* 0x44 */ Gfx *sp44;                           /* inferred */
    /* 0x48 */ Gfx *sp48;                           /* inferred */
    /* 0x4C */ char pad_4C[0xC];
};                                                  /* size = 0x58 */

struct _mips2c_stack_func_800EEE34 {
    /* 0x00 */ char pad_0[0x44];
    /* 0x44 */ Gfx *sp44;                           /* inferred */
    /* 0x48 */ Gfx *sp48;                           /* inferred */
    /* 0x4C */ char pad_4C[0xC];
};                                                  /* size = 0x58 */

struct _mips2c_stack_func_800EEF4C {
    /* 0x00 */ char pad_0[0x44];
    /* 0x44 */ Gfx *sp44;                           /* inferred */
    /* 0x48 */ Gfx *sp48;                           /* inferred */
    /* 0x4C */ char pad_4C[0xC];
};                                                  /* size = 0x58 */

struct _mips2c_stack_func_800EF054 {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ Gfx *sp18;                           /* inferred */
    /* 0x1C */ char pad_1C[0x4];
    /* 0x20 */ GraphicsContext *sp20;               /* inferred */
    /* 0x24 */ char pad_24[0x4];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_800EF0F0 {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ s801BB170 *sp20;                     /* inferred */
    /* 0x24 */ char pad_24[0x4];
    /* 0x28 */ Gfx *sp28;                           /* inferred */
    /* 0x2C */ char pad_2C[0x4];
    /* 0x30 */ Gfx *sp30;                           /* inferred */
    /* 0x34 */ char pad_34[0xC];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_800EF1F4 {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ Gfx *sp18;                           /* inferred */
    /* 0x1C */ char pad_1C[0x4];
    /* 0x20 */ GraphicsContext *sp20;               /* inferred */
    /* 0x24 */ char pad_24[0x4];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_800EF2AC {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ Gfx *sp18;                           /* inferred */
    /* 0x1C */ char pad_1C[0x4];
    /* 0x20 */ GraphicsContext *sp20;               /* inferred */
    /* 0x24 */ char pad_24[0x4];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_800EF364 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ s801BB170 *sp24;                     /* inferred */
    /* 0x28 */ char pad_28[0x8];                    /* maybe part of sp24[3]? */
    /* 0x30 */ Gfx *sp30;                           /* inferred */
    /* 0x34 */ char pad_34[0x4];
    /* 0x38 */ Gfx *sp38;                           /* inferred */
    /* 0x3C */ char pad_3C[0x4];
    /* 0x40 */ Gfx *sp40;                           /* inferred */
    /* 0x44 */ char pad_44[0x8];                    /* maybe part of sp40[3]? */
    /* 0x4C */ ? sp4C;                              /* inferred */
    /* 0x4C */ char pad_4C[0x44];
};                                                  /* size = 0x90 */

struct _mips2c_stack_func_800EF4D4 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ s801BB170 *sp24;                     /* inferred */
    /* 0x28 */ char pad_28[0x8];                    /* maybe part of sp24[3]? */
    /* 0x30 */ Gfx *sp30;                           /* inferred */
    /* 0x34 */ char pad_34[0x4];
    /* 0x38 */ Gfx *sp38;                           /* inferred */
    /* 0x3C */ char pad_3C[0x4];
    /* 0x40 */ Gfx *sp40;                           /* inferred */
    /* 0x44 */ char pad_44[0x8];                    /* maybe part of sp40[3]? */
    /* 0x4C */ ? sp4C;                              /* inferred */
    /* 0x4C */ char pad_4C[0x44];
};                                                  /* size = 0x90 */

struct _mips2c_stack_func_800EF65C {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ s801BB170 *sp24;                     /* inferred */
    /* 0x28 */ char pad_28[0x8];                    /* maybe part of sp24[3]? */
    /* 0x30 */ Gfx *sp30;                           /* inferred */
    /* 0x34 */ char pad_34[0x4];
    /* 0x38 */ Gfx *sp38;                           /* inferred */
    /* 0x3C */ char pad_3C[0xC];
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_800EF780 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ s801BB170 *sp24;                     /* inferred */
    /* 0x28 */ char pad_28[0x8];                    /* maybe part of sp24[3]? */
    /* 0x30 */ Gfx *sp30;                           /* inferred */
    /* 0x34 */ char pad_34[0x4];
    /* 0x38 */ Gfx *sp38;                           /* inferred */
    /* 0x3C */ char pad_3C[0xC];
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_800EF89C {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ Gfx *sp18;                           /* inferred */
    /* 0x1C */ char pad_1C[0x4];
    /* 0x20 */ GraphicsContext *sp20;               /* inferred */
    /* 0x24 */ char pad_24[0x4];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_800EF984 {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ s801BB170 *sp20;                     /* inferred */
    /* 0x24 */ char pad_24[0x8];                    /* maybe part of sp20[3]? */
    /* 0x2C */ Gfx *sp2C;                           /* inferred */
    /* 0x30 */ char pad_30[0x8];                    /* maybe part of sp2C[3]? */
    /* 0x38 */ Gfx *sp38;                           /* inferred */
    /* 0x3C */ char pad_3C[0xC];
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_800EFAB8 {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ s801BB170 *sp20;                     /* inferred */
    /* 0x24 */ char pad_24[0x8];                    /* maybe part of sp20[3]? */
    /* 0x2C */ Gfx *sp2C;                           /* inferred */
    /* 0x30 */ char pad_30[0x8];                    /* maybe part of sp2C[3]? */
    /* 0x38 */ Gfx *sp38;                           /* inferred */
    /* 0x3C */ char pad_3C[0xC];
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_800EFBFC {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ Gfx *sp18;                           /* inferred */
    /* 0x1C */ char pad_1C[0x4];
    /* 0x20 */ GraphicsContext *sp20;               /* inferred */
    /* 0x24 */ char pad_24[0x4];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_800EFD44 {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ Gfx *sp20;                           /* inferred */
    /* 0x24 */ char pad_24[0x14];
};                                                  /* size = 0x38 */

extern void D_06001254;
extern void D_06001C60;
s801BB170 D_801BB170[118] = {
    {func_800EF0F0, 0x6000670, 0x6000750, 0, 0, 0, 0, 0, 0},
    {func_800EF054, 0x6000800, 0, 0, 0, 0, 0, 0, 0},
    {func_800EF1F4, 0x6000FD8, 0x6000FD0, 0, 0, 0, 0, 0, 0},
    {func_800EF0F0, 0x60006A0, 0x60005A0, 0, 0, 0, 0, 0, 0},
    {func_800EF2AC, 0x6000AA0, 0x6000AE0, 0, 0, 0, 0, 0, 0},
    {func_800EF2AC, 0x6000AB0, 0x6000AE0, 0, 0, 0, 0, 0, 0},
    {func_800EF2AC, 0x6000AC0, 0x6000AE0, 0, 0, 0, 0, 0, 0},
    {func_800EF2AC, 0x6000AD0, 0x6000AE0, 0, 0, 0, 0, 0, 0},
    {func_800EEE34, 0x60000E0, 0, 0, 0, 0, 0, 0, 0},
    {func_800EF0F0, 0x6000CA0, 0x6000F08, 0, 0, 0, 0, 0, 0},
    {func_800EE940, 0x6000960, 0x6000C50, 0, 0, 0, 0, 0, 0},
    {func_800EF0F0, 0x6000B78, 0x60006C0, 0, 0, 0, 0, 0, 0},
    {func_800EF0F0, 0x6000E48, 0x6000A10, 0, 0, 0, 0, 0, 0},
