f32 func_80086814(f32);                             /* extern */
void func_800A8C78(void *arg0);                     /* static */
void func_800A8DE8(EffectBlure *arg0, s32 arg1, f32 arg2, s16 *arg3, s16 *arg4, u8 *arg5, u8 *arg6); /* static */
void func_800A92FC(EffectBlure *arg0, GraphicsContext *arg1, s32); /* static */
void func_800A9330(EffectBlure *arg0, EffectBlure *arg1, s32 arg2, GraphicsContext *arg3); /* static */
void func_800A9804(EffectBlure *arg0, EffectBlure *arg1, s32 arg2, GraphicsContext *arg3); /* static */
void func_800AA190(EffectBlure *arg0, GraphicsContext *arg1, Gfx *); /* static */
void func_800AA460(void *arg0, ? arg1, ? arg2);     /* static */
void func_800AA498(void *arg0, void *arg1, ? arg2); /* static */
void func_800AA700(GraphicsContext *arg0, EffectBlure *arg1, u32 arg2); /* static */
void func_800AABE0(EffectBlure *arg0, GraphicsContext *arg1, Gfx *); /* static */
extern ? D_04014570;
static ? D_801AE240;                                /* unable to generate initializer */
static ? D_801AE250;                                /* unable to generate initializer */
static ? D_801AE26C;                                /* unable to generate initializer */
static ? D_801AE27C;                                /* unable to generate initializer */
static ? D_801AE28C;                                /* unable to generate initializer */
static ? D_801AE29C;                                /* unable to generate initializer */
static ? D_801AE2AC;                                /* unable to generate initializer */
static ? D_801AE2BC;                                /* unable to generate initializer */
static ? D_801AE2CC;                                /* unable to generate initializer */
static ? D_801AE2DC;                                /* unable to generate initializer */
void *D_801AE260[3] = {(void *) func_800AA460, (void *) func_800AA498, NULL};
RSPMatrix D_801D1DE0 = {
    {1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1},
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
};

typedef struct {
    /* 0x0000 */ char pad0[0x184];
    /* 0x0184 */ Color_RGBA8 unk184;
    /* 0x0188 */ Color_RGBA8 unk188;
    /* 0x018C */ Color_RGBA8 unk18C;
    /* 0x0190 */ Color_RGBA8 unk190;
    /* 0x0194 */ s32 unk194;                        /* inferred */
    /* 0x0198 */ s32 unk198;                        /* inferred */
    /* 0x019C */ s32 unk19C;                        /* inferred */
} EffBlureInit1;                                    /* size 0x1A0 */

void func_800A81F0(EffectBlure *this, Vec3f *p1, Vec3f *p2) {
    f32 sp174;
    f32 sp170;
    f32 sp16C;
    f32 sp168;
    f32 sp164;
    f32 sp160;
    Vec3f sp154;
    MtxF sp110;
    MtxF spD0;
    MtxF sp90;
    MtxF sp50;
    Vec3f sp44;
    Vec3f sp38;
    EffectBlureElement *temp_s0;
    f32 *temp_a0;
    f32 *temp_a1;
    f32 temp_f0;
    u8 temp_v0;

    if (this != 0) {
        temp_v0 = this->numElements;
        if ((s32) temp_v0 < 0x10) {
            temp_s0 = &this->elements[temp_v0];
            temp_s0->state = 1;
            if ((this->flags & 2) == 0) {
                temp_s0->p1.x = (s16) (s32) p1->x;
                temp_s0->p1.y = (s16) (s32) p1->y;
                temp_s0->p1.z = (s16) (s32) p1->z;
                temp_s0->p2.x = (s16) (s32) p2->x;
                temp_s0->p2.y = (s16) (s32) p2->y;
