typedef struct {
    /* 0x000 */ char pad_0[0x184];
    /* 0x184 */ Color_RGBA8 unk184;
    /* 0x188 */ Color_RGBA8 unk188;
    /* 0x18C */ Color_RGBA8 unk18C;
    /* 0x190 */ Color_RGBA8 unk190;
    /* 0x194 */ s32 unk_194;                        /* inferred */
    /* 0x198 */ s32 unk_198;                        /* inferred */
    /* 0x19C */ s32 unk_19C;                        /* inferred */
} EffBlureInit1;                                    /* size = 0x1A0 */

struct _mips2c_stack_EffectBlure_Destroy {};        /* size 0x0 */

struct _mips2c_stack_EffectBlure_Draw {
    /* 0x00 */ char pad_0[0x40];
    /* 0x40 */ Gfx *sp40;                           /* inferred */
    /* 0x44 */ char pad_44[0x4];
};                                                  /* size = 0x48 */

struct _mips2c_stack_EffectBlure_Init1 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EffectBlure_Init2 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EffectBlure_Initcommon {};     /* size 0x0 */

struct _mips2c_stack_EffectBlure_Update {
    /* 0x00 */ char pad_0[0x8];
    /* 0x08 */ s32 sp8;                             /* inferred */
    /* 0x0C */ s32 spC;                             /* inferred */
};                                                  /* size = 0x10 */

struct _mips2c_stack_func_800A81F0 {
    /* 0x000 */ char pad_0[0x38];
    /* 0x038 */ f32 sp38;                           /* inferred */
    /* 0x03C */ f32 sp3C;                           /* inferred */
    /* 0x040 */ f32 sp40;                           /* inferred */
    /* 0x044 */ f32 sp44;                           /* inferred */
    /* 0x048 */ f32 sp48;                           /* inferred */
    /* 0x04C */ f32 sp4C;                           /* inferred */
    /* 0x050 */ ? sp50;                             /* inferred */
    /* 0x050 */ char pad_50[0x40];
    /* 0x090 */ ? sp90;                             /* inferred */
    /* 0x090 */ char pad_90[0x40];
    /* 0x0D0 */ ? spD0;                             /* inferred */
    /* 0x0D0 */ char pad_D0[0x40];
    /* 0x110 */ ? sp110;                            /* inferred */
    /* 0x110 */ char pad_110[0x44];
    /* 0x154 */ f32 sp154;                          /* inferred */
    /* 0x158 */ f32 sp158;                          /* inferred */
    /* 0x15C */ f32 sp15C;                          /* inferred */
    /* 0x160 */ f32 sp160;                          /* inferred */
    /* 0x164 */ f32 sp164;                          /* inferred */
    /* 0x168 */ f32 sp168;                          /* inferred */
    /* 0x16C */ f32 sp16C;                          /* inferred */
    /* 0x170 */ f32 sp170;                          /* inferred */
    /* 0x174 */ f32 sp174;                          /* inferred */
    /* 0x178 */ char pad_178[0x8];
};                                                  /* size = 0x180 */

struct _mips2c_stack_func_800A8514 {};              /* size 0x0 */

struct _mips2c_stack_func_800A8C78 {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ Vec3s *sp20;                         /* inferred */
    /* 0x24 */ Vec3s *sp24;                         /* inferred */
    /* 0x28 */ void *sp28;                          /* inferred */
    /* 0x2C */ f32 sp2C;                            /* inferred */
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ char pad_38[0x8];                    /* maybe part of sp34[3]? */
    /* 0x40 */ ? sp40;                              /* inferred */
    /* 0x40 */ char pad_40[0xC];
    /* 0x4C */ ? sp4C;                              /* inferred */
    /* 0x4C */ char pad_4C[0xC];
    /* 0x58 */ ? sp58;                              /* inferred */
    /* 0x58 */ char pad_58[0xC];
    /* 0x64 */ ? sp64;                              /* inferred */
    /* 0x64 */ char pad_64[0xC];
};                                                  /* size = 0x70 */

struct _mips2c_stack_func_800A8DE8 {
    /* 0x00 */ char pad_0[0x30];
    /* 0x30 */ s16 sp30;                            /* inferred */
    /* 0x32 */ s16 sp32;                            /* inferred */
    /* 0x34 */ s16 sp34;                            /* inferred */
    /* 0x36 */ char pad_36[0x2];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_800A92FC {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_800A9330 {
    /* 0x00 */ char pad_0[0x4C];
    /* 0x4C */ f32 sp4C;                            /* inferred */
    /* 0x50 */ f32 sp50;                            /* inferred */
    /* 0x54 */ f32 sp54;                            /* inferred */
    /* 0x58 */ f32 sp58;                            /* inferred */
    /* 0x5C */ f32 sp5C;                            /* inferred */
    /* 0x60 */ f32 sp60;                            /* inferred */
    /* 0x64 */ ? sp64;                              /* inferred */
    /* 0x64 */ char pad_64[0xC];
    /* 0x70 */ u8 sp70;                             /* inferred */
    /* 0x71 */ u8 sp71;                             /* inferred */
    /* 0x72 */ u8 sp72;                             /* inferred */
    /* 0x73 */ u8 sp73;                             /* inferred */
    /* 0x74 */ u8 sp74;                             /* inferred */
    /* 0x75 */ u8 sp75;                             /* inferred */
    /* 0x76 */ u8 sp76;                             /* inferred */
    /* 0x77 */ u8 sp77;                             /* inferred */
    /* 0x78 */ char pad_78[0x4];                    /* maybe part of sp77[5]? */
    /* 0x7C */ s16 sp7C;                            /* inferred */
    /* 0x7E */ s16 sp7E;                            /* inferred */
    /* 0x80 */ s16 sp80;                            /* inferred */
    /* 0x82 */ char pad_82[0x2];
    /* 0x84 */ s16 sp84;                            /* inferred */
    /* 0x86 */ s16 sp86;                            /* inferred */
    /* 0x88 */ s16 sp88;                            /* inferred */
    /* 0x8A */ char pad_8A[0x6];
};                                                  /* size = 0x90 */

struct _mips2c_stack_func_800A9804 {
    /* 0x000 */ char pad_0[0xE4];
    /* 0x0E4 */ f32 spE4;                           /* inferred */
    /* 0x0E8 */ f32 spE8;                           /* inferred */
    /* 0x0EC */ f32 spEC;                           /* inferred */
    /* 0x0F0 */ s32 spF0;                           /* inferred */
    /* 0x0F4 */ char pad_F4[0x4];
    /* 0x0F8 */ ? spF8;                             /* inferred */
    /* 0x0F8 */ char pad_F8[0xC];
    /* 0x104 */ ? sp104;                            /* inferred */
    /* 0x104 */ char pad_104[0xC];
    /* 0x110 */ ? sp110;                            /* inferred */
    /* 0x110 */ char pad_110[0xC];
    /* 0x11C */ ? sp11C;                            /* inferred */
    /* 0x11C */ char pad_11C[0x14];
    /* 0x130 */ ? sp130;                            /* inferred */
    /* 0x130 */ char pad_130[0xC];
    /* 0x13C */ u8 sp13C;                           /* inferred */
    /* 0x13D */ u8 sp13D;                           /* inferred */
    /* 0x13E */ u8 sp13E;                           /* inferred */
    /* 0x13F */ u8 sp13F;                           /* inferred */
    /* 0x140 */ u8 sp140;                           /* inferred */
    /* 0x141 */ u8 sp141;                           /* inferred */
    /* 0x142 */ u8 sp142;                           /* inferred */
    /* 0x143 */ u8 sp143;                           /* inferred */
    /* 0x144 */ f32 sp144;                          /* inferred */
    /* 0x148 */ f32 sp148;                          /* inferred */
    /* 0x14C */ f32 sp14C;                          /* inferred */
    /* 0x150 */ f32 sp150;                          /* inferred */
    /* 0x154 */ f32 sp154;                          /* inferred */
    /* 0x158 */ f32 sp158;                          /* inferred */
    /* 0x15C */ char pad_15C[0x4];
    /* 0x160 */ f32 sp160;                          /* inferred */
    /* 0x164 */ f32 sp164;                          /* inferred */
    /* 0x168 */ f32 sp168;                          /* inferred */
    /* 0x16C */ f32 sp16C;                          /* inferred */
    /* 0x170 */ f32 sp170;                          /* inferred */
    /* 0x174 */ f32 sp174;                          /* inferred */
    /* 0x178 */ f32 sp178;                          /* inferred */
    /* 0x17C */ f32 sp17C;                          /* inferred */
    /* 0x180 */ f32 sp180;                          /* inferred */
    /* 0x184 */ f32 sp184;                          /* inferred */
    /* 0x188 */ f32 sp188;                          /* inferred */
    /* 0x18C */ f32 sp18C;                          /* inferred */
    /* 0x190 */ u8 sp190;                           /* inferred */
    /* 0x191 */ u8 sp191;                           /* inferred */
    /* 0x192 */ u8 sp192;                           /* inferred */
    /* 0x193 */ u8 sp193;                           /* inferred */
    /* 0x194 */ u8 sp194;                           /* inferred */
    /* 0x195 */ u8 sp195;                           /* inferred */
    /* 0x196 */ u8 sp196;                           /* inferred */
    /* 0x197 */ u8 sp197;                           /* inferred */
    /* 0x198 */ u8 sp198;                           /* inferred */
    /* 0x199 */ u8 sp199;                           /* inferred */
    /* 0x19A */ u8 sp19A;                           /* inferred */
    /* 0x19B */ u8 sp19B;                           /* inferred */
    /* 0x19C */ u8 sp19C;                           /* inferred */
    /* 0x19D */ u8 sp19D;                           /* inferred */
    /* 0x19E */ u8 sp19E;                           /* inferred */
    /* 0x19F */ u8 sp19F;                           /* inferred */
    /* 0x1A0 */ f32 sp1A0;                          /* inferred */
    /* 0x1A4 */ f32 sp1A4;                          /* inferred */
    /* 0x1A8 */ f32 sp1A8;                          /* inferred */
    /* 0x1AC */ f32 sp1AC;                          /* inferred */
    /* 0x1B0 */ f32 sp1B0;                          /* inferred */
    /* 0x1B4 */ f32 sp1B4;                          /* inferred */
    /* 0x1B8 */ f32 sp1B8;                          /* inferred */
    /* 0x1BC */ f32 sp1BC;                          /* inferred */
    /* 0x1C0 */ f32 sp1C0;                          /* inferred */
    /* 0x1C4 */ f32 sp1C4;                          /* inferred */
    /* 0x1C8 */ f32 sp1C8;                          /* inferred */
    /* 0x1CC */ f32 sp1CC;                          /* inferred */
    /* 0x1D0 */ u8 sp1D0;                           /* inferred */
    /* 0x1D1 */ char pad_1D1[0x3];                  /* maybe part of sp1D0[4]? */
    /* 0x1D4 */ u8 sp1D4;                           /* inferred */
    /* 0x1D5 */ char pad_1D5[0x7];                  /* maybe part of sp1D4[8]? */
    /* 0x1DC */ s16 sp1DC;                          /* inferred */
    /* 0x1DE */ char pad_1DE[0x6];                  /* maybe part of sp1DC[4]? */
    /* 0x1E4 */ s16 sp1E4;                          /* inferred */
    /* 0x1E6 */ char pad_1E6[0xA];
};                                                  /* size = 0x1F0 */

struct _mips2c_stack_func_800AA190 {
    /* 0x000 */ char pad_0[0x4C];
    /* 0x04C */ ? sp4C;                             /* inferred */
    /* 0x04C */ char pad_4C[0x40];
    /* 0x08C */ ? sp8C;                             /* inferred */
    /* 0x08C */ char pad_8C[0x40];
    /* 0x0CC */ ? spCC;                             /* inferred */
    /* 0x0CC */ char pad_CC[0x4C];
};                                                  /* size = 0x118 */

struct _mips2c_stack_func_800AA460 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_800AA498 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_800AA700 {
    /* 0x000 */ char pad_0[0x90];
    /* 0x090 */ ? sp90;                             /* inferred */
    /* 0x090 */ char pad_90[0x40];
    /* 0x0D0 */ ? spD0;                             /* inferred */
    /* 0x0D0 */ char pad_D0[0x40];
    /* 0x110 */ ? sp110;                            /* inferred */
    /* 0x110 */ char pad_110[0x40];
    /* 0x150 */ ? sp150;                            /* inferred */
    /* 0x150 */ char pad_150[0x44];
    /* 0x194 */ f32 sp194;                          /* inferred */
    /* 0x198 */ f32 sp198;                          /* inferred */
    /* 0x19C */ f32 sp19C;                          /* inferred */
    /* 0x1A0 */ f32 sp1A0;                          /* inferred */
    /* 0x1A4 */ f32 sp1A4;                          /* inferred */
    /* 0x1A8 */ f32 sp1A8;                          /* inferred */
    /* 0x1AC */ f32 sp1AC;                          /* inferred */
    /* 0x1B0 */ f32 sp1B0;                          /* inferred */
    /* 0x1B4 */ f32 sp1B4;                          /* inferred */
    /* 0x1B8 */ char pad_1B8[0x10];
};                                                  /* size = 0x1C8 */

struct _mips2c_stack_func_800AABE0 {
    /* 0x00 */ char pad_0[0x60];
    /* 0x60 */ u8 sp60;                             /* inferred */
    /* 0x61 */ u8 sp61;                             /* inferred */
    /* 0x62 */ u8 sp62;                             /* inferred */
    /* 0x63 */ u8 sp63;                             /* inferred */
    /* 0x64 */ u8 sp64;                             /* inferred */
    /* 0x65 */ u8 sp65;                             /* inferred */
    /* 0x66 */ u8 sp66;                             /* inferred */
    /* 0x67 */ u8 sp67;                             /* inferred */
    /* 0x68 */ char pad_68[0x4];                    /* maybe part of sp67[5]? */
    /* 0x6C */ s16 sp6C;                            /* inferred */
    /* 0x6E */ s16 sp6E;                            /* inferred */
    /* 0x70 */ s16 sp70;                            /* inferred */
    /* 0x72 */ char pad_72[0x2];
    /* 0x74 */ s16 sp74;                            /* inferred */
    /* 0x76 */ s16 sp76;                            /* inferred */
    /* 0x78 */ s16 sp78;                            /* inferred */
    /* 0x7A */ char pad_7A[0x1E];
};                                                  /* size = 0x98 */

f32 func_80086814(f32);                             /* extern */
void func_800A8C78(void *arg0);                     /* static */
void func_800A8DE8(EffectBlure *arg0, s32 arg1, f32 arg2, s16 *arg3, s16 *arg4, u8 *arg5, u8 *arg6); /* static */
void func_800A92FC(EffectBlure *arg0, GraphicsContext *arg1, s32); /* static */
void func_800A9330(EffectBlure *arg0, EffectBlure *arg1, s32 arg2, GraphicsContext *arg3); /* static */
void func_800A9804(EffectBlure *arg0, EffectBlure *arg1, s32 arg2, GraphicsContext *arg3); /* static */
void func_800AA190(EffectBlure *arg0, GraphicsContext *arg1, Gfx *); /* static */
void func_800AA460(void *arg0, ? arg1, ? arg2);     /* static */
void func_800AA498(void *arg0, void *arg1, ? arg2); /* static */
void func_800AA700(GraphicsContext *arg0, EffectBlure *arg1, u32 arg2); /* static */
