struct _mips2c_stack_EnItem00_Destroy {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnItem00_Draw {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ ObjectContext *sp18;                 /* inferred */
    /* 0x1C */ char pad_1C[0x3];
    /* 0x1F */ s8 sp1F;                             /* inferred */
    /* 0x20 */ char pad_20[0x8];
};                                                  /* size = 0x28 */

struct _mips2c_stack_EnItem00_DrawHeartContainer {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ Gfx *sp24;                           /* inferred */
    /* 0x28 */ char pad_28[0x10];
};                                                  /* size = 0x38 */

struct _mips2c_stack_EnItem00_DrawHeartPiece {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ Gfx *sp20;                           /* inferred */
    /* 0x24 */ char pad_24[0xC];
};                                                  /* size = 0x30 */

struct _mips2c_stack_EnItem00_DrawRupee {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ Gfx *sp20;                           /* inferred */
    /* 0x24 */ Gfx *sp24;                           /* inferred */
    /* 0x28 */ char pad_28[0x8];                    /* maybe part of sp24[3]? */
    /* 0x30 */ s32 sp30;                            /* inferred */
    /* 0x34 */ char pad_34[0x4];
};                                                  /* size = 0x38 */

struct _mips2c_stack_EnItem00_DrawSprite {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ Gfx *sp24;                           /* inferred */
    /* 0x28 */ Gfx *sp28;                           /* inferred */
    /* 0x2C */ char pad_2C[0x8];                    /* maybe part of sp28[3]? */
    /* 0x34 */ s32 sp34;                            /* inferred */
};                                                  /* size = 0x38 */

struct _mips2c_stack_EnItem00_Init {
    /* 0x00 */ char pad_0[0x30];
    /* 0x30 */ s32 sp30;                            /* inferred */
    /* 0x34 */ s32 sp34;                            /* inferred */
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ f32 sp3C;                            /* inferred */
    /* 0x40 */ char pad_40[0x8];
};                                                  /* size = 0x48 */

struct _mips2c_stack_EnItem00_SetObject {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnItem00_Update {
    /* 0x00 */ char pad_0[0x28];
    /* 0x28 */ ColliderCylinder *sp28;              /* inferred */
    /* 0x2C */ char pad_2C[0x8];                    /* maybe part of sp28[3]? */
    /* 0x34 */ s32 sp34;                            /* inferred */
    /* 0x38 */ s32 sp38;                            /* inferred */
    /* 0x3C */ char pad_3C[0xC];
};                                                  /* size = 0x48 */

struct _mips2c_stack_EnItem00_WaitForHeartObject {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ ObjectContext *sp18;                 /* inferred */
    /* 0x1C */ s32 sp1C;                            /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_Item_DropCollectible {
    /* 0x00 */ char pad_0[0x44];
    /* 0x44 */ u32 sp44;                            /* inferred */
    /* 0x48 */ s32 sp48;                            /* inferred */
    /* 0x4C */ char pad_4C[0x4];
    /* 0x50 */ s32 sp50;                            /* inferred */
    /* 0x54 */ s16 sp54;                            /* inferred */
    /* 0x56 */ s16 sp56;                            /* inferred */
    /* 0x58 */ s32 sp58;                            /* inferred */
    /* 0x5C */ char pad_5C[0xC];
};                                                  /* size = 0x68 */

struct _mips2c_stack_Item_DropCollectible2 {
    /* 0x00 */ char pad_0[0x40];
    /* 0x40 */ s16 sp40;                            /* inferred */
    /* 0x42 */ s16 sp42;                            /* inferred */
    /* 0x44 */ s32 sp44;                            /* inferred */
    /* 0x48 */ char pad_48[0x4];
    /* 0x4C */ Actor *sp4C;                         /* inferred */
};                                                  /* size = 0x50 */

struct _mips2c_stack_Item_DropCollectibleRandom {
    /* 0x00 */ char pad_0[0x50];
    /* 0x50 */ s16 sp50;                            /* inferred */
    /* 0x52 */ char pad_52[0xE];
};                                                  /* size = 0x60 */

struct _mips2c_stack_func_800A640C {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_800A6650 {
    /* 0x00 */ char pad_0[0x30];
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ char pad_3C[0x4];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_800A6780 {
    /* 0x00 */ char pad_0[0x34];
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ char pad_38[0x8];                    /* maybe part of sp34[3]? */
    /* 0x40 */ f32 sp40;                            /* inferred */
    /* 0x44 */ f32 sp44;                            /* inferred */
    /* 0x48 */ f32 sp48;                            /* inferred */
    /* 0x4C */ char pad_4C[0x4];
};                                                  /* size = 0x50 */

struct _mips2c_stack_func_800A6A40 {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ Actor *sp2C;                         /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_800A7650 {};              /* size 0x0 */

struct _mips2c_stack_func_800A8150 {};              /* size 0x0 */

struct _mips2c_stack_func_800A817C {};              /* size 0x0 */

struct _mips2c_stack_func_800A81A4 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

void EnItem00_SetObject(Actor *arg0, GlobalContext *arg1, f32 *arg2, f32 *arg3); /* static */
s16 func_800A7650(s16 arg0, Vec3f *);               /* static */
extern ? D_06001290;
extern ? D_06001470;
static Color_RGBA8 D_801ADF10 = {0xFF, 0xFF, 0x7F, 0};
static Color_RGBA8 D_801ADF14 = {0xFF, 0xFF, 0xFF, 0};
static Vec3f D_801ADF18 = {0.0f, 0.1f, 0.0f};
static Vec3f D_801ADF24 = {0.0f, 0.01f, 0.0f};
static ColliderCylinderInit enItem00CylinderInit = {
    {0xA, 0, 9, 0, 0, 1},
    {0, {0, 0, 0}, {0x10, 0, 0}, 0, 1, 0},
    {0xA, 0x1E, 0, {0, 0, 0}},
};
static InitChainEntry enItem00InitVars;             /* unable to generate initializer */
void *D_801ADF30[5] = {
    (void *)0x4061FC0,
    (void *)0x4061FE0,
    (void *)0x4062000,
    (void *)0x4062040,
    (void *)0x4062020,
};
void *D_801ADF44[12] = {
    (void *)0x405E6F0,
    (void *)0x405CEF0,
    (void *)0x405BEF0,
