CRASHED

typedef struct GraphicsContext {
    /* 0x000 */ Gfx *polyOpaBuffer;
    /* 0x004 */ Gfx *polyXluBuffer;
    /* 0x008 */ char pad_8[0x8];                    /* maybe part of polyXluBuffer[3]? */
    /* 0x010 */ Gfx *overlayBuffer;
    /* 0x014 */ char pad_14[0x44];                  /* maybe part of overlayBuffer[18]? */
    /* 0x058 */ OSMesgQueue *unk58;
    /* 0x05C */ OSMesgQueue unk5C;
    /* 0x074 */ char pad_74[0x12C];                 /* maybe part of unk5C[13]? */
    /* 0x1A0 */ Gfx *unk1A0;
    /* 0x1A4 */ TwoHeadGfxArena unk1A4;
    /* 0x1B4 */ Gfx *unk1B4;
    /* 0x1B8 */ TwoHeadGfxArena unk1B8;
    /* 0x1C8 */ char pad_1C8[0xAC];                 /* maybe part of unk1B8[11]? */
    /* 0x274 */ OSViMode *unk274;
    /* 0x278 */ void *zbuffer;
    /* 0x27C */ char pad_27C[0x1C];                 /* maybe part of zbuffer[8]? */
    /* 0x298 */ TwoHeadGfxArena overlay;
    /* 0x2A8 */ TwoHeadGfxArena polyOpa;
    /* 0x2B8 */ TwoHeadGfxArena polyXlu;
    /* 0x2C8 */ s32 displaylistCounter;
    /* 0x2CC */ void *framebuffer;
    /* 0x2D0 */ s32 pad2D0;
    /* 0x2D4 */ u32 viConfigFeatures;
    /* 0x2D8 */ char pad_2D8[0x3];
    /* 0x2DB */ u8 framebufferCounter;
    /* 0x2DC */ void (*unk_2DC)(s32, GlobalContext *); /* inferred */
    /* 0x2E0 */ GlobalContext *unk_2E0;             /* inferred */
    /* 0x2E4 */ f32 viConfigXScale;
    /* 0x2E8 */ f32 viConfigYScale;
    /* 0x2EC */ char pad_2EC[0x4];
} GraphicsContext;                                  /* size = 0x2F0 */

typedef struct {
    /* 0x00 */ Room currRoom;
    /* 0x14 */ Room prevRoom;
    /* 0x28 */ void *roomMemPages[2];
    /* 0x30 */ u8 activeMemPage;
    /* 0x31 */ s8 unk31;
    /* 0x32 */ char pad_32[0x2];                    /* maybe part of unk31[3]? */
    /* 0x34 */ void *activeRoomVram;
    /* 0x38 */ DmaRequest dmaRequest;
    /* 0x58 */ OSMesgQueue loadQueue;
    /* 0x70 */ void *loadMsg[1];
    /* 0x74 */ void *unk74;
    /* 0x78 */ s8 unk78;
    /* 0x79 */ s8 unk79;
    /* 0x7A */ s16 unk_7A;                          /* inferred */
    /* 0x7C */ s16 unk_7C;                          /* inferred */
    /* 0x7E */ char pad_7E[0x2];
} RoomContext;                                      /* size = 0x80 */

struct _mips2c_stack_Kankyo_Init {
    /* 0x00 */ char pad_0[0x34];
    /* 0x34 */ void *sp34;                          /* inferred */
    /* 0x38 */ char pad_38[0x4];
    /* 0x3C */ LightContext *sp3C;                  /* inferred */
    /* 0x40 */ LightInfo *sp40;                     /* inferred */
    /* 0x44 */ char pad_44[0x14];
};                                                  /* size = 0x58 */

struct _mips2c_stack_Kankyo_IsSceneUpsideDown {};   /* size 0x0 */

struct _mips2c_stack_func_800F5090 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_800F50D4 {};              /* size 0x0 */

struct _mips2c_stack_func_800F5954 {};              /* size 0x0 */

struct _mips2c_stack_func_800F5A8C {};              /* size 0x0 */

struct _mips2c_stack_func_800F5B10 {
    /* 0x00 */ char pad_0[0x8];
    /* 0x08 */ f64 sp8;                             /* inferred */
    /* 0x10 */ f64 sp10;                            /* inferred */
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_800F5CD0 {
    /* 0x00 */ char pad_0[0x34];
    /* 0x34 */ s32 sp34;                            /* inferred */
    /* 0x38 */ void *sp38;                          /* inferred */
    /* 0x3C */ DmaRequest *sp3C;                    /* inferred */
    /* 0x40 */ char pad_40[0x4];
    /* 0x44 */ f32 sp44;                            /* inferred */
    /* 0x48 */ char pad_48[0x3];
    /* 0x4B */ u8 sp4B;                             /* inferred */
    /* 0x4C */ u8 sp4C;                             /* inferred */
    /* 0x4D */ u8 sp4D;                             /* inferred */
    /* 0x4E */ u8 sp4E;                             /* inferred */
    /* 0x4F */ u8 sp4F;                             /* inferred */
    /* 0x50 */ char pad_50[0x4];                    /* maybe part of sp4F[5]? */
    /* 0x54 */ u32 sp54;                            /* inferred */
};                                                  /* size = 0x58 */

struct _mips2c_stack_func_800F6834 {};              /* size 0x0 */

struct _mips2c_stack_func_800F694C {};              /* size 0x0 */

struct _mips2c_stack_func_800F6A04 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_800F6A40 {};              /* size 0x0 */

struct _mips2c_stack_func_800F6AB8 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_800F6CEC {};              /* size 0x0 */

struct _mips2c_stack_func_800F6EA4 {};              /* size 0x0 */

struct _mips2c_stack_func_800F6FF8 {
    /* 0x000 */ char pad_0[0x54];
    /* 0x054 */ u8 *sp54;                           /* inferred */
    /* 0x058 */ LightSettings *sp58;                /* inferred */
    /* 0x05C */ u8 *sp5C;                           /* inferred */
    /* 0x060 */ LightSettings *sp60;                /* inferred */
    /* 0x064 */ u8 *sp64;                           /* inferred */
    /* 0x068 */ LightSettings *sp68;                /* inferred */
    /* 0x06C */ u8 *sp6C;                           /* inferred */
    /* 0x070 */ LightSettings *sp70;                /* inferred */
    /* 0x074 */ s32 sp74;                           /* inferred */
    /* 0x078 */ s32 sp78;                           /* inferred */
    /* 0x07C */ s32 sp7C;                           /* inferred */
    /* 0x080 */ char pad_80[0x4];
    /* 0x084 */ s32 sp84;                           /* inferred */
    /* 0x088 */ char pad_88[0x4];
    /* 0x08C */ s16 sp8C;                           /* inferred */
    /* 0x08E */ s16 sp8E;                           /* inferred */
    /* 0x090 */ u8 sp90;                            /* inferred */
    /* 0x091 */ u8 sp91;                            /* inferred */
    /* 0x092 */ char pad_92[0x2];                   /* maybe part of sp91[3]? */
    /* 0x094 */ u8 sp94;                            /* inferred */
    /* 0x095 */ u8 sp95;                            /* inferred */
    /* 0x096 */ u8 sp96;                            /* inferred */
    /* 0x097 */ char pad_97[0xD];                   /* maybe part of sp96[14]? */
    /* 0x0A4 */ ? spA4;                             /* inferred */
    /* 0x0A4 */ char pad_A4[0x1C];
    /* 0x0C0 */ ? spC0;                             /* inferred */
    /* 0x0C0 */ char pad_C0[0x1C];
    /* 0x0DC */ ? spDC;                             /* inferred */
    /* 0x0DC */ char pad_DC[0x1C];
    /* 0x0F8 */ ? spF8;                             /* inferred */
    /* 0x0F8 */ char pad_F8[0x38];
};                                                  /* size = 0x130 */

struct _mips2c_stack_func_800F8554 {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ s32 sp20;                            /* inferred */
    /* 0x24 */ f32 *sp24;                           /* inferred */
    /* 0x28 */ void *sp28;                          /* inferred */
    /* 0x2C */ char pad_2C[0x8];                    /* maybe part of sp28[3]? */
    /* 0x34 */ f32 sp34;                            /* inferred */
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_800F88C4 {};              /* size 0x0 */

struct _mips2c_stack_func_800F8970 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_800F8A9C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_800F8CD4 {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_800F8D84 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ void *sp24;                          /* inferred */
    /* 0x28 */ char pad_28[0x4];
    /* 0x2C */ Gfx *sp2C;                           /* inferred */
    /* 0x30 */ char pad_30[0x14];                   /* maybe part of sp2C[6]? */
    /* 0x44 */ GraphicsContext *sp44;               /* inferred */
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_800F9728 {
    /* 0x00 */ char pad_0[0x40];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_800F9824 {
    /* 0x000 */ char pad_0[0x5C];
    /* 0x05C */ f32 *sp5C;                          /* inferred */
    /* 0x060 */ f32 sp60;                           /* inferred */
    /* 0x064 */ f32 sp64;                           /* inferred */
    /* 0x068 */ char pad_68[0x4];
    /* 0x06C */ f32 sp6C;                           /* inferred */
    /* 0x070 */ f32 sp70;                           /* inferred */
    /* 0x074 */ f32 sp74;                           /* inferred */
    /* 0x078 */ char pad_78[0x44];                  /* maybe part of sp74[18]? */
    /* 0x0BC */ f32 spBC;                           /* inferred */
    /* 0x0C0 */ char pad_C0[0x3];
    /* 0x0C3 */ u8 spC3;                            /* inferred */
    /* 0x0C4 */ f32 spC4;                           /* inferred */
    /* 0x0C8 */ f32 spC8;                           /* inferred */
    /* 0x0CC */ char pad_CC[0x10];                  /* maybe part of spC8[5]? */
    /* 0x0DC */ f32 spDC;                           /* inferred */
    /* 0x0E0 */ char pad_E0[0x4];
    /* 0x0E4 */ f32 spE4;                           /* inferred */
    /* 0x0E8 */ f32 spE8;                           /* inferred */
    /* 0x0EC */ f32 spEC;                           /* inferred */
    /* 0x0F0 */ f32 spF0;                           /* inferred */
    /* 0x0F4 */ char pad_F4[0x8];                   /* maybe part of spF0[3]? */
    /* 0x0FC */ f32 spFC;                           /* inferred */
    /* 0x100 */ f32 sp100;                          /* inferred */
    /* 0x104 */ f32 sp104;                          /* inferred */
    /* 0x108 */ char pad_108[0x10];                 /* maybe part of sp104[5]? */
    /* 0x118 */ f32 sp118;                          /* inferred */
    /* 0x11C */ char pad_11C[0x14];
};                                                  /* size = 0x130 */

struct _mips2c_stack_func_800FA39C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_800FA3C4 {
    /* 0x000 */ char pad_0[0x78];
    /* 0x078 */ ? *sp78;                            /* inferred */
    /* 0x07C */ char pad_7C[0x8];                   /* maybe part of sp78[3]? */
    /* 0x084 */ Gfx *sp84;                          /* inferred */
    /* 0x088 */ char pad_88[0x3E];                  /* maybe part of sp84[16]? */
    /* 0x0C6 */ s16 spC6;                           /* inferred */
    /* 0x0C8 */ char pad_C8[0xC];                   /* maybe part of spC6[7]? */
    /* 0x0D4 */ f32 spD4;                           /* inferred */
    /* 0x0D8 */ f32 spD8;                           /* inferred */
    /* 0x0DC */ f32 spDC;                           /* inferred */
    /* 0x0E0 */ f32 spE0;                           /* inferred */
    /* 0x0E4 */ f32 spE4;                           /* inferred */
    /* 0x0E8 */ f32 spE8;                           /* inferred */
    /* 0x0EC */ f32 spEC;                           /* inferred */
    /* 0x0F0 */ f32 spF0;                           /* inferred */
    /* 0x0F4 */ char pad_F4[0x20];                  /* maybe part of spF0[9]? */
    /* 0x114 */ void *sp114;                        /* inferred */
};                                                  /* size = 0x118 */

struct _mips2c_stack_func_800FA9FC {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ void *sp18;                          /* inferred */
    /* 0x1C */ char pad_1C[0x4];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_800FAAB4 {};              /* size 0x0 */

struct _mips2c_stack_func_800FAC20 {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ s32 sp18;                            /* inferred */
    /* 0x1C */ s32 *sp1C;                           /* inferred */
    /* 0x20 */ char pad_20[0xC];                    /* maybe part of sp1C[4]? */
    /* 0x2C */ GraphicsContext *sp2C;               /* inferred */
    /* 0x30 */ char pad_30[0x10];                   /* maybe part of sp2C[5]? */
    /* 0x40 */ GraphicsContext *sp40;               /* inferred */
    /* 0x44 */ char pad_44[0x4];
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_800FAF74 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ GraphicsContext *sp1C;               /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_800FB010 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_800FB320 {};              /* size 0x0 */

struct _mips2c_stack_func_800FB388 {
    /* 0x00 */ char pad_0[0x68];
};                                                  /* size = 0x68 */

struct _mips2c_stack_func_800FB758 {
    /* 0x00 */ char pad_0[0x27];
    /* 0x27 */ u8 sp27;                             /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_800FB9B4 {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ void *sp18;                          /* inferred */
    /* 0x1C */ char pad_1C[0x4];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_800FBCBC {
    /* 0x00 */ char pad_0[0x3C];
    /* 0x3C */ ?32 sp3C;                            /* inferred */
    /* 0x40 */ f32 sp40;                            /* inferred */
    /* 0x44 */ f32 sp44;                            /* inferred */
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_800FBDEC {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ LightContext *sp2C;                  /* inferred */
    /* 0x30 */ void *sp30;                          /* inferred */
    /* 0x34 */ char pad_34[0x4];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_800FBF3C {
    /* 0x00 */ char pad_0[0x34];
    /* 0x34 */ Actor *sp34;                         /* inferred */
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_800FC158 {
    /* 0x00 */ char pad_0[0x40];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_800FC3DC {};              /* size 0x0 */

struct _mips2c_stack_func_800FC444 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ s32 *sp24;                           /* inferred */
    /* 0x28 */ u32 sp28;                            /* inferred */
    /* 0x2C */ char pad_2C[0x2C];
};                                                  /* size = 0x58 */

struct _mips2c_stack_func_800FC64C {
    /* 0x00 */ char pad_0[0x3C];
    /* 0x3C */ void *sp3C;                          /* inferred */
    /* 0x40 */ char pad_40[0xC];                    /* maybe part of sp3C[4]? */
    /* 0x4C */ Gfx *sp4C;                           /* inferred */
    /* 0x50 */ char pad_50[0x14];                   /* maybe part of sp4C[6]? */
    /* 0x64 */ GraphicsContext *sp64;               /* inferred */
    /* 0x68 */ char pad_68[0x4];
    /* 0x6C */ f32 sp6C;                            /* inferred */
    /* 0x70 */ char pad_70[0x4];
    /* 0x74 */ u8 sp74;                             /* inferred */
    /* 0x75 */ u8 sp75;                             /* inferred */
    /* 0x76 */ u8 sp76;                             /* inferred */
    /* 0x77 */ char pad_77[0x1];
    /* 0x78 */ u8 sp78;                             /* inferred */
    /* 0x79 */ u8 sp79;                             /* inferred */
    /* 0x7A */ u8 sp7A;                             /* inferred */
    /* 0x7B */ char pad_7B[0x3];                    /* maybe part of sp7A[4]? */
    /* 0x7E */ u16 sp7E;                            /* inferred */
    /* 0x80 */ u16 sp80;                            /* inferred */
    /* 0x82 */ u16 sp82;                            /* inferred */
    /* 0x84 */ char pad_84[0x14];
};                                                  /* size = 0x98 */

struct _mips2c_stack_func_800FD2B4 {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ s32 sp18;                            /* inferred */
    /* 0x1C */ void *sp1C;                          /* inferred */
    /* 0x20 */ char pad_20[0x8];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_800FD538 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ u8 sp1C;                             /* inferred */
    /* 0x1D */ u8 sp1D;                             /* inferred */
    /* 0x1E */ u8 sp1E;                             /* inferred */
    /* 0x1F */ char pad_1F[0x1];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_800FD59C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_800FD5E0 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_800FD654 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_800FD698 {};              /* size 0x0 */

struct _mips2c_stack_func_800FD750 {};              /* size 0x0 */

struct _mips2c_stack_func_800FD768 {};              /* size 0x0 */

struct _mips2c_stack_func_800FD78C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_800FD858 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_800FD928 {};              /* size 0x0 */

struct _mips2c_stack_func_800FD980 {};              /* size 0x0 */

struct _mips2c_stack_func_800FDAF8 {};              /* size 0x0 */

struct _mips2c_stack_func_800FDC94 {
    /* 0x000 */ char pad_0[0xD8];
    /* 0x0D8 */ void *spD8;                         /* inferred */
    /* 0x0DC */ char pad_DC[0x8];                   /* maybe part of spD8[3]? */
    /* 0x0E4 */ s32 spE4;                           /* inferred */
    /* 0x0E8 */ s32 spE8;                           /* inferred */
    /* 0x0EC */ char pad_EC[0x4];
    /* 0x0F0 */ f32 spF0;                           /* inferred */
    /* 0x0F4 */ f32 spF4;                           /* inferred */
    /* 0x0F8 */ char pad_F8[0x4];
    /* 0x0FC */ f32 spFC;                           /* inferred */
    /* 0x100 */ f32 sp100;                          /* inferred */
    /* 0x104 */ f32 sp104;                          /* inferred */
};                                                  /* size = 0x108 */

struct _mips2c_stack_func_800FE390 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_800FE3E0 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ void *sp24;                          /* inferred */
    /* 0x28 */ Gfx *sp28;                           /* inferred */
    /* 0x2C */ Gfx *sp2C;                           /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_800FE484 {};              /* size 0x0 */

struct _mips2c_stack_func_800FE498 {};              /* size 0x0 */

struct _mips2c_stack_func_800FE4A8 {};              /* size 0x0 */

struct _mips2c_stack_func_800FE4B8 {};              /* size 0x0 */

struct _mips2c_stack_func_800FE590 {};              /* size 0x0 */

struct _mips2c_stack_func_800FE5D0 {
    /* 0x00 */ char pad_0[0x1F];
    /* 0x1F */ u8 sp1F;                             /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_800FE610 {};              /* size 0x0 */

struct _mips2c_stack_func_800FE620 {};              /* size 0x0 */

struct _mips2c_stack_func_800FE658 {};              /* size 0x0 */

struct _mips2c_stack_func_800FE6F8 {};              /* size 0x0 */

struct _mips2c_stack_func_800FE778 {};              /* size 0x0 */

struct _mips2c_stack_func_800FE788 {};              /* size 0x0 */

struct _mips2c_stack_func_800FE798 {};              /* size 0x0 */

struct _mips2c_stack_func_800FE7A8 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ s32 sp1C;                            /* inferred */
    /* 0x20 */ char pad_20[0x4];
    /* 0x24 */ f32 sp24;                            /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_800FE9B4 {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ s32 sp18;                            /* inferred */
    /* 0x1C */ char pad_1C[0x3];
    /* 0x1F */ u8 sp1F;                             /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_800FEA50 {};              /* size 0x0 */

struct _mips2c_stack_func_800FEAB0 {};              /* size 0x0 */

struct _mips2c_stack_func_800FEAC0 {};              /* size 0x0 */

struct _mips2c_stack_func_800FEAF4 {};              /* size 0x0 */

struct _mips2c_stack_get_current_day {};            /* size 0x0 */

struct _mips2c_stack_get_days_elapsed {};           /* size 0x0 */

struct _mips2c_stack_reset_days_elapsed {};         /* size 0x0 */

? func_8013EE24();                                  /* extern */
? func_8013EE38();                                  /* extern */
? func_80143624(f32, void *, s32, s32, s32, u32);   /* extern */
s32 func_80169FFC(GlobalContext *, void *, void *, void *); /* extern */
s32 func_80178A34(s32, s32);                        /* extern */
