CRASHED

struct _mips2c_stack_func_80102E40 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80102E90 {};              /* size 0x0 */

struct _mips2c_stack_func_80102EA4 {};              /* size 0x0 */

struct _mips2c_stack_func_80102EB4 {};              /* size 0x0 */

struct _mips2c_stack_func_80102ED0 {};              /* size 0x0 */

struct _mips2c_stack_func_80102EF0 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80102F9C {};              /* size 0x0 */

struct _mips2c_stack_func_80103090 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_801030B4 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_801030F4 {
    /* 0x00 */ char pad_0[0x28];
    /* 0x28 */ s32 sp28;                            /* inferred */
    /* 0x2C */ s32 sp2C;                            /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_801031D0 {
    /* 0x00 */ char pad_0[0xA4];
    /* 0xA4 */ GraphicsContext *spA4;               /* inferred */
    /* 0xA8 */ s32 spA8;                            /* inferred */
    /* 0xAC */ u8 spAC;                             /* inferred */
    /* 0xAD */ u8 spAD;                             /* inferred */
    /* 0xAE */ u8 spAE;                             /* inferred */
    /* 0xAF */ u8 spAF;                             /* inferred */
    /* 0xB0 */ char pad_B0[0x14];                   /* maybe part of spAF[21]? */
    /* 0xC4 */ s32 spC4;                            /* inferred */
    /* 0xC8 */ s32 spC8;                            /* inferred */
    /* 0xCC */ u16 *spCC;                           /* inferred */
};                                                  /* size = 0xD0 */

struct _mips2c_stack_func_801039EC {};              /* size 0x0 */

struct _mips2c_stack_func_80103A10 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80103A58 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ void *sp1C;                          /* inferred */
    /* 0x20 */ char pad_20[0xC];                    /* maybe part of sp1C[4]? */
    /* 0x2C */ f32 sp2C;                            /* inferred */
    /* 0x30 */ char pad_30[0x58];                   /* maybe part of sp2C[23]? */
    /* 0x88 */ Gfx *sp88;                           /* inferred */
    /* 0x8C */ char pad_8C[0x16];                   /* maybe part of sp88[6]? */
    /* 0xA2 */ s16 spA2;                            /* inferred */
    /* 0xA4 */ char pad_A4[0x4];                    /* maybe part of spA2[3]? */
    /* 0xA8 */ GraphicsContext *spA8;               /* inferred */
    /* 0xAC */ s32 spAC;                            /* inferred */
    /* 0xB0 */ char pad_B0[0x4];
    /* 0xB4 */ void *spB4;                          /* inferred */
    /* 0xB8 */ char pad_B8[0x8];                    /* maybe part of spB4[3]? */
    /* 0xC0 */ f32 spC0;                            /* inferred */
    /* 0xC4 */ s32 spC4;                            /* inferred */
    /* 0xC8 */ s32 spC8;                            /* inferred */
    /* 0xCC */ s32 spCC;                            /* inferred */
    /* 0xD0 */ s32 spD0;                            /* inferred */
    /* 0xD4 */ s32 spD4;                            /* inferred */
    /* 0xD8 */ s32 spD8;                            /* inferred */
    /* 0xDC */ u16 *spDC;                           /* inferred */
};                                                  /* size = 0xE0 */

struct _mips2c_stack_func_8010439C {
    /* 0x00 */ char pad_0[0x44];
    /* 0x44 */ void *sp44;                          /* inferred */
    /* 0x48 */ char pad_48[0x38];
};                                                  /* size = 0x80 */

struct _mips2c_stack_func_801045AC {
    /* 0x00 */ char pad_0[0x34];
    /* 0x34 */ s32 sp34;                            /* inferred */
    /* 0x38 */ char pad_38[0x10];                   /* maybe part of sp34[5]? */
    /* 0x48 */ GraphicsContext *sp48;               /* inferred */
    /* 0x4C */ s32 sp4C;                            /* inferred */
    /* 0x50 */ u16 *sp50;                           /* inferred */
    /* 0x54 */ char pad_54[0x8];                    /* maybe part of sp50[3]? */
    /* 0x5C */ f32 sp5C;                            /* inferred */
    /* 0x60 */ char pad_60[0x4];
    /* 0x64 */ s32 sp64;                            /* inferred */
    /* 0x68 */ s32 sp68;                            /* inferred */
    /* 0x6C */ s32 sp6C;                            /* inferred */
    /* 0x70 */ void **sp70;                         /* inferred */
    /* 0x74 */ s32 sp74;                            /* inferred */
    /* 0x78 */ s32 sp78;                            /* inferred */
    /* 0x7C */ s32 *sp7C;                           /* inferred */
};                                                  /* size = 0x80 */

struct _mips2c_stack_func_80104AE8 {
    /* 0x00 */ char pad_0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80104C80 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80104CF4 {
    /* 0x00 */ char pad_0[0x30];
    /* 0x30 */ TwoHeadArena *sp30;                  /* inferred */
    /* 0x34 */ char pad_34[0x4];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80104F34 {
    /* 0x0 */ char pad_0[0x4];
    /* 0x4 */ s32 sp4;                              /* inferred */
};                                                  /* size = 0x8 */

struct _mips2c_stack_func_80105294 {
    /* 0x00 */ char pad_0[0x4];
    /* 0x04 */ ? sp4;                               /* inferred */
    /* 0x04 */ char pad_4[0x14];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80105318 {};              /* size 0x0 */

struct _mips2c_stack_func_80105328 {};              /* size 0x0 */

struct _mips2c_stack_func_8010534C {
    /* 0x00 */ char pad_0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_8010549C {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_8010565C {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80105818 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80105A40 {
    /* 0x00 */ char pad_0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80105B34 {};              /* size 0x0 */

struct _mips2c_stack_func_80105C40 {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ s32 sp2C;                            /* inferred */
    /* 0x30 */ char pad_30[0x8];                    /* maybe part of sp2C[3]? */
    /* 0x38 */ s32 sp38;                            /* inferred */
    /* 0x3C */ s32 sp3C;                            /* inferred */
    /* 0x40 */ s32 sp40;                            /* inferred */
    /* 0x44 */ s32 sp44;                            /* inferred */
    /* 0x48 */ s32 sp48;                            /* inferred */
    /* 0x4C */ s32 sp4C;                            /* inferred */
    /* 0x50 */ s32 sp50;                            /* inferred */
    /* 0x54 */ s32 sp54;                            /* inferred */
    /* 0x58 */ u16 *sp58;                           /* inferred */
    /* 0x5C */ char pad_5C[0x4];
};                                                  /* size = 0x60 */

struct _mips2c_stack_func_80105FE0 {
    /* 0x00 */ char pad_0[0x28];
    /* 0x28 */ Gfx *sp28;                           /* inferred */
    /* 0x2C */ char pad_2C[0x18];                   /* maybe part of sp28[7]? */
    /* 0x44 */ GraphicsContext *sp44;               /* inferred */
    /* 0x48 */ s32 sp48;                            /* inferred */
    /* 0x4C */ f32 sp4C;                            /* inferred */
    /* 0x50 */ char pad_50[0x4];
    /* 0x54 */ s32 sp54;                            /* inferred */
    /* 0x58 */ s32 sp58;                            /* inferred */
    /* 0x5C */ s32 sp5C;                            /* inferred */
    /* 0x60 */ s32 sp60;                            /* inferred */
    /* 0x64 */ s32 sp64;                            /* inferred */
    /* 0x68 */ s32 sp68;                            /* inferred */
    /* 0x6C */ u16 *sp6C;                           /* inferred */
};                                                  /* size = 0x70 */

struct _mips2c_stack_func_80106408 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80106450 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_801064CC {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80106530 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8010657C {};              /* size 0x0 */

struct _mips2c_stack_func_80106644 {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ void *sp2C;                          /* inferred */
    /* 0x30 */ char pad_30[0x8];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_8010683C {};              /* size 0x0 */

struct _mips2c_stack_func_801068B4 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_801068D8 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_801068FC {
    /* 0x00 */ char pad_0[0x3C];
    /* 0x3C */ void *sp3C;                          /* inferred */
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80106BEC {};              /* size 0x0 */

struct _mips2c_stack_func_80106D08 {};              /* size 0x0 */

struct _mips2c_stack_func_80106D5C {
    /* 0x000 */ char pad_0[0x34];
    /* 0x034 */ f32 sp34;                           /* inferred */
    /* 0x038 */ f32 sp38;                           /* inferred */
    /* 0x03C */ void *sp3C;                         /* inferred */
    /* 0x040 */ s32 sp40;                           /* inferred */
    /* 0x044 */ char pad_44[0x4];
    /* 0x048 */ void *sp48;                         /* inferred */
    /* 0x04C */ char pad_4C[0x9C];                  /* maybe part of sp48[40]? */
    /* 0x0E8 */ s32 spE8;                           /* inferred */
    /* 0x0EC */ s32 spEC;                           /* inferred */
    /* 0x0F0 */ s32 spF0;                           /* inferred */
    /* 0x0F4 */ s32 spF4;                           /* inferred */
    /* 0x0F8 */ s32 spF8;                           /* inferred */
    /* 0x0FC */ s32 spFC;                           /* inferred */
    /* 0x100 */ s32 sp100;                          /* inferred */
    /* 0x104 */ char pad_104[0x4];
    /* 0x108 */ void *sp108;                        /* inferred */
    /* 0x10C */ s32 sp10C;                          /* inferred */
    /* 0x110 */ s32 sp110;                          /* inferred */
    /* 0x114 */ s32 sp114;                          /* inferred */
    /* 0x118 */ s32 sp118;                          /* inferred */
    /* 0x11C */ char pad_11C[0x7C];
};                                                  /* size = 0x198 */

struct _mips2c_stack_func_80107B78 {
    /* 0x00 */ char pad_0[0x38];
    /* 0x38 */ void *sp38;                          /* inferred */
    /* 0x3C */ s32 sp3C;                            /* inferred */
    /* 0x40 */ char pad_40[0x60];
};                                                  /* size = 0xA0 */

struct _mips2c_stack_func_80108124 {
    /* 0x00 */ char pad_0[0x48];
    /* 0x48 */ u8 *sp48;                            /* inferred */
    /* 0x4C */ char pad_4C[0x4];
};                                                  /* size = 0x50 */

struct _mips2c_stack_func_80108558 {
    /* 0x00 */ char pad_0[0x30];
    /* 0x30 */ u8 *sp30;                            /* inferred */
    /* 0x34 */ char pad_34[0x4];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80108A10 {};              /* size 0x0 */

struct _mips2c_stack_func_80108A64 {};              /* size 0x0 */

struct _mips2c_stack_func_801090B0 {};              /* size 0x0 */

struct _mips2c_stack_func_80109124 {};              /* size 0x0 */

struct _mips2c_stack_func_801091F0 {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ s32 sp2C;                            /* inferred */
    /* 0x30 */ s32 sp30;                            /* inferred */
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ char pad_38[0x4];
    /* 0x3C */ s32 sp3C;                            /* inferred */
    /* 0x40 */ s32 sp40;                            /* inferred */
    /* 0x44 */ s32 sp44;                            /* inferred */
    /* 0x48 */ char pad_48[0x10];
};                                                  /* size = 0x58 */

struct _mips2c_stack_func_80109428 {};              /* size 0x0 */

s32 convert_scene_number_among_shared_scenes(s16);  /* extern */
? func_801094A0(s32, u8 *);                         /* extern */
void **func_8010958C(u16);                          /* extern */
s32 func_801096D4(u16);                             /* extern */
s32 func_80109714(u16);                             /* extern */
? func_80109754(u16, u16 *);                        /* extern */
? func_801097C8(u16, s32 *, s32 *, u16 *);          /* extern */
? func_8010983C(u16, u16 *);                        /* extern */
? func_801098A0(u16, s32 *, GraphicsContext *);     /* extern */
s32 func_80109908(u16);                             /* extern */
s32 func_80109A98(s32);                             /* extern */
s32 func_80109AD8(u16);                             /* extern */
