typedef struct {
    /* 0x00000 */ View view;
    /* 0x00168 */ Font font;
    /* 0x11EF4 */ char pad_11EF4[0x10];
    /* 0x11F04 */ u16 unk11F04;
    /* 0x11F06 */ char pad_11F06[0x4];              /* maybe part of unk11F04[3]? */
    /* 0x11F0A */ u8 unk11F0A;
    /* 0x11F0B */ char pad_11F0B[0x5];              /* maybe part of unk11F0A[6]? */
    /* 0x11F10 */ s32 unk11F10;
    /* 0x11F14 */ char pad_11F14[0xE];              /* maybe part of unk11F10[4]? */
    /* 0x11F22 */ u8 unk11F22;
    /* 0x11F23 */ char pad_11F23[0xFD];             /* maybe part of unk11F22[254]? */
    /* 0x12020 */ u8 unk12020;
    /* 0x12021 */ u8 choiceIndex;
    /* 0x12022 */ char pad_12022[0x1];
    /* 0x12023 */ s8 unk12023;
    /* 0x12024 */ char pad_12024[0x6];              /* maybe part of unk12023[7]? */
    /* 0x1202A */ u16 unk1202A;
    /* 0x1202C */ char pad_1202C[0x2];
    /* 0x1202E */ u16 unk1202E;
    /* 0x12030 */ char pad_12030[0x14];             /* maybe part of unk1202E[11]? */
    /* 0x12044 */ s16 unk12044;
    /* 0x12046 */ char pad_12046[0x24];             /* maybe part of unk12044[19]? */
    /* 0x1206A */ s16 unk1206A;
    /* 0x1206C */ s32 unk1206C;
    /* 0x12070 */ char pad_12070[0x8];              /* maybe part of unk1206C[3]? */
    /* 0x12078 */ s32 bankRupeesSelected;
    /* 0x1207C */ s32 bankRupees;
    /* 0x12080 */ char pad_12080[0x4];
    /* 0x12084 */ void *unk_12084;                  /* inferred */
    /* 0x12088 */ char pad_12088[0x10];             /* maybe part of unk_12084[5]? */
    /* 0x12098 */ f32 unk_12098;                    /* inferred */
    /* 0x1209C */ char pad_1209C[0x15];             /* maybe part of unk_12098[6]? */
    /* 0x120B1 */ u8 unk120B1;
    /* 0x120B2 */ char pad_120B2[0x2E];             /* maybe part of unk120B1[47]? */
} MessageContext;                                   /* size = 0x120E0 */

struct _mips2c_stack_func_801588D0 {};              /* size 0x0 */

struct _mips2c_stack_func_80158988 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ f32 sp1C;                            /* inferred */
    /* 0x20 */ s32 sp20;                            /* inferred */
    /* 0x24 */ char pad_24[0x4];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80158A24 {
    /* 0x00 */ char pad_0[0x30];
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ char pad_34[0xC];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80158C04 {
    /* 0x00 */ char pad_0[0x40];
    /* 0x40 */ f32 sp40;                            /* inferred */
    /* 0x44 */ char pad_44[0xC];
};                                                  /* size = 0x50 */

struct _mips2c_stack_func_80158D98 {
    /* 0x00 */ char pad_0[0x38];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80158FB0 {
    /* 0x00 */ char pad_0[0x54];
    /* 0x54 */ s16 sp54;                            /* inferred */
    /* 0x56 */ s16 sp56;                            /* inferred */
    /* 0x58 */ s16 sp58;                            /* inferred */
    /* 0x5A */ s16 sp5A;                            /* inferred */
    /* 0x5C */ char pad_5C[0x4];                    /* maybe part of sp5A[3]? */
    /* 0x60 */ f32 sp60;                            /* inferred */
    /* 0x64 */ char pad_64[0xC];
};                                                  /* size = 0x70 */

struct _mips2c_stack_func_8015926C {
    /* 0x00 */ char pad_0[0x48];
    /* 0x48 */ s16 sp48;                            /* inferred */
    /* 0x4A */ char pad_4A[0x16];
};                                                  /* size = 0x60 */

struct _mips2c_stack_func_80159438 {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ s32 sp20;                            /* inferred */
    /* 0x24 */ u32 sp24;                            /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_8015966C {
    /* 0x000 */ char pad_0[0x50];
    /* 0x050 */ s32 sp50;                           /* inferred */
    /* 0x054 */ s32 sp54;                           /* inferred */
    /* 0x058 */ char pad_58[0x4];
    /* 0x05C */ Font *sp5C;                         /* inferred */
    /* 0x060 */ char pad_60[0xCA];                  /* maybe part of sp5C[51]? */
    /* 0x12A */ s16 sp12A;                          /* inferred */
    /* 0x12C */ s16 sp12C;                          /* inferred */
    /* 0x12E */ s16 sp12E;                          /* inferred */
    /* 0x130 */ s16 sp130;                          /* inferred */
    /* 0x132 */ char pad_132[0x2];
    /* 0x134 */ u32 *sp134;                         /* inferred */
    /* 0x138 */ char pad_138[0x2];
    /* 0x13A */ u16 sp13A;                          /* inferred */
    /* 0x13C */ char pad_13C[0xC];
};                                                  /* size = 0x148 */

struct _mips2c_stack_func_8015B198 {
    /* 0x00 */ char pad_0[0x70];
    /* 0x70 */ void *sp70;                          /* inferred */
    /* 0x74 */ char pad_74[0x4];
    /* 0x78 */ s32 sp78;                            /* inferred */
    /* 0x7C */ char pad_7C[0x14];                   /* maybe part of sp78[6]? */
    /* 0x90 */ s32 sp90;                            /* inferred */
    /* 0x94 */ u32 sp94;                            /* inferred */
    /* 0x98 */ char pad_98[0xC];                    /* maybe part of sp94[4]? */
    /* 0xA4 */ f32 spA4;                            /* inferred */
    /* 0xA8 */ ? spA8;                              /* inferred */
    /* 0xA8 */ char pad_A8[0x14];
    /* 0xBC */ s32 spBC;                            /* inferred */
    /* 0xC0 */ char pad_C0[0x6];                    /* maybe part of spBC[2]? */
    /* 0xC6 */ s16 spC6;                            /* inferred */
    /* 0xC8 */ s16 spC8;                            /* inferred */
    /* 0xCA */ s16 spCA;                            /* inferred */
    /* 0xCC */ s16 spCC;                            /* inferred */
    /* 0xCE */ s16 spCE;                            /* inferred */
    /* 0xD0 */ s16 spD0;                            /* inferred */
    /* 0xD2 */ char pad_D2[0x8];                    /* maybe part of spD0[5]? */
    /* 0xDA */ s16 spDA;                            /* inferred */
    /* 0xDC */ void *spDC;                          /* inferred */
    /* 0xE0 */ void *spE0;                          /* inferred */
    /* 0xE4 */ char pad_E4[0x4];
};                                                  /* size = 0xE8 */

s32 func_8010A0A4(GlobalContext *);                 /* extern */
? func_8014995C(GlobalContext *, void *, u32 **, Font *); /* extern */
? func_8014AAD0(GlobalContext *);                   /* extern */
? func_8014CFDC(GlobalContext *);                   /* extern */
void func_80158988(GlobalContext *arg0, u8 arg1, s32 *arg2, f32 *arg3, s16 arg4); /* static */
void func_80158A24(GlobalContext *arg0, s16 *arg1, s32 *arg2, f32 *arg3); /* static */
void func_80158C04(GlobalContext *arg0, s16 *arg1, s32 *arg2, f32 *arg3); /* static */
void func_80158D98(GlobalContext *arg0, s16 *arg1, s32 *arg2, f32 *arg3, s16 arg4); /* static */
void func_80158FB0(GlobalContext *arg0, s32 arg1, s32 *arg2, f32 *arg3, s16 *arg4); /* static */
void func_8015926C(GlobalContext *arg0, s32 *arg1, f32 *arg2, s16 *arg3); /* static */
void func_80159438(s32 arg0, u32 arg1, ? *arg2, s16); /* static */
