typedef struct {
    /* 0x00000 */ View view;
    /* 0x00168 */ Font font;
    /* 0x11EF4 */ char pad11EF4[0x10];
    /* 0x11F04 */ u16 unk11F04;
    /* 0x11F06 */ u16 unk11F06;                     /* inferred */
    /* 0x11F08 */ char pad11F08[0x2];
    /* 0x11F0A */ u8 unk11F0A;
    /* 0x11F0B */ char pad11F0B[0x5];               /* maybe part of unk11F0A[6]? */
    /* 0x11F10 */ s32 unk11F10;
    /* 0x11F14 */ char pad11F14[0xE];               /* maybe part of unk11F10[4]? */
    /* 0x11F22 */ u8 unk11F22;
    /* 0x11F23 */ char pad11F23[0xC9];              /* maybe part of unk11F22[202]? */
    /* 0x11FEC */ s16 unk11FEC;                     /* inferred */
    /* 0x11FEE */ u16 unk11FEE;                     /* inferred */
    /* 0x11FF0 */ char pad11FF0[0x2];
    /* 0x11FF2 */ s16 unk11FF2;                     /* inferred */
    /* 0x11FF4 */ s16 unk11FF4;                     /* inferred */
    /* 0x11FF6 */ s16 unk11FF6;                     /* inferred */
    /* 0x11FF8 */ s16 unk11FF8;                     /* inferred */
    /* 0x11FFA */ s16 unk11FFA;                     /* inferred */
    /* 0x11FFC */ char pad11FFC[0x1E];              /* maybe part of unk11FFA[16]? */
    /* 0x1201A */ s16 unk1201A;                     /* inferred */
    /* 0x1201C */ s16 unk1201C;                     /* inferred */
    /* 0x1201E */ char pad1201E[0x2];
    /* 0x12020 */ u8 unk12020;
    /* 0x12021 */ u8 choiceIndex;
    /* 0x12022 */ char pad12022[0x1];
    /* 0x12023 */ s8 unk12023;
    /* 0x12024 */ u16 unk12024;                     /* inferred */
    /* 0x12026 */ s16 unk12026;                     /* inferred */
    /* 0x12028 */ char pad12028[0x2];
    /* 0x1202A */ u16 unk1202A;
    /* 0x1202C */ char pad1202C[0x2];
    /* 0x1202E */ u16 unk1202E;
    /* 0x12030 */ char pad12030[0x14];              /* maybe part of unk1202E[11]? */
    /* 0x12044 */ s16 unk12044;
    /* 0x12046 */ char pad12046[0x24];              /* maybe part of unk12044[19]? */
    /* 0x1206A */ s16 unk1206A;
    /* 0x1206C */ s32 unk1206C;
    /* 0x12070 */ char pad12070[0x8];               /* maybe part of unk1206C[3]? */
    /* 0x12078 */ s32 bankRupeesSelected;
    /* 0x1207C */ s32 bankRupees;
    /* 0x12080 */ char pad12080[0x10];              /* maybe part of bankRupees[5]? */
    /* 0x12090 */ s16 unk12090;                     /* inferred */
    /* 0x12092 */ s16 unk12092;                     /* inferred */
    /* 0x12094 */ char pad12094[0x1D];              /* maybe part of unk12092[15]? */
    /* 0x120B1 */ u8 unk120B1;
    /* 0x120B2 */ char pad120B2[0x2E];              /* maybe part of unk120B1[47]? */
} MessageContext;                                   /* size = 0x120E0 */

struct _mips2c_stack_func_8015E750 {};              /* size 0x0 */

struct _mips2c_stack_func_8015E7EC {
    /* 0x000 */ char pad0[0x40];
    /* 0x040 */ void *sp40;                         /* inferred */
    /* 0x044 */ char pad44[0x4];
    /* 0x048 */ s32 sp48;                           /* inferred */
    /* 0x04C */ char pad4C[0x4];
    /* 0x050 */ Font *sp50;                         /* inferred */
    /* 0x054 */ char pad54[0xC4];                   /* maybe part of sp50[50]? */
    /* 0x118 */ void *sp118;                        /* inferred */
    /* 0x11C */ char pad11C[0x4];
    /* 0x120 */ u16 sp120;                          /* inferred */
    /* 0x122 */ char pad122[0x4];                   /* maybe part of sp120[3]? */
    /* 0x126 */ u16 sp126;                          /* inferred */
    /* 0x128 */ char pad128[0x8];
};                                                  /* size = 0x130 */

struct _mips2c_stack_func_8015F8A8 {
    /* 0x00 */ char pad0[0x44];
    /* 0x44 */ void *sp44;                          /* inferred */
    /* 0x48 */ char pad48[0x4];
    /* 0x4C */ void *sp4C;                          /* inferred */
    /* 0x50 */ char pad50[0x1C];                    /* maybe part of sp4C[8]? */
    /* 0x6C */ s16 sp6C;                            /* inferred */
    /* 0x6E */ s16 sp6E;                            /* inferred */
    /* 0x70 */ s16 sp70;                            /* inferred */
    /* 0x72 */ s16 sp72;                            /* inferred */
    /* 0x74 */ char pad74[0x2];
    /* 0x76 */ s16 sp76;                            /* inferred */
    /* 0x78 */ char pad78[0x10];
};                                                  /* size = 0x88 */

? func_8014995C(GlobalContext *, s32, void **, Font *); /* extern */
? func_8014AAD0(GlobalContext *);                   /* extern */
? func_8014C70C(GlobalContext *, u8, s16, s16);     /* extern */
void func_8015E750(void *arg0, s32 arg1);           /* static */
void func_8015F8A8(GlobalContext *arg0);            /* static */
static ? D_801D0890;                                /* unable to generate initializer */
SaveContext gSaveContext;

void func_8015E750(void *arg0, s32 arg1) {
    s32 temp_a1;
    u16 temp_v0;
    u16 temp_v0_3;
    void *temp_v0_2;
    void *temp_v1;
    u16 phi_v0;
    void *phi_v1;

    temp_v1 = arg0->unk16994;
    temp_v0 = temp_v1->unk0;
    phi_v0 = temp_v0;
    phi_v1 = temp_v1;
    if (temp_v0 != 0xFFFF) {
loop_1:
        temp_v0_2 = arg0 + 0x4A70;
        if ((arg1 & 0xFFFF) == phi_v0) {
            temp_a1 = phi_v1->unk4;
