typedef struct GameState {
    /* 0x00 */ GraphicsContext *gfxCtx;
    /* 0x04 */ void (*main)(GameState *);
    /* 0x08 */ void (*destroy)(GameState *);
    /* 0x0C */ void (*nextGameStateInit)(GameState *);
    /* 0x10 */ u32 nextGameStateSize;
    /* 0x14 */ Input input[4];
    /* 0x74 */ TwoHeadArena heap;
    /* 0x84 */ GameAlloc alloc;
    /* 0x98 */ char pad98[0x3];
    /* 0x9B */ u8 running;
    /* 0x9C */ u32 frames;
    /* 0xA0 */ char padA0[0x2];
    /* 0xA2 */ u8 framerateDivisor;
    /* 0xA3 */ u8 unkA3;                            /* inferred */
} GameState;                                        /* size = 0xA4 */

typedef struct {
    /* 0x00000 */ View view;
    /* 0x00168 */ Font font;
    /* 0x11EF4 */ char pad11EF4[0x4];
    /* 0x11EF8 */ void *unk11EF8;                   /* inferred */
    /* 0x11EFC */ char pad11EFC[0x8];               /* maybe part of unk11EF8[3]? */
    /* 0x11F04 */ u16 unk11F04;
    /* 0x11F06 */ u16 unk11F06;                     /* inferred */
    /* 0x11F08 */ char pad11F08[0x2];
    /* 0x11F0A */ u8 unk11F0A;
    /* 0x11F0B */ char pad11F0B[0x1];
    /* 0x11F0C */ u8 unk11F0C;                      /* inferred */
    /* 0x11F0D */ char pad11F0D[0x3];               /* maybe part of unk11F0C[4]? */
    /* 0x11F10 */ s32 unk11F10;
    /* 0x11F14 */ u16 unk11F14;                     /* inferred */
    /* 0x11F16 */ u16 unk11F16;                     /* inferred */
    /* 0x11F18 */ char pad11F18[0x2];
    /* 0x11F1A */ s16 unk11F1A;                     /* inferred */
    /* 0x11F1C */ s16 unk11F1C;                     /* inferred */
    /* 0x11F1E */ s16 unk11F1E;                     /* inferred */
    /* 0x11F20 */ char pad11F20[0x2];
    /* 0x11F22 */ u8 unk11F22;
    /* 0x11F23 */ char pad11F23[0xC9];              /* maybe part of unk11F22[202]? */
    /* 0x11FEC */ u16 unk11FEC;                     /* inferred */
    /* 0x11FEE */ u16 unk11FEE;                     /* inferred */
    /* 0x11FF0 */ u16 unk11FF0;                     /* inferred */
    /* 0x11FF2 */ u16 unk11FF2;                     /* inferred */
    /* 0x11FF4 */ s16 unk11FF4;                     /* inferred */
    /* 0x11FF6 */ s16 unk11FF6;                     /* inferred */
    /* 0x11FF8 */ s16 unk11FF8;                     /* inferred */
    /* 0x11FFA */ s16 unk11FFA;                     /* inferred */
    /* 0x11FFC */ s16 unk11FFC;                     /* inferred */
    /* 0x11FFE */ char pad11FFE[0x14];              /* maybe part of unk11FFC[11]? */
    /* 0x12012 */ s16 unk12012;                     /* inferred */
    /* 0x12014 */ s16 unk12014;                     /* inferred */
    /* 0x12016 */ s16 unk12016;                     /* inferred */
    /* 0x12018 */ s16 unk12018;                     /* inferred */
    /* 0x1201A */ s16 unk1201A;                     /* inferred */
    /* 0x1201C */ s16 unk1201C;                     /* inferred */
    /* 0x1201E */ s16 unk1201E;                     /* inferred */
    /* 0x12020 */ u8 unk12020;
    /* 0x12021 */ u8 choiceIndex;
    /* 0x12022 */ u8 unk12022;                      /* inferred */
    /* 0x12023 */ s8 unk12023;
    /* 0x12024 */ u16 unk12024;                     /* inferred */
    /* 0x12026 */ s16 unk12026;                     /* inferred */
    /* 0x12028 */ char pad12028[0x2];
    /* 0x1202A */ u16 unk1202A;
    /* 0x1202C */ u16 unk1202C;                     /* inferred */
    /* 0x1202E */ u16 unk1202E;
    /* 0x12030 */ char pad12030[0xA];               /* maybe part of unk1202E[6]? */
    /* 0x1203A */ s16 unk1203A;                     /* inferred */
    /* 0x1203C */ s16 unk1203C;                     /* inferred */
    /* 0x1203E */ char pad1203E[0x2];
    /* 0x12040 */ Actor *unk12040;                  /* inferred */
    /* 0x12044 */ s16 unk12044;
    /* 0x12046 */ s16 unk12046;                     /* inferred */
    /* 0x12048 */ char pad12048[0x2];
    /* 0x1204A */ s16 unk1204A;                     /* inferred */
    /* 0x1204C */ s16 unk1204C;                     /* inferred */
    /* 0x1204E */ s16 unk1204E;                     /* inferred */
    /* 0x12050 */ s16 unk12050;                     /* inferred */
    /* 0x12052 */ s16 unk12052;                     /* inferred */
    /* 0x12054 */ char pad12054[0x14];              /* maybe part of unk12052[11]? */
    /* 0x12068 */ s16 unk12068;                     /* inferred */
    /* 0x1206A */ s16 unk1206A;
    /* 0x1206C */ s32 unk1206C;
    /* 0x12070 */ char pad12070[0x8];               /* maybe part of unk1206C[3]? */
    /* 0x12078 */ s32 bankRupeesSelected;
    /* 0x1207C */ s32 bankRupees;
    /* 0x12080 */ char pad12080[0x4];
    /* 0x12084 */ ? *unk12084;                      /* inferred */
    /* 0x12088 */ char pad12088[0x4];
    /* 0x1208C */ ? *unk1208C;                      /* inferred */
    /* 0x12090 */ s16 unk12090;                     /* inferred */
    /* 0x12092 */ s16 unk12092;                     /* inferred */
    /* 0x12094 */ u8 unk12094;                      /* inferred */
    /* 0x12095 */ char pad12095[0x3];               /* maybe part of unk12094[4]? */
    /* 0x12098 */ f32 unk12098;                     /* inferred */
    /* 0x1209C */ s16 unk1209C;                     /* inferred */
    /* 0x1209E */ char pad1209E[0x2];
    /* 0x120A0 */ s32 unk120A0;                     /* inferred */
    /* 0x120A4 */ s16 unk120A4;                     /* inferred */
    /* 0x120A6 */ s16 unk120A6;                     /* inferred */
    /* 0x120A8 */ s16 unk120A8;                     /* inferred */
    /* 0x120AA */ char pad120AA[0x2];
    /* 0x120AC */ s16 unk120AC;                     /* inferred */
    /* 0x120AE */ char pad120AE[0x2];
    /* 0x120B0 */ s8 unk120B0;                      /* inferred */
    /* 0x120B1 */ u8 unk120B1;
    /* 0x120B2 */ char pad120B2[0xA];               /* maybe part of unk120B1[11]? */
    /* 0x120BC */ u16 unk120BC;                     /* inferred */
    /* 0x120BE */ s16 unk120BE;                     /* inferred */
    /* 0x120C0 */ s16 unk120C0;                     /* inferred */
    /* 0x120C2 */ s16 unk120C2;                     /* inferred */
    /* 0x120C4 */ s32 unk120C4;                     /* inferred */
    /* 0x120C8 */ s16 unk120C8;                     /* inferred */
    /* 0x120CA */ s16 unk120CA;                     /* inferred */
    /* 0x120CC */ s16 unk120CC;                     /* inferred */
    /* 0x120CE */ s16 unk120CE;                     /* inferred */
    /* 0x120D0 */ s16 unk120D0;                     /* inferred */
    /* 0x120D2 */ s16 unk120D2;                     /* inferred */
    /* 0x120D4 */ s16 unk120D4;                     /* inferred */
    /* 0x120D6 */ s16 unk120D6;                     /* inferred */
    /* 0x120D8 */ char pad120D8[0x8];               /* maybe part of unk120D6[5]? */
} MessageContext;                                   /* size = 0x120E0 */

struct _mips2c_stack_Message_Init {
    /* 0x00 */ char pad0[0x24];
    /* 0x24 */ void *sp24;                          /* inferred */
    /* 0x28 */ Font *sp28;                          /* inferred */
    /* 0x2C */ char pad2C[0xC];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80147520 {};              /* size 0x0 */

struct _mips2c_stack_func_80147564 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80147624 {
    /* 0x00 */ char pad0[0x1C];
    /* 0x1C */ Input *sp1C;                         /* inferred */
    /* 0x20 */ char pad20[0x8];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80147734 {};              /* size 0x0 */

struct _mips2c_stack_func_801477B4 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80147818 {
    /* 0x00 */ char pad0[0x4];
    /* 0x04 */ s32 sp4;                             /* inferred */
    /* 0x08 */ s32 sp8;                             /* inferred */
    /* 0x0C */ s32 spC;                             /* inferred */
    /* 0x10 */ s32 sp10;                            /* inferred */
    /* 0x14 */ char pad14[0x8];                     /* maybe part of sp10[3]? */
    /* 0x1C */ void *sp1C;                          /* inferred */
    /* 0x20 */ char pad20[0x48];                    /* maybe part of sp1C[19]? */
    /* 0x68 */ s16 sp68;                            /* inferred */
    /* 0x6A */ char pad6A[0xE];
};                                                  /* size = 0x78 */

struct _mips2c_stack_func_80147F18 {
    /* 0x00 */ char pad0[0x4];
    /* 0x04 */ s32 sp4;                             /* inferred */
    /* 0x08 */ s32 sp8;                             /* inferred */
    /* 0x0C */ s32 spC;                             /* inferred */
    /* 0x10 */ s32 sp10;                            /* inferred */
    /* 0x14 */ char pad14[0x30];                    /* maybe part of sp10[13]? */
    /* 0x44 */ s16 sp44;                            /* inferred */
    /* 0x46 */ char pad46[0xA];
};                                                  /* size = 0x50 */

struct _mips2c_stack_func_80148558 {
    /* 0x00 */ char pad0[0x4];
    /* 0x04 */ s32 sp4;                             /* inferred */
    /* 0x08 */ s32 sp8;                             /* inferred */
    /* 0x0C */ s32 spC;                             /* inferred */
    /* 0x10 */ s32 sp10;                            /* inferred */
    /* 0x14 */ char pad14[0x30];                    /* maybe part of sp10[13]? */
    /* 0x44 */ s16 sp44;                            /* inferred */
    /* 0x46 */ char pad46[0xA];
};                                                  /* size = 0x50 */

struct _mips2c_stack_func_80148B98 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80148CBC {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80148D64 {
    /* 0x00 */ char pad0[0x20];
    /* 0x20 */ void *sp20;                          /* inferred */
    /* 0x24 */ char pad24[0x4];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80149048 {
    /* 0x00 */ char pad0[0x20];
    /* 0x20 */ void *sp20;                          /* inferred */
    /* 0x24 */ char pad24[0x4];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_801491DC {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80149454 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_801496C8 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8014995C {};              /* size 0x0 */

struct _mips2c_stack_func_80149C18 {};              /* size 0x0 */

struct _mips2c_stack_func_80149EBC {};              /* size 0x0 */

struct _mips2c_stack_func_80149F74 {
    /* 0x000 */ char pad0[0x1C];
    /* 0x01C */ void *sp1C;                         /* inferred */
    /* 0x020 */ char pad20[0x170];                  /* maybe part of sp1C[93]? */
    /* 0x190 */ u32 *sp190;                         /* inferred */
    /* 0x194 */ char pad194[0x4];
};                                                  /* size = 0x198 */

struct _mips2c_stack_func_8014AAD0 {
    /* 0x00 */ char pad0[0x1C];
    /* 0x1C */ void *sp1C;                          /* inferred */
    /* 0x20 */ void *sp20;                          /* inferred */
    /* 0x24 */ char pad24[0x4];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_8014ADBC {
    /* 0x000 */ char pad0[0x44];
    /* 0x044 */ void *sp44;                         /* inferred */
    /* 0x048 */ char pad48[0x8];                    /* maybe part of sp44[3]? */
    /* 0x050 */ s32 sp50;                           /* inferred */
    /* 0x054 */ char pad54[0x4];
    /* 0x058 */ void *sp58;                         /* inferred */
    /* 0x05C */ Font *sp5C;                         /* inferred */
    /* 0x060 */ char pad60[0xCA];                   /* maybe part of sp5C[51]? */
    /* 0x12A */ s16 sp12A;                          /* inferred */
    /* 0x12C */ s16 sp12C;                          /* inferred */
    /* 0x12E */ s16 sp12E;                          /* inferred */
    /* 0x130 */ s16 sp130;                          /* inferred */
    /* 0x132 */ char pad132[0x2];
    /* 0x134 */ u32 *sp134;                         /* inferred */
    /* 0x138 */ u16 sp138;                          /* inferred */
    /* 0x13A */ char pad13A[0xE];
};                                                  /* size = 0x148 */

struct _mips2c_stack_func_8014C70C {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_8014CC14 {
    /* 0x00 */ char pad0[0x1C];
    /* 0x1C */ f32 sp1C;                            /* inferred */
    /* 0x20 */ s32 sp20;                            /* inferred */
    /* 0x24 */ char pad24[0x4];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_8014CCB4 {
    /* 0x00 */ char pad0[0x24];
    /* 0x24 */ MessageContext *sp24;                /* inferred */
    /* 0x28 */ f32 sp28;                            /* inferred */
    /* 0x2C */ char pad2C[0xC];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_8014CDF0 {
    /* 0x00 */ char pad0[0x20];
    /* 0x20 */ s32 sp20;                            /* inferred */
    /* 0x24 */ u32 sp24;                            /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_8014CFDC {
    /* 0x00 */ char pad0[0x1C];
    /* 0x1C */ s32 sp1C;                            /* inferred */
    /* 0x20 */ char pad20[0x18];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_8014D304 {
    /* 0x00 */ char pad0[0x54];
    /* 0x54 */ s16 sp54;                            /* inferred */
    /* 0x56 */ s16 sp56;                            /* inferred */
    /* 0x58 */ s16 sp58;                            /* inferred */
    /* 0x5A */ s16 sp5A;                            /* inferred */
    /* 0x5C */ char pad5C[0x4];                     /* maybe part of sp5A[3]? */
    /* 0x60 */ f32 sp60;                            /* inferred */
    /* 0x64 */ char pad64[0xC];
};                                                  /* size = 0x70 */

struct _mips2c_stack_func_8014D62C {
    /* 0x00 */ char pad0[0x3C];
    /* 0x3C */ f32 sp3C;                            /* inferred */
    /* 0x40 */ char pad40[0x10];
};                                                  /* size = 0x50 */

struct _mips2c_stack_func_8014D7B4 {
    /* 0x00 */ char pad0[0x74];
    /* 0x74 */ void *sp74;                          /* inferred */
    /* 0x78 */ char pad78[0x4];
    /* 0x7C */ s32 sp7C;                            /* inferred */
    /* 0x80 */ char pad80[0x18];                    /* maybe part of sp7C[7]? */
    /* 0x98 */ s32 sp98;                            /* inferred */
    /* 0x9C */ u32 sp9C;                            /* inferred */
    /* 0xA0 */ char padA0[0xC];                     /* maybe part of sp9C[4]? */
    /* 0xAC */ ? spAC;                              /* inferred */
    /* 0xAC */ char padAC[0x14];
    /* 0xC0 */ f32 spC0;                            /* inferred */
    /* 0xC4 */ char padC4[0x4];
    /* 0xC8 */ s32 spC8;                            /* inferred */
    /* 0xCC */ char padCC[0x6];                     /* maybe part of spC8[2]? */
    /* 0xD2 */ s16 spD2;                            /* inferred */
    /* 0xD4 */ s16 spD4;                            /* inferred */
    /* 0xD6 */ s16 spD6;                            /* inferred */
    /* 0xD8 */ s16 spD8;                            /* inferred */
    /* 0xDA */ s16 spDA;                            /* inferred */
    /* 0xDC */ char padDC[0x4];                     /* maybe part of spDA[3]? */
    /* 0xE0 */ s16 spE0;                            /* inferred */
    /* 0xE2 */ char padE2[0x8];                     /* maybe part of spE0[5]? */
    /* 0xEA */ s16 spEA;                            /* inferred */
    /* 0xEC */ void *spEC;                          /* inferred */
    /* 0xF0 */ void *spF0;                          /* inferred */
    /* 0xF4 */ char padF4[0x4];
};                                                  /* size = 0xF8 */

struct _mips2c_stack_func_80150A84 {
    /* 0x00 */ char pad0[0x1C];
    /* 0x1C */ s16 *sp1C;                           /* inferred */
    /* 0x20 */ s32 sp20;                            /* inferred */
    /* 0x24 */ void *sp24;                          /* inferred */
    /* 0x28 */ char pad28[0x8];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80150D08 {
    /* 0x00 */ char pad0[0x18];
    /* 0x18 */ void *sp18;                          /* inferred */
    /* 0x1C */ s32 sp1C;                            /* inferred */
    /* 0x20 */ void *sp20;                          /* inferred */
    /* 0x24 */ Font *sp24;                          /* inferred */
    /* 0x28 */ MessageContext *sp28;                /* inferred */
    /* 0x2C */ char pad2C[0x14];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_801514B0 {
    /* 0x00 */ char pad0[0x2C];
    /* 0x2C */ Font *sp2C;                          /* inferred */
    /* 0x30 */ char pad30[0x18];
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_801518B0 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80151938 {
    /* 0x00 */ char pad0[0x24];
    /* 0x24 */ MessageContext *sp24;                /* inferred */
    /* 0x28 */ char pad28[0x8];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80151A68 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80151BB4 {};              /* size 0x0 */

struct _mips2c_stack_func_80151C9C {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80151DA4 {
    /* 0x00 */ char pad0[0x24];
    /* 0x24 */ void *sp24;                          /* inferred */
    /* 0x28 */ s32 sp28;                            /* inferred */
    /* 0x2C */ char pad2C[0x10];                    /* maybe part of sp28[5]? */
    /* 0x3C */ s32 sp3C;                            /* inferred */
    /* 0x40 */ s16 sp40;                            /* inferred */
    /* 0x42 */ s16 sp42;                            /* inferred */
    /* 0x44 */ char pad44[0x4];
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_80152434 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80152464 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80152498 {};              /* size 0x0 */

struct _mips2c_stack_func_8015268C {};              /* size 0x0 */

struct _mips2c_stack_func_80152C64 {
    /* 0x00 */ char pad0[0x18];
    /* 0x18 */ s32 sp18;                            /* inferred */
    /* 0x1C */ s32 sp1C;                            /* inferred */
    /* 0x20 */ s32 sp20;                            /* inferred */
    /* 0x24 */ s32 sp24;                            /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80152CAC {
    /* 0x00 */ char pad0[0x18];
    /* 0x18 */ void *sp18;                          /* inferred */
    /* 0x1C */ char pad1C[0x4];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80152EC0 {
    /* 0x00 */ char pad0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80152FB8 {
    /* 0x00 */ s32 sp0;                             /* inferred */
    /* 0x04 */ char pad4[0x4];
    /* 0x08 */ s32 sp8;                             /* inferred */
    /* 0x0C */ char padC[0x4];
    /* 0x10 */ s32 sp10;                            /* inferred */
    /* 0x14 */ char pad14[0x4];
    /* 0x18 */ s32 sp18;                            /* inferred */
    /* 0x1C */ char pad1C[0x4];
    /* 0x20 */ s32 sp20;                            /* inferred */
    /* 0x24 */ s32 sp24;                            /* inferred */
    /* 0x28 */ s32 sp28;                            /* inferred */
    /* 0x2C */ s32 sp2C;                            /* inferred */
    /* 0x30 */ s32 sp30;                            /* inferred */
    /* 0x34 */ char pad34[0x4];
    /* 0x38 */ s32 sp38;                            /* inferred */
    /* 0x3C */ char pad3C[0x4];
    /* 0x40 */ s32 sp40;                            /* inferred */
    /* 0x44 */ s32 sp44;                            /* inferred */
    /* 0x48 */ char pad48[0x8];
};                                                  /* size = 0x50 */

struct _mips2c_stack_func_80153750 {
    /* 0x00 */ char pad0[0x1C];
    /* 0x1C */ void *sp1C;                          /* inferred */
    /* 0x20 */ char pad20[0x4];
    /* 0x24 */ void *sp24;                          /* inferred */
    /* 0x28 */ char pad28[0x78];                    /* maybe part of sp24[31]? */
    /* 0xA0 */ Gfx *spA0;                           /* inferred */
    /* 0xA4 */ char padA4[0x4];
};                                                  /* size = 0xA8 */

struct _mips2c_stack_func_80153E7C {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80153EF0 {
    /* 0x00 */ char pad0[0x70];
    /* 0x70 */ Gfx *sp70;                           /* inferred */
    /* 0x74 */ char pad74[0x4];
};                                                  /* size = 0x78 */

struct _mips2c_stack_func_801541D4 {
    /* 0x00 */ char pad0[0x78];
    /* 0x78 */ s32 sp78;                            /* inferred */
    /* 0x7C */ char pad7C[0x6];                     /* maybe part of sp78[2]? */
    /* 0x82 */ u16 sp82;                            /* inferred */
    /* 0x84 */ Gfx *sp84;                           /* inferred */
    /* 0x88 */ char pad88[0x8];
};                                                  /* size = 0x90 */

struct _mips2c_stack_func_80156758 {
    /* 0x00 */ char pad0[0x38];
    /* 0x38 */ Gfx *sp38;                           /* inferred */
    /* 0x3C */ Gfx *sp3C;                           /* inferred */
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_8015680C {
    /* 0x00 */ char pad0[0x20];
    /* 0x20 */ void *sp20;                          /* inferred */
    /* 0x24 */ char pad24[0x4];
    /* 0x28 */ void *sp28;                          /* inferred */
    /* 0x2C */ PauseContext *sp2C;                  /* inferred */
    /* 0x30 */ MessageContext *sp30;                /* inferred */
    /* 0x34 */ char pad34[0xA];                     /* maybe part of sp30[3]? */
    /* 0x3E */ u16 sp3E;                            /* inferred */
    /* 0x40 */ s32 sp40;                            /* inferred */
    /* 0x44 */ s32 sp44;                            /* inferred */
    /* 0x48 */ char pad48[0x2];
    /* 0x4A */ s16 sp4A;                            /* inferred */
    /* 0x4C */ s16 sp4C;                            /* inferred */
    /* 0x4E */ char pad4E[0x2];
    /* 0x50 */ s16 sp50;                            /* inferred */
    /* 0x52 */ char pad52[0x16];
};                                                  /* size = 0x68 */

struct _mips2c_stack_func_801586A4 {};              /* size 0x0 */

s32 ShrinkWindow_GetLetterboxTarget();              /* extern */
s32 func_8010A0A4(GlobalContext *, u16, s32, s16 *); /* extern */
? func_8014546C(SramContext *);                     /* extern */
? func_80147008(PauseContext *, s32, s32);          /* extern */
? func_80147138(PauseContext *, s32, s32);          /* extern */
? func_8015966C(GlobalContext *, Gfx **, u16, GameInfo **); /* extern */
? func_8015B198(GlobalContext *);                   /* extern */
? func_8015E750(GlobalContext *, s32, u16, SaveContext *); /* extern */
? func_8015F8A8(GlobalContext *);                   /* extern */
? func_80178E3C(u8 *, u16, s32, ?);                 /* extern */
? func_8019B378();                                  /* extern */
? func_8019B38C(s32, SaveContext *, s16);           /* extern */
