CRASHED

struct _mips2c_stack_func_8010A760 {};              /* size 0x0 */

struct _mips2c_stack_func_8010A7CC {};              /* size 0x0 */

struct _mips2c_stack_func_8010A814 {};              /* size 0x0 */

struct _mips2c_stack_func_8010A85C {};              /* size 0x0 */

struct _mips2c_stack_func_8010A8A4 {};              /* size 0x0 */

struct _mips2c_stack_func_8010A8EC {};              /* size 0x0 */

struct _mips2c_stack_func_8010A990 {
    /* 0x00 */ char pad0[0x26];
    /* 0x26 */ s16 sp26;                            /* inferred */
    /* 0x28 */ f32 sp28;                            /* inferred */
    /* 0x2C */ f32 sp2C;                            /* inferred */
    /* 0x30 */ s32 sp30;                            /* inferred */
    /* 0x34 */ char pad34[0x4];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_8010AA54 {
    /* 0x00 */ char pad0[0x26];
    /* 0x26 */ s16 sp26;                            /* inferred */
    /* 0x28 */ f32 sp28;                            /* inferred */
    /* 0x2C */ f32 sp2C;                            /* inferred */
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ char pad34[0x4];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_8010AB30 {};              /* size 0x0 */

struct _mips2c_stack_func_8010AB94 {
    /* 0x00 */ char pad0[0x1A];
    /* 0x1A */ s16 sp1A;                            /* inferred */
    /* 0x1C */ char pad1C[0x4];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_8010AC00 {};              /* size 0x0 */

struct _mips2c_stack_func_8010AD24 {
    /* 0x00 */ char pad0[0x1C];
    /* 0x1C */ void *sp1C;                          /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_8010ADD4 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8010AE48 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8010AECC {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8010AF20 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8010AF6C {};              /* size 0x0 */

struct _mips2c_stack_func_8010AF94 {};              /* size 0x0 */

struct _mips2c_stack_func_8010AFE0 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8010B010 {
    /* 0x00 */ char pad0[0x18];
    /* 0x18 */ s32 sp18;                            /* inferred */
    /* 0x1C */ char pad1C[0x4];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_8010B06C {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8010B0B4 {};              /* size 0x0 */

struct _mips2c_stack_func_8010B0DC {};              /* size 0x0 */

struct _mips2c_stack_func_8010B108 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8010B140 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8010B180 {};              /* size 0x0 */

struct _mips2c_stack_func_8010B1BC {};              /* size 0x0 */

struct _mips2c_stack_func_8010B22C {};              /* size 0x0 */

struct _mips2c_stack_func_8010B284 {};              /* size 0x0 */

struct _mips2c_stack_func_8010B2C0 {};              /* size 0x0 */

struct _mips2c_stack_func_8010B300 {
    /* 0x00 */ char pad0[0x18];
    /* 0x18 */ s32 sp18;                            /* inferred */
    /* 0x1C */ void *sp1C;                          /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_8010B434 {};              /* size 0x0 */

struct _mips2c_stack_func_8010B4A4 {
    /* 0x00 */ char pad0[0x1E];
    /* 0x1E */ s16 sp1E;                            /* inferred */
    /* 0x20 */ s32 sp20;                            /* inferred */
    /* 0x24 */ char pad24[0x4];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_8010B520 {};              /* size 0x0 */

struct _mips2c_stack_func_8010B664 {};              /* size 0x0 */

struct _mips2c_stack_func_8010B7A8 {
    /* 0x00 */ char pad0[0x18];
    /* 0x18 */ s16 sp18;                            /* inferred */
    /* 0x1A */ char pad1A[0x6];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_8010B828 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8010B878 {};              /* size 0x0 */

struct _mips2c_stack_func_8010B8E4 {};              /* size 0x0 */

struct _mips2c_stack_func_8010BB0C {};              /* size 0x0 */

struct _mips2c_stack_func_8010BB6C {
    /* 0x00 */ char pad0[0x1A];
    /* 0x1A */ s16 sp1A;                            /* inferred */
    /* 0x1C */ char pad1C[0x4];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_8010BBCC {};              /* size 0x0 */

struct _mips2c_stack_func_8010BC28 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8010BC7C {
    /* 0x00 */ char pad0[0x1C];
    /* 0x1C */ void *sp1C;                          /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_8010BD48 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8010BD90 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8010BDDC {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8010BE78 {};              /* size 0x0 */

struct _mips2c_stack_func_8010BEBC {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8010BEF0 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8010BF24 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

? func_801149A0(s16, u8);                           /* extern */
? func_8010A760(s32 arg0, ? arg1, void **arg2, ? arg3); /* static */
? func_8010A7CC(s32 arg0, void *arg1, void **arg2, ? arg3); /* static */
? func_8010A814(s32 arg0, void *arg1, void **arg2, ? arg3); /* static */
? func_8010A85C(s32 arg0, void *arg1, void **arg2, ? arg3); /* static */
? func_8010A8A4(s32 arg0, void *arg1, void **arg2, ? arg3); /* static */
? func_8010A8EC(s32 arg0, void *arg1, void **arg2, ? arg3); /* static */
? func_8010A990(Actor *arg0, GlobalContext *arg1, void **arg2, ? arg3); /* static */
? func_8010AA54(Actor *arg0, GlobalContext *arg1, void **arg2, ? arg3); /* static */
? func_8010AB30(s32 arg0, ? arg1, void **arg2, ? arg3); /* static */
? func_8010AB94(void **arg2, s32 (*arg3)());        /* static */
? func_8010AC00(s32 arg0, ? arg1, void **arg2, ? arg3); /* static */
? func_8010AD24(s32 arg0, GlobalContext *arg1, void **arg2, ? arg3); /* static */
? func_8010ADD4(s32 arg0, GlobalContext *arg1, ? arg2, ? arg3); /* static */
? func_8010AE48(s32 arg0, GlobalContext *arg1, ? arg2, ? arg3, s32 *arg4); /* static */
? func_8010AECC(s32 arg0, GlobalContext *arg1, void **arg2, ? arg3); /* static */
? func_8010AF20(s32 arg0, GlobalContext *arg1, void **arg2, ? arg3); /* static */
? func_8010AF6C(s32 arg0, ? arg1, ? arg2, ? arg3, s32 *arg4); /* static */
? func_8010AF94(s32 arg0, ? arg1, void **arg2, ? arg3); /* static */
? func_8010AFE0(s32 arg0, GlobalContext *arg1, ? arg2, ? arg3); /* static */
? func_8010B010(void *arg0, GlobalContext *arg1, void **arg2, ? arg3); /* static */
? func_8010B06C(s32 arg0, ? arg1, void **arg2, ? arg3); /* static */
? func_8010B0B4(s32 arg0, void *arg1, ? arg2, ? arg3); /* static */
? func_8010B0DC(void *arg0, ? arg1, ? arg2, ? arg3); /* static */
? func_8010B108(Actor *arg0, GlobalContext *arg1, ? arg2, ? arg3); /* static */
? func_8010B140(Actor *arg0, GlobalContext *arg1, ? arg2, ? arg3); /* static */
? func_8010B180(s32 arg0, ? arg1, void **arg2, ? arg3); /* static */
? func_8010B1BC(s32 arg0, ? arg1, void **arg2, ? arg3); /* static */
? func_8010B22C(s32 arg0, ? arg1, void **arg2, ? arg3); /* static */
? func_8010B284(s32 arg0, ? arg1, void **arg2, ? arg3); /* static */
? func_8010B2C0(s32 arg0, ? arg1, void **arg2, ? arg3); /* static */
? func_8010B300(s32 arg0, GlobalContext *arg1, void **arg2, ? arg3); /* static */
? func_8010B434(s32 arg0, ? arg1, void **arg2, ? arg3); /* static */
? func_8010B4A4(s32 arg0, GlobalContext *arg1, void **arg2, ? arg3); /* static */
? func_8010B520(s32 arg0, ? arg1, void **arg2, ? arg3); /* static */
? func_8010B664(s32 arg0, ? arg1, void **arg2, ? arg3); /* static */
? func_8010B7A8(s32 arg0, GlobalContext *arg1, void **arg2, ? arg3); /* static */
? func_8010B828(s32 arg0, GlobalContext *arg1, void **arg2, ? arg3); /* static */
? func_8010B878(s32 arg0, ? arg1, void **arg2, ? arg3); /* static */
? func_8010B8E4(s32 arg0, ? arg1, void **arg2, ? arg3); /* static */
? func_8010BB0C(s32 arg0, ? arg1, void **arg2, ? arg3); /* static */
? func_8010BB6C(void **arg2, s32 (*arg3)());        /* static */
? func_8010BBCC(s32 arg0, void *arg1, void **arg2, ? arg3); /* static */
? func_8010BC28(s32 arg0, ? arg1, void **arg2, ? arg3); /* static */
? func_8010BC7C(void **arg2, s32 (*arg3)());        /* static */
? func_8010BD48(s32 arg0, GlobalContext *arg1, void **arg2, ? arg3); /* static */
? func_8010BD90(s32 arg0, GlobalContext *arg1, void **arg2, ? arg3); /* static */
? func_8010BDDC(s32 arg0, GlobalContext *arg1, ? arg2, ? arg3); /* static */
? func_8010BE78(s32 arg0, ? arg1, void **arg2, ? arg3); /* static */
? func_8010BEBC(s32 arg0, ? arg1, ? arg2, ? arg3);  /* static */
? func_8010BEF0(s32 arg0, ? arg1, ? arg2, ? arg3);  /* static */
? func_8010BF24(s32 arg0, ? arg1, ? arg2, ? arg3);  /* static */
u32 gBitFlags[32] = {
    1,
    2,
    4,
    8,
    0x10,
    0x20,
    0x40,
    0x80,
    0x100,
    0x200,
    0x400,
    0x800,
    0x1000,
    0x2000,
    0x4000,
    0x8000,
    0x10000,
    0x20000,
    0x40000,
    0x80000,
    0x100000,
    0x200000,
    0x400000,
    0x800000,
    0x1000000,
    0x2000000,
    0x4000000,
    0x8000000,
    0x10000000,
    0x20000000,
    0x40000000,
    0x80000000,
};
u8 gItemSlots[80] = {
    0,
    1,
    2,
    3,
    4,
    5,
    6,
    7,
    8,
    9,
    0xA,
    0xB,
    0xC,
    0xD,
    0xE,
    0xF,
    0x10,
    0x12,
    0x12,
    0x12,
    0x12,
    0x12,
    0x12,
    0x12,
    0x12,
    0x12,
    0x12,
    0x12,
    0x12,
    0x12,
    0x12,
    0x12,
    0x12,
    0x12,
    0x12,
    0x12,
    0x12,
    0x12,
    0x12,
    0x12,
    5,
    5,
    5,
    5,
    5,
    0xB,
    0xB,
    0x11,
    0x11,
    0x11,
    0x1D,
    0x23,
    0x29,
    0x2F,
    0x28,
    0x26,
    0x19,
    0x20,
    0x1E,
    0x2C,
    0x24,
    0x25,
    0x18,
    0x27,
    0x1C,
    0x2B,
    0x21,
    0x2A,
    0x2D,
    0x1B,
    0x1F,
    0x1A,
    0x22,
    0x2E,
    1,
    1,
    1,
    0,
    0,
    0,
};
SaveContext gSaveContext;

? func_8010A760(s32 arg0, ? arg1, void **arg2, ? arg3) {
    s32 temp_a0;
    void *temp_v1;

    temp_v1 = *arg2;
    temp_a0 = ((temp_v1->unk1 << 8) | temp_v1->unk2) & 0xFFFF;
    if ((gSaveContext.weekEventReg[temp_a0 >> 8] & temp_a0 & 0xFF) != 0) {
        *arg2 = temp_v1 + (s16) ((temp_v1->unk3 << 8) | temp_v1->unk4);
    }
    return 0;
}

? func_8010A7CC(s32 arg0, void *arg1, void **arg2, ? arg3) {
    void *temp_a0;

    temp_a0 = *arg2;
    if (arg1->unk1CCC->unk14B == 1) {
        *arg2 = temp_a0 + (s16) ((temp_a0->unk1 << 8) | temp_a0->unk2);
    }
    return 0;
}

? func_8010A814(s32 arg0, void *arg1, void **arg2, ? arg3) {
    void *temp_a0;

    temp_a0 = *arg2;
    if (arg1->unk1CCC->unk14B == 2) {
        *arg2 = temp_a0 + (s16) ((temp_a0->unk1 << 8) | temp_a0->unk2);
    }
    return 0;
}

? func_8010A85C(s32 arg0, void *arg1, void **arg2, ? arg3) {
    void *temp_a0;

    temp_a0 = *arg2;
    if (arg1->unk1CCC->unk14B == 3) {
        *arg2 = temp_a0 + (s16) ((temp_a0->unk1 << 8) | temp_a0->unk2);
    }
    return 0;
}

? func_8010A8A4(s32 arg0, void *arg1, void **arg2, ? arg3) {
    void *temp_a0;

    temp_a0 = *arg2;
    if (arg1->unk1CCC->unk14B == 4) {
        *arg2 = temp_a0 + (s16) ((temp_a0->unk1 << 8) | temp_a0->unk2);
    }
    return 0;
}

? func_8010A8EC(s32 arg0, void *arg1, void **arg2, ? arg3) {
    u8 temp_a3;
    void *temp_v1;
    s32 phi_a0;
    s32 phi_a0_2;

    temp_a3 = arg1->unk16929;
    temp_v1 = *arg2;
    phi_a0 = 0;
    if (temp_a3 != 0) {
        if (temp_a3 != 1) {
            if (temp_a3 != 2) {

            } else {
                phi_a0_2 = ((temp_v1->unk5 << 8) | temp_v1->unk6) << 0x10;
                goto block_7;
            }
        } else {
            phi_a0_2 = ((temp_v1->unk3 << 8) | temp_v1->unk4) << 0x10;
            goto block_7;
        }
    } else {
        phi_a0_2 = ((temp_v1->unk1 << 8) | temp_v1->unk2) << 0x10;
block_7:
        phi_a0 = phi_a0_2 >> 0x10;
    }
    *arg2 = temp_v1 + phi_a0;
    return 0;
}

? func_8010A990(Actor *arg0, GlobalContext *arg1, void **arg2, ? arg3) {
    s32 sp30;
    f32 sp2C;
    f32 sp28;
    s16 sp26;
    void *temp_v0;

    temp_v0 = *arg2;
    sp30 = (temp_v0->unk1 << 8) | temp_v0->unk2;
    sp2C = arg0->xzDistToPlayer + 1.0f;
    sp28 = fabsf(arg0->yDistToPlayer) + 1.0f;
    sp26 = (temp_v0->unk3 << 8) | temp_v0->unk4;
    if (Actor_HasParent(arg0, arg1) != 0) {
        *arg2 += sp26;
        return 0;
    }
    func_800B8A1C(arg0, arg1, sp30, sp2C, sp28);
    return 1;
}

? func_8010AA54(Actor *arg0, GlobalContext *arg1, void **arg2, ? arg3) {
    f32 sp30;
    f32 sp2C;
    f32 sp28;
    s16 sp26;
    Actor *temp_a0;
    void *temp_v0;

    temp_v0 = *arg2;
    sp30 = arg0->xzDistToPlayer + 1.0f;
    sp2C = fabsf(arg0->yDistToPlayer) + 1.0f;
    sp26 = (temp_v0->unk1 << 8) | temp_v0->unk2;
    temp_a0 = arg0;
    if (func_800B84D0(arg0, arg1) != 0) {
        *arg2 += sp26;
        return 0;
    }
    temp_a0->flags |= 0x10000;
    sp28 = temp_a0->xzDistToPlayer;
    temp_a0->xzDistToPlayer = 0.0f;
    arg0 = temp_a0;
    func_800B8500(temp_a0, arg1, sp30, sp2C, 0);
    arg0->xzDistToPlayer = sp28;
    return 1;
}

? func_8010AB30(s32 arg0, ? arg1, void **arg2, ? arg3) {
    void *temp_v1;

    temp_v1 = *arg2;
    if ((s32) gSaveContext.rupees >= (s32) (s16) ((temp_v1->unk1 << 8) | temp_v1->unk2)) {
        *arg2 = temp_v1 + (s16) ((temp_v1->unk3 << 8) | temp_v1->unk4);
    }
    return 0;
}

? func_8010AB94(void **arg2, s32 (*arg3)()) {
    s16 sp1A;
    s16 temp_t0;
    void *temp_v1;
    void *phi_v1;

    temp_v1 = *arg2;
    temp_t0 = (temp_v1->unk1 << 8) | temp_v1->unk2;
    phi_v1 = temp_v1;
    if (arg3 != 0) {
        sp1A = temp_t0;
        if (arg3() != 0) {
            phi_v1 = *arg2;
            goto block_3;
        }
        return 1;
    }
block_3:
    *arg2 = phi_v1 + temp_t0;
    return 0;
}

? func_8010AC00(s32 arg0, ? arg1, void **arg2, ? arg3) {
    s32 temp_a1;
    void *temp_v1;
    s32 phi_a0;
    s32 phi_a0_2;

    temp_a1 = gSaveContext.day;
    temp_v1 = *arg2;
    phi_a0 = 0;
    if (temp_a1 != 1) {
        if (temp_a1 != 2) {
            if (temp_a1 != 3) {

            } else {
                if (gSaveContext.isNight == 0) {
                    phi_a0_2 = ((temp_v1->unk9 << 8) | temp_v1->unkA) << 0x10;
                } else {
                    phi_a0_2 = ((temp_v1->unkB << 8) | temp_v1->unkC) << 0x10;
                }
                goto block_13;
            }
        } else {
            if (gSaveContext.isNight == 0) {
                phi_a0_2 = ((temp_v1->unk5 << 8) | temp_v1->unk6) << 0x10;
            } else {
                phi_a0_2 = ((temp_v1->unk7 << 8) | temp_v1->unk8) << 0x10;
            }
            goto block_13;
        }
    } else {
        if (gSaveContext.isNight == 0) {
            phi_a0_2 = ((temp_v1->unk1 << 8) | temp_v1->unk2) << 0x10;
        } else {
            phi_a0_2 = ((temp_v1->unk3 << 8) | temp_v1->unk4) << 0x10;
        }
block_13:
        phi_a0 = phi_a0_2 >> 0x10;
    }
    *arg2 = temp_v1 + phi_a0;
    return 0;
}

? func_8010AD24(s32 arg0, GlobalContext *arg1, void **arg2, ? arg3) {
    void *sp1C;
    u8 temp_v0;

    sp1C = *arg2;
    temp_v0 = func_80152498(arg1 + 0x4908);
    if (temp_v0 != 2) {
        if ((temp_v0 == 4) || (temp_v0 == 5)) {
            if (func_80147624(arg1) == 0) {
                return 1;
            }
            goto block_5;
        }
        return 1;
    }
block_5:
    *arg2 += (s16) ((sp1C->unk1 << 8) | sp1C->unk2);
    return 0;
}

? func_8010ADD4(s32 arg0, GlobalContext *arg1, ? arg2, ? arg3) {
    u8 temp_v0;

    temp_v0 = func_80152498(arg1 + 0x4908);
    if (temp_v0 != 2) {
        if ((temp_v0 == 4) || (temp_v0 == 5)) {
            if (func_80147624(arg1) == 0) {
                return 1;
            }
            goto block_6;
        }
        return 1;
    }
block_6:
    return 0;
}

? func_8010AE48(s32 arg0, GlobalContext *arg1, ? arg2, ? arg3, s32 *arg4) {
    u8 temp_v0;

    temp_v0 = func_80152498(arg1 + 0x4908);
    *arg4 = 0;
    if (temp_v0 != 2) {
        if ((temp_v0 == 4) || (temp_v0 == 5)) {
            if (func_80147624(arg1) != 0) {
                goto block_4;
            }
        }
    } else {
block_4:
        *arg4 = 1;
    }
    return 1;
}

? func_8010AECC(s32 arg0, GlobalContext *arg1, void **arg2, ? arg3) {
    void *temp_v0;

    temp_v0 = *arg2;
    func_801518B0(arg1, ((temp_v0->unk1 << 8) | temp_v0->unk2) & 0xFFFF, NULL);
    return 0;
}

? func_8010AF20(s32 arg0, GlobalContext *arg1, void **arg2, ? arg3) {
    void *temp_v0;

    temp_v0 = *arg2;
    func_80151938(arg1, ((temp_v0->unk1 << 8) | temp_v0->unk2) & 0xFFFF);
    return 0;
}

? func_8010AF6C(s32 arg0, ? arg1, ? arg2, ? arg3, s32 *arg4) {
    *arg4 = 1;
    return 1;
}

? func_8010AF94(s32 arg0, ? arg1, void **arg2, ? arg3) {
    s32 temp_t2;
    s32 temp_t9;
    void *temp_v1;

    temp_v1 = *arg2;
    temp_t2 = ((temp_v1->unk1 << 8) | temp_v1->unk2) & 0xFFFF;
    temp_t9 = temp_t2 >> 8;
    gSaveContext.weekEventReg[temp_t9] |= temp_t2;
    return 0;
}

? func_8010AFE0(s32 arg0, GlobalContext *arg1, ? arg2, ? arg3) {
    func_801477B4(arg1);
    return 0;
}

? func_8010B010(void *arg0, GlobalContext *arg1, void **arg2, ? arg3) {
    s32 sp18;
    s32 temp_a1;
    void *temp_v0;

    temp_v0 = *arg2;
    temp_a1 = (temp_v0->unk1 << 8) | temp_v0->unk2;
    sp18 = temp_a1;
    if (Actor_GetCollectibleFlag(arg1, temp_a1) == 0) {
        Actor_SetCollectibleFlag(arg1, temp_a1);
    }
    arg0->unk120 = 0;
    return 0;
}

? func_8010B06C(s32 arg0, ? arg1, void **arg2, ? arg3) {
    void *temp_v0;

    temp_v0 = *arg2;
    func_801159EC((s16) ((temp_v0->unk1 << 8) | temp_v0->unk2));
    return 0;
}

? func_8010B0B4(s32 arg0, void *arg1, ? arg2, ? arg3) {
    arg1->unk1682A = 0x44;
    return 0;
}

? func_8010B0DC(void *arg0, ? arg1, ? arg2, ? arg3) {
    arg0->unk4 = (s32) (arg0->unk4 & 0xFFFEFFFF);
    return 0;
}

? func_8010B108(Actor *arg0, GlobalContext *arg1, ? arg2, ? arg3) {
    Actor *temp_a2;

    temp_a2 = arg0->child;
    if (temp_a2 != 0) {
        func_800B86C8(arg0, arg1, temp_a2);
    }
    return 0;
}

? func_8010B140(Actor *arg0, GlobalContext *arg1, ? arg2, ? arg3) {
    Actor *temp_a3;

    temp_a3 = arg0->child;
    if (temp_a3 != 0) {
        func_800B86C8(temp_a3, arg1, arg0);
    }
    return 0;
}

? func_8010B180(s32 arg0, ? arg1, void **arg2, ? arg3) {
    void *temp_a0;

    temp_a0 = *arg2;
    *arg2 = temp_a0 + (s16) ((temp_a0->unk1 << 8) | temp_a0->unk2);
    return 0;
}

? func_8010B1BC(s32 arg0, ? arg1, void **arg2, ? arg3) {
    void *temp_v1;

    temp_v1 = *arg2;
    if ((gBitFlags[((temp_v1->unk1 << 8) | temp_v1->unk2) & 0xFFFF] & gSaveContext.inventory.questItems) != 0) {
        *arg2 = temp_v1 + (s16) ((temp_v1->unk3 << 8) | temp_v1->unk4);
    }
    return 0;
}

? func_8010B22C(s32 arg0, ? arg1, void **arg2, ? arg3) {
    void *temp_v1;

    temp_v1 = *arg2;
    if ((gSaveContext.eventInf[temp_v1->unk1] & temp_v1->unk2) != 0) {
        *arg2 = temp_v1 + (s16) ((temp_v1->unk3 << 8) | temp_v1->unk4);
    }
    return 0;
}

? func_8010B284(s32 arg0, ? arg1, void **arg2, ? arg3) {
    u8 temp_t6;
    void *temp_v1;

    temp_v1 = *arg2;
    temp_t6 = temp_v1->unk1;
    gSaveContext.eventInf[temp_t6] |= temp_v1->unk2;
    return 0;
}

? func_8010B2C0(s32 arg0, ? arg1, void **arg2, ? arg3) {
    u8 temp_t6;
    void *temp_v1;

    temp_v1 = *arg2;
    temp_t6 = temp_v1->unk1;
    gSaveContext.eventInf[temp_t6] &= temp_v1->unk2 ^ 0xFF;
    return 0;
}

? func_8010B300(s32 arg0, GlobalContext *arg1, void **arg2, ? arg3) {
    void *sp1C;
    s32 sp18;
    s32 temp_v0_2;
    u8 temp_v0;
    void *temp_a3;
    s16 phi_v1;

    temp_a3 = *arg2;
    sp1C = temp_a3;
    sp18 = (temp_a3->unk1 << 8) | temp_a3->unk2;
    temp_v0 = func_80152498(arg1 + 0x4908);
    if ((temp_v0 != 4) && (temp_v0 != 5)) {
        if (temp_v0 != 0x10) {
            return 1;
        }
        goto block_6;
    }
    sp1C = temp_a3;
    if (func_80147624(arg1) == 0) {
        return 1;
    }
block_6:
    sp1C = *arg2;
    temp_v0_2 = func_80123810(arg1);
    if (temp_v0_2 == 0) {
        return 1;
    }
    if (temp_v0_2 < 0) {
        phi_v1 = (s16) (((*arg2)->unk7 << 8) | (*arg2)->unk8);
    } else if (temp_v0_2 == sp18) {
        phi_v1 = (s16) (((*arg2)->unk3 << 8) | (*arg2)->unk4);
    } else {
        phi_v1 = (s16) (((*arg2)->unk5 << 8) | (*arg2)->unk6);
    }
    *arg2 += phi_v1;
    return 0;
}

? func_8010B434(s32 arg0, ? arg1, void **arg2, ? arg3) {
    void *temp_v1;

    temp_v1 = *arg2;
    if (((gBitFlags + 0x18)[((temp_v1->unk1 << 8) | temp_v1->unk2) & 0xFFFF] & gSaveContext.inventory.questItems) != 0) {
        *arg2 = temp_v1 + (s16) ((temp_v1->unk3 << 8) | temp_v1->unk4);
    }
    return 0;
}

? func_8010B4A4(s32 arg0, GlobalContext *arg1, void **arg2, ? arg3) {
    s32 sp20;
    s16 sp1E;
    void *temp_v0;

    temp_v0 = *arg2;
    sp20 = (temp_v0->unk1 << 8) | temp_v0->unk2;
    sp1E = (temp_v0->unk3 << 8) | temp_v0->unk4;
    if (Player_GetMask(arg1) == sp20) {
        *arg2 += sp1E;
    }
    return 0;
}

? func_8010B520(s32 arg0, ? arg1, void **arg2, ? arg3) {
    f32 temp_f18;
    f32 temp_f6;
    u8 temp_t0;
    u8 temp_t9;
    void *temp_v1;
    f32 phi_f6;
    f32 phi_f18;

    temp_v1 = *arg2;
    temp_t9 = temp_v1->unk1;
    temp_f6 = (f32) temp_t9;
    phi_f6 = temp_f6;
    if ((s32) temp_t9 < 0) {
        phi_f6 = temp_f6 + 4294967296.0f;
    }
    temp_t0 = temp_v1->unk2;
    temp_f18 = (f32) temp_t0;
    phi_f18 = temp_f18;
    if ((s32) temp_t0 < 0) {
        phi_f18 = temp_f18 + 4294967296.0f;
    }
    if ((((u32) (((phi_f6 * 60.0f) + phi_f18) * 45.5f) - 0x3FFC) & 0xFFFF) < ((gSaveContext.time - 0x3FFC) & 0xFFFF)) {
        *arg2 = temp_v1 + (s16) ((temp_v1->unk3 << 8) | temp_v1->unk4);
    }
    return 0;
}

? func_8010B664(s32 arg0, ? arg1, void **arg2, ? arg3) {
    f32 temp_f18;
    f32 temp_f6;
    u8 temp_t0;
    u8 temp_t9;
    void *temp_v1;
    f32 phi_f6;
    f32 phi_f18;

    temp_v1 = *arg2;
    temp_t9 = temp_v1->unk1;
    temp_f6 = (f32) temp_t9;
    phi_f6 = temp_f6;
    if ((s32) temp_t9 < 0) {
        phi_f6 = temp_f6 + 4294967296.0f;
    }
    temp_t0 = temp_v1->unk2;
    temp_f18 = (f32) temp_t0;
    phi_f18 = temp_f18;
    if ((s32) temp_t0 < 0) {
        phi_f18 = temp_f18 + 4294967296.0f;
    }
    if ((((u32) (((phi_f6 * 60.0f) + phi_f18) * 45.5f) - 0x3FFC) & 0xFFFF) >= ((gSaveContext.time - 0x3FFC) & 0xFFFF)) {
        *arg2 = temp_v1 + (s16) ((temp_v1->unk3 << 8) | temp_v1->unk4);
    }
    return 0;
}

? func_8010B7A8(s32 arg0, GlobalContext *arg1, void **arg2, ? arg3) {
    s16 sp18;
    void *temp_v0;

    temp_v0 = *arg2;
    sp18 = (temp_v0->unk3 << 8) | temp_v0->unk4;
    if (Flags_GetSwitch(arg1, (s32) (s16) ((temp_v0->unk1 << 8) | temp_v0->unk2)) != 0) {
        *arg2 += sp18;
    }
    return 0;
}

? func_8010B828(s32 arg0, GlobalContext *arg1, void **arg2, ? arg3) {
    void *temp_v0;

    temp_v0 = *arg2;
    Actor_SetSwitchFlag(arg1, (s32) (s16) ((temp_v0->unk1 << 8) | temp_v0->unk2));
    return 0;
}

? func_8010B878(s32 arg0, ? arg1, void **arg2, ? arg3) {
    s32 temp_a0;
    void *temp_v1;

    temp_v1 = *arg2;
    temp_a0 = ((temp_v1->unk1 << 8) | temp_v1->unk2) & 0xFFFF;
    if (temp_a0 == gSaveContext.inventory.items[gItemSlots[temp_a0]]) {
        *arg2 = temp_v1 + (s16) ((temp_v1->unk3 << 8) | temp_v1->unk4);
    }
    return 0;
}

? func_8010B8E4(s32 arg0, ? arg1, void **arg2, ? arg3) {
    f32 temp_f16;
    f32 temp_f4;
    f32 temp_f6;
    s32 temp_t0;
    u8 temp_t1;
    u8 temp_t4;
    u8 temp_t9;
    void *temp_v1;
    f32 phi_f6;
    f32 phi_f16;
    f32 phi_f4;

    temp_v1 = *arg2;
    temp_t9 = temp_v1->unk1;
    temp_f6 = (f32) temp_t9;
    phi_f6 = temp_f6;
    if ((s32) temp_t9 < 0) {
        phi_f6 = temp_f6 + 4294967296.0f;
    }
    temp_t1 = temp_v1->unk2;
    temp_f16 = (f32) temp_t1;
    phi_f16 = temp_f16;
    if ((s32) temp_t1 < 0) {
        phi_f16 = temp_f16 + 4294967296.0f;
    }
    temp_t4 = temp_v1->unk4;
    temp_f4 = (f32) temp_t4;
    phi_f4 = temp_f4;
    if ((s32) temp_t4 < 0) {
        phi_f4 = temp_f4 + 4294967296.0f;
    }
    temp_t0 = (gSaveContext.time - 0x3FFC) & 0xFFFF;
    if (((((u32) (((phi_f6 * 60.0f) + phi_f16) * 45.5f) - 0x3FFC) & 0xFFFF) >= temp_t0) || (temp_t0 >= (((u32) ((((f32) temp_v1->unk3 * 60.0f) + phi_f4) * 45.5f) - 0x3FFD) & 0xFFFF))) {
        *arg2 = temp_v1 + (s16) ((temp_v1->unk5 << 8) | temp_v1->unk6);
    }
    return 0;
}

? func_8010BB0C(s32 arg0, ? arg1, void **arg2, ? arg3) {
    void *temp_v1;

    temp_v1 = *arg2;
    if ((s16) ((temp_v1->unk1 << 8) | temp_v1->unk2) == gSaveContext.day) {
        *arg2 = temp_v1 + (s16) ((temp_v1->unk3 << 8) | temp_v1->unk4);
    }
    return 0;
}

? func_8010BB6C(void **arg2, s32 (*arg3)()) {
    s16 sp1A;
    s16 temp_v1;
    void *temp_v0;

    temp_v0 = *arg2;
    temp_v1 = (temp_v0->unk1 << 8) | temp_v0->unk2;
    if (arg3 != 0) {
        sp1A = temp_v1;
        if (arg3() != 0) {
            *arg2 += temp_v1;
        }
    }
    return 0;
}

? func_8010BBCC(s32 arg0, void *arg1, void **arg2, ? arg3) {
    void *temp_v1;

    temp_v1 = *arg2;
    if ((gSaveContext.inventory.ammo[gItemSlots[0xC]] != 0) || ((arg1->unk1CA5 & 1) != 0)) {
        *arg2 = temp_v1 + (s16) ((temp_v1->unk1 << 8) | temp_v1->unk2);
    }
    return 0;
}

? func_8010BC28(s32 arg0, ? arg1, void **arg2, ? arg3) {
    s16 temp_a0;
    void *temp_v0;

    temp_v0 = *arg2;
    temp_a0 = (temp_v0->unk1 << 8) | temp_v0->unk2;
    func_801149A0(temp_a0, gItemSlots[temp_a0]);
    return 0;
}

? func_8010BC7C(void **arg2, s32 (*arg3)()) {
    void *sp1C;
    s32 phi_v1;
    s16 phi_a0;

    phi_v1 = 1;
    if (arg3 != 0) {
        sp1C = *arg2;
        phi_v1 = arg3();
    }
    if (phi_v1 != 1) {
        if (phi_v1 != 2) {
            if (phi_v1 == 3) {
                phi_a0 = (s16) (((*arg2)->unk5 << 8) | (*arg2)->unk6);
                goto block_9;
            }
            return 1;
        }
        phi_a0 = (s16) (((*arg2)->unk3 << 8) | (*arg2)->unk4);
        goto block_9;
    }
    phi_a0 = (s16) (((*arg2)->unk1 << 8) | (*arg2)->unk2);
block_9:
    *arg2 += phi_a0;
    return 0;
}

? func_8010BD48(s32 arg0, GlobalContext *arg1, void **arg2, ? arg3) {
    void *temp_v0;

    temp_v0 = *arg2;
    arg1->actorCtx.actorList[2].first->unk116 = (s16) ((temp_v0->unk1 << 8) | temp_v0->unk2);
    func_801477B4(arg1);
    return 0;
}

? func_8010BD90(s32 arg0, GlobalContext *arg1, void **arg2, ? arg3) {
    void *temp_v0;

    temp_v0 = *arg2;
    func_80151BB4(arg1, ((temp_v0->unk1 << 8) | temp_v0->unk2) & 0xFF);
    return 0;
}

? func_8010BDDC(s32 arg0, GlobalContext *arg1, ? arg2, ? arg3) {
    u8 temp_v0;

    temp_v0 = func_80152498(arg1 + 0x4908);
    if (temp_v0 != 2) {
        if ((temp_v0 != 4) && (temp_v0 != 5)) {
            if (temp_v0 != 6) {
                return 1;
            }
            goto block_7;
        }
        if (func_80147624(arg1) == 0) {
            return 1;
        }
block_7:
        if (func_80147624(arg1) == 0) {
            return 1;
        }
        goto block_10;
    }
block_10:
    return 0;
}

? func_8010BE78(s32 arg0, ? arg1, void **arg2, ? arg3) {
    void *temp_a0;
    void *temp_t9;

    temp_a0 = *arg2;
    temp_t9 = temp_a0 + (s16) ((temp_a0->unk1 << 8) | temp_a0->unk2);
    *arg2 = temp_t9;
    *arg2 = temp_t9 + 3;
    return 1;
}

? func_8010BEBC(s32 arg0, ? arg1, ? arg2, ? arg3) {
    func_8019F208();
    return 0;
}

? func_8010BEF0(s32 arg0, ? arg1, ? arg2, ? arg3) {
    func_8019F230();
    return 0;
}

? func_8010BF24(s32 arg0, ? arg1, ? arg2, ? arg3) {
    play_sound(0x4806U);
    return 0;
}

/*
Failed to decompile function func_8010BF58:

Label L8010C03C refers to a delay slot; this is currently not supported.
Please modify the assembly to work around it (e.g. copy the instruction
to all jump sources and move the label, or add a nop to the delay slot).
*/
