struct _mips2c_stack_OLib_ClampMaxDist {};          /* size 0x0 */

struct _mips2c_stack_OLib_ClampMinDist {};          /* size 0x0 */

struct _mips2c_stack_OLib_DbCameraVec3fDiff {
    /* 0x00 */ char pad_0[0x30];
    /* 0x30 */ ? sp30;                              /* inferred */
    /* 0x30 */ char pad_30[0x6];
    /* 0x36 */ s16 sp36;                            /* inferred */
};                                                  /* size = 0x38 */

struct _mips2c_stack_OLib_DbCameraVec3fSum {
    /* 0x00 */ char pad_0[0x28];
    /* 0x28 */ ? sp28;                              /* inferred */
    /* 0x28 */ char pad_28[0x6];
    /* 0x2E */ s16 sp2E;                            /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_OLib_Vec3fDiffBinAng {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ s16 sp1C;                            /* inferred */
    /* 0x1E */ s16 sp1E;                            /* inferred */
    /* 0x20 */ s16 sp20;                            /* inferred */
    /* 0x22 */ char pad_22[0x2];
    /* 0x24 */ f32 sp24;                            /* inferred */
    /* 0x28 */ f32 sp28;                            /* inferred */
    /* 0x2C */ char pad_2C[0x4];
};                                                  /* size = 0x30 */

struct _mips2c_stack_OLib_Vec3fDiffDegF {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ f32 sp18;                            /* inferred */
    /* 0x1C */ f32 sp1C;                            /* inferred */
    /* 0x20 */ f32 sp20;                            /* inferred */
    /* 0x24 */ f32 sp24;                            /* inferred */
    /* 0x28 */ f32 sp28;                            /* inferred */
    /* 0x2C */ char pad_2C[0x4];
};                                                  /* size = 0x30 */

struct _mips2c_stack_OLib_Vec3fDiffRad {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ f32 sp1C;                            /* inferred */
    /* 0x20 */ f32 sp20;                            /* inferred */
    /* 0x24 */ f32 sp24;                            /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_OLib_Vec3fDiffToVecSph {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ f32 sp1C;                            /* inferred */
    /* 0x20 */ f32 sp20;                            /* inferred */
    /* 0x24 */ f32 sp24;                            /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_OLib_Vec3fDiffToVecSphGeo {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ f32 sp1C;                            /* inferred */
    /* 0x20 */ f32 sp20;                            /* inferred */
    /* 0x24 */ f32 sp24;                            /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_OLib_Vec3fDist {};             /* size 0x0 */

struct _mips2c_stack_OLib_Vec3fDistNormalize {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ f32 sp20;                            /* inferred */
    /* 0x24 */ f32 sp24;                            /* inferred */
    /* 0x28 */ f32 sp28;                            /* inferred */
    /* 0x2C */ f32 sp2C;                            /* inferred */
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ f32 sp34;                            /* inferred */
};                                                  /* size = 0x38 */

struct _mips2c_stack_OLib_Vec3fDistOutDiff {};      /* size 0x0 */

struct _mips2c_stack_OLib_Vec3fDistXZ {};           /* size 0x0 */

struct _mips2c_stack_OLib_Vec3fToVecSph {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ f32 sp20;                            /* inferred */
    /* 0x24 */ f32 sp24;                            /* inferred */
    /* 0x28 */ f32 sp28;                            /* inferred */
    /* 0x2C */ s16 sp2C;                            /* inferred */
    /* 0x2E */ s16 sp2E;                            /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_OLib_Vec3fToVecSphGeo {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ ? sp18;                              /* inferred */
    /* 0x18 */ char pad_18[0x4];
    /* 0x1C */ s16 sp1C;                            /* inferred */
    /* 0x1E */ char pad_1E[0x2];
};                                                  /* size = 0x20 */

struct _mips2c_stack_OLib_VecSphAddToVec3f {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ f32 sp18;                            /* inferred */
    /* 0x1C */ f32 sp1C;                            /* inferred */
    /* 0x20 */ f32 sp20;                            /* inferred */
    /* 0x24 */ f32 sp24;                            /* inferred */
    /* 0x28 */ f32 sp28;                            /* inferred */
    /* 0x2C */ f32 sp2C;                            /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_OLib_VecSphGeoToVec3f {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ f32 sp18;                            /* inferred */
    /* 0x1C */ s16 sp1C;                            /* inferred */
    /* 0x1E */ s16 sp1E;                            /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_OLib_VecSphToVec3f {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ f32 sp24;                            /* inferred */
    /* 0x28 */ char pad_28[0x4];
    /* 0x2C */ f32 sp2C;                            /* inferred */
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ f32 sp3C;                            /* inferred */
};                                                  /* size = 0x40 */

f32 OLib_Vec3fDist(Vec3f *a, Vec3f *b) {
    f32 temp_f12;
    f32 temp_f14;
    f32 temp_f2;

    temp_f2 = a->x - b->x;
    temp_f12 = a->y - b->y;
    temp_f14 = a->z - b->z;
    return sqrtf((temp_f2 * temp_f2) + (temp_f12 * temp_f12) + (temp_f14 * temp_f14));
}

f32 OLib_Vec3fDistOutDiff(Vec3f *a, Vec3f *b, Vec3f *dest) {
    f32 temp_f12;
    f32 temp_f14;
    f32 temp_f2;

    dest->x = a->x - b->x;
    temp_f2 = dest->x;
    dest->y = a->y - b->y;
    temp_f12 = dest->y;
    dest->z = a->z - b->z;
    temp_f14 = dest->z;
    return sqrtf((temp_f2 * temp_f2) + (temp_f12 * temp_f12) + (temp_f14 * temp_f14));
}

f32 OLib_Vec3fDistXZ(Vec3f *a, Vec3f *b) {
    f32 temp_f12;
    f32 temp_f2;

    temp_f2 = a->x - b->x;
    temp_f12 = a->z - b->z;
    return sqrtf((temp_f2 * temp_f2) + (temp_f12 * temp_f12));
}

f32 OLib_ClampMinDist(f32 val, f32 min) {
    f32 temp_f0;
    f32 phi_f2;

    if (val < 0.0f) {
        temp_f0 = -min;
        if (temp_f0 < val) {
            return temp_f0;
        }
        return val;
    }
    if (val < min) {
        phi_f2 = min;
    } else {
        phi_f2 = val;
    }
    return phi_f2;
}

f32 OLib_ClampMaxDist(f32 val, f32 max) {
    f32 temp_f0;
    f32 phi_f2;

    if (val < 0.0f) {
        temp_f0 = -max;
        if (val < temp_f0) {
            return temp_f0;
        }
        return val;
    }
    if (max < val) {
        phi_f2 = max;
    } else {
        phi_f2 = val;
    }
    return phi_f2;
}

Vec3f *OLib_Vec3fDistNormalize(Vec3f *dest, Vec3f *a, Vec3f *b) {
    f32 sp34;
    f32 sp30;
    f32 sp2C;
    f32 sp28;
    f32 sp24;
    f32 sp20;
    f32 *temp_t6;
    f32 temp_f0;
    f32 temp_f10;
    f32 temp_f16;
    f32 temp_f18;
    f32 temp_f2;

    temp_f2 = b->x - a->x;
    temp_f16 = b->y - a->y;
    temp_f18 = b->z - a->z;
    sp30 = temp_f16;
    sp34 = temp_f18;
    sp2C = temp_f2;
    temp_f0 = OLib_ClampMinDist(sqrtf((temp_f2 * temp_f2) + (temp_f16 * temp_f16) + (temp_f18 * temp_f18)), 0.01f);
    temp_t6 = &sp20;
    temp_f10 = temp_f16 / temp_f0;
    sp20 = temp_f2 / temp_f0;
    sp24 = temp_f10;
    sp28 = temp_f18 / temp_f0;
    dest->x = temp_t6->unk_0;
    dest->y = temp_t6->unk_4;
    dest->z = temp_t6->unk_8;
    return dest;
}

Vec3f *OLib_VecSphToVec3f(Vec3f *dest, VecSph *sph) {
    f32 sp3C;
    f32 sp38;
    f32 sp34;
    f32 sp30;
    f32 sp2C;
    f32 sp24;
    f32 *temp_t6;

    sp2C = Math_CosS(sph->pitch);
    sp24 = Math_CosS(sph->yaw);
    sp30 = Math_SinS(sph->pitch);
    temp_t6 = &sp34;
    sp34 = sph->r * sp30 * Math_SinS(sph->yaw);
    sp38 = sph->r * sp2C;
    sp3C = sph->r * sp30 * sp24;
    dest->x = temp_t6->unk_0;
    dest->y = temp_t6->unk_4;
    dest->z = temp_t6->unk_8;
    return dest;
}

Vec3f *OLib_VecSphGeoToVec3f(Vec3f *dest, VecSph *sph) {
    s16 sp1E;
    s16 sp1C;
    f32 sp18;
    f32 *temp_a1;

    temp_a1 = &sp18;
    sp18 = sph->r;
    sp1C = 0x4000 - sph->pitch;
    sp1E = sph->yaw;
    return OLib_VecSphToVec3f(dest, (VecSph *) temp_a1);
}

VecSph *OLib_Vec3fToVecSph(VecSph *dest, Vec3f *vec) {
    s16 sp2E;
    s16 sp2C;
    f32 sp28;
    f32 sp24;
    f32 sp20;
    f32 temp_f0;
    f32 temp_f12;
    f32 temp_f12_2;
    f32 temp_f16;
    f32 temp_f2;
    f32 temp_f2_2;
    f32 temp_f4;
    f32 temp_f6;
    s32 temp_cond;

    temp_f12 = vec->x;
    temp_f2 = vec->z;
    temp_f4 = temp_f12 * temp_f12;
    temp_f6 = temp_f2 * temp_f2;
    temp_f16 = temp_f4 + temp_f6;
    temp_f0 = sqrtf(temp_f16);
    temp_cond = temp_f0 == 0.0f;
    sp20 = temp_f0;
    if (temp_cond && (vec->y == 0.0f)) {
        sp2C = 0;
    } else {
        sp24 = temp_f16;
        sp2C = (s16) (s32) ((func_80086B30(sp20, vec->y) * 57.295776f * 182.04167f) + 0.5f);
    }
    temp_f2_2 = vec->y;
    sp28 = sqrtf((temp_f2_2 * temp_f2_2) + (temp_f4 + temp_f6));
    temp_f12_2 = vec->x;
    if ((temp_f12_2 == 0.0f) && (vec->z == 0.0f)) {
        sp2E = 0;
    } else {
        sp2E = (s16) (s32) ((func_80086B30(temp_f12_2, vec->z) * 57.295776f * 182.04167f) + 0.5f);
    }
    dest->r = sp28.unk_0;
    dest->unk_4 = (s32) sp28.unk_4;
    return dest;
}

VecSph *OLib_Vec3fToVecSphGeo(VecSph *dest, Vec3f *vec) {
    s16 sp1C;
    ? sp18;

    OLib_Vec3fToVecSph((VecSph *) &sp18, vec);
    sp1C = 0x4000 - sp1C;
    dest->r = sp18.unk_0;
    dest->unk_4 = (s32) sp18.unk_4;
    return dest;
}

VecSph *OLib_Vec3fDiffToVecSph(VecSph *dest, Vec3f *a, Vec3f *b) {
    f32 sp24;
    f32 sp20;
    f32 sp1C;
    f32 *temp_a1;

    temp_a1 = &sp1C;
    sp1C = b->x - a->x;
    sp20 = b->y - a->y;
    sp24 = b->z - a->z;
    return OLib_Vec3fToVecSph(dest, (Vec3f *) temp_a1);
}

VecSph *OLib_Vec3fDiffToVecSphGeo(VecSph *dest, Vec3f *a, Vec3f *b) {
    f32 sp24;
    f32 sp20;
    f32 sp1C;
    f32 *temp_a1;

    temp_a1 = &sp1C;
    sp1C = b->x - a->x;
    sp20 = b->y - a->y;
    sp24 = b->z - a->z;
    return OLib_Vec3fToVecSphGeo(dest, (Vec3f *) temp_a1);
}

Vec3f *OLib_VecSphAddToVec3f(Vec3f *dest, Vec3f *a, VecSph *sph) {
    f32 sp2C;
    f32 sp28;
    f32 sp24;
    f32 sp18;
    f32 *temp_t6;

    a = a;
    OLib_VecSphGeoToVec3f((Vec3f *) &sp18, sph);
    temp_t6 = &sp24;
    sp24 = a->x + sp18;
    sp28 = a->y + sp1C;
    sp2C = a->z + sp20;
    dest->x = temp_t6->unk_0;
    dest->y = temp_t6->unk_4;
    dest->z = temp_t6->unk_8;
    return dest;
}

Vec3f *OLib_Vec3fDiffRad(Vec3f *dest, Vec3f *a, Vec3f *b) {
    f32 sp24;
    f32 sp20;
    f32 sp1C;

    sp1C = func_80086B30(b->z - a->z, b->y - a->y);
    sp20 = func_80086B30(b->x - a->x, b->z - a->z);
    sp24 = 0.0f;
    dest->x = sp1C.unk_0;
    dest->y = sp1C.unk_4;
    dest->z = sp1C.unk_8;
    return dest;
}

Vec3f *OLib_Vec3fDiffDegF(Vec3f *dest, Vec3f *a, Vec3f *b) {
    f32 sp24;
    f32 sp20;
    f32 sp1C;
    f32 sp18;
    f32 *temp_t6;

    OLib_Vec3fDiffRad((Vec3f *) &sp24, a, b);
    temp_t6 = &sp18;
    sp20 = 0.0f;
    sp18 = sp24 * 57.295776f;
    sp1C = sp28 * 57.295776f;
    dest->x = temp_t6->unk_0;
    dest->y = temp_t6->unk_4;
    dest->z = temp_t6->unk_8;
    return dest;
}

Vec3s *OLib_Vec3fDiffBinAng(Vec3s *dest, Vec3f *a, Vec3f *b) {
    f32 sp24;
    s16 sp20;
    s16 sp1E;
    s16 sp1C;
    s16 *temp_t0;

    OLib_Vec3fDiffRad((Vec3f *) &sp24, a, b);
    sp20 = 0;
    temp_t0 = &sp1C;
    sp1C = (s16) (s32) ((sp24 * 57.295776f * 182.04167f) + 0.5f);
    sp1E = (s16) (s32) ((sp28 * 57.295776f * 182.04167f) + 0.5f);
    dest->unk_0 = (unaligned s32) temp_t0->unk_0;
    dest->z = (s16) temp_t0->unk_4;
    return dest;
}

void OLib_DbCameraVec3fDiff(PosRot *a, Vec3f *b, Vec3f *dest, s16 mode) {
    s16 sp36;
    ? sp30;

    if (mode != 1) {
        if (mode != 2) {
            dest->x = b->x;
            dest->y = b->y;
            dest->z = b->z;
            return;
        }
        dest->x = b->x - a->pos.x;
        dest->y = b->y - a->pos.y;
        dest->z = b->z - a->pos.z;
        return;
    }
    OLib_Vec3fDiffToVecSphGeo((VecSph *) &sp30, (Vec3f *) a, b);
    sp36 -= a->rot.y;
    OLib_VecSphGeoToVec3f(dest, (VecSph *) &sp30);
}

void OLib_DbCameraVec3fSum(PosRot *a, Vec3f *b, Vec3f *dest, s16 mode) {
    s16 sp2E;
    ? sp28;

    if (mode != 1) {
        if (mode != 2) {
            dest->x = b->x;
            dest->y = b->y;
            dest->z = b->z;
            return;
        }
        dest->x = a->pos.x + b->x;
        dest->y = a->pos.y + b->y;
        dest->z = a->pos.z + b->z;
        return;
    }
    OLib_Vec3fToVecSphGeo((VecSph *) &sp28, b);
    sp2E += a->rot.y;
    OLib_VecSphAddToVec3f(dest, (Vec3f *) a, (VecSph *) &sp28);
}
