CRASHED

typedef struct GlobalContext {
    /* 0x00000 */ GameState state;
    /* 0x000A4 */ s16 sceneNum;
    /* 0x000A6 */ u8 sceneConfig;
    /* 0x000A7 */ char pad_A7[0x9];                 /* maybe part of sceneConfig[10]? */
    /* 0x000B0 */ void *sceneSegment;
    /* 0x000B4 */ char pad_B4[0x4];
    /* 0x000B8 */ View view;
    /* 0x00220 */ Camera mainCamera;
    /* 0x00398 */ Camera subCameras[3];
    /* 0x00800 */ Camera *cameraPtrs[4];
    /* 0x00810 */ s16 activeCamera;
    /* 0x00812 */ s16 nextCamera;
    /* 0x00814 */ SoundContext soundCtx;
    /* 0x00817 */ char pad_817[0x1];
    /* 0x00818 */ LightContext lightCtx;
    /* 0x00828 */ FrameAdvanceContext frameAdvCtx;
    /* 0x00830 */ CollisionContext colCtx;
    /* 0x01CA0 */ ActorContext actorCtx;
    /* 0x01F24 */ CutsceneContext csCtx;
    /* 0x01F78 */ SoundSource soundSources[16];
    /* 0x02138 */ EffFootmark footprintInfo[100];
    /* 0x046B8 */ SramContext sramCtx;
    /* 0x046E0 */ SkyboxContext skyboxCtx;
    /* 0x04908 */ MessageContext msgCtx;
    /* 0x169E8 */ InterfaceContext interfaceCtx;
    /* 0x16D30 */ PauseContext pauseCtx;
    /* 0x17000 */ GameOverContext gameOverCtx;
    /* 0x17002 */ char pad_17002[0x2];
    /* 0x17004 */ EnvironmentContext envCtx;
    /* 0x17104 */ AnimationContext animationCtx;
    /* 0x17D88 */ ObjectContext objectCtx;
    /* 0x186E0 */ RoomContext roomCtx;
    /* 0x18760 */ DoorContext doorCtx;
    /* 0x18768 */ void (*playerInit)(Player *, GlobalContext *, FlexSkeletonHeader *);
    /* 0x1876C */ void (*playerUpdate)(Player *, GlobalContext *, Input *);
    /* 0x18770 */ void *unk_18770;
    /* 0x18774 */ s32 (*startPlayerFishing)(GlobalContext *);
    /* 0x18778 */ s32 (*grabPlayer)(GlobalContext *, Player *);
    /* 0x1877C */ s32 (*startPlayerCutscene)(GlobalContext *, Player *, s32);
    /* 0x18780 */ void (*func_18780)(Player *, GlobalContext *);
    /* 0x18784 */ s32 (*damagePlayer)(GlobalContext *, s32);
    /* 0x18788 */ void (*talkWithPlayer)(GlobalContext *, Actor *);
    /* 0x1878C */ void (*unk_1878C)(GlobalContext *);
    /* 0x18790 */ void (*unk_18790)(GlobalContext *, s16, Actor *);
    /* 0x18794 */ void *unk_18794;
    /* 0x18798 */ s32 (*setPlayerTalkAnim)(GlobalContext *, void *, s32);
    /* 0x1879C */ s16 unk_1879C[10];
    /* 0x187B0 */ MtxF projectionMatrix;
    /* 0x187F0 */ Vec3f unk_187F0;
    /* 0x187FC */ MtxF mf_187FC;
    /* 0x1883C */ Mtx *unk_1883C;
    /* 0x18840 */ u32 gameplayFrames;
    /* 0x18844 */ u8 unk_18844;
    /* 0x18845 */ u8 unk_18845;
    /* 0x18846 */ s16 numSetupActors;
    /* 0x18848 */ u8 numRooms;
    /* 0x18849 */ char pad_18849[0x3];              /* maybe part of numRooms[4]? */
    /* 0x1884C */ RomFile *roomList;
    /* 0x18850 */ ActorEntry *linkActorEntry;
    /* 0x18854 */ ActorEntry *setupActorList;
    /* 0x18858 */ void *unk_18858;
    /* 0x1885C */ EntranceEntry *setupEntranceList;
    /* 0x18860 */ u16 *setupExitList;
    /* 0x18864 */ Path *setupPathList;
    /* 0x18868 */ void *unk_18868;
    /* 0x1886C */ AnimatedMaterial *sceneMaterialAnims;
    /* 0x18870 */ void *specialEffects;
    /* 0x18874 */ u8 skyboxId;
    /* 0x18875 */ s8 sceneLoadFlag;
    /* 0x18876 */ s16 unk_18876;
    /* 0x18878 */ s16 bgCoverAlpha;
    /* 0x1887A */ u16 nextEntranceIndex;
    /* 0x1887C */ s8 unk_1887C;
    /* 0x1887D */ s8 unk_1887D;
    /* 0x1887E */ s8 unk_1887E;
    /* 0x1887F */ u8 unk_1887F;
    /* 0x18880 */ u8 unk_18880;
    /* 0x18881 */ char pad_18881[0x3];              /* maybe part of unk_18880[4]? */
    /* 0x18884 */ CollisionCheckContext colChkCtx;
    /* 0x18B20 */ u16 envFlags[20];
    /* 0x18B48 */ u8 curSpawn;
    /* 0x18B49 */ u8 unk_18B49;
    /* 0x18B4A */ u8 unk_18B4A;
    /* 0x18B4B */ char pad_18B4B[0x1];
    /* 0x18B4C */ PreRender pauseBgPreRender;
    /* 0x18B9C */ char pad_18B9C[0x2B8];            /* maybe part of pauseBgPreRender[9]? */
    /* 0x18E54 */ SceneTableEntry *loadedScene;
    /* 0x18E58 */ char pad_18E58[0x4];
    /* 0x18E5C */ s32 unk_18E5C;                    /* inferred */
    /* 0x18E60 */ char pad_18E60[0x3F8];            /* maybe part of unk_18E5C[255]? */
} GlobalContext;                                    /* size = 0x19258 */

typedef struct {
    /* 0x00000 */ View view;
    /* 0x00168 */ Font font;
    /* 0x11EF4 */ char pad_11EF4[0x10];
    /* 0x11F04 */ u16 unk11F04;
    /* 0x11F06 */ char pad_11F06[0x4];              /* maybe part of unk11F04[3]? */
    /* 0x11F0A */ u8 unk11F0A;
    /* 0x11F0B */ char pad_11F0B[0x5];              /* maybe part of unk11F0A[6]? */
    /* 0x11F10 */ s32 unk11F10;
    /* 0x11F14 */ char pad_11F14[0xE];              /* maybe part of unk11F10[4]? */
    /* 0x11F22 */ u8 unk11F22;
    /* 0x11F23 */ char pad_11F23[0xFD];             /* maybe part of unk11F22[254]? */
    /* 0x12020 */ u8 unk12020;
    /* 0x12021 */ u8 choiceIndex;
    /* 0x12022 */ char pad_12022[0x1];
    /* 0x12023 */ s8 unk12023;
    /* 0x12024 */ char pad_12024[0x6];              /* maybe part of unk12023[7]? */
    /* 0x1202A */ u16 unk1202A;
    /* 0x1202C */ u16 unk_1202C;                    /* inferred */
    /* 0x1202E */ u16 unk1202E;
    /* 0x12030 */ char pad_12030[0x14];             /* maybe part of unk1202E[11]? */
    /* 0x12044 */ s16 unk12044;
    /* 0x12046 */ char pad_12046[0x24];             /* maybe part of unk12044[19]? */
    /* 0x1206A */ s16 unk1206A;
    /* 0x1206C */ s32 unk1206C;
    /* 0x12070 */ char pad_12070[0x8];              /* maybe part of unk1206C[3]? */
    /* 0x12078 */ s32 bankRupeesSelected;
    /* 0x1207C */ s32 bankRupees;
    /* 0x12080 */ char pad_12080[0x31];             /* maybe part of bankRupees[13]? */
    /* 0x120B1 */ u8 unk120B1;
    /* 0x120B2 */ char pad_120B2[0x2E];             /* maybe part of unk120B1[47]? */
} MessageContext;                                   /* size = 0x120E0 */

struct _mips2c_stack_Interface_ChangeAlpha {};      /* size 0x0 */

struct _mips2c_stack_Parameter_AddMagic {};         /* size 0x0 */

struct _mips2c_stack_func_8010CB80 {};              /* size 0x0 */

struct _mips2c_stack_func_8010CD98 {};              /* size 0x0 */

struct _mips2c_stack_func_8010CFBC {};              /* size 0x0 */

struct _mips2c_stack_func_8010D2D4 {};              /* size 0x0 */

struct _mips2c_stack_func_8010D480 {
    /* 0x00 */ void *sp0;                           /* inferred */
    /* 0x04 */ void *sp4;                           /* inferred */
    /* 0x08 */ char pad_8[0x30];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_8010D7D0 {};              /* size 0x0 */

struct _mips2c_stack_func_8010D9F4 {};              /* size 0x0 */

struct _mips2c_stack_func_8010DC58 {};              /* size 0x0 */

struct _mips2c_stack_func_8010DE38 {};              /* size 0x0 */

struct _mips2c_stack_func_8010E028 {
    /* 0x00 */ char pad_0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_8010E968 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ s32 sp1C;                            /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_8010E9F0 {
    /* 0x00 */ s32 sp0;                             /* inferred */
    /* 0x04 */ s32 sp4;                             /* inferred */
    /* 0x08 */ char pad_8[0x8];
};                                                  /* size = 0x10 */

struct _mips2c_stack_func_8010EA9C {
    /* 0x0 */ s32 sp0;                              /* inferred */
    /* 0x4 */ s32 sp4;                              /* inferred */
};                                                  /* size = 0x8 */

struct _mips2c_stack_func_8010EB50 {};              /* size 0x0 */

struct _mips2c_stack_func_8010EBA0 {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ s32 sp18;                            /* inferred */
    /* 0x1C */ s32 sp1C;                            /* inferred */
    /* 0x20 */ char pad_20[0x4];
    /* 0x24 */ void *sp24;                          /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_8010EC54 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ s16 sp1C;                            /* inferred */
    /* 0x1E */ s16 sp1E;                            /* inferred */
    /* 0x20 */ s16 sp20;                            /* inferred */
    /* 0x22 */ s16 sp22;                            /* inferred */
    /* 0x24 */ char pad_24[0x4];                    /* maybe part of sp22[3]? */
    /* 0x28 */ s32 sp28;                            /* inferred */
    /* 0x2C */ u32 sp2C;                            /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_8010EE74 {
    /* 0x00 */ char pad_0[0x1A];
    /* 0x1A */ s16 sp1A;                            /* inferred */
    /* 0x1C */ char pad_1C[0x4];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_8010EF9C {};              /* size 0x0 */

struct _mips2c_stack_func_8010F0D4 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8010F1A8 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ void *sp1C;                          /* inferred */
    /* 0x20 */ char pad_20[0x2];
    /* 0x22 */ s16 sp22;                            /* inferred */
    /* 0x24 */ char pad_24[0x4];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80110038 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ SaveContext *sp1C;                   /* inferred */
    /* 0x20 */ char pad_20[0x8];                    /* maybe part of sp1C[3]? */
    /* 0x28 */ InterfaceContext *sp28;              /* inferred */
    /* 0x2C */ char pad_2C[0x44];                   /* maybe part of sp28[18]? */
    /* 0x70 */ s16 sp70;                            /* inferred */
    /* 0x72 */ s16 sp72;                            /* inferred */
    /* 0x74 */ SaveContext *sp74;                   /* inferred */
    /* 0x78 */ char pad_78[0x8];
};                                                  /* size = 0x80 */

struct _mips2c_stack_func_80111CB4 {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ void *sp18;                          /* inferred */
    /* 0x1C */ char pad_1C[0xC];                    /* maybe part of sp18[4]? */
    /* 0x28 */ s32 sp28;                            /* inferred */
    /* 0x2C */ char pad_2C[0x4];
    /* 0x30 */ void *sp30;                          /* inferred */
    /* 0x34 */ char pad_34[0x4];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_801129E4 {};              /* size 0x0 */

struct _mips2c_stack_func_80112AF4 {};              /* size 0x0 */

struct _mips2c_stack_func_80112AFC {};              /* size 0x0 */

struct _mips2c_stack_func_80112B40 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80112BE4 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80112C0C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80114978 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_801149A0 {};              /* size 0x0 */

struct _mips2c_stack_func_80114A9C {};              /* size 0x0 */

struct _mips2c_stack_func_80114B84 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80114CA0 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80114E90 {};              /* size 0x0 */

struct _mips2c_stack_func_80114F2C {};              /* size 0x0 */

struct _mips2c_stack_func_80114FD0 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ void *sp1C;                          /* inferred */
    /* 0x20 */ char pad_20[0x4];
    /* 0x24 */ s32 sp24;                            /* inferred */
    /* 0x28 */ char pad_28[0x8];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80115130 {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ s32 sp18;                            /* inferred */
    /* 0x1C */ char pad_1C[0xA];                    /* maybe part of sp18[3]? */
    /* 0x26 */ u8 sp26;                             /* inferred */
    /* 0x27 */ char pad_27[0x1];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_801152B8 {
    /* 0x00 */ char pad_0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_801153C8 {};              /* size 0x0 */

struct _mips2c_stack_func_80115428 {
    /* 0x00 */ char pad_0[0x34];
    /* 0x34 */ OSMesgQueue *sp34;                   /* inferred */
    /* 0x38 */ s32 sp38;                            /* inferred */
    /* 0x3C */ char pad_3C[0x4];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_8011552C {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ InterfaceContext *sp1C;              /* inferred */
    /* 0x20 */ char pad_20[0x8];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_801155B4 {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ OSMesgQueue *sp2C;                   /* inferred */
    /* 0x30 */ void *sp30;                          /* inferred */
    /* 0x34 */ char pad_34[0x14];
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_80115764 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ s32 sp1C;                            /* inferred */
    /* 0x20 */ void *sp20;                          /* inferred */
    /* 0x24 */ char pad_24[0x4];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80115844 {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ OSMesgQueue *sp2C;                   /* inferred */
    /* 0x30 */ InterfaceContext *sp30;              /* inferred */
    /* 0x34 */ char pad_34[0x4];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80115908 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_801159EC {};              /* size 0x0 */

struct _mips2c_stack_func_801159c0 {};              /* size 0x0 */

struct _mips2c_stack_func_80115A14 {};              /* size 0x0 */

struct _mips2c_stack_func_80115D5C {};              /* size 0x0 */

struct _mips2c_stack_func_80115DB4 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80116088 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80116114 {
    /* 0x00 */ s32 sp0;                             /* inferred */
    /* 0x04 */ s32 sp4;                             /* inferred */
    /* 0x08 */ s32 sp8;                             /* inferred */
    /* 0x0C */ char pad_C[0x28];                    /* maybe part of sp8[11]? */
    /* 0x34 */ s16 sp34;                            /* inferred */
    /* 0x36 */ char pad_36[0x2];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80116348 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80116918 {
    /* 0x00 */ char pad_0[0x4C];
    /* 0x4C */ void *sp4C;                          /* inferred */
    /* 0x50 */ char pad_50[0x8C];                   /* maybe part of sp4C[36]? */
    /* 0xDC */ GraphicsContext *spDC;               /* inferred */
    /* 0xE0 */ char pad_E0[0x2];
    /* 0xE2 */ s16 spE2;                            /* inferred */
    /* 0xE4 */ char pad_E4[0x4];
};                                                  /* size = 0xE8 */

struct _mips2c_stack_func_80116FD8 {
    /* 0x00 */ char pad_0[0x28];
    /* 0x28 */ f32 sp28;                            /* inferred */
    /* 0x2C */ f32 sp2C;                            /* inferred */
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ f32 sp3C;                            /* inferred */
    /* 0x40 */ f32 sp40;                            /* inferred */
    /* 0x44 */ f32 sp44;                            /* inferred */
    /* 0x48 */ f32 sp48;                            /* inferred */
    /* 0x4C */ char pad_4C[0x4];
};                                                  /* size = 0x50 */

struct _mips2c_stack_func_801170B8 {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ s32 sp18;                            /* inferred */
    /* 0x1C */ s32 sp1C;                            /* inferred */
    /* 0x20 */ s32 sp20;                            /* inferred */
    /* 0x24 */ s32 sp24;                            /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80117100 {
    /* 0x000 */ char pad_0[0x4C];
    /* 0x04C */ void *sp4C;                         /* inferred */
    /* 0x050 */ char pad_50[0xA6];                  /* maybe part of sp4C[42]? */
    /* 0x0F6 */ s16 spF6;                           /* inferred */
    /* 0x0F8 */ char pad_F8[0x8];                   /* maybe part of spF6[5]? */
    /* 0x100 */ void *sp100;                        /* inferred */
    /* 0x104 */ char pad_104[0x4];
};                                                  /* size = 0x108 */

struct _mips2c_stack_func_80117A20 {};              /* size 0x0 */

struct _mips2c_stack_func_80117BD0 {
    /* 0x00 */ char pad_0[0x30];
    /* 0x30 */ s32 sp30;                            /* inferred */
    /* 0x34 */ char pad_34[0x1C];                   /* maybe part of sp30[8]? */
    /* 0x50 */ GraphicsContext *sp50;               /* inferred */
    /* 0x54 */ char pad_54[0x4];
};                                                  /* size = 0x58 */

struct _mips2c_stack_func_80118084 {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ void *sp18;                          /* inferred */
    /* 0x1C */ char pad_1C[0x98];                   /* maybe part of sp18[39]? */
    /* 0xB4 */ GraphicsContext *spB4;               /* inferred */
    /* 0xB8 */ void *spB8;                          /* inferred */
    /* 0xBC */ char pad_BC[0x4];
};                                                  /* size = 0xC0 */

struct _mips2c_stack_func_80118890 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ GraphicsContext **sp1C;              /* inferred */
    /* 0x20 */ char pad_20[0x40];                   /* maybe part of sp1C[17]? */
    /* 0x60 */ GraphicsContext *sp60;               /* inferred */
    /* 0x64 */ char pad_64[0x4];
};                                                  /* size = 0x68 */

struct _mips2c_stack_func_80118BA4 {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ void *sp2C;                          /* inferred */
    /* 0x30 */ char pad_30[0x4];
    /* 0x34 */ Gfx *sp34;                           /* inferred */
    /* 0x38 */ char pad_38[0x30];                   /* maybe part of sp34[13]? */
    /* 0x68 */ Gfx *sp68;                           /* inferred */
    /* 0x6C */ char pad_6C[0x16];                   /* maybe part of sp68[6]? */
    /* 0x82 */ s16 sp82;                            /* inferred */
    /* 0x84 */ char pad_84[0x4];
};                                                  /* size = 0x88 */

struct _mips2c_stack_func_80119030 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ void *sp1C;                          /* inferred */
    /* 0x20 */ char pad_20[0x68];                   /* maybe part of sp1C[27]? */
    /* 0x88 */ GraphicsContext *sp88;               /* inferred */
    /* 0x8C */ char pad_8C[0xC];
};                                                  /* size = 0x98 */

struct _mips2c_stack_func_80119610 {
    /* 0x000 */ char pad_0[0x5C];
    /* 0x05C */ s32 sp5C;                           /* inferred */
    /* 0x060 */ s32 sp60;                           /* inferred */
    /* 0x064 */ RSPMatrix *sp64;                    /* inferred */
    /* 0x068 */ s32 *sp68;                          /* inferred */
    /* 0x06C */ u32 sp6C;                           /* inferred */
    /* 0x070 */ InterfaceContext *sp70;             /* inferred */
    /* 0x074 */ char pad_74[0x4C];                  /* maybe part of sp70[20]? */
    /* 0x0C0 */ Gfx *spC0;                          /* inferred */
    /* 0x0C4 */ char pad_C4[0x1C];                  /* maybe part of spC0[8]? */
    /* 0x0E0 */ Gfx *spE0;                          /* inferred */
    /* 0x0E4 */ char pad_E4[0xC];                   /* maybe part of spE0[4]? */
    /* 0x0F0 */ Gfx *spF0;                          /* inferred */
    /* 0x0F4 */ char pad_F4[0x10];                  /* maybe part of spF0[5]? */
    /* 0x104 */ Gfx *sp104;                         /* inferred */
    /* 0x108 */ char pad_108[0x38];                 /* maybe part of sp104[15]? */
    /* 0x140 */ Gfx *sp140;                         /* inferred */
    /* 0x144 */ char pad_144[0x68];                 /* maybe part of sp140[27]? */
    /* 0x1AC */ s16 sp1AC;                          /* inferred */
    /* 0x1AE */ s16 sp1AE;                          /* inferred */
    /* 0x1B0 */ s16 sp1B0;                          /* inferred */
    /* 0x1B2 */ s16 sp1B2;                          /* inferred */
    /* 0x1B4 */ s16 sp1B4;                          /* inferred */
    /* 0x1B6 */ s16 sp1B6;                          /* inferred */
    /* 0x1B8 */ s16 sp1B8;                          /* inferred */
    /* 0x1BA */ s16 sp1BA;                          /* inferred */
    /* 0x1BC */ char pad_1BC[0xA];                  /* maybe part of sp1BA[6]? */
    /* 0x1C6 */ s16 sp1C6;                          /* inferred */
    /* 0x1C8 */ char pad_1C8[0x4];                  /* maybe part of sp1C6[3]? */
    /* 0x1CC */ f32 sp1CC;                          /* inferred */
    /* 0x1D0 */ f32 sp1D0;                          /* inferred */
    /* 0x1D4 */ char pad_1D4[0x4];
    /* 0x1D8 */ f32 sp1D8;                          /* inferred */
    /* 0x1DC */ char pad_1DC[0xA];                  /* maybe part of sp1D8[3]? */
    /* 0x1E6 */ s16 sp1E6;                          /* inferred */
    /* 0x1E8 */ char pad_1E8[0x8];
};                                                  /* size = 0x1F0 */

struct _mips2c_stack_func_8011B4E0 {};              /* size 0x0 */

struct _mips2c_stack_func_8011B5C0 {
    /* 0x00 */ char pad_0[0x4];
    /* 0x04 */ s32 sp4;                             /* inferred */
    /* 0x08 */ char pad_8[0x28];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_8011B9E0 {
    /* 0x00 */ char pad_0[0x8];
    /* 0x08 */ s32 sp8;                             /* inferred */
    /* 0x0C */ s32 spC;                             /* inferred */
    /* 0x10 */ s32 sp10;                            /* inferred */
    /* 0x14 */ s32 sp14;                            /* inferred */
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8011BF70 {
    /* 0x00 */ char pad_0[0x4];
    /* 0x04 */ s32 sp4;                             /* inferred */
    /* 0x08 */ s32 sp8;                             /* inferred */
    /* 0x0C */ s32 spC;                             /* inferred */
    /* 0x10 */ s32 sp10;                            /* inferred */
    /* 0x14 */ s32 sp14;                            /* inferred */
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8011C4C4 {
    /* 0x00 */ char pad_0[0x68];
};                                                  /* size = 0x68 */

struct _mips2c_stack_func_8011C808 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8011C898 {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ u32 sp20;                            /* inferred */
    /* 0x24 */ u32 sp24;                            /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_8011CA64 {
    /* 0x00 */ char pad_0[0x38];
    /* 0x38 */ u32 sp38;                            /* inferred */
    /* 0x3C */ u32 sp3C;                            /* inferred */
    /* 0x40 */ char pad_40[0x10];                   /* maybe part of sp3C[5]? */
    /* 0x50 */ void *sp50;                          /* inferred */
    /* 0x54 */ char pad_54[0xC];                    /* maybe part of sp50[4]? */
    /* 0x60 */ s32 sp60;                            /* inferred */
    /* 0x64 */ u32 sp64;                            /* inferred */
    /* 0x68 */ s32 sp68;                            /* inferred */
    /* 0x6C */ u32 sp6C;                            /* inferred */
    /* 0x70 */ char pad_70[0x8];                    /* maybe part of sp6C[3]? */
    /* 0x78 */ u32 sp78;                            /* inferred */
    /* 0x7C */ u32 sp7C;                            /* inferred */
    /* 0x80 */ char pad_80[0x46];                   /* maybe part of sp7C[18]? */
    /* 0xC6 */ s16 spC6;                            /* inferred */
    /* 0xC8 */ s32 spC8;                            /* inferred */
    /* 0xCC */ u32 spCC;                            /* inferred */
    /* 0xD0 */ u32 spD0;                            /* inferred */
    /* 0xD4 */ u32 spD4;                            /* inferred */
    /* 0xD8 */ char pad_D8[0x10];
};                                                  /* size = 0xE8 */

struct _mips2c_stack_func_8011E3B4 {
    /* 0x00 */ char pad_0[0x30];
    /* 0x30 */ u32 sp30;                            /* inferred */
    /* 0x34 */ u32 sp34;                            /* inferred */
    /* 0x38 */ char pad_38[0x8];                    /* maybe part of sp34[3]? */
    /* 0x40 */ s32 sp40;                            /* inferred */
    /* 0x44 */ u32 sp44;                            /* inferred */
    /* 0x48 */ s32 sp48;                            /* inferred */
    /* 0x4C */ u32 sp4C;                            /* inferred */
    /* 0x50 */ char pad_50[0x30];
};                                                  /* size = 0x80 */

struct _mips2c_stack_func_8011E730 {
    /* 0x00 */ char pad_0[0x34];
    /* 0x34 */ GraphicsContext *sp34;               /* inferred */
    /* 0x38 */ char pad_38[0x4];
    /* 0x3C */ s16 sp3C;                            /* inferred */
    /* 0x3E */ s16 sp3E;                            /* inferred */
    /* 0x40 */ s16 sp40;                            /* inferred */
    /* 0x42 */ s16 sp42;                            /* inferred */
    /* 0x44 */ char pad_44[0x4];
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_8011F0E0 {
    /* 0x000 */ char pad_0[0x4C];
    /* 0x04C */ u32 sp4C;                           /* inferred */
    /* 0x050 */ void *sp50;                         /* inferred */
    /* 0x054 */ char pad_54[0x118];                 /* maybe part of sp50[71]? */
    /* 0x16C */ Gfx *sp16C;                         /* inferred */
    /* 0x170 */ char pad_170[0x118];                /* maybe part of sp16C[71]? */
    /* 0x288 */ Gfx *sp288;                         /* inferred */
    /* 0x28C */ char pad_28C[0x2C];                 /* maybe part of sp288[12]? */
    /* 0x2B8 */ s16 sp2B8;                          /* inferred */
    /* 0x2BA */ s16 sp2BA;                          /* inferred */
    /* 0x2BC */ s16 sp2BC;                          /* inferred */
    /* 0x2BE */ s16 sp2BE;                          /* inferred */
    /* 0x2C0 */ f32 sp2C0;                          /* inferred */
    /* 0x2C4 */ char pad_2C4[0x4];
    /* 0x2C8 */ s16 sp2C8;                          /* inferred */
    /* 0x2CA */ s16 sp2CA;                          /* inferred */
    /* 0x2CC */ s16 sp2CC;                          /* inferred */
    /* 0x2CE */ s16 sp2CE;                          /* inferred */
    /* 0x2D0 */ Gfx *sp2D0;                         /* inferred */
    /* 0x2D4 */ void *sp2D4;                        /* inferred */
    /* 0x2D8 */ char pad_2D8[0x8];
};                                                  /* size = 0x2E0 */

struct _mips2c_stack_func_80120F90 {
    /* 0x00 */ char pad_0[0x30];
    /* 0x30 */ OSMesgQueue *sp30;                   /* inferred */
    /* 0x34 */ char pad_34[0xC];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80121064 {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ void *sp18;                          /* inferred */
    /* 0x1C */ char pad_1C[0x4];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_801210E0 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ void *sp1C;                          /* inferred */
    /* 0x20 */ InterfaceContext *sp20;              /* inferred */
    /* 0x24 */ char pad_24[0xC];                    /* maybe part of sp20[4]? */
    /* 0x30 */ s16 sp30;                            /* inferred */
    /* 0x32 */ s16 sp32;                            /* inferred */
    /* 0x34 */ void *sp34;                          /* inferred */
    /* 0x38 */ char pad_38[0x8];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80121F94 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80121FC4 {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ TwoHeadArena *sp18;                  /* inferred */
    /* 0x1C */ u32 sp1C;                            /* inferred */
    /* 0x20 */ u8 *sp20;                            /* inferred */
    /* 0x24 */ InterfaceContext *sp24;              /* inferred */
    /* 0x28 */ char pad_28[0x18];
};                                                  /* size = 0x40 */

s32 func_800FE4A8();                                /* extern */
? func_8010A410();                                  /* extern */
? func_8010A430(GlobalContext *);                   /* extern */
? func_8010A54C(GraphicsContext **);                /* extern */
? func_8010A580(GlobalContext *);                   /* extern */
s32 func_801234D4(GlobalContext *);                 /* extern */
s32 func_801242DC(GlobalContext *, SaveContext *, u8, s16); /* extern */
? func_801663C4(s32, u64 *, ?, SaveContext *);      /* extern */
? func_80166644(u64 *, s32, ?, SaveContext *);      /* extern */
? func_80174F7C(void (*)(s32), ?);                  /* extern */
? func_80174F9C(void (*)(s32), ?);                  /* extern */
? func_80178E3C(u8 *, s32, void *, ?);              /* extern */
u32 func_80182CBC();                                /* extern */
