struct _mips2c_stack_func_8016AC10 {};              /* size 0x0 */

struct _mips2c_stack_func_8016AE1C {
    /* 0x00 */ char pad_0[0x48];
    /* 0x48 */ s32 *sp48;                           /* inferred */
    /* 0x4C */ char pad_4C[0x64];                   /* maybe part of sp48[26]? */
    /* 0xB0 */ s32 spB0;                            /* inferred */
    /* 0xB4 */ Gfx *spB4;                           /* inferred */
};                                                  /* size = 0xB8 */

struct _mips2c_stack_func_8016B278 {
    /* 0x00 */ char pad_0[0x90];
    /* 0x90 */ s32 sp90;                            /* inferred */
    /* 0x94 */ char pad_94[0x10];                   /* maybe part of sp90[5]? */
    /* 0xA4 */ Gfx *spA4;                           /* inferred */
};                                                  /* size = 0xA8 */

struct _mips2c_stack_func_8016B4B0 {
    /* 0x000 */ char pad_0[0x5C];
    /* 0x05C */ s32 *sp5C;                          /* inferred */
    /* 0x060 */ s32 sp60;                           /* inferred */
    /* 0x064 */ s32 sp64;                           /* inferred */
    /* 0x068 */ s32 sp68;                           /* inferred */
    /* 0x06C */ char pad_6C[0x10];                  /* maybe part of sp68[5]? */
    /* 0x07C */ s32 sp7C;                           /* inferred */
    /* 0x080 */ s32 sp80;                           /* inferred */
    /* 0x084 */ void *sp84;                         /* inferred */
    /* 0x088 */ char pad_88[0x10C];                 /* maybe part of sp84[68]? */
    /* 0x194 */ s32 sp194;                          /* inferred */
    /* 0x198 */ char pad_198[0x8];                  /* maybe part of sp194[3]? */
    /* 0x1A0 */ s32 sp1A0;                          /* inferred */
    /* 0x1A4 */ s32 sp1A4;                          /* inferred */
    /* 0x1A8 */ char pad_1A8[0x4];
    /* 0x1AC */ Gfx *sp1AC;                         /* inferred */
};                                                  /* size = 0x1B0 */

struct _mips2c_stack_func_8016C344 {
    /* 0x000 */ char pad_0[0x5C];
    /* 0x05C */ s32 sp5C;                           /* inferred */
    /* 0x060 */ s32 sp60;                           /* inferred */
    /* 0x064 */ ? *sp64;                            /* inferred */
    /* 0x068 */ s32 sp68;                           /* inferred */
    /* 0x06C */ s32 sp6C;                           /* inferred */
    /* 0x070 */ s32 sp70;                           /* inferred */
    /* 0x074 */ ? *sp74;                            /* inferred */
    /* 0x078 */ s32 sp78;                           /* inferred */
    /* 0x07C */ char pad_7C[0xA8];                  /* maybe part of sp78[43]? */
    /* 0x124 */ s32 sp124;                          /* inferred */
    /* 0x128 */ char pad_128[0x4];
    /* 0x12C */ s32 sp12C;                          /* inferred */
    /* 0x130 */ s32 sp130;                          /* inferred */
    /* 0x134 */ s32 sp134;                          /* inferred */
    /* 0x138 */ char pad_138[0x4];
    /* 0x13C */ Gfx *sp13C;                         /* inferred */
};                                                  /* size = 0x140 */

struct _mips2c_stack_func_8016CD4C {
    /* 0x000 */ char pad_0[0x34];
    /* 0x034 */ s32 sp34;                           /* inferred */
    /* 0x038 */ s32 sp38;                           /* inferred */
    /* 0x03C */ s32 sp3C;                           /* inferred */
    /* 0x040 */ s32 sp40;                           /* inferred */
    /* 0x044 */ char pad_44[0x1FC];                 /* maybe part of sp40[128]? */
    /* 0x240 */ s32 sp240;                          /* inferred */
    /* 0x244 */ s32 sp244;                          /* inferred */
    /* 0x248 */ s32 sp248;                          /* inferred */
    /* 0x24C */ char pad_24C[0x4];
    /* 0x250 */ s32 sp250;                          /* inferred */
    /* 0x254 */ s32 sp254;                          /* inferred */
    /* 0x258 */ s32 sp258;                          /* inferred */
    /* 0x25C */ s32 sp25C;                          /* inferred */
    /* 0x260 */ s32 sp260;                          /* inferred */
    /* 0x264 */ Gfx *sp264;                         /* inferred */
};                                                  /* size = 0x268 */

struct _mips2c_stack_func_8016E40C {
    /* 0x00 */ char pad_0[0x38];
    /* 0x38 */ s32 sp38;                            /* inferred */
    /* 0x3C */ s32 *sp3C;                           /* inferred */
    /* 0x40 */ s32 sp40;                            /* inferred */
    /* 0x44 */ s32 sp44;                            /* inferred */
    /* 0x48 */ s32 sp48;                            /* inferred */
    /* 0x4C */ s32 sp4C;                            /* inferred */
    /* 0x50 */ char pad_50[0x34];                   /* maybe part of sp4C[14]? */
    /* 0x84 */ s32 sp84;                            /* inferred */
    /* 0x88 */ s32 sp88;                            /* inferred */
    /* 0x8C */ s32 sp8C;                            /* inferred */
    /* 0x90 */ char pad_90[0x14];                   /* maybe part of sp8C[6]? */
    /* 0xA4 */ Gfx *spA4;                           /* inferred */
};                                                  /* size = 0xA8 */

struct _mips2c_stack_func_8016EA90 {
    /* 0x00 */ char pad_0[0x8C];
    /* 0x8C */ Gfx *sp8C;                           /* inferred */
};                                                  /* size = 0x90 */

struct _mips2c_stack_func_8016F1A8 {
    /* 0x00 */ char pad_0[0x8C];
    /* 0x8C */ Gfx *sp8C;                           /* inferred */
};                                                  /* size = 0x90 */

struct _mips2c_stack_func_8016F4EC {
    /* 0x00 */ char pad_0[0x30];
    /* 0x30 */ OSMesgQueue *sp30;                   /* inferred */
    /* 0x34 */ char pad_34[0x4];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_8016F5A8 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ s32 sp24;                            /* inferred */
    /* 0x28 */ s32 sp28;                            /* inferred */
    /* 0x2C */ s32 sp2C;                            /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_8016FC78 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8016FC98 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

? func_80178E7C(s32, s32, s32);                     /* extern */
void func_8016AC10(Gfx **arg0, s32 arg1, s32 arg2, s32 arg3, s32 arg4, s32 arg5, s32 arg6, s32 arg7, s16 arg8, s16 arg9); /* static */
void func_8016AE1C(Gfx **arg0);                     /* static */
void func_8016B278(Gfx **arg0);                     /* static */
void func_8016B4B0(Gfx **arg0, s32 arg1, s32 arg2); /* static */
void func_8016C344(void *arg0, Gfx **arg1);         /* static */
void func_8016CD4C(Gfx **arg0);                     /* static */
void func_8016E40C(void *arg0, Gfx **arg1);         /* static */
void func_8016EA90(void *arg0, Gfx **arg1);         /* static */
void func_8016F1A8(void *arg0, GraphicsContext *arg1); /* static */
void func_8016F4EC(s8 *arg0, s32 arg1, s8 *);       /* static */
void func_8016FC78(void *arg0);                     /* static */
