? EffectSsDtBubble_SpawnColorProfile(GraphicsContext **, Vec3f *, f32 *, ? *, s32, s32, s32, s32); /* extern */
? EffectSsGFire_Spawn(void *, Vec3f *);             /* extern */
? func_800B4A98(Player *, s32, ?, void *, s32, void *); /* extern */
s32 func_800B7118(Player *);                        /* extern */
s32 func_800B7128(Player *);                        /* extern */
f32 func_800C40B4(CollisionContext *, CollisionPoly **, s32 *, Vec3f *); /* extern */
s32 func_800C58C8(CollisionContext *, Vec3f *, Vec3f *, Vec3f *, s32 *, s32, s32, s32, s32, s32 *); /* extern */
? func_800DF840(Camera *, ?);                       /* extern */
? func_800DFD78(Camera *, ?, Actor *);              /* extern */
? func_80114FD0(u8, u8);                            /* extern */
void func_80160B40(Actor *thisx, GlobalContext *globalCtx); /* extern */
s32 func_801226E0(GlobalContext *arg0, s32 arg1);   /* static */
void func_801229EC(s32 arg0, ? arg1);               /* static */
void func_801229FC(void *arg0);                     /* static */
void func_80122BA4(GraphicsContext **arg0, void *arg1, s32 arg2, u8 arg3); /* static */
void func_80122C20(s32 arg0, s32 arg1);             /* static */
void func_80122D44(GlobalContext *arg0, s32 arg1);  /* static */
u8 func_80122ED8(s32 arg0);                         /* static */
u8 func_80122EEC(void *arg0);                       /* static */
s32 func_80122F9C(void *arg0);                      /* static */

    },
    {(u32) _object_kzsakuSegmentRomStart, (u32) _object_kzsakuSegmentRomEnd},
    {
        (u32) _object_obj_milk_binSegmentRomStart,
        (u32) _object_obj_milk_binSegmentRomEnd,
    },
    {
        (u32) _object_random_objSegmentRomStart,
        (u32) _object_random_objSegmentRomEnd,
    },
    {(u32) _object_kujiyaSegmentRomStart, (u32) _object_kujiyaSegmentRomEnd},
    {(u32) _object_kitanSegmentRomStart, (u32) _object_kitanSegmentRomEnd},
    {(u32) _object_gi_mask06SegmentRomStart, (u32) _object_gi_mask06SegmentRomEnd},
    {(u32) _object_gi_mask16SegmentRomStart, (u32) _object_gi_mask16SegmentRomEnd},
    {(u32) _object_astr_objSegmentRomStart, (u32) _object_astr_objSegmentRomEnd},
    {(u32) _object_bsbSegmentRomStart, (u32) _object_bsbSegmentRomEnd},
    {(u32) _object_fall2SegmentRomStart, (u32) _object_fall2SegmentRomEnd},
    {(u32) _object_sthSegmentRomStart, (u32) _object_sthSegmentRomEnd},
    {(u32) _object_gi_mssaSegmentRomStart, (u32) _object_gi_mssaSegmentRomEnd},
    {(u32) _object_smtowerSegmentRomStart, (u32) _object_smtowerSegmentRomEnd},
    {(u32) _object_gi_mask21SegmentRomStart, (u32) _object_gi_mask21SegmentRomEnd},
    {(u32) _object_yado_objSegmentRomStart, (u32) _object_yado_objSegmentRomEnd},
    {(u32) _object_syotenSegmentRomStart, (u32) _object_syotenSegmentRomEnd},
    {(u32) _object_moonendSegmentRomStart, (u32) _object_moonendSegmentRomEnd},
    {(u32) _object_obSegmentRomStart, (u32) _object_obSegmentRomEnd},
    {
        (u32) _object_gi_bottle_04SegmentRomStart,
        (u32) _object_gi_bottle_04SegmentRomEnd,
    },
    {
        (u32) _object_obj_danpeiliftSegmentRomStart,
        (u32) _object_obj_danpeiliftSegmentRomEnd,
    },
    {(u32) _object_wdor01SegmentRomStart, (u32) _object_wdor01SegmentRomEnd},
    {(u32) _object_wdor02SegmentRomStart, (u32) _object_wdor02SegmentRomEnd},
    {(u32) _object_wdor03SegmentRomStart, (u32) _object_wdor03SegmentRomEnd},
    {(u32) _object_stk3SegmentRomStart, (u32) _object_stk3SegmentRomEnd},
    {
        (u32) _object_kinsta1_objSegmentRomStart,
        (u32) _object_kinsta1_objSegmentRomEnd,
    },
    {
        (u32) _object_kinsta2_objSegmentRomStart,
        (u32) _object_kinsta2_objSegmentRomEnd,
    },
    {(u32) _object_bhSegmentRomStart, (u32) _object_bhSegmentRomEnd},
    {(u32) _object_wdor04SegmentRomStart, (u32) _object_wdor04SegmentRomEnd},
    {(u32) _object_wdor05SegmentRomStart, (u32) _object_wdor05SegmentRomEnd},
    {(u32) _object_gi_mask17SegmentRomStart, (u32) _object_gi_mask17SegmentRomEnd},
    {(u32) _object_gi_mask22SegmentRomStart, (u32) _object_gi_mask22SegmentRomEnd},
    {(u32) _object_lbfshotSegmentRomStart, (u32) _object_lbfshotSegmentRomEnd},
    {(u32) _object_fusenSegmentRomStart, (u32) _object_fusenSegmentRomEnd},
    {
        (u32) _object_ending_objSegmentRomStart,
        (u32) _object_ending_objSegmentRomEnd,
    },
    {(u32) _object_gi_mask13SegmentRomStart, (u32) _object_gi_mask13SegmentRomEnd},
};

typedef struct {
    /* 0x0000 */ View view;
    /* 0x0168 */ Font font;
    /* 0x11EF4 */ s8 unk_11EF4[16];
    /* 0x11F04 */ u16 unk11F04;
    /* 0x11F06 */ char pad11F06[0x4];               /* maybe part of unk11F04[3]? */
    /* 0x11F0A */ u8 unk11F0A;
    /* 0x11F0B */ char pad11F0B[0x5];               /* maybe part of unk11F0A[6]? */
    /* 0x11F10 */ s32 unk11F10;
    /* 0x11F14 */ char pad11F14[0xE];
    /* 0x11F22 */ u8 unk11F22;
    /* 0x11F23 */ char pad11F23[0xFD];              /* maybe part of unk11F22[254]? */
    /* 0x12020 */ u8 unk12020;
    /* 0x12021 */ u8 choiceIndex;
    /* 0x12022 */ char pad12022[0x1];               /* maybe part of choiceIndex[2]? */
    /* 0x12023 */ s8 unk12023;
    /* 0x12024 */ char pad12024[0x6];               /* maybe part of unk12023[7]? */
    /* 0x1202A */ u16 unk1202A;
    /* 0x1202C */ char pad1202C[0x2];               /* maybe part of unk1202A[2]? */
    /* 0x1202E */ u16 unk1202E;
    /* 0x12030 */ char pad12030[0x14];              /* maybe part of unk1202E[11]? */
    /* 0x12044 */ s16 unk12044;
    /* 0x12046 */ char pad12046[0x24];              /* maybe part of unk12044[19]? */
    /* 0x1206A */ s16 unk1206A;
    /* 0x1206C */ s32 unk1206C;
    /* 0x12070 */ char pad12070[0x8];               /* maybe part of unk1206C[3]? */
    /* 0x12078 */ s32 bankRupeesSelected;
    /* 0x1207C */ s32 bankRupees;
    /* 0x12080 */ char pad12080[0x31];
    /* 0x120B1 */ u8 unk120B1;
    /* 0x120B2 */ char pad120B2[0xA];               /* maybe part of unk120B1[11]? */
    /* 0x120BC */ u16 unk120BC;                     /* inferred */
    /* 0x120BE */ char pad120BE[0x22];              /* maybe part of unk120BC[18]? */
} MessageContext;                                   /* size 0x120E0 */

s32 func_801226E0(GlobalContext *arg0, s32 arg1) {
    if ((arg1 == 0) && (arg1 = arg1, func_80169E6C(arg0, 0, 0xBFF), (arg0->sceneNum == 7))) {
        return 1;
    }
    gSaveContext.respawn[0].data = 0;
    return arg1;
}

void func_80122744(GlobalContext *globalCtx, void *arg1, u32 arg2, Vec3s *arg3) {
    arg1->unk0 = (s8) arg2;
    arg1->unk1 = 0;
    arg1->unk4 = arg3;
}

s32 func_80122760(GlobalContext *globalCtx, void *arg1, f32 arg2) {
    Actor *sp3C;
    Vec3f sp30;
    PosRot *sp20;
    PosRot *temp_a0;
    s8 temp_v0;

    temp_v0 = arg1->unk1;
    if ((s32) temp_v0 < (s32) arg1->unk0) {
        sp3C = globalCtx->actorCtx.actorList[2].first;
        Math_Vec3s_ToVec3f(&sp30, arg1->unk4 + (temp_v0 * 6));
        temp_a0 = &sp3C->world;
        sp20 = temp_a0;
