typedef struct ActorContext {
    /* 0x000 */ u8 unk_0;                           /* inferred */
    /* 0x001 */ char pad_1[0x1];
    /* 0x002 */ u8 unk2;
    /* 0x003 */ u8 unk3;
    /* 0x004 */ s8 unk4;
    /* 0x005 */ u8 unk5;
    /* 0x006 */ char pad_6[0x5];                    /* maybe part of unk5[6]? */
    /* 0x00B */ s8 unkB;
    /* 0x00C */ s16 unkC;
    /* 0x00E */ u8 totalLoadedActors;
    /* 0x00F */ u8 undrawnActorCount;
    /* 0x010 */ ActorListEntry actorList[12];
    /* 0x0A0 */ Actor *undrawnActors[32];
    /* 0x120 */ TargetContext targetContext;
    /* 0x1B8 */ u32 switchFlags[4];
    /* 0x1C8 */ u32 chestFlags;
    /* 0x1CC */ u32 clearedRooms;
    /* 0x1D0 */ u32 clearedRoomsTemp;
    /* 0x1D4 */ u32 collectibleFlags[4];
    /* 0x1E4 */ TitleCardContext titleCtxt;
    /* 0x1F4 */ u8 unk1F4;
    /* 0x1F5 */ u8 unk1F5;
    /* 0x1F6 */ char pad_1F6[0x2];                  /* maybe part of unk1F5[3]? */
    /* 0x1F8 */ f32 unk1F8;
    /* 0x1FC */ Vec3f unk1FC;
    /* 0x208 */ char pad_208[0x48];                 /* maybe part of unk1FC[7]? */
    /* 0x250 */ void *unk250;
    /* 0x254 */ u32 unk254[5];
    /* 0x268 */ u8 unk268;
    /* 0x269 */ char pad_269[0xF];                  /* maybe part of unk268[16]? */
    /* 0x278 */ u16 unk278;
    /* 0x27A */ char pad_27A[0xA];                  /* maybe part of unk278[6]? */
} ActorContext;                                     /* size = 0x284 */

typedef struct GlobalContext {
    /* 0x00000 */ GameState state;
    /* 0x000A4 */ s16 sceneNum;
    /* 0x000A6 */ u8 sceneConfig;
    /* 0x000A7 */ char pad_A7[0x9];                 /* maybe part of sceneConfig[10]? */
    /* 0x000B0 */ void *sceneSegment;
    /* 0x000B4 */ char pad_B4[0x4];
    /* 0x000B8 */ View view;
    /* 0x00220 */ Camera mainCamera;
    /* 0x00398 */ Camera subCameras[3];
    /* 0x00800 */ Camera *cameraPtrs[4];
    /* 0x00810 */ s16 activeCamera;
    /* 0x00812 */ s16 nextCamera;
    /* 0x00814 */ SoundContext soundCtx;
    /* 0x00817 */ char pad_817[0x1];
    /* 0x00818 */ LightContext lightCtx;
    /* 0x00828 */ FrameAdvanceContext frameAdvCtx;
    /* 0x00830 */ CollisionContext colCtx;
    /* 0x01CA0 */ ActorContext actorCtx;
    /* 0x01F24 */ CutsceneContext csCtx;
    /* 0x01F78 */ SoundSource soundSources[16];
    /* 0x02138 */ EffFootmark footprintInfo[100];
    /* 0x046B8 */ SramContext sramCtx;
    /* 0x046E0 */ SkyboxContext skyboxCtx;
    /* 0x04908 */ MessageContext msgCtx;
    /* 0x169E8 */ InterfaceContext interfaceCtx;
    /* 0x16D30 */ PauseContext pauseCtx;
    /* 0x17000 */ GameOverContext gameOverCtx;
    /* 0x17002 */ char pad_17002[0x2];
    /* 0x17004 */ EnvironmentContext envCtx;
    /* 0x17104 */ AnimationContext animationCtx;
    /* 0x17D88 */ ObjectContext objectCtx;
    /* 0x186E0 */ RoomContext roomCtx;
    /* 0x18760 */ DoorContext doorCtx;
    /* 0x18768 */ void (*playerInit)(Player *, GlobalContext *, FlexSkeletonHeader *);
    /* 0x1876C */ void (*playerUpdate)(Player *, GlobalContext *, Input *);
    /* 0x18770 */ void *unk_18770;
    /* 0x18774 */ s32 (*startPlayerFishing)(GlobalContext *);
    /* 0x18778 */ s32 (*grabPlayer)(GlobalContext *, Player *);
    /* 0x1877C */ s32 (*startPlayerCutscene)(GlobalContext *, Player *, s32);
    /* 0x18780 */ void (*func_18780)(Player *, GlobalContext *);
    /* 0x18784 */ s32 (*damagePlayer)(GlobalContext *, s32);
    /* 0x18788 */ void (*talkWithPlayer)(GlobalContext *, Actor *);
    /* 0x1878C */ void (*unk_1878C)(GlobalContext *);
    /* 0x18790 */ void (*unk_18790)(GlobalContext *, s16, Actor *);
    /* 0x18794 */ void *unk_18794;
    /* 0x18798 */ s32 (*setPlayerTalkAnim)(GlobalContext *, void *, s32);
    /* 0x1879C */ s16 unk_1879C[10];
    /* 0x187B0 */ MtxF projectionMatrix;
    /* 0x187F0 */ Vec3f unk_187F0;
    /* 0x187FC */ MtxF mf_187FC;
    /* 0x1883C */ Mtx *unk_1883C;
    /* 0x18840 */ u32 gameplayFrames;
    /* 0x18844 */ u8 unk_18844;
    /* 0x18845 */ u8 unk_18845;
    /* 0x18846 */ s16 numSetupActors;
    /* 0x18848 */ u8 numRooms;
    /* 0x18849 */ char pad_18849[0x3];              /* maybe part of numRooms[4]? */
    /* 0x1884C */ RomFile *roomList;
    /* 0x18850 */ ActorEntry *linkActorEntry;
    /* 0x18854 */ ActorEntry *setupActorList;
    /* 0x18858 */ void *unk_18858;
    /* 0x1885C */ EntranceEntry *setupEntranceList;
    /* 0x18860 */ u16 *setupExitList;
    /* 0x18864 */ Path *setupPathList;
    /* 0x18868 */ void *unk_18868;
    /* 0x1886C */ AnimatedMaterial *sceneMaterialAnims;
    /* 0x18870 */ void *specialEffects;
    /* 0x18874 */ u8 skyboxId;
    /* 0x18875 */ s8 sceneLoadFlag;
    /* 0x18876 */ s16 unk_18876;
    /* 0x18878 */ s16 bgCoverAlpha;
    /* 0x1887A */ u16 nextEntranceIndex;
    /* 0x1887C */ s8 unk_1887C;
    /* 0x1887D */ s8 unk_1887D;
    /* 0x1887E */ s8 unk_1887E;
    /* 0x1887F */ u8 unk_1887F;
    /* 0x18880 */ u8 unk_18880;
    /* 0x18881 */ char pad_18881[0x3];              /* maybe part of unk_18880[4]? */
    /* 0x18884 */ CollisionCheckContext colChkCtx;
    /* 0x18B20 */ u16 envFlags[20];
    /* 0x18B48 */ u8 curSpawn;
    /* 0x18B49 */ u8 unk_18B49;
    /* 0x18B4A */ u8 unk_18B4A;
    /* 0x18B4B */ char pad_18B4B[0x1];
    /* 0x18B4C */ PreRender pauseBgPreRender;
    /* 0x18B9C */ char pad_18B9C[0x5C];             /* maybe part of pauseBgPreRender[2]? */
    /* 0x18BF8 */ ? unk_18BF8;                      /* inferred */
    /* 0x18BF8 */ char pad_18BF8[0x22C];
    /* 0x18E24 */ ? (*unk_18E24)(? *);              /* inferred */
    /* 0x18E28 */ char pad_18E28[0x20];             /* maybe part of unk_18E24[9]? */
    /* 0x18E48 */ ? unk_18E48;                      /* inferred */
    /* 0x18E48 */ char pad_18E48[0xC];
    /* 0x18E54 */ SceneTableEntry *loadedScene;
    /* 0x18E58 */ s32 unk_18E58;                    /* inferred */
    /* 0x18E5C */ s32 unk_18E5C;                    /* inferred */
    /* 0x18E60 */ s32 unk_18E60;                    /* inferred */
    /* 0x18E64 */ s32 unk_18E64;                    /* inferred */
    /* 0x18E68 */ s32 unk_18E68;                    /* inferred */
    /* 0x18E6C */ char pad_18E6C[0x3EC];            /* maybe part of unk_18E68[252]? */
} GlobalContext;                                    /* size = 0x19258 */

typedef struct GraphicsContext {
    /* 0x000 */ Gfx *polyOpaBuffer;
    /* 0x004 */ Gfx *polyXluBuffer;
    /* 0x008 */ char pad_8[0x8];                    /* maybe part of polyXluBuffer[3]? */
    /* 0x010 */ Gfx *overlayBuffer;
    /* 0x014 */ char pad_14[0x44];                  /* maybe part of overlayBuffer[18]? */
    /* 0x058 */ OSMesgQueue *unk58;
    /* 0x05C */ OSMesgQueue unk5C;
    /* 0x074 */ char pad_74[0x12C];                 /* maybe part of unk5C[13]? */
    /* 0x1A0 */ Gfx *unk1A0;
    /* 0x1A4 */ TwoHeadGfxArena unk1A4;
    /* 0x1B4 */ Gfx *unk1B4;
    /* 0x1B8 */ TwoHeadGfxArena unk1B8;
    /* 0x1C8 */ char pad_1C8[0xAC];                 /* maybe part of unk1B8[11]? */
    /* 0x274 */ OSViMode *unk274;
    /* 0x278 */ void *zbuffer;
    /* 0x27C */ char pad_27C[0x1C];                 /* maybe part of zbuffer[8]? */
    /* 0x298 */ TwoHeadGfxArena overlay;
    /* 0x2A8 */ TwoHeadGfxArena polyOpa;
    /* 0x2B8 */ TwoHeadGfxArena polyXlu;
    /* 0x2C8 */ s32 displaylistCounter;
    /* 0x2CC */ void *framebuffer;
    /* 0x2D0 */ s32 pad2D0;
    /* 0x2D4 */ u32 viConfigFeatures;
    /* 0x2D8 */ char pad_2D8[0x2];
    /* 0x2DA */ s8 unk_2DA;                         /* inferred */
    /* 0x2DB */ u8 framebufferCounter;
    /* 0x2DC */ s32 unk_2DC;                        /* inferred */
    /* 0x2E0 */ s32 unk_2E0;                        /* inferred */
    /* 0x2E4 */ f32 viConfigXScale;
    /* 0x2E8 */ f32 viConfigYScale;
    /* 0x2EC */ char pad_2EC[0x4];
} GraphicsContext;                                  /* size = 0x2F0 */

typedef struct {
    /* 0x00 */ RomFile segment;
    /* 0x08 */ u16 titleTextId;
    /* 0x0A */ u8 unk_A;
    /* 0x0B */ u8 drawConfig;
    /* 0x0C */ u8 unk_C;
    /* 0x0D */ s8 unk_D;                            /* inferred */
    /* 0x0E */ char pad_E[0x2];                     /* maybe part of unk_D[3]? */
} SceneTableEntry;                                  /* size = 0x10 */

typedef struct {
    /* 0x000 */ u32 magic;
    /* 0x004 */ GraphicsContext *gfxCtx;
    /* 0x008 */ Viewport viewport;
    /* 0x018 */ f32 fovy;
    /* 0x01C */ f32 zNear;
    /* 0x020 */ f32 zFar;
    /* 0x024 */ f32 scale;
    /* 0x028 */ Vec3f eye;
    /* 0x034 */ Vec3f at;
    /* 0x040 */ Vec3f up;
    /* 0x04C */ char pad_4C[0x4];
    /* 0x050 */ Vp vp;
    /* 0x060 */ Mtx projection;
    /* 0x0A0 */ Mtx viewing;
    /* 0x0E0 */ Mtx unkE0;
    /* 0x120 */ Mtx *projectionPtr;
    /* 0x124 */ Mtx *viewingPtr;
    /* 0x128 */ Vec3f quakeRot;
    /* 0x134 */ Vec3f quakeScale;
    /* 0x140 */ f32 quakeSpeed;
    /* 0x144 */ Vec3f currQuakeRot;
    /* 0x150 */ Vec3f currQuakeScale;
    /* 0x15C */ u16 normal;
    /* 0x15E */ char pad_15E[0x2];
    /* 0x160 */ u32 flags;
    /* 0x164 */ s32 unk_164;                        /* inferred */
} View;                                             /* size = 0x168 */

struct _mips2c_stack_FrameAdvance_IsEnabled {};     /* size 0x0 */

struct _mips2c_stack_Play_CameraSetAtEye {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ s32 sp24;                            /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_Play_Fini {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ GraphicsContext *sp20;               /* inferred */
    /* 0x24 */ char pad_24[0x4];
};                                                  /* size = 0x28 */

struct _mips2c_stack_Play_GetActiveCameraIndex {};  /* size 0x0 */

struct _mips2c_stack_Play_GetCamera {};             /* size 0x0 */

struct _mips2c_stack_Play_Init {
    /* 0x00 */ char pad_0[0x3C];
    /* 0x3C */ CollisionContext *sp3C;              /* inferred */
    /* 0x40 */ Camera *sp40;                        /* inferred */
    /* 0x44 */ View *sp44;                          /* inferred */
    /* 0x48 */ Camera *sp48;                        /* inferred */
    /* 0x4C */ PreRender *sp4C;                     /* inferred */
    /* 0x50 */ char pad_50[0x10];                   /* maybe part of sp4C[5]? */
    /* 0x60 */ s32 sp60;                            /* inferred */
    /* 0x64 */ char pad_64[0x23];                   /* maybe part of sp60[9]? */
    /* 0x87 */ u8 sp87;                             /* inferred */
    /* 0x88 */ char pad_88[0x8];                    /* maybe part of sp87[9]? */
    /* 0x90 */ Actor *sp90;                         /* inferred */
    /* 0x94 */ s32 sp94;                            /* inferred */
    /* 0x98 */ char pad_98[0x8];                    /* maybe part of sp94[3]? */
    /* 0xA0 */ GraphicsContext *spA0;               /* inferred */
    /* 0xA4 */ char pad_A4[0x4];
};                                                  /* size = 0xA8 */

struct _mips2c_stack_Play_LoadScene {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ void *sp18;                          /* inferred */
    /* 0x1C */ u32 sp1C;                            /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_Play_SceneInit {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ SceneTableEntry *sp1C;               /* inferred */
    /* 0x20 */ char pad_20[0x8];
};                                                  /* size = 0x28 */

struct _mips2c_stack_Play_Update {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ Input *sp24;                         /* inferred */
    /* 0x28 */ ? sp28;                              /* inferred */
    /* 0x28 */ char pad_28[0x18];
    /* 0x40 */ GraphicsContext *sp40;               /* inferred */
    /* 0x44 */ char pad_44[0x4];
};                                                  /* size = 0x48 */

struct _mips2c_stack_convert_scene_number_among_shared_scenes {}; /* size 0x0 */

struct _mips2c_stack_func_80165460 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ PreRender *sp1C;                     /* inferred */
    /* 0x20 */ char pad_20[0x10];                   /* maybe part of sp1C[5]? */
    /* 0x30 */ Gfx *sp30;                           /* inferred */
    /* 0x34 */ Gfx *sp34;                           /* inferred */
    /* 0x38 */ s32 sp38;                            /* inferred */
    /* 0x3C */ void *sp3C;                          /* inferred */
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80165608 {};              /* size 0x0 */

struct _mips2c_stack_func_80165630 {};              /* size 0x0 */

struct _mips2c_stack_func_80165658 {};              /* size 0x0 */

struct _mips2c_stack_func_8016566C {};              /* size 0x0 */

struct _mips2c_stack_func_80165690 {};              /* size 0x0 */

struct _mips2c_stack_func_801656A4 {
    /* 0x00 */ char pad_0[0x4];
    /* 0x04 */ s32 sp4;                             /* inferred */
    /* 0x08 */ s32 sp8;                             /* inferred */
    /* 0x0C */ s32 spC;                             /* inferred */
    /* 0x10 */ s32 sp10;                            /* inferred */
    /* 0x14 */ s32 sp14;                            /* inferred */
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80165DB8 {};              /* size 0x0 */

struct _mips2c_stack_func_80165DCC {};              /* size 0x0 */

struct _mips2c_stack_func_80165DF0 {};              /* size 0x0 */

struct _mips2c_stack_func_80165E04 {};              /* size 0x0 */

struct _mips2c_stack_func_80165E1C {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80165E7C {};              /* size 0x0 */

struct _mips2c_stack_func_80165EC0 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ void *sp1C;                          /* inferred */
    /* 0x20 */ s32 sp20;                            /* inferred */
    /* 0x24 */ char pad_24[0x4];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80166060 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_801660B8 {
    /* 0x00 */ char pad_0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_801663C4 {};              /* size 0x0 */

struct _mips2c_stack_func_80166644 {};              /* size 0x0 */

struct _mips2c_stack_func_801668B4 {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ void *sp2C;                          /* inferred */
    /* 0x30 */ ? sp30;                              /* inferred */
    /* 0x30 */ char pad_30[0x4];
    /* 0x34 */ s32 sp34;                            /* inferred */
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ char pad_3C[0x4];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80166968 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ Actor *sp24;                         /* inferred */
    /* 0x28 */ s32 sp28;                            /* inferred */
    /* 0x2C */ char pad_2C[0x4];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80166B30 {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ ? *sp18;                             /* inferred */
    /* 0x1C */ void *sp1C;                          /* inferred */
    /* 0x20 */ char pad_20[0x34];                   /* maybe part of sp1C[14]? */
    /* 0x54 */ s32 sp54;                            /* inferred */
    /* 0x58 */ char pad_58[0xA];                    /* maybe part of sp54[3]? */
    /* 0x62 */ s16 sp62;                            /* inferred */
    /* 0x64 */ char pad_64[0x4];
};                                                  /* size = 0x68 */

struct _mips2c_stack_func_80167814 {
    /* 0x00 */ char pad_0[0x30];
    /* 0x30 */ Input *sp30;                         /* inferred */
    /* 0x34 */ CollisionCheckContext *sp34;         /* inferred */
    /* 0x38 */ RoomContext *sp38;                   /* inferred */
    /* 0x3C */ AnimationContext *sp3C;              /* inferred */
    /* 0x40 */ CutsceneContext *sp40;               /* inferred */
    /* 0x44 */ void *sp44;                          /* inferred */
    /* 0x48 */ ? sp48;                              /* inferred */
    /* 0x48 */ char pad_48[0x8];
    /* 0x50 */ s32 sp50;                            /* inferred */
    /* 0x54 */ s32 sp54;                            /* inferred */
    /* 0x58 */ char pad_58[0x4];
    /* 0x5C */ s32 sp5C;                            /* inferred */
    /* 0x60 */ char pad_60[0x8];
};                                                  /* size = 0x68 */

struct _mips2c_stack_func_80167DE4 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80167F0C {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ void *sp18;                          /* inferred */
    /* 0x1C */ char pad_1C[0x10];                   /* maybe part of sp18[5]? */
    /* 0x2C */ GraphicsContext *sp2C;               /* inferred */
    /* 0x30 */ Gfx *sp30;                           /* inferred */
    /* 0x34 */ Gfx *sp34;                           /* inferred */
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80168090 {
    /* 0x000 */ char pad_0[0x34];
    /* 0x034 */ SkyboxContext *sp34;                /* inferred */
    /* 0x038 */ View *sp38;                         /* inferred */
    /* 0x03C */ void *sp3C;                         /* inferred */
    /* 0x040 */ void *sp40;                         /* inferred */
    /* 0x044 */ MtxF *sp44;                         /* inferred */
    /* 0x048 */ MtxF *sp48;                         /* inferred */
    /* 0x04C */ ? sp4C;                             /* inferred */
    /* 0x04C */ char pad_4C[0x24];
    /* 0x070 */ Gfx *sp70;                          /* inferred */
    /* 0x074 */ Gfx *sp74;                          /* inferred */
    /* 0x078 */ f32 sp78;                           /* inferred */
    /* 0x07C */ f32 sp7C;                           /* inferred */
    /* 0x080 */ f32 sp80;                           /* inferred */
    /* 0x084 */ char pad_84[0x8];                   /* maybe part of sp80[3]? */
    /* 0x08C */ Gfx *sp8C;                          /* inferred */
    /* 0x090 */ Gfx *sp90;                          /* inferred */
    /* 0x094 */ char pad_94[0x4];
    /* 0x098 */ s32 sp98;                           /* inferred */
    /* 0x09C */ s32 sp9C;                           /* inferred */
    /* 0x0A0 */ s32 spA0;                           /* inferred */
    /* 0x0A4 */ s32 spA4;                           /* inferred */
    /* 0x0A8 */ ? spA8;                             /* inferred */
    /* 0x0A8 */ char pad_A8[0x160];
    /* 0x208 */ s32 sp208;                          /* inferred */
    /* 0x20C */ char pad_20C[0x8];                  /* maybe part of sp208[3]? */
    /* 0x214 */ Gfx *sp214;                         /* inferred */
    /* 0x218 */ Gfx *sp218;                         /* inferred */
    /* 0x21C */ char pad_21C[0x3F];                 /* maybe part of sp218[16]? */
    /* 0x25B */ u8 sp25B;                           /* inferred */
    /* 0x25C */ f32 sp25C;                          /* inferred */
    /* 0x260 */ f32 sp260;                          /* inferred */
    /* 0x264 */ f32 sp264;                          /* inferred */
    /* 0x268 */ Lights *sp268;                      /* inferred */
    /* 0x26C */ char pad_26C[0x4];
};                                                  /* size = 0x270 */

struct _mips2c_stack_func_80168DAC {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ GraphicsContext *sp24;               /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_801690CC {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80169100 {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ f32 sp2C;                            /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_801691F0 {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ ? sp20;                              /* inferred */
    /* 0x20 */ char pad_20[0x4];
    /* 0x24 */ ? sp24;                              /* inferred */
    /* 0x24 */ char pad_24[0x4];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_8016927C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_801692C4 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80169474 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ f32 sp1C;                            /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_801694DC {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ void *sp18;                          /* inferred */
    /* 0x1C */ char pad_1C[0x2];
    /* 0x1E */ s16 sp1E;                            /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80169590 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80169600 {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ void *sp18;                          /* inferred */
    /* 0x1C */ char pad_1C[0x4];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80169668 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_8016981C {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80169940 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80169988 {};              /* size 0x0 */

struct _mips2c_stack_func_801699D4 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80169A50 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ Camera *sp1C;                        /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80169AC0 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80169AFC {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80169BC4 {};              /* size 0x0 */

struct _mips2c_stack_func_80169BF8 {};              /* size 0x0 */

struct _mips2c_stack_func_80169C64 {};              /* size 0x0 */

struct _mips2c_stack_func_80169C84 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80169D40 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80169DCC {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80169E6C {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80169ECC {};              /* size 0x0 */

struct _mips2c_stack_func_80169EFC {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80169F78 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80169FDC {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80169FFC {};              /* size 0x0 */

struct _mips2c_stack_func_8016A02C {};              /* size 0x0 */

struct _mips2c_stack_func_8016A0AC {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ CollisionContext *sp24;              /* inferred */
    /* 0x28 */ ? sp28;                              /* inferred */
    /* 0x28 */ char pad_28[0x4];
    /* 0x2C */ f32 sp2C;                            /* inferred */
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ CollisionPoly *sp38;                 /* inferred */
    /* 0x3C */ WaterBox *sp3C;                      /* inferred */
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_8016A168 {};              /* size 0x0 */

struct _mips2c_stack_func_8016A178 {
    /* 0x00 */ char pad_0[0x40];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_8016A268 {};              /* size 0x0 */

? ActorCutscene_ClearWaiting();                     /* extern */
? ActorCutscene_Update();                           /* extern */
? Actor_Init(GameState *, PreRender *, s32);        /* extern */
? MainHeap_Cleanup();                               /* extern */
? ShrinkWindow_Init();                              /* extern */
? TransitionFade_Destroy(? *);                      /* extern */
? TransitionFade_Draw(? *, Gfx **);                 /* extern */
? TransitionFade_SetColor(PreRender *, ?);          /* extern */
? TransitionFade_SetType(PreRender *, ?);           /* extern */
? TransitionFade_Start(PreRender *);                /* extern */
? TransitionFade_Update(? *, u8);                   /* extern */
? func_800BA9B4(ActorContext *, GlobalContext *);   /* extern */
