typedef struct {
    /* 0x00 */ s8 num;
    /* 0x01 */ u8 unk1;
    /* 0x02 */ u8 unk2;
    /* 0x03 */ u8 unk3;
    /* 0x04 */ s8 echo;
    /* 0x05 */ u8 unk5;
    /* 0x06 */ u8 enablePosLights;
    /* 0x07 */ char pad7[0x1];
    /* 0x08 */ RoomMesh *mesh;
    /* 0x0C */ void *segment;
    /* 0x10 */ s32 unk10;                           /* inferred */
} Room;                                             /* size = 0x14 */

struct _mips2c_stack_Room_AllocateAndLoad {
    /* 0x00 */ char pad0[0x20];
    /* 0x20 */ void *sp20;                          /* inferred */
    /* 0x24 */ char pad24[0x3C];
};                                                  /* size = 0x60 */

struct _mips2c_stack_Room_Draw {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Room_DrawType0Mesh {
    /* 0x00 */ char pad0[0x18];
    /* 0x18 */ s32 sp18;                            /* inferred */
    /* 0x1C */ RSPMatrix *sp1C;                     /* inferred */
    /* 0x20 */ s32 sp20;                            /* inferred */
    /* 0x24 */ char pad24[0x1C];                    /* maybe part of sp20[8]? */
    /* 0x40 */ GraphicsContext *sp40;               /* inferred */
    /* 0x44 */ char pad44[0x8];                     /* maybe part of sp40[3]? */
    /* 0x4C */ RoomMesh *sp4C;                      /* inferred */
};                                                  /* size = 0x50 */

struct _mips2c_stack_Room_DrawType1Mesh {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Room_DrawType2Mesh {
    /* 0x000 */ char pad0[0x1C];
    /* 0x01C */ s32 sp1C;                           /* inferred */
    /* 0x020 */ RSPMatrix *sp20;                    /* inferred */
    /* 0x024 */ MtxF *sp24;                         /* inferred */
    /* 0x028 */ s32 sp28;                           /* inferred */
    /* 0x02C */ char pad2C[0x28];                   /* maybe part of sp28[11]? */
    /* 0x054 */ f32 sp54;                           /* inferred */
    /* 0x058 */ char pad58[0x34];                   /* maybe part of sp54[14]? */
    /* 0x08C */ GraphicsContext *sp8C;              /* inferred */
    /* 0x090 */ char pad90[0x4];
    /* 0x094 */ ? sp94;                             /* inferred */
    /* 0x094 */ char pad94[0x8];
    /* 0x09C */ f32 sp9C;                           /* inferred */
    /* 0x0A0 */ f32 spA0;                           /* inferred */
    /* 0x0A4 */ f32 spA4;                           /* inferred */
    /* 0x0A8 */ f32 spA8;                           /* inferred */
    /* 0x0AC */ s32 spAC;                           /* inferred */
    /* 0x0B0 */ char padB0[0x4];
    /* 0x0B4 */ ? *spB4;                            /* inferred */
    /* 0x0B8 */ char padB8[0x8];                    /* maybe part of spB4[3]? */
    /* 0x0C0 */ ? *spC0;                            /* inferred */
    /* 0x0C4 */ ? *spC4;                            /* inferred */
    /* 0x0C8 */ ? spC8;                             /* inferred */
    /* 0x0C8 */ char padC8[0x800];
    /* 0x8C8 */ void *sp8C8;                        /* inferred */
    /* 0x8CC */ RoomMesh *sp8CC;                    /* inferred */
};                                                  /* size = 0x8D0 */

struct _mips2c_stack_Room_DrawType3Mesh {};         /* size 0x0 */

struct _mips2c_stack_Room_HandleLoadCallbacks {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_Room_Init {};                  /* size 0x0 */

struct _mips2c_stack_Room_StartRoomTransition {
    /* 0x00 */ char pad0[0x30];
    /* 0x30 */ OSMesgQueue *sp30;                   /* inferred */
    /* 0x34 */ s32 sp34;                            /* inferred */
    /* 0x38 */ void *sp38;                          /* inferred */
    /* 0x3C */ u32 sp3C;                            /* inferred */
};                                                  /* size = 0x40 */

struct _mips2c_stack_Room_nop8012D510 {};           /* size 0x0 */

struct _mips2c_stack_func_8012DEE8 {
    /* 0x00 */ char pad0[0x4C];
    /* 0x4C */ RSPMatrix *sp4C;                     /* inferred */
    /* 0x50 */ s32 sp50;                            /* inferred */
    /* 0x54 */ char pad54[0xC];                     /* maybe part of sp50[4]? */
    /* 0x60 */ Gfx *sp60;                           /* inferred */
    /* 0x64 */ f32 sp64;                            /* inferred */
    /* 0x68 */ f32 sp68;                            /* inferred */
    /* 0x6C */ f32 sp6C;                            /* inferred */
    /* 0x70 */ char pad70[0x20];                    /* maybe part of sp6C[9]? */
    /* 0x90 */ s32 sp90;                            /* inferred */
    /* 0x94 */ char pad94[0x4];
    /* 0x98 */ void *sp98;                          /* inferred */
    /* 0x9C */ RoomMesh *sp9C;                      /* inferred */
    /* 0xA0 */ Gfx *spA0;                           /* inferred */
    /* 0xA4 */ Camera *spA4;                        /* inferred */
};                                                  /* size = 0xA8 */

struct _mips2c_stack_func_8012E254 {
    /* 0x00 */ char pad0[0x18];
    /* 0x18 */ s32 sp18;                            /* inferred */
    /* 0x1C */ char pad1C[0x4];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_8012E32C {
    /* 0x00 */ char pad0[0x48];
    /* 0x48 */ RSPMatrix *sp48;                     /* inferred */
    /* 0x4C */ s32 sp4C;                            /* inferred */
    /* 0x50 */ char pad50[0xC];                     /* maybe part of sp4C[4]? */
    /* 0x5C */ Gfx *sp5C;                           /* inferred */
    /* 0x60 */ f32 sp60;                            /* inferred */
    /* 0x64 */ f32 sp64;                            /* inferred */
    /* 0x68 */ f32 sp68;                            /* inferred */
    /* 0x6C */ char pad6C[0x20];                    /* maybe part of sp68[9]? */
    /* 0x8C */ s32 sp8C;                            /* inferred */
    /* 0x90 */ char pad90[0x4];
    /* 0x94 */ void *sp94;                          /* inferred */
    /* 0x98 */ u32 sp98;                            /* inferred */
    /* 0x9C */ RoomMesh *sp9C;                      /* inferred */
    /* 0xA0 */ Gfx *spA0;                           /* inferred */
    /* 0xA4 */ Camera *spA4;                        /* inferred */
};                                                  /* size = 0xA8 */

struct _mips2c_stack_func_8012EBF8 {
    /* 0x00 */ char pad0[0x24];
    /* 0x24 */ ActorContext *sp24;                  /* inferred */
};                                                  /* size = 0x28 */

void *func_800C98CC(CollisionContext *, s16, ?);    /* extern */
? func_800E01B8(f32 *, Camera *);                   /* extern */
u32 func_80182CBC(Gfx *);                           /* extern */
u32 func_80182CCC();                                /* extern */
static ? D_801ABAB0;                                /* unable to generate initializer */
static ? D_801E3BB0;                                /* unable to generate initializer; const */
Vec3f D_801C1D10 = {0.0f, 0.0f, 0.0f};
RSPMatrix D_801D1DE0 = {
    {1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1},
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
};
GameInfo *gGameInfo;
SaveContext gSaveContext;
u32 gSegments[16];
void (*roomDrawFuncs[4])(GlobalContext *, Room *, u32) = {
    Room_DrawType0Mesh,
    Room_DrawType1Mesh,
    Room_DrawType2Mesh,
    Room_DrawType3Mesh,
};

