typedef struct {
    /* 0x00 */ Room currRoom;
    /* 0x14 */ Room prevRoom;
    /* 0x28 */ void *roomMemPages[2];
    /* 0x30 */ u8 activeMemPage;
    /* 0x31 */ s8 unk31;
    /* 0x32 */ char pad32[0x2];                     /* maybe part of unk31[3]? */
    /* 0x34 */ void *activeRoomVram;
    /* 0x38 */ DmaRequest dmaRequest;
    /* 0x58 */ OSMesgQueue loadQueue;
    /* 0x70 */ void *loadMsg[1];
    /* 0x74 */ void *unk74;
    /* 0x78 */ s8 unk78;
    /* 0x79 */ s8 unk79;
    /* 0x7A */ s16 unk7A;                           /* inferred */
    /* 0x7C */ s16 unk7C;                           /* inferred */
    /* 0x7E */ char pad7E[0x2];
} RoomContext;                                      /* size = 0x80 */

struct _mips2c_stack_AnimatedMat_Draw {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_AnimatedMat_DrawAlpha {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_AnimatedMat_DrawAlphaOpa {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_AnimatedMat_DrawAlphaStep {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_AnimatedMat_DrawAlphaStepOpa {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_AnimatedMat_DrawAlphaStepXlu {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_AnimatedMat_DrawAlphaXlu {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_AnimatedMat_DrawColor {
    /* 0x00 */ char pad0[0x18];
    /* 0x18 */ s32 sp18;                            /* inferred */
    /* 0x1C */ char pad1C[0x4];
    /* 0x20 */ F3DPrimColor *sp20;                  /* inferred */
    /* 0x24 */ char pad24[0x4];
};                                                  /* size = 0x28 */

struct _mips2c_stack_AnimatedMat_DrawColorLerp {
    /* 0x00 */ char pad0[0x30];
    /* 0x30 */ void *sp30;                          /* inferred */
    /* 0x34 */ char pad34[0xC];                     /* maybe part of sp30[4]? */
    /* 0x40 */ s8 sp40;                             /* inferred */
    /* 0x41 */ s8 sp41;                             /* inferred */
    /* 0x42 */ s8 sp42;                             /* inferred */
    /* 0x43 */ s8 sp43;                             /* inferred */
    /* 0x44 */ void *sp44;                          /* inferred */
    /* 0x48 */ s8 sp48;                             /* inferred */
    /* 0x49 */ s8 sp49;                             /* inferred */
    /* 0x4A */ s8 sp4A;                             /* inferred */
    /* 0x4B */ s8 sp4B;                             /* inferred */
    /* 0x4C */ s8 sp4C;                             /* inferred */
    /* 0x4D */ char pad4D[0x27];                    /* maybe part of sp4C[40]? */
    /* 0x74 */ void *sp74;                          /* inferred */
};                                                  /* size = 0x78 */

struct _mips2c_stack_AnimatedMat_DrawColorNonLinearInterp {
    /* 0x000 */ char pad0[0x3C];
    /* 0x03C */ s32 sp3C;                           /* inferred */
    /* 0x040 */ char pad40[0x30];                   /* maybe part of sp3C[13]? */
    /* 0x070 */ f32 sp70;                           /* inferred */
    /* 0x074 */ char pad74[0xC4];                   /* maybe part of sp70[50]? */
    /* 0x138 */ f32 sp138;                          /* inferred */
    /* 0x13C */ char pad13C[0xC4];                  /* maybe part of sp138[50]? */
    /* 0x200 */ f32 sp200;                          /* inferred */
    /* 0x204 */ char pad204[0xC4];                  /* maybe part of sp200[50]? */
    /* 0x2C8 */ f32 sp2C8;                          /* inferred */
    /* 0x2CC */ char pad2CC[0xC4];                  /* maybe part of sp2C8[50]? */
    /* 0x390 */ f32 sp390;                          /* inferred */
    /* 0x394 */ char pad394[0xC4];                  /* maybe part of sp390[50]? */
    /* 0x458 */ f32 sp458;                          /* inferred */
    /* 0x45C */ char pad45C[0xC4];                  /* maybe part of sp458[50]? */
    /* 0x520 */ f32 sp520;                          /* inferred */
    /* 0x524 */ char pad524[0xC4];                  /* maybe part of sp520[50]? */
    /* 0x5E8 */ f32 sp5E8;                          /* inferred */
    /* 0x5EC */ char pad5EC[0xC4];                  /* maybe part of sp5E8[50]? */
    /* 0x6B0 */ f32 sp6B0;                          /* inferred */
    /* 0x6B4 */ char pad6B4[0xC4];                  /* maybe part of sp6B0[50]? */
    /* 0x778 */ f32 sp778;                          /* inferred */
    /* 0x77C */ char pad77C[0xC4];                  /* maybe part of sp778[50]? */
    /* 0x840 */ u8 sp840;                           /* inferred */
    /* 0x841 */ u8 sp841;                           /* inferred */
    /* 0x842 */ u8 sp842;                           /* inferred */
    /* 0x843 */ u8 sp843;                           /* inferred */
    /* 0x844 */ u8 sp844;                           /* inferred */
    /* 0x845 */ u8 sp845;                           /* inferred */
    /* 0x846 */ u8 sp846;                           /* inferred */
    /* 0x847 */ u8 sp847;                           /* inferred */
    /* 0x848 */ u8 sp848;                           /* inferred */
    /* 0x849 */ char pad849[0xF];                   /* maybe part of sp848[16]? */
    /* 0x858 */ void *sp858;                        /* inferred */
    /* 0x85C */ char pad85C[0x4];
};                                                  /* size = 0x860 */

struct _mips2c_stack_AnimatedMat_DrawMain {
    /* 0x00 */ char pad0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_AnimatedMat_DrawOpa {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_AnimatedMat_DrawStep {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_AnimatedMat_DrawStepOpa {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_AnimatedMat_DrawStepXlu {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_AnimatedMat_DrawTexCycle {
    /* 0x00 */ char pad0[0x18];
    /* 0x18 */ void *sp18;                          /* inferred */
    /* 0x1C */ char pad1C[0x4];
};                                                  /* size = 0x20 */

struct _mips2c_stack_AnimatedMat_DrawTexScroll {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_AnimatedMat_DrawTwoTexScroll {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_AnimatedMat_DrawXlu {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_AnimatedMat_Lerp {};           /* size 0x0 */

struct _mips2c_stack_AnimatedMat_SetColor {};       /* size 0x0 */

struct _mips2c_stack_AnimatedMat_TexScroll {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_AnimatedMat_TwoLayerTexScroll {
    /* 0x00 */ char pad0[0x40];
};                                                  /* size = 0x40 */

struct _mips2c_stack_Scene_DrawConfig3 {
    /* 0x00 */ char pad0[0x44];
    /* 0x44 */ u32 sp44;                            /* inferred */
    /* 0x48 */ u32 sp48;                            /* inferred */
    /* 0x4C */ char pad4C[0x10];                    /* maybe part of sp48[5]? */
    /* 0x5C */ Gfx *sp5C;                           /* inferred */
    /* 0x60 */ Gfx *sp60;                           /* inferred */
    /* 0x64 */ Gfx *sp64;                           /* inferred */
    /* 0x68 */ Gfx *sp68;                           /* inferred */
    /* 0x6C */ Gfx *sp6C;                           /* inferred */
    /* 0x70 */ Gfx *sp70;                           /* inferred */
    /* 0x74 */ char pad74[0x8];                     /* maybe part of sp70[3]? */
    /* 0x7C */ u32 sp7C;                            /* inferred */
};                                                  /* size = 0x80 */

struct _mips2c_stack_Scene_DrawConfig4 {
    /* 0x00 */ char pad0[0x38];
    /* 0x38 */ Gfx *sp38;                           /* inferred */
    /* 0x3C */ char pad3C[0x4];
    /* 0x40 */ GraphicsContext *sp40;               /* inferred */
    /* 0x44 */ char pad44[0x4];
};                                                  /* size = 0x48 */

struct _mips2c_stack_Scene_DrawConfig5 {
    /* 0x00 */ char pad0[0x1C];
    /* 0x1C */ GraphicsContext *sp1C;               /* inferred */
    /* 0x20 */ s32 sp20;                            /* inferred */
    /* 0x24 */ s32 sp24;                            /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_Scene_DrawConfigDefault {};    /* size 0x0 */

struct _mips2c_stack_Scene_DrawConfigDoNothing {};  /* size 0x0 */

struct _mips2c_stack_Scene_DrawConfigGreatBayTemple {
    /* 0x00 */ char pad0[0x28];
    /* 0x28 */ Gfx *sp28;                           /* inferred */
    /* 0x2C */ char pad2C[0x10];                    /* maybe part of sp28[5]? */
    /* 0x3C */ GraphicsContext *sp3C;               /* inferred */
    /* 0x40 */ char pad40[0x10];
};                                                  /* size = 0x50 */

struct _mips2c_stack_Scene_DrawConfigMatAnim {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Scene_DrawConfigMatAnimManualStep {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Scene_ExecuteDrawConfig {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Scene_LagrangeInterp {
    /* 0x000 */ char pad0[0x38];
    /* 0x038 */ f32 sp38;                           /* inferred */
    /* 0x03C */ char pad3C[0xC4];
};                                                  /* size = 0x100 */

struct _mips2c_stack_Scene_LagrangeInterpColor {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Scene_SetCullFlag {};          /* size 0x0 */

struct _mips2c_stack_Scene_SetRenderModeXlu {};     /* size 0x0 */

static ? D_801C3C50;                                /* unable to generate initializer */
static ? D_801C3C80;                                /* unable to generate initializer */
static void D_801C3C88;                             /* unable to generate initializer */
static ? gSceneProcDrawFuncs;                       /* unable to generate initializer */
static ? gSceneProcSceneDrawFuncs;                  /* unable to generate initializer */
static f32 sMatAnimAlphaRatio;
static u32 sMatAnimFlags;
static s32 sMatAnimStep;
static ? sSceneDrawDefaultDl;                       /* unable to generate initializer */

void Scene_ExecuteDrawConfig(GlobalContext *globalCtx) {
    *(&gSceneProcSceneDrawFuncs + (globalCtx->sceneConfig * 4))();
}

