struct _mips2c_stack_Door_InitContext {};           /* size 0x0 */

struct _mips2c_stack_Entrance_CreateIndex {};       /* size 0x0 */

struct _mips2c_stack_Entrance_CreateIndexFromSpawn {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Object_GetIndex {};            /* size 0x0 */

struct _mips2c_stack_Object_InitBank {
    /* 0x00 */ char pad0[0x24];
    /* 0x24 */ u32 sp24;                            /* inferred */
    /* 0x28 */ char pad28[0x8];
};                                                  /* size = 0x30 */

struct _mips2c_stack_Object_IsLoaded {};            /* size 0x0 */

struct _mips2c_stack_Object_LoadAll {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_Object_Spawn {
    /* 0x00 */ char pad0[0x18];
    /* 0x18 */ u32 sp18;                            /* inferred */
    /* 0x1C */ u32 sp1C;                            /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_Object_UpdateBank {
    /* 0x00 */ char pad0[0x48];
};                                                  /* size = 0x48 */

struct _mips2c_stack_Scene_HeaderCmd09 {};          /* size 0x0 */

struct _mips2c_stack_Scene_HeaderCmd1D {};          /* size 0x0 */

struct _mips2c_stack_Scene_HeaderCmdActorCutsceneCamList {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Scene_HeaderCmdActorCutsceneList {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Scene_HeaderCmdActorList {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Scene_HeaderCmdAltHeaderList {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Scene_HeaderCmdAnimatedMaterials {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Scene_HeaderCmdColHeader {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_Scene_HeaderCmdCutsceneList {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Scene_HeaderCmdEchoSetting {}; /* size 0x0 */

struct _mips2c_stack_Scene_HeaderCmdEntranceList {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Scene_HeaderCmdEnvLightSettings {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Scene_HeaderCmdExitList {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Scene_HeaderCmdLightList {
    /* 0x00 */ char pad0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_Scene_HeaderCmdMesh {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Scene_HeaderCmdMiniMap {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Scene_HeaderCmdMiniMapCompassInfo {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Scene_HeaderCmdObjectList {
    /* 0x00 */ char pad0[0x40];
};                                                  /* size = 0x40 */

struct _mips2c_stack_Scene_HeaderCmdPathList {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Scene_HeaderCmdRoomBehavior {}; /* size 0x0 */

struct _mips2c_stack_Scene_HeaderCmdRoomList {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Scene_HeaderCmdSetAreaVisitedFlag {}; /* size 0x0 */

struct _mips2c_stack_Scene_HeaderCmdSkyboxDisables {}; /* size 0x0 */

struct _mips2c_stack_Scene_HeaderCmdSkyboxSettings {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Scene_HeaderCmdSoundSettings {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Scene_HeaderCmdSpawnList {
    /* 0x00 */ char pad0[0x24];
    /* 0x24 */ void *sp24;                          /* inferred */
    /* 0x28 */ ObjectContext *sp28;                 /* inferred */
    /* 0x2C */ char pad2C[0x8];                     /* maybe part of sp28[3]? */
    /* 0x34 */ void *sp34;                          /* inferred */
    /* 0x38 */ char pad38[0x8];
};                                                  /* size = 0x40 */

struct _mips2c_stack_Scene_HeaderCmdSpecialFiles {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Scene_HeaderCmdTimeSettings {
    /* 0x00 */ char pad0[0x18];
    /* 0x18 */ void *sp18;                          /* inferred */
    /* 0x1C */ char pad1C[0x4];
};                                                  /* size = 0x20 */

struct _mips2c_stack_Scene_HeaderCmdTransiActorList {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Scene_HeaderCmdWindSettings {}; /* size 0x0 */

struct _mips2c_stack_Scene_LoadAreaTextures {
    /* 0x00 */ char pad0[0x18];
    /* 0x18 */ u32 sp18;                            /* inferred */
    /* 0x1C */ u32 sp1C;                            /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_Scene_ProcessHeader {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_Scene_SetExitFade {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8012F73C {};              /* size 0x0 */

void func_80160AF8(Actor *thisx, GlobalContext *globalCtx); /* extern */
void func_80160B40(Actor *thisx, GlobalContext *globalCtx); /* extern */
void func_80160B80(Actor *thisx, GlobalContext *globalCtx); /* extern */
void func_80160BC0(Actor *thisx, GlobalContext *globalCtx); /* extern */
extern void ArmsHook_SetupAction;
extern void BgCtowerGear_Splash;
extern void BgIkanaShutter_AllSwitchesPressed;
extern void BgKin2Fence_CheckHitMask;
extern void DmChar07_SetupAction;
extern void DoorAna_SetupAction;
extern void DoorSpiral_SetupAction;
extern void EnClearTag_CreateDebrisEffect;
extern void EnFg_UpdateAnimation;
extern void EnFsn_TestItemSelected;
extern void EnGirlA_SetupAction;
extern void EnMaYts_UpdateEyes;
extern void EnOkarinaEffect_SetupAction;
extern void EnOssan_SetupAction;
