static ? D_801C3C50;                                /* unable to generate initializer */
static ? D_801C3C80;                                /* unable to generate initializer */
static void D_801C3C88;                             /* unable to generate initializer */
static ? gSceneProcDrawFuncs;                       /* unable to generate initializer */
static ? gSceneProcSceneDrawFuncs;                  /* unable to generate initializer */
static f32 sMatAnimAlphaRatio;
static u32 sMatAnimFlags;
static s32 sMatAnimStep;
static ? sSceneDrawDefaultDl;                       /* unable to generate initializer */

typedef struct {
    /* 0x0000 */ Room currRoom;
    /* 0x0014 */ Room prevRoom;
    /* 0x0028 */ void *roomMemPages[2];
    /* 0x0030 */ u8 activeMemPage;
    /* 0x0031 */ s8 unk31;
    /* 0x0032 */ char pad32[0x2];                   /* maybe part of unk31[3]? */
    /* 0x0034 */ void *activeRoomVram;
    /* 0x0038 */ DmaRequest dmaRequest;
    /* 0x0058 */ OSMesgQueue loadQueue;
    /* 0x0070 */ void *loadMsg[1];
    /* 0x0074 */ void *unk74;
    /* 0x0078 */ s8 unk78;
    /* 0x0079 */ s8 unk79;
    /* 0x007A */ s16 unk7A;                         /* inferred */
    /* 0x007C */ s16 unk7C;                         /* inferred */
    /* 0x007E */ char pad7E[0x2];                   /* maybe part of unk7C[2]? */
} RoomContext;                                      /* size 0x80 */

void Scene_ExecuteDrawConfig(GlobalContext *globalCtx) {
    *(&gSceneProcSceneDrawFuncs + (globalCtx->sceneConfig * 4))();
}

void Scene_DrawConfigDefault(GlobalContext *globalCtx) {
    Gfx *temp_a0;
    Gfx *temp_a0_2;
    GraphicsContext *temp_v0;

    temp_v0 = globalCtx->state.gfxCtx;
    temp_a0 = temp_v0->polyOpa.p;
    temp_v0->polyOpa.p = temp_a0 + 8;
    temp_a0->words.w1 = (u32) &sSceneDrawDefaultDl;
    temp_a0->words.w0 = 0xDE000000;
    temp_a0_2 = temp_v0->polyXlu.p;
    temp_v0->polyXlu.p = temp_a0_2 + 8;
    temp_a0_2->words.w1 = (u32) &sSceneDrawDefaultDl;
    temp_a0_2->words.w0 = 0xDE000000;
}

Gfx *AnimatedMat_TexScroll(GlobalContext *globalCtx, AnimatedMatTexScrollParams *params) {
    s32 temp_v0;

    temp_v0 = sMatAnimStep;
