struct _mips2c_stack_Sram_Alloc {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Sram_CalcChecksum {};          /* size 0x0 */

struct _mips2c_stack_Sram_GenerateRandomSaveFields {
    /* 0x00 */ char pad0[0x2A];
    /* 0x2A */ s16 sp2A;                            /* inferred */
    /* 0x2C */ char pad2C[0x4];
};                                                  /* size = 0x30 */

struct _mips2c_stack_Sram_IncrementDay {};          /* size 0x0 */

struct _mips2c_stack_Sram_nop8014750C {};           /* size 0x0 */

struct _mips2c_stack_func_80143A10 {};              /* size 0x0 */

struct _mips2c_stack_func_80143A54 {};              /* size 0x0 */

struct _mips2c_stack_func_80143AC4 {};              /* size 0x0 */

struct _mips2c_stack_func_80143B0C {
    /* 0x00 */ char pad0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80144628 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80144890 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80144968 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80144A94 {
    /* 0x00 */ char pad0[0x20];
    /* 0x20 */ s32 sp20;                            /* inferred */
    /* 0x24 */ char pad24[0x4];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80144E78 {
    /* 0x00 */ char pad0[0x18];
    /* 0x18 */ void *sp18;                          /* inferred */
    /* 0x1C */ void *sp1C;                          /* inferred */
    /* 0x20 */ s32 sp20;                            /* inferred */
    /* 0x24 */ u32 *sp24;                           /* inferred */
    /* 0x28 */ char pad28[0xC];                     /* maybe part of sp24[4]? */
    /* 0x34 */ s32 sp34;                            /* inferred */
    /* 0x38 */ char pad38[0x8];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_8014546C {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80145698 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_801457CC {
    /* 0x00 */ char pad0[0x40];
    /* 0x40 */ void *sp40;                          /* inferred */
    /* 0x44 */ char pad44[0xC];                     /* maybe part of sp40[4]? */
    /* 0x50 */ s32 sp50;                            /* inferred */
    /* 0x54 */ s32 sp54;                            /* inferred */
    /* 0x58 */ s32 sp58;                            /* inferred */
    /* 0x5C */ u32 *sp5C;                           /* inferred */
    /* 0x60 */ SramContext **sp60;                  /* inferred */
    /* 0x64 */ s32 sp64;                            /* inferred */
    /* 0x68 */ char pad68[0x6];                     /* maybe part of sp64[2]? */
    /* 0x6E */ u16 sp6E;                            /* inferred */
    /* 0x70 */ char pad70[0x4];                     /* maybe part of sp6E[3]? */
    /* 0x74 */ s16 sp74;                            /* inferred */
    /* 0x76 */ u16 sp76;                            /* inferred */
    /* 0x78 */ char pad78[0x2];
    /* 0x7A */ u16 sp7A;                            /* inferred */
    /* 0x7C */ char pad7C[0x4];
};                                                  /* size = 0x80 */

struct _mips2c_stack_func_80146580 {
    /* 0x00 */ char pad0[0x1C];
    /* 0x1C */ s32 sp1C;                            /* inferred */
    /* 0x20 */ char pad20[0x8];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80146628 {
    /* 0x00 */ char pad0[0x20];
    /* 0x20 */ s16 sp20;                            /* inferred */
    /* 0x22 */ char pad22[0x6];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80146AA0 {
    /* 0x00 */ char pad0[0x20];
    /* 0x20 */ void *sp20;                          /* inferred */
    /* 0x24 */ char pad24[0x14];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80146DF8 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80146E40 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80146EBC {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80146EE8 {
    /* 0x00 */ char pad0[0x18];
    /* 0x18 */ void *sp18;                          /* inferred */
    /* 0x1C */ char pad1C[0xC];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80146F5C {
    /* 0x00 */ char pad0[0x1E];
    /* 0x1E */ u16 sp1E;                            /* inferred */
    /* 0x20 */ s32 sp20;                            /* inferred */
    /* 0x24 */ s32 sp24;                            /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80147008 {};              /* size 0x0 */

struct _mips2c_stack_func_80147020 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80147068 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80147138 {};              /* size 0x0 */

struct _mips2c_stack_func_80147150 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80147198 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80147314 {
    /* 0x00 */ char pad0[0x24];
    /* 0x24 */ u32 *sp24;                           /* inferred */
    /* 0x28 */ void *sp28;                          /* inferred */
    /* 0x2C */ char pad2C[0x4];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80147414 {
    /* 0x00 */ char pad0[0x24];
    /* 0x24 */ SaveContext *sp24;                   /* inferred */
    /* 0x28 */ void *sp28;                          /* inferred */
    /* 0x2C */ char pad2C[0x4];
};                                                  /* size = 0x30 */

s16 convert_scene_number_among_shared_scenes(s16);  /* extern */
? func_800F3B2C(GlobalContext *);                   /* extern */
? func_801149A0(?, u8, u32, u16 *);                 /* extern */
s32 func_80185968(void *, SramContext *, u32, SaveContext *); /* extern */
? func_80185DDC(u32 *, u32, u32, SramContext *);    /* extern */
s32 func_80185EC4();                                /* extern */
s32 func_80185F04();                                /* extern */
? func_80185F64(u32 *, SramContext *, u32, void *); /* extern */
? func_801A3D98(s8);                                /* extern */
void Sram_GenerateRandomSaveFields(u8);             /* static */
void Sram_nop8014750C(s32 arg0);                    /* static */
void func_80143A54();                               /* static */
void func_80144628();                               /* static */
