s32 func_8017D2FC(f32, f32, s32, s32, Vec3f *, Vec3f *, Vec3f *, s32); /* extern */
Actor *func_8013A7C0(GlobalContext *arg0, s32 arg1); /* static */
Gfx *func_8013A860(GlobalContext *arg0, u8 arg1, void **arg2, Vec3s *arg3, s32 (*arg4)(GlobalContext *, s32, u32 *, f32 *, Vec3s *, Actor *, Gfx **), ? (*arg5)(GlobalContext *, s32, u32 *, Vec3s *, Actor *, Gfx **), ? (*arg6)(GlobalContext *, s32, Actor *, Gfx **), Actor *arg7, RSPMatrix **arg8, Gfx *arg9); /* static */
? func_8013AD9C(s16 arg0, s16 arg1, void *arg2, s16 *arg3, s32 arg4, s32 arg5); /* static */
s32 func_8013B010(f32 *arg0, s32 arg1, s32 arg2, s32 arg3, s32 arg4, s32 arg5, void *arg6); /* static */
void func_8013B0C8(s32 arg0, f32 arg1, s32 arg2, s32 arg3, void *arg4, ? *); /* static */
void *func_8013B350(f32 *arg0, f32 *arg1, s32 arg2, f32 arg3, s32 arg4, void *arg5, void *arg6); /* static */
s32 func_8013BD40(void *arg0, void *arg1, s32 arg2); /* static */
u8 *func_8013BEDC(void *arg0, s32 arg1, s32 arg2, s32 *arg3); /* static */
s32 func_8013C068(u8 *arg0, s32 arg1, Vec3f *arg2, f32 arg3, s32 arg4); /* static */
? func_8013C624(Actor *arg0, u8 *arg1, s32 *arg2, f32 *arg3, s32 arg4, s32 arg5); /* static */
? func_8013C8B8(void *arg0, s32 arg1, void *arg2);  /* static */
void func_8013CC2C(s32 arg0, s32 arg1, s32 arg2, u8 arg3); /* static */
void func_8013CD64(void *arg0, void *arg1, s32 arg2, f32 arg3, u8 arg4, u8 *arg5, s8 *arg6); /* static */
void func_8013CF04(void *arg0, GraphicsContext **arg1, u32 arg2); /* static */
s16 func_8013D0E0(s16 *arg0, s16 arg1, s16 arg2, f32 arg3, f32 arg4, f32 arg5); /* static */
void func_8013D720(void *arg0, PosRot *arg1, f32 *arg2); /* static */
void func_8013D83C(void *arg0, s32 arg1, void *arg2, f32 *arg3); /* static */
? func_8013DC40(s32 arg0, s32 arg1, s32 arg2, void *arg3); /* static */
u8 func_8013DCCC(s32 arg0, s32 arg1);               /* static */
? func_8013E054(s32 arg0, void *arg1);              /* static */
? func_8013E07C(s32 arg0, void *arg1);              /* static */
void func_8013E4B0(Vec3f *arg0, Vec3s *arg1, f32 *arg2, void *arg3); /* static */
s16 *func_8013E640(s32 arg0, ? arg1, s16 *arg2, s32 arg3, s16 arg4, s32 arg5, s32 (*arg6)(s32, ?, s16 *, s32)); /* static */
s32 func_8013E748(Actor *arg0, GlobalContext *arg1, f32 arg2, f32 arg3, s32 arg4, s16 *arg5, s32 (*arg6)(GlobalContext *, Actor *, s16 *, ?)); /* static */
s32 func_8013E7C0(GlobalContext *arg0, Actor *arg1, s16 *arg2, ? *); /* static */
void func_8013E8F8(Actor *arg2, GlobalContext *arg3, s32 arg4, s16 arg5, s16 arg6); /* static */
static ? D_801C5D10;                                /* unable to generate initializer */
static ? D_801C5D60;                                /* unable to generate initializer */
static ? D_801C5D80;                                /* unable to generate initializer */
static ? D_801DE5E0;                                /* unable to generate initializer; const */
Vec3f D_801D15B0 = {0.0f, 0.0f, 0.0f};
f32 gFramerateDivisorHalf = 0.5f;
SaveContext gSaveContext;

typedef struct EnDno_ActorUnkStruct {
    /* 0x0000 */ Vec3f unk_00;
    /* 0x000C */ s32 unkC;                          /* inferred */
    /* 0x0010 */ s16 unk_10;
    /* 0x0012 */ char pad12[0x2];                   /* maybe part of unk_10[2]? */
    /* 0x0014 */ s32 unk14;                         /* inferred */
    /* 0x0018 */ s32 unk18;                         /* inferred */
    /* 0x001C */ u8 unk_1C;
    /* 0x001D */ u8 unk_1D;
    /* 0x001E */ char pad1E[0x2];                   /* maybe part of unk_1D[3]? */
    /* 0x0020 */ Vec3f unk_20;
    /* 0x002C */ Vec3f unk_2C;
    /* 0x0038 */ Vec3f unk38;                       /* inferred */
    /* 0x0044 */ Vec3f *unk44;                      /* inferred */
    /* 0x0048 */ Actor *unk_48;
    /* 0x004C */ f32 unk_4C;
    /* 0x0050 */ f32 unk_50;
    /* 0x0054 */ s16 unk_54;
    /* 0x0056 */ s16 unk_56;
    /* 0x0058 */ s32 unk_58;
    /* 0x005C */ s32 (*unk_5C)(GlobalContext *, EnDno_ActorUnkStruct *);
    /* 0x0060 */ s32 (*unk_60)(GlobalContext *, EnDno_ActorUnkStruct *);
    /* 0x0064 */ s32 (*unk_64)(GlobalContext *, EnDno_ActorUnkStruct *);
    /* 0x0068 */ s32 (*unk_68)(GlobalContext *, EnDno_ActorUnkStruct *);
} EnDno_ActorUnkStruct;                             /* size 0x6C */

Actor *func_8013A7C0(GlobalContext *arg0, s32 arg1) {
    Actor *temp_v0;
    Actor *temp_v1;
    Actor *phi_s0;
    Actor *phi_v1;

    phi_s0 = NULL;
loop_1:
    temp_v0 = func_ActorCategoryIterateById(arg0, phi_s0, 0xA, (s32) 5);
    phi_v1 = temp_v0;
    if ((temp_v0 != 0) && ((temp_v0->unk1A4 != 5) || ((arg1 & 0xFF) != temp_v0->unk1A5))) {
        temp_v1 = temp_v0->next;
        if (temp_v1 == 0) {
            phi_v1 = NULL;
        } else {
            phi_s0 = temp_v1;
            goto loop_1;
        }
    }
    return phi_v1;
}

