struct _mips2c_stack_func_80142440 {
    /* 0x000 */ char pad_0[0x40];
    /* 0x040 */ s32 sp40;                           /* inferred */
    /* 0x044 */ char pad_44[0xE0];                  /* maybe part of sp40[57]? */
    /* 0x124 */ ? sp124;                            /* inferred */
    /* 0x124 */ char pad_124[0x64];
    /* 0x188 */ s32 sp188;                          /* inferred */
    /* 0x18C */ char pad_18C[0x60];                 /* maybe part of sp188[25]? */
    /* 0x1EC */ ? sp1EC;                            /* inferred */
    /* 0x1EC */ char pad_1EC[0x64];
    /* 0x250 */ ? sp250;                            /* inferred */
    /* 0x250 */ char pad_250[0x64];
    /* 0x2B4 */ ? sp2B4;                            /* inferred */
    /* 0x2B4 */ char pad_2B4[0x6A];
    /* 0x31E */ s16 sp31E;                          /* inferred */
    /* 0x320 */ s16 sp320;                          /* inferred */
    /* 0x322 */ char pad_322[0x16];
};                                                  /* size = 0x338 */

struct _mips2c_stack_func_80143148 {
    /* 0x00 */ char pad_0[0x48];
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_801431E8 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ u32 sp24;                            /* inferred */
    /* 0x28 */ char pad_28[0x4];
    /* 0x2C */ s32 sp2C;                            /* inferred */
    /* 0x30 */ char pad_30[0x8];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80143324 {
    /* 0x00 */ char pad_0[0x30];
    /* 0x30 */ void *sp30;                          /* inferred */
    /* 0x34 */ void **sp34;                         /* inferred */
    /* 0x38 */ char pad_38[0x8];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_801434E4 {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ TwoHeadArena *sp20;                  /* inferred */
    /* 0x24 */ char pad_24[0x4];
};                                                  /* size = 0x28 */

s32 D_801C5E30[6] = {0, 0x2000, 0x4000, 0x6000, 0x8000, 0xC000};
u16 D_801C5E48[32] = {
    0,
    2,
    0xA,
    0xC,
    2,
    4,
    0xC,
    0xE,
    0xA,
    0xC,
    0x14,
    0x16,
    0xC,
    0xE,
    0x16,
    0x18,
    1,
    3,
    5,
    6,
    7,
    8,
    9,
    0xB,
    0xD,
    0xF,
    0x10,
    0x11,
    0x12,
    0x13,
    0x15,
    0x17,
};
s32 D_801C5E88[5] = {0, 0x7C0, 0xF80, 0x1740, 0x1F00};
s32 D_801C5E9C[5] = {0, 0x7C0, 0xF80, 0x1740, 0x1F00};
s32 D_801C5EB0[5] = {0, 0x7C0, 0xF80, 0x7C0, 0};
s16 D_801C5EC4[64] = {
    0,
    0x10,
    0x13,
    0x12,
    0x10,
    1,
    0x14,
    0x13,
    1,
    0x11,
    0x15,
    0x14,
    0x11,
    5,
    0x16,
    0x15,
    0x12,
    0x13,
    0x17,
    2,
    0x13,
    0x14,
    3,
    0x17,
    0x14,
    0x15,
    0x18,
    3,
    0x15,
    0x16,
    7,
    0x18,
    2,
    0x17,
    0x1A,
    0x19,
    0x17,
