s32 func_800B8718(EnZot *, GlobalContext *);        /* extern */
? func_800B874C(EnZot *, GlobalContext *, ?, f32);  /* extern */
? func_8019B544(?);                                 /* extern */
? func_8019C300(?);                                 /* extern */
void func_80B965D0(EnZot *arg0, GlobalContext *arg1); /* static */
void func_80B96BEC(EnZot *arg0, s16 arg1, u8 arg2, GlobalContext *); /* static */
s32 func_80B96CE4(EnZot *arg0);                     /* static */
void func_80B96D4C(EnZot *arg0);                    /* static */
s32 func_80B96DF0(Actor *arg0, GlobalContext *arg1); /* static */
s32 func_80B96E5C(EnZot *arg0);                     /* static */
? func_80B96FB0(EnZot *arg0);                       /* static */
void func_80B97100(EnZot *arg0, GlobalContext *arg1); /* static */
void func_80B97110(Actor *arg0, GlobalContext *arg1); /* static */
void func_80B97194(EnZot *arg0, GlobalContext *arg1); /* static */
void func_80B97240(EnZot *arg0, GlobalContext *arg1); /* static */
void func_80B972E8(Actor *arg0, GlobalContext *arg1); /* static */
void func_80B973BC(EnZot *arg0, GlobalContext *arg1); /* static */
void func_80B975F8(EnZot *arg0, GlobalContext *arg1); /* static */
void func_80B9765C(EnZot *arg0, GlobalContext *arg1); /* static */
void func_80B97708(EnZot *arg0, GlobalContext *arg1); /* static */
void func_80B9787C(Actor *arg0, GlobalContext *arg1); /* static */
void func_80B979DC(EnZot *arg0, GlobalContext *arg1); /* static */
void func_80B97A44(EnZot *arg0, GlobalContext *arg1); /* static */
void func_80B97B5C(EnZot *arg0, GlobalContext *arg1); /* static */
void func_80B97BF8(Actor *arg0, GlobalContext *arg1); /* static */
void func_80B97C40(void *arg0, GlobalContext *arg1); /* static */
void func_80B97CC8(Actor *arg0, GlobalContext *arg1); /* static */
void func_80B97D6C(EnZot *arg0, GlobalContext *arg1); /* static */
void func_80B97E0C(EnZot *arg0, GlobalContext *arg1); /* static */
void func_80B97E4C(EnZot *arg0, GlobalContext *arg1); /* static */
void func_80B97FD0(EnZot *arg0, GlobalContext *arg1); /* static */
void func_80B980FC(EnZot *arg0, GlobalContext *arg1); /* static */
void func_80B98178(Actor *arg0, GlobalContext *arg1); /* static */
void func_80B98348(Actor *arg0, GlobalContext *arg1, Actor *, GlobalContext *); /* static */
void func_80B9849C(Actor *arg0, GlobalContext *arg1); /* static */
void func_80B9854C(Actor *arg0, Actor *arg1);       /* static */
void func_80B985EC(Actor *arg0, GlobalContext *arg1); /* static */
void func_80B98728(Actor *arg0, GlobalContext *arg1); /* static */
void func_80B98998(EnZot *arg0, GlobalContext *arg1); /* static */
void func_80B98A4C(Actor *arg0, GlobalContext *arg1); /* static */
void func_80B98AD0(EnZot *arg0, GlobalContext *arg1); /* static */
void func_80B98BF4(Actor *arg0, GlobalContext *arg1); /* static */
void func_80B98CA8(EnZot *arg0, GlobalContext *arg1); /* static */
void func_80B98E10(Actor *arg0, GlobalContext *arg1); /* static */
void func_80B98F30(Actor *arg0, GlobalContext *arg1); /* static */
void func_80B98F94(Actor *arg0, GlobalContext *arg1); /* static */
void func_80B990A4(EnZot *arg0, GlobalContext *arg1); /* static */
void func_80B99160(Actor *arg0, GlobalContext *arg1); /* static */
void func_80B991E4(EnZot *arg0, GlobalContext *arg1); /* static */
void func_80B992C0(EnZot *arg0, GlobalContext *arg1); /* static */
void func_80B99384(EnZot *arg0, GlobalContext *arg1); /* static */
Gfx *func_80B99580(GraphicsContext *arg0);          /* static */
s32 func_80B995A4(GlobalContext *arg0, s32 arg1, Gfx **arg2, Vec3f *arg3, Vec3s *arg4, Actor *arg5); /* static */
void func_80B99758(GlobalContext *arg0, s32 arg1, Gfx **arg2, Vec3s *arg3, Actor *arg4); /* static */
extern AnimationHeader D_06004248;
extern FlexSkeletonHeader D_0600D208;
extern AnimationHeader D_0600DE20;
static ColliderCylinderInit D_80B998E0 = {
    {0xA, 0, 0x11, 0x39, 0x10, 1},
    {0, {0, 0, 0}, {0xF7CFFFFF, 0, 0}, 0, 1, 1},
    {0x1E, 0x28, 0, {0, 0, 0}},
};
static ? D_80B9990C;                                /* unable to generate initializer */
static Vec3f D_80B99934 = {400.0f, 0.0f, 0.0f};
static ? D_80B99940;                                /* unable to generate initializer */

typedef struct EnZot {
    /* 0x0000 */ Actor actor;
    /* 0x0144 */ SkelAnime unk144;                  /* inferred */
    /* 0x0188 */ ColliderCylinder unk188;           /* inferred */
    /* 0x01D4 */ Vec3s unk1D4;                      /* inferred */
    /* 0x01DA */ char pad1DA[0x72];                 /* maybe part of unk1D4[20]? */
    /* 0x024C */ Vec3s unk24C;                      /* inferred */
    /* 0x0252 */ char pad252[0x72];                 /* maybe part of unk24C[20]? */
    /* 0x02C4 */ Vec3s unk2C4;                      /* inferred */
    /* 0x02CA */ Vec3s unk2CA;                      /* inferred */
    /* 0x02D0 */ Path *unk2D0;                      /* inferred */
    /* 0x02D4 */ s32 unk2D4;                        /* inferred */
    /* 0x02D8 */ Actor *unk2D8;                     /* inferred */
    /* 0x02DC */ char pad2DC[0x10];                 /* maybe part of unk2D8[5]? */
    /* 0x02EC */ s16 unk2EC;                        /* inferred */
    /* 0x02EE */ s16 unk2EE;                        /* inferred */
    /* 0x02F0 */ s16 unk2F0;                        /* inferred */
    /* 0x02F2 */ u16 unk2F2;                        /* inferred */
    /* 0x02F4 */ s16 unk2F4;                        /* inferred */
    /* 0x02F6 */ char pad2F6[0x2];                  /* maybe part of unk2F4[2]? */
    /* 0x02F8 */ void (*actionFunc)(EnZot *, GlobalContext *);
} EnZot;                                            /* size 0x2FC */

void func_80B965D0(EnZot *arg0, GlobalContext *arg1) {
    s32 temp_s2;
    void *temp_v0;
    EnZot *phi_s1;
    void *phi_s0;
    s32 phi_s2;

    temp_v0 = arg0->unk2D0;
    if ((temp_v0 != 0) && ((s32) temp_v0->count >= 5)) {
        phi_s1 = arg0;
        phi_s0 = Lib_SegmentedToVirtual(temp_v0->points);
        phi_s2 = 0;
        do {
            if (phi_s1->unk2D8 == 0) {
                phi_s1->unk2D8 = Actor_Spawn(arg1 + 0x1CA0, arg1, 0x82, (f32) phi_s0->unk0, (f32) phi_s0->unk2, (f32) phi_s0->unk4, (s16) 0, (s16) 0, (s16) 0, (s16) 0x13F);
            }
            temp_s2 = phi_s2 + 4;
            phi_s1 += 4;
            phi_s0 += 6;
            phi_s2 = temp_s2;
        } while (temp_s2 != 0x14);
    }
}

