s32 func_800C9EBC(GlobalContext *, s32, f32, f32, f32 *, ? *, ? *); /* extern */
void func_80A687A0(EnMushi2 *arg0);                 /* static */
void func_80A68808(EnMushi2 *arg0);                 /* static */
s32 func_80A68860(Actor *arg0, GlobalContext *arg1); /* static */
s32 func_80A68910(EnMushi2 *arg0, GlobalContext *arg1); /* static */
void func_80A68A78(EnMushi2 *arg0, GlobalContext *arg1); /* static */
void func_80A68B3C(EnMushi2 *arg0);                 /* static */
void func_80A68B6C(EnMushi2 *arg0);                 /* static */
s32 func_80A68BA0(EnMushi2 *arg0, EnMushi2 *);      /* static */
void func_80A68BC8(Actor *arg0);                    /* static */
s32 func_80A68C5C(Vec3f *arg0, Vec3f *arg1);        /* static */
s32 func_80A68CE4(Vec3f *arg0, Vec3f *arg1, f32 arg2, f32); /* static */
s32 func_80A68DD4(EnMushi2 *arg0, GlobalContext *arg1); /* static */
void func_80A68ED8(Actor *arg0, EnMushi2 *);        /* static */
void func_80A68F24(EnMushi2 *arg0);                 /* static */
? func_80A68F9C(EnMushi2 *arg0, s16 arg1);          /* static */
? func_80A690C4(EnMushi2 *arg0, s16 arg1);          /* static */
s32 func_80A691EC(EnMushi2 *arg0, CollisionPoly *arg1, f32 arg2); /* static */
void func_80A69388(EnMushi2 *arg0);                 /* static */
void func_80A69424(Actor *arg0, GlobalContext *arg1); /* static */
s32 func_80A69468(EnMushi2 *arg0, GlobalContext *arg1); /* static */
s32 func_80A6958C(EnMushi2 *arg0, GlobalContext *arg1); /* static */
? func_80A6969C(EnMushi2 *arg0, GlobalContext *arg1); /* static */
void func_80A697C4(EnMushi2 *arg0, GlobalContext *arg1); /* static */
s32 func_80A699E4(EnMushi2 *arg0, GlobalContext *arg1); /* static */
f32 func_80A69AA8(f32 arg0, f32 arg1, f32 arg2, void *arg3); /* static */
void func_80A69ADC(EnMushi2 *arg0);                 /* static */
void func_80A69CE0(EnMushi2 *arg0);                 /* static */
void func_80A69D3C(EnMushi2 *arg0);                 /* static */
s32 func_80A69EE4(EnMushi2 *arg0, GlobalContext *arg1); /* static */
void func_80A69F5C(EnMushi2 *arg0, GlobalContext *arg1); /* static */
? func_80A6A024(EnMushi2 *arg0);                    /* static */
? func_80A6A058(EnMushi2 *arg0);                    /* static */
? func_80A6A094(EnMushi2 *arg0);                    /* static */
void func_80A6A0D8(EnMushi2 *arg0);                 /* static */
void func_80A6A300(EnMushi2 *arg0);                 /* static */
void func_80A6A508(EnMushi2 *arg0);                 /* static */
void func_80A6A794(EnMushi2 *arg0);                 /* static */
void func_80A6A984(EnMushi2 *arg0);                 /* static */
void func_80A6AAA4(EnMushi2 *arg0);                 /* static */
void func_80A6AE14(EnMushi2 *arg0);                 /* static */
void func_80A6B078(EnMushi2 *arg0);                 /* static */
extern SkeletonHeader D_040527A0;
static ColliderJntSphElementInit D_80A6B950 = {{0, {0, 0, 0}, {0, 0, 0}, 0, 0, 1}, {0, {{0, 0, 0}, 5}, 0x64}};
static ColliderJntSphInit D_80A6B974 = {{0xA, 0, 0, 0x19, 0x10, 0}, 1, &D_80A6B950};
static ? D_80A6B984;                                /* unable to generate initializer */
static ? D_80A6B98C;                                /* unable to generate initializer */
static s32 D_80A6B994 = 0;
static ? D_80A6B998;                                /* unable to generate initializer */
static Vec3f D_80A6B9A0 = {1.0f, 0.0f, 0.0f};
static Vec3f D_80A6B9AC = {0.0f, 1.0f, 0.0f};
static Vec3f D_80A6B9B8 = {0.0f, 0.0f, 1.0f};
static MtxF D_80A6B9C4 = {
    {
        {0.0f, 0.0f, 0.0f, 0.0f},
        {0.0f, 0.0f, 0.0f, 0.0f},
        {0.0f, 0.0f, 0.0f, 0.0f},
        {0.0f, 0.0f, 0.0f, 0.0f},
    },
};
static InitChainEntry D_80A6BA04;                   /* unable to generate initializer */
static ? D_80A6BA14;                                /* unable to generate initializer */

typedef struct EnMushi2 {
    /* 0x0000 */ Actor actor;
    /* 0x0144 */ SkelAnime unk144;                  /* inferred */
    /* 0x0188 */ Vec3s unk188;                      /* inferred */
    /* 0x018E */ char pad18E[0x8A];                 /* maybe part of unk188[24]? */
    /* 0x0218 */ Vec3s unk218;                      /* inferred */
    /* 0x021E */ char pad21E[0x8A];                 /* maybe part of unk218[24]? */
    /* 0x02A8 */ SkelAnime unk2A8;                  /* inferred */
    /* 0x02BA */ u8 unk2BA;                         /* overlap; inferred */
    /* 0x02BB */ char pad2BB[0x4D];                 /* maybe part of unk2BA[78]? */
    /* 0x0308 */ void (*actionFunc)(EnMushi2 *, GlobalContext *);
    /* 0x030C */ s32 unk30C;                        /* inferred */
    /* 0x0310 */ f32 unk310;                        /* inferred */
    /* 0x0314 */ f32 unk314;                        /* inferred */
    /* 0x0318 */ f32 unk318;                        /* inferred */
    /* 0x031C */ f32 unk31C;                        /* inferred */
    /* 0x0320 */ f32 unk320;                        /* inferred */
    /* 0x0324 */ f32 unk324;                        /* inferred */
    /* 0x0328 */ f32 unk328;                        /* inferred */
    /* 0x032C */ f32 unk32C;                        /* inferred */
    /* 0x0330 */ f32 unk330;                        /* inferred */
    /* 0x0334 */ CollisionPoly *unk334;             /* inferred */
    /* 0x0338 */ s32 unk338;                        /* inferred */
    /* 0x033C */ char pad33C[0xC];                  /* maybe part of unk338[4]? */
    /* 0x0348 */ f32 unk348;                        /* inferred */
    /* 0x034C */ Actor *unk34C;                     /* inferred */
    /* 0x0350 */ f32 unk350;                        /* inferred */
    /* 0x0354 */ f32 unk354;                        /* inferred */
    /* 0x0358 */ f32 unk358;                        /* inferred */
    /* 0x035C */ f32 unk35C;                        /* inferred */
    /* 0x0360 */ f32 unk360;                        /* inferred */
    /* 0x0364 */ s16 unk364;                        /* inferred */
    /* 0x0366 */ s16 unk366;                        /* inferred */
    /* 0x0368 */ s16 unk368;                        /* inferred */
    /* 0x036A */ s16 unk36A;                        /* inferred */
    /* 0x036C */ char pad36C[0x2];                  /* maybe part of unk36A[2]? */
    /* 0x036E */ s16 unk36E;                        /* inferred */
    /* 0x0370 */ s16 unk370;                        /* inferred */
    /* 0x0372 */ char pad372[0x2];                  /* maybe part of unk370[2]? */
} EnMushi2;                                         /* size 0x374 */

void func_80A687A0(EnMushi2 *arg0) {
    MtxF *temp_v0;

    temp_v0 = SysMatrix_GetCurrentState();
    temp_v0->mf[3][0] += arg0->unk348 * arg0->unk31C;
    temp_v0->mf[3][1] += arg0->unk348 * arg0->unk320;
    temp_v0->mf[3][2] += arg0->unk348 * arg0->unk324;
}

void func_80A68808(EnMushi2 *arg0) {
    SysMatrix_SetStateRotationAndTranslation(arg0->actor.world.pos.x, arg0->actor.world.pos.y, arg0->actor.world.pos.z, arg0 + 0xBC);
    Matrix_Scale(arg0->actor.scale.x, arg0->actor.scale.y, arg0->actor.scale.z, 1);
    Collider_UpdateSpheres(0, arg0 + 0x2A8);
}

s32 func_80A68860(Actor *arg0, GlobalContext *arg1) {
    s32 sp40;
    CollisionPoly *sp3C;
    WaterBox *sp34;
    f32 sp30;
    CollisionContext *sp2C;
    CollisionContext *temp_a0;
    f32 temp_f0;

    temp_a0 = arg1 + 0x830;
    sp2C = temp_a0;
