typedef struct EnRg {
    /* 0x000 */ Actor actor;
    /* 0x144 */ SkelAnime unk_144;                  /* inferred */
    /* 0x154 */ f32 unk_154;                        /* overlap; inferred */
    /* 0x188 */ void (*actionFunc)(EnRg *, GlobalContext *);
    /* 0x18C */ void *unk_18C;                      /* inferred */
    /* 0x190 */ ColliderCylinder unk_190;           /* inferred */
    /* 0x1DC */ ColliderSphere unk_1DC;             /* inferred */
    /* 0x234 */ s32 unk_234;                        /* inferred */
    /* 0x238 */ Vec3s unk_238;                      /* inferred */
    /* 0x23E */ char pad_23E[0x66];                 /* maybe part of unk_238[18]? */
    /* 0x2A4 */ Vec3s unk_2A4;                      /* inferred */
    /* 0x2AA */ char pad_2AA[0x66];                 /* maybe part of unk_2A4[18]? */
    /* 0x310 */ u16 unk_310;                        /* inferred */
    /* 0x312 */ char pad_312[0x6];                  /* maybe part of unk_310[4]? */
    /* 0x318 */ s16 unk_318;                        /* inferred */
    /* 0x31A */ char pad_31A[0x2];
    /* 0x31C */ s16 unk_31C;                        /* inferred */
    /* 0x31E */ s16 unk_31E;                        /* inferred */
    /* 0x320 */ s16 unk_320;                        /* inferred */
    /* 0x322 */ char pad_322[0x2];
    /* 0x324 */ s16 unk_324;                        /* inferred */
    /* 0x326 */ char pad_326[0x2];
    /* 0x328 */ s16 unk_328;                        /* inferred */
    /* 0x32A */ char pad_32A[0x4];                  /* maybe part of unk_328[3]? */
    /* 0x32E */ s16 unk_32E;                        /* inferred */
    /* 0x330 */ char pad_330[0x4];                  /* maybe part of unk_32E[3]? */
    /* 0x334 */ s32 unk_334;                        /* inferred */
    /* 0x338 */ char pad_338[0x4];
    /* 0x33C */ s32 unk_33C;                        /* inferred */
    /* 0x340 */ s32 unk_340;                        /* inferred */
    /* 0x344 */ s32 unk_344;                        /* inferred */
    /* 0x348 */ char pad_348[0x784];                /* maybe part of unk_344[482]? */
} EnRg;                                             /* size = 0xACC */

struct _mips2c_stack_EnRg_Destroy {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnRg_Draw {
    /* 0x00 */ char pad_0[0x30];
    /* 0x30 */ Gfx *sp30;                           /* inferred */
    /* 0x34 */ char pad_34[0x4];
    /* 0x38 */ GraphicsContext *sp38;               /* inferred */
    /* 0x3C */ char pad_3C[0x4];
};                                                  /* size = 0x40 */

struct _mips2c_stack_EnRg_Init {
    /* 0x00 */ char pad_0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_EnRg_Update {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80BF3920 {
    /* 0x00 */ char pad_0[0x60];
};                                                  /* size = 0x60 */

struct _mips2c_stack_func_80BF3C64 {};              /* size 0x0 */

struct _mips2c_stack_func_80BF3DA0 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80BF3DC4 {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ Collider *sp20;                      /* inferred */
    /* 0x24 */ CollisionCheckContext *sp24;         /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80BF3E88 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80BF3ED4 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80BF3F14 {};              /* size 0x0 */

struct _mips2c_stack_func_80BF3FF8 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80BF4024 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ SkelAnime *sp1C;                     /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80BF409C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80BF40F4 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80BF416C {
    /* 0x00 */ char pad_0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80BF4220 {
    /* 0x00 */ char pad_0[0x34];
    /* 0x34 */ ? sp34;                              /* inferred */
    /* 0x34 */ char pad_34[0xC];
    /* 0x40 */ u32 sp40;                            /* inferred */
    /* 0x44 */ CollisionPoly *sp44;                 /* inferred */
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_80BF42BC {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ s32 sp24;                            /* inferred */
    /* 0x28 */ char pad_28[0x4];
    /* 0x2C */ f32 sp2C;                            /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80BF43FC {
    /* 0x00 */ char pad_0[0x84];
    /* 0x84 */ f32 sp84;                            /* inferred */
    /* 0x88 */ ? sp88;                              /* inferred */
    /* 0x88 */ char pad_88[0x4];
    /* 0x8C */ ? sp8C;                              /* inferred */
    /* 0x8C */ char pad_8C[0x4];
    /* 0x90 */ ?32 sp90;                            /* inferred */
    /* 0x94 */ char pad_94[0x4];
    /* 0x98 */ f32 sp98;                            /* inferred */
    /* 0x9C */ ?32 sp9C;                            /* inferred */
    /* 0xA0 */ char pad_A0[0x4];
    /* 0xA4 */ s32 spA4;                            /* inferred */
};                                                  /* size = 0xA8 */

struct _mips2c_stack_func_80BF4560 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80BF45B4 {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ s32 sp20;                            /* inferred */
    /* 0x24 */ s32 sp24;                            /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80BF47AC {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80BF4934 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80BF4964 {
    /* 0x00 */ char pad_0[0x30];
    /* 0x30 */ ? sp30;                              /* inferred */
    /* 0x30 */ char pad_30[0xC];
    /* 0x3C */ void *sp3C;                          /* inferred */
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80BF4AB8 {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80BF4D64 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80BF4DA8 {
    /* 0x00 */ char pad_0[0x3C];
    /* 0x3C */ s32 sp3C;                            /* inferred */
    /* 0x40 */ char pad_40[0x10];
};                                                  /* size = 0x50 */

struct _mips2c_stack_func_80BF4EBC {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80BF4FC4 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80BF547C {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80BF5588 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ void *sp1C;                          /* inferred */
    /* 0x20 */ char pad_20[0x10];
};                                                  /* size = 0x30 */

? func_800AEF44(void *);                            /* extern */
s32 func_8013BD40(EnRg *, void *, s32);             /* extern */
s32 func_8013BEDC(GlobalContext *, s32, ?, s32 *);  /* extern */
? func_8013C8B8(s32, s32, ?32 *);                   /* extern */
s32 func_8017D668(f32, f32, ?32, s32, ?32, f32, ? *, ? *, f32 *); /* extern */
void func_80BF3920(void *arg0, GraphicsContext **arg1); /* static */
void func_80BF3C64(EnRg *arg0);                     /* static */
void func_80BF3DA0(GraphicsContext **arg0, GlobalContext *); /* static */
void func_80BF3DC4(void *arg0, GlobalContext *arg1); /* static */
void func_80BF3E88(s32 arg0, GlobalContext *arg1);  /* static */
void func_80BF3ED4(EnRg *arg0, GlobalContext *);    /* static */
? func_80BF3F14(EnRg *arg0, GlobalContext *arg1);   /* static */
void func_80BF3FF8(EnRg *arg0);                     /* static */
