? func_800AEF44(void *);                            /* extern */
s32 func_8013BD40(EnRg *, void *, s32);             /* extern */
void *func_8013BEDC(GlobalContext *, s32, ?, s32 *); /* extern */
? func_8013C8B8(void *, s32, ?32 *);                /* extern */
s32 func_8017D668(f32, f32, ?32, s32, ?32, f32, ? *, ? *, f32 *); /* extern */
void func_80BF3920(void *arg0, GraphicsContext **arg1); /* static */
void func_80BF3C64(EnRg *arg0);                     /* static */
void func_80BF3DA0(GraphicsContext **arg0, GlobalContext *); /* static */
void func_80BF3DC4(void *arg0, GlobalContext *arg1); /* static */
void func_80BF3E88(s32 arg0, GlobalContext *arg1);  /* static */
void func_80BF3ED4(EnRg *arg0, GlobalContext *);    /* static */
? func_80BF3F14(EnRg *arg0, GlobalContext *arg1);   /* static */
void func_80BF3FF8(EnRg *arg0);                     /* static */
? func_80BF4024(Actor *arg0, GlobalContext *arg1);  /* static */
s32 func_80BF409C(EnRg *arg0, s32 arg1);            /* static */
void func_80BF40F4(EnRg *arg0);                     /* static */
? func_80BF416C(Actor *arg0, GlobalContext *arg1);  /* static */
s32 func_80BF4220(Actor *arg0, GlobalContext *arg1, Actor *arg2); /* static */
? func_80BF42BC(void *arg0, f32 arg1);              /* static */
s32 func_80BF43FC(EnRg *arg0);                      /* static */
s32 func_80BF4560(EnRg *arg0, GlobalContext *arg1); /* static */
s32 func_80BF45B4(Actor *arg0);                     /* static */
? func_80BF47AC(EnRg *arg0, GlobalContext *arg1);   /* static */
void func_80BF4934(Actor *arg0);                    /* static */
void func_80BF4964(EnRg *arg0);                     /* static */
void func_80BF4AB8(Actor *arg0, GlobalContext *arg1); /* static */
void func_80BF4D64(PosRot *arg0);                   /* static */
s32 func_80BF4DA8(Actor *arg0);                     /* static */
void func_80BF547C(EnRg *arg0, GraphicsContext **arg1); /* static */
s32 func_80BF5588(GlobalContext *arg0, s32 arg1, Gfx **arg2, Vec3f *arg3, Vec3s *arg4, Actor *arg5); /* static */
extern ? D_060091A8;
extern FlexSkeletonHeader D_06011AC8;
extern ? D_06014CF0;
extern ? D_06014D00;
static ColliderSphereInit D_80BF5760 = {
    {9, 0x19, 0xD, 0x39, 0x10, 4},
    {0, {0xF7CFFFFF, 0, 0}, {0xF7CFFFFF, 0, 0}, 1, 1, 1},
    {0, {{0, 0, 0}, 0x14}, 0x64},
};
static ColliderCylinderInit D_80BF578C = {
    {1, 0, 0, 0x39, 0x10, 1},
    {1, {0, 0, 0}, {0, 0, 0}, 0, 0, 1},
    {0x14, 0x3E, 0, {0, 0, 0}},
};
static CollisionCheckInfoInit2 D_80BF57B8 = {0, 0, 0, 0, 0xFF};
static DamageTable D_80BF57C4 = {
    {
        1,
        1,
        1,
        1,
        1,
        1,
        0,
        1,
        0xF1,
        1,
        0xF1,
        1,
        1,
        1,
        0xF1,
        1,
        1,
        1,
        1,
        1,
        0,
        0,
        1,
        1,
        1,
        0,
        0,
        0,
        0,
        0,
        0,
        1,
    },
};
static ? D_80BF57E4;                                /* unable to generate initializer */
static ActorAnimationEntryS D_80BF5914 = {
    {(AnimationHeader *)0x6012DE0, 2.0f, 0, 0xFFFF, 2, 0},
    {(AnimationHeader *)0x6012DE0, -2.0f, 0, 0xFFFF, 2, 0},
};
static ? D_80BF5934;                                /* unable to generate initializer */
static ? D_80BF5954;                                /* unable to generate initializer */
static ? D_80BF5960;                                /* unable to generate initializer */
static Vec3f D_80BF596C = {
    {-2473.0f, 39.0f, 7318.0f},
    {-2223.0f, 142.0f, 7184.0f},
    {-2281.0f, 41.0f, 7718.0f},
    {-2136.0f, 96.0f, 7840.0f},
    {-2432.0f, 6.0f, 7857.0f},
    {-2412.0f, 139.0f, 6872.0f},
    {-2719.0f, 39.0f, 7110.0f},
    {-2289.0f, 67.0f, 7463.0f},
    {-2820.0f, 85.0f, 6605.0f},
    {-2088.0f, 160.0f, 7584.0f},
    {-2503.0f, 1.0f, 7643.0f},
};
static void D_80BF59F0;                             /* unable to generate initializer */
static ? D_80BF59F8;                                /* unable to generate initializer */
static s32 D_80BF5C10;

typedef struct EnRg {
    /* 0x0000 */ Actor actor;
    /* 0x0144 */ SkelAnime unk144;                  /* inferred */
    /* 0x0154 */ f32 unk154;                        /* overlap; inferred */
    /* 0x0158 */ char pad158[0x30];                 /* maybe part of unk154[13]? */
    /* 0x0188 */ void (*actionFunc)(EnRg *, GlobalContext *);
    /* 0x018C */ void *unk18C;                      /* inferred */
    /* 0x0190 */ ColliderCylinder unk190;           /* inferred */
    /* 0x01DC */ ColliderSphere unk1DC;             /* inferred */
    /* 0x0234 */ void *unk234;                      /* inferred */
    /* 0x0238 */ Vec3s unk238;                      /* inferred */
    /* 0x023E */ char pad23E[0x66];                 /* maybe part of unk238[18]? */
    /* 0x02A4 */ Vec3s unk2A4;                      /* inferred */
    /* 0x02AA */ char pad2AA[0x66];                 /* maybe part of unk2A4[18]? */
    /* 0x0310 */ u16 unk310;                        /* inferred */
    /* 0x0312 */ char pad312[0x2];                  /* maybe part of unk310[2]? */
    /* 0x0314 */ f32 unk314;                        /* inferred */
    /* 0x0318 */ s16 unk318;                        /* inferred */
    /* 0x031A */ char pad31A[0x2];                  /* maybe part of unk318[2]? */
    /* 0x031C */ s16 unk31C;                        /* inferred */
    /* 0x031E */ s16 unk31E;                        /* inferred */
    /* 0x0320 */ s16 unk320;                        /* inferred */
    /* 0x0322 */ s16 unk322;                        /* inferred */
    /* 0x0324 */ s16 unk324;                        /* inferred */
    /* 0x0326 */ s16 unk326;                        /* inferred */
    /* 0x0328 */ s16 unk328;                        /* inferred */
    /* 0x032A */ char pad32A[0x4];                  /* maybe part of unk328[3]? */
    /* 0x032E */ s16 unk32E;                        /* inferred */
    /* 0x0330 */ char pad330[0x4];                  /* maybe part of unk32E[3]? */
    /* 0x0334 */ s32 unk334;                        /* inferred */
    /* 0x0338 */ char pad338[0x4];                  /* maybe part of unk334[2]? */
    /* 0x033C */ s32 unk33C;                        /* inferred */
    /* 0x0340 */ s32 unk340;                        /* inferred */
    /* 0x0344 */ s32 unk344;                        /* inferred */
    /* 0x0348 */ s32 unk348;                        /* inferred */
    /* 0x034C */ char pad34C[0x780];                /* maybe part of unk348[481]? */
} EnRg;                                             /* size 0xACC */

void func_80BF3920(void *arg0, GraphicsContext **arg1) {
    Gfx *temp_a0_2;
    Gfx *temp_v0_2;
    Gfx *temp_v0_3;
    Gfx *temp_v0_4;
    Gfx *temp_v0_5;
    Gfx *temp_v0_6;
    GraphicsContext *temp_a0;
    GraphicsContext *temp_s0;
    f32 temp_f12;
    f32 temp_f16;
    f32 temp_f20;
    f32 temp_f4;
    f32 temp_f6;
    s32 temp_f8;
    s32 temp_s4;
    u8 temp_t7;
    u8 temp_t8;
    u8 temp_v0;
    void *temp_v1;
    void *temp_v1_2;
    void *phi_s2;
    s32 phi_fp;
    f32 phi_f6;
    f32 phi_f16;
    s32 phi_t7;
    s32 phi_s4;

    temp_a0 = *arg1;
    temp_s0 = temp_a0;
    func_8012C2DC(temp_a0);
    phi_s2 = arg0;
    phi_fp = 0;
    phi_s4 = 0;
    do {
        temp_v0 = phi_s2->unk0;
        if (((s32) temp_v0 >= 4) && ((s32) temp_v0 < 7)) {
            if (phi_fp == 0) {
