void func_80AAC5A0(SkelAnime *arg0, ? *arg1, s32 arg2, u8); /* static */
void func_80AAC63C(DmChar05 *arg0, GlobalContext *arg1); /* static */
void func_80AAC6E4(DmChar05 *arg0, GlobalContext *arg1); /* static */
void func_80AAC770(DmChar05 *arg0, GlobalContext *arg1); /* static */
void func_80AAC7FC(DmChar05 *arg0, GlobalContext *arg1); /* static */
void func_80AAC888(DmChar05 *arg0, ? arg1);         /* static */
void func_80AACF04(Actor *arg0, GlobalContext *arg1); /* static */
void func_80AAD3F8(Actor *arg0, GlobalContext *arg1, GlobalContext *, Actor *); /* static */
void func_80AAD450(Actor *arg0, GlobalContext *arg1, GlobalContext *, Actor *); /* static */
void func_80AAD4A8(Actor *arg0, GlobalContext *arg1); /* static */
s32 func_80AAD964(GlobalContext *arg0, s32 arg1, Gfx **arg2, Vec3f *arg3, Vec3s *rot, Actor *actor); /* static */
void func_80AAD980(GlobalContext *arg0, s32 arg1, Gfx **arg2, Vec3s *arg3, Actor *actor); /* static */
void func_80AAD998(Actor *arg0, GlobalContext *arg1, DmChar05 *, GlobalContext *); /* static */
void func_80AADA90(Actor *arg0, GlobalContext *arg1, DmChar05 *, GlobalContext *); /* static */
void func_80AADB4C(Actor *arg0, GlobalContext *arg1, DmChar05 *, GlobalContext *); /* static */
void func_80AADC00(Actor *arg0, GlobalContext *arg1, DmChar05 *, GlobalContext *); /* static */
void func_80AADD9C(GlobalContext *arg0, Actor *arg1); /* static */
void func_80AADE78(GlobalContext *arg0, Actor *arg1); /* static */
void func_80AADF54(GlobalContext *arg0, Actor *arg1); /* static */
void func_80AAE030(GlobalContext *arg0, DmChar05 *arg1, DmChar05 *, GlobalContext *); /* static */
void func_80AAE114(GlobalContext *arg0, DmChar05 *arg1, DmChar05 *, GlobalContext *); /* static */
extern FlexSkeletonHeader D_060001D0;
extern SkeletonHeader D_060010B0;
extern SkeletonHeader D_060013D0;
extern Gfx D_06001E70;
extern SkeletonHeader D_060042B0;
static ? D_80AAE260;                                /* unable to generate initializer */
static ? D_80AAE278;                                /* unable to generate initializer */
static ? D_80AAE2A8;                                /* unable to generate initializer */
static ? D_80AAE2C0;                                /* unable to generate initializer */
static ? D_80AAE2F0;                                /* unable to generate initializer */
static ? D_80AAE300;                                /* unable to generate initializer */

typedef struct DmChar05 {
    /* 0x0000 */ Actor actor;
    /* 0x0144 */ SkelAnime unk144;                  /* inferred */
    /* 0x0188 */ void (*actionFunc)(DmChar05 *, GlobalContext *);
    /* 0x018C */ s16 unk18C;                        /* inferred */
    /* 0x018E */ u8 unk18E;                         /* inferred */
    /* 0x018F */ u8 unk18F;                         /* inferred */
    /* 0x0190 */ f32 unk190;                        /* inferred */
    /* 0x0194 */ f32 unk194;                        /* inferred */
    /* 0x0198 */ f32 unk198;                        /* inferred */
    /* 0x019C */ u32 unk19C;                        /* inferred */
    /* 0x01A0 */ u32 unk1A0;                        /* inferred */
    /* 0x01A4 */ u32 unk1A4;                        /* inferred */
    /* 0x01A8 */ s32 unk1A8;                        /* inferred */
    /* 0x01AC */ s32 unk1AC;                        /* inferred */
    /* 0x01B0 */ s32 unk1B0;                        /* inferred */
    /* 0x01B4 */ u8 unk1B4;                         /* inferred */
    /* 0x01B5 */ char pad1B5[0x3];                  /* maybe part of unk1B4[4]? */
} DmChar05;                                         /* size 0x1B8 */

void func_80AAC5A0(SkelAnime *arg0, ? *arg1, s32 arg2) {
    f32 temp_f0;
    void *temp_s0;
    f32 phi_f2;

    temp_s0 = arg1 + ((arg2 & 0xFFFF) * 0x18);
    temp_f0 = temp_s0->unkC;
    if (temp_f0 < 0.0f) {
        phi_f2 = (f32) SkelAnime_GetFrameCount(temp_s0->unk0);
    } else {
        phi_f2 = temp_f0;
    }
    SkelAnime_ChangeAnim(arg0, (AnimationHeader *) temp_s0->unk0, temp_s0->unk4, temp_s0->unk8, phi_f2, (u8) (s32) temp_s0->unk10, temp_s0->unk14);
}

void func_80AAC63C(DmChar05 *arg0, GlobalContext *arg1) {
    SkelAnime *sp30;
    SkelAnime *temp_a1;

    ActorShape_Init(arg0 + 0xBC, 0.0f, func_800B3FC0, 24.0f);
    temp_a1 = arg0 + 0x144;
    sp30 = temp_a1;
    SkelAnime_Init(arg1, temp_a1, &D_060010B0, NULL, NULL, NULL, 0);
    if (arg0->actor.params == 0) {
        func_80AAC5A0(sp30, &D_80AAE260, 0);
    } else {
