? func_800E0308(Camera *, Actor *);                 /* extern */
void *func_8013A7C0(?);                             /* extern */
? func_8013AD9C(s16, s16, void *, void *, s32, s32); /* extern */
s32 func_80AF7B40();                                /* static */
? func_80AF7BAC(EnPm *arg0);                        /* static */
Actor *func_80AF7CB0(Actor *arg0, GlobalContext *arg1, u8 arg2, s16 arg3); /* static */
void *func_80AF7D60(GlobalContext *arg1, u8);       /* static */
Actor *func_80AF7DC4(Actor *arg0, GlobalContext *arg1, s16 arg2, s32); /* static */
void func_80AF7E6C(EnPm *arg0);                     /* static */
s32 func_80AF7E98(Actor *arg0, s32 arg1, u16);      /* static */
void func_80AF7F68(Actor *arg0, GlobalContext *arg1); /* static */
Actor *func_80AF8040(EnPm *arg0, GlobalContext *arg1); /* static */
s32 func_80AF80F4(Actor *arg0, s16 arg1);           /* static */
s8 func_80AF8170(Actor *arg0, s32 arg1);            /* static */
s32 func_80AF81E8(Actor *arg0, GlobalContext *arg1); /* static */
s32 func_80AF8348(Actor *arg0, GlobalContext *arg1); /* static */
s32 func_80AF8478(Actor *arg0, GlobalContext *arg1); /* static */
? *func_80AF8540(Actor *arg0, GlobalContext *arg1); /* static */
s32 func_80AF86F0(Actor *arg0, GlobalContext *arg1); /* static */
s32 func_80AF87C4(EnPm *arg0, GlobalContext *arg1); /* static */
void func_80AF8890(void *arg0, void **arg1, s32 arg2); /* static */
void func_80AF898C(void *arg0);                     /* static */

static ? D_80AFB60C;                                /* unable to generate initializer */
static ? D_80AFB614;                                /* unable to generate initializer */
static ? D_80AFB61C;                                /* unable to generate initializer */
static ? D_80AFB624;                                /* unable to generate initializer */
static ? D_80AFB62C;                                /* unable to generate initializer */
static ? D_80AFB634;                                /* unable to generate initializer */
static ? D_80AFB63C;                                /* unable to generate initializer */
static ? D_80AFB644;                                /* unable to generate initializer */
static ? D_80AFB650;                                /* unable to generate initializer */
static ? D_80AFB658;                                /* unable to generate initializer */
static ? D_80AFB6BC;                                /* unable to generate initializer */
static ? D_80AFB710;                                /* unable to generate initializer */
static ? D_80AFB744;                                /* unable to generate initializer */
static ? D_80AFB74C;                                /* unable to generate initializer */
static ? D_80AFB764;                                /* unable to generate initializer */
static ColliderCylinderInit D_80AFB790 = {
    {1, 0, 0, 0x39, 0x10, 1},
    {1, {0, 0, 0}, {0, 0, 0}, 0, 0, 1},
    {0xE, 0x3E, 0, {0, 0, 0}},
};
static ColliderSphereInit D_80AFB7BC = {
    {0xA, 0, 0, 0x39, 0x10, 4},
    {0, {0, 0, 0}, {0, 0, 0}, 0, 0, 1},
    {0, {{0, 0, 0}, 0x1A}, 0x64},
};
static CollisionCheckInfoInit2 D_80AFB7E8 = {0, 0, 0, 0, 0xFF};
static ActorAnimationEntryS D_80AFB7F4 = {
    {(AnimationHeader *)0x6002238, 1.0f, 0, 0xFFFF, 0, 0},
    {(AnimationHeader *)0x6002238, 1.0f, 0, 0xFFFF, 0, 0xFFFC},
    {(AnimationHeader *)0x600A4E0, 1.0f, 0, 0xFFFF, 2, 0},
    {(AnimationHeader *)0x600B09C, 1.0f, 0, 0xFFFF, 0, 0},
    {(AnimationHeader *)0x600B09C, 1.0f, 0, 0xFFFF, 0, 0xFFFC},
    {(AnimationHeader *)0x600BA78, 1.0f, 0, 0xFFFF, 2, 0},
    {(AnimationHeader *)0x600C32C, 1.0f, 0, 0xFFFF, 0, 0xFFFC},
    {(AnimationHeader *)0x60099B4, 1.0f, 0, 0xFFFF, 0, 0},
    {(AnimationHeader *)0x6000FC4, 1.0f, 0, 0xFFFF, 0, 0},
    {(AnimationHeader *)0x600A8D8, 1.0f, 0, 0xFFFF, 0, 0},
    {(AnimationHeader *)0x600099C, 1.0f, 0, 0xFFFF, 0, 0},
    {(AnimationHeader *)0x6001F84, 1.0f, 0, 0xFFFF, 2, 0},
    {(AnimationHeader *)0x6000468, 1.0f, 0, 0xFFFF, 0, 0},
    {(AnimationHeader *)0x600C640, 1.0f, 0, 0xFFFF, 0, 0},
};
static ? D_80AFB8D4;                                /* unable to generate initializer */
static ? D_80AFB8E0;                                /* unable to generate initializer */
static Vec3f D_80AFB8EC = {116.0f, 26.0f, -219.0f};
static Vec3s D_80AFB8F8 = {0, 0xC0BA, 0};
static ? D_80AFB900;                                /* unable to generate initializer */
static void *D_80AFB914 = {(void *)0x6002950, (void *)0x6002750, NULL};

typedef struct EnPm {
    /* 0x0000 */ Actor actor;
    /* 0x0144 */ SkelAnime unk144;                  /* inferred */
    /* 0x0188 */ void (*actionFunc)(EnPm *, GlobalContext *);
    /* 0x018C */ char pad18C[0x4];                  /* maybe part of actionFunc[2]? */
    /* 0x0190 */ ColliderCylinder unk190;           /* inferred */
    /* 0x01DC */ ColliderSphere unk1DC;             /* inferred */
    /* 0x0234 */ char pad234[0x24];
    /* 0x0258 */ u8 unk258;                         /* inferred */
    /* 0x0259 */ char pad259[0x3];                  /* maybe part of unk258[4]? */
    /* 0x025C */ s32 *unk25C;                       /* inferred */
    /* 0x0260 */ char pad260[0x4];                  /* maybe part of unk25C[2]? */
    /* 0x0264 */ s32 unk264;                        /* inferred */
    /* 0x0268 */ Actor *unk268;                     /* inferred */
    /* 0x026C */ char pad26C[0x2A];
    /* 0x0296 */ Vec3s unk296;                      /* inferred */
    /* 0x029C */ char pad29C[0x5A];                 /* maybe part of unk296[16]? */
    /* 0x02F6 */ Vec3s unk2F6;                      /* inferred */
    /* 0x02FC */ char pad2FC[0x5A];                 /* maybe part of unk2F6[16]? */
    /* 0x0356 */ u16 unk356;                        /* inferred */
    /* 0x0358 */ char pad358[0x4];                  /* maybe part of unk356[3]? */
    /* 0x035C */ f32 unk35C;                        /* inferred */
    /* 0x0360 */ char pad360[0x8];                  /* maybe part of unk35C[3]? */
    /* 0x0368 */ f32 unk368;                        /* inferred */
    /* 0x036C */ char pad36C[0x4];                  /* maybe part of unk368[2]? */
    /* 0x0370 */ s16 unk370;                        /* inferred */
    /* 0x0372 */ s16 unk372;                        /* inferred */
    /* 0x0374 */ s16 unk374;                        /* inferred */
    /* 0x0376 */ s16 unk376;                        /* inferred */
    /* 0x0378 */ char pad378[0x4];                  /* maybe part of unk376[3]? */
    /* 0x037C */ void *unk37C;                      /* inferred */
    /* 0x0380 */ s32 unk380;                        /* inferred */
    /* 0x0384 */ s32 unk384;                        /* inferred */
    /* 0x0388 */ char pad388[0x4];                  /* maybe part of unk384[2]? */
    /* 0x038C */ s32 unk38C;                        /* inferred */
    /* 0x0390 */ char pad390[0x4];                  /* maybe part of unk38C[2]? */
    /* 0x0394 */ s32 unk394;                        /* inferred */
    /* 0x0398 */ char pad398[0x8];                  /* maybe part of unk394[3]? */
} EnPm;                                             /* size 0x3A0 */

s32 func_80AF7B40(void) {
    u8 temp_v0;

    if ((gSaveContext.weekEventReg[90] & 1) != 0) {
        return 4;
    }
    temp_v0 = gSaveContext.weekEventReg[89];
    if ((temp_v0 & 0x40) != 0) {
        return 3;
    }
    if ((temp_v0 & 8) != 0) {
        return 2;
    }
    if ((gSaveContext.weekEventReg[86] & 1) != 0) {
        return 1;
    }
    return 0;
}

? func_80AF7BAC(EnPm *arg0) {
    s32 temp_v0;

    temp_v0 = arg0->unk38C;
    if (temp_v0 != 0) {
        if (temp_v0 != 1) {
            if (temp_v0 != 2) {
                if (temp_v0 != 3) {

                } else if ((gSaveContext.weekEventReg[90] & 1) != 0) {
                    D_801F4E78 = gSaveContext.time;
                    arg0->unk38C += 1;
                }
            } else if ((gSaveContext.weekEventReg[89] & 0x40) != 0) {
                D_801F4E78 = 0;
