typedef struct EnBox {
    /* 0x000 */ Actor actor;
    /* 0x144 */ s32 unk_144;                        /* inferred */
    /* 0x148 */ char pad_148[0x14];                 /* maybe part of unk_144[6]? */
    /* 0x15C */ SkelAnime unk_15C;                  /* inferred */
    /* 0x1A0 */ s32 unk_1A0;                        /* inferred */
    /* 0x1A4 */ char pad_1A4[0x8];                  /* maybe part of unk_1A0[3]? */
    /* 0x1AC */ ? (*unk_1AC)(EnBox *, GlobalContext *); /* inferred */
    /* 0x1B0 */ Vec3s unk_1B0;                      /* inferred */
    /* 0x1B6 */ char pad_1B6[0x18];                 /* maybe part of unk_1B0[5]? */
    /* 0x1CE */ Vec3s unk_1CE;                      /* inferred */
    /* 0x1D4 */ char pad_1D4[0x18];                 /* maybe part of unk_1CE[5]? */
    /* 0x1EC */ s16 unk_1EC;                        /* inferred */
    /* 0x1EE */ u8 unk_1EE;                         /* inferred */
    /* 0x1EF */ u8 unk_1EF;                         /* inferred */
    /* 0x1F0 */ u8 unk_1F0;                         /* inferred */
    /* 0x1F1 */ u8 unk_1F1;                         /* inferred */
    /* 0x1F2 */ u8 unk_1F2;                         /* inferred */
    /* 0x1F3 */ s8 unk_1F3;                         /* inferred */
    /* 0x1F4 */ EnBox unk_1F4;                      /* inferred */
    /* 0x200 */ void (*actionFunc)(EnBox *, GlobalContext *); /* overlap */
    /* 0x218 */ s16 unk_218;                        /* overlap; inferred */
    /* 0x21A */ s16 unk_21A;                        /* overlap; inferred */
    /* 0x21C */ s32 unk_21C;                        /* overlap; inferred */
    /* 0x220 */ s32 unk_220;                        /* overlap; inferred */
} EnBox;                                            /* size = 0x224 */

struct _mips2c_stack_EnBox_Destroy {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnBox_Draw {
    /* 0x00 */ char pad_0[0x34];
    /* 0x34 */ Gfx *sp34;                           /* inferred */
    /* 0x38 */ Gfx *sp38;                           /* inferred */
    /* 0x3C */ char pad_3C[0x8];                    /* maybe part of sp38[3]? */
    /* 0x44 */ Gfx *sp44;                           /* inferred */
    /* 0x48 */ char pad_48[0x18];
};                                                  /* size = 0x60 */

struct _mips2c_stack_EnBox_Init {
    /* 0x00 */ char pad_0[0x40];
    /* 0x40 */ f32 sp40;                            /* inferred */
    /* 0x44 */ f32 sp44;                            /* inferred */
    /* 0x48 */ CollisionHeader *sp48;               /* inferred */
    /* 0x4C */ char pad_4C[0xC];
};                                                  /* size = 0x58 */

struct _mips2c_stack_EnBox_Update {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80867BD0 {};              /* size 0x0 */

struct _mips2c_stack_func_80867BDC {};              /* size 0x0 */

struct _mips2c_stack_func_80867C14 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80867C8C {
    /* 0x00 */ char pad_0[0x74];
    /* 0x74 */ f32 sp74;                            /* inferred */
    /* 0x78 */ char pad_78[0x50];
};                                                  /* size = 0xC8 */

struct _mips2c_stack_func_80867FBC {};              /* size 0x0 */

struct _mips2c_stack_func_80867FE4 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8086800C {
    /* 0x00 */ char pad_0[0x28];
    /* 0x28 */ ? sp28;                              /* inferred */
    /* 0x28 */ char pad_28[0x4];
    /* 0x2C */ f32 sp2C;                            /* inferred */
    /* 0x30 */ char pad_30[0x4];
    /* 0x34 */ s32 sp34;                            /* inferred */
    /* 0x38 */ CollisionPoly *sp38;                 /* inferred */
    /* 0x3C */ char pad_3C[0x4];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80868630 {
    /* 0x00 */ char pad_0[0x22];
    /* 0x22 */ s16 sp22;                            /* inferred */
    /* 0x24 */ f32 sp24;                            /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80868734 {
    /* 0x00 */ char pad_0[0x48];
    /* 0x48 */ ? sp48;                              /* inferred */
    /* 0x48 */ char pad_48[0xC];
    /* 0x54 */ ? sp54;                              /* inferred */
    /* 0x54 */ char pad_54[0xC];
    /* 0x60 */ ? sp60;                              /* inferred */
    /* 0x60 */ char pad_60[0x10];
};                                                  /* size = 0x70 */

struct _mips2c_stack_func_808687E8 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80868944 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_808689E8 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80868A6C {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80868AFC {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80868B74 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80868CC8 {
    /* 0x00 */ char pad_0[0x4C];
    /* 0x4C */ f32 sp4C;                            /* inferred */
    /* 0x50 */ f32 sp50;                            /* inferred */
    /* 0x54 */ f32 sp54;                            /* inferred */
    /* 0x58 */ char pad_58[0x4];
    /* 0x5C */ ? sp5C;                              /* inferred */
    /* 0x5C */ char pad_5C[0x14];
    /* 0x70 */ f32 sp70;                            /* inferred */
    /* 0x74 */ char pad_74[0x4];
    /* 0x78 */ AnimationHeaderCommon *sp78;         /* inferred */
    /* 0x7C */ char pad_7C[0x4];
};                                                  /* size = 0x80 */

struct _mips2c_stack_func_80869020 {
    /* 0x00 */ char pad_0[0x44];
    /* 0x44 */ SkelAnime *sp44;                     /* inferred */
    /* 0x48 */ char pad_48[0x6];                    /* maybe part of sp44[2]? */
    /* 0x4E */ u16 sp4E;                            /* inferred */
    /* 0x50 */ ? sp50;                              /* inferred */
    /* 0x50 */ char pad_50[0x4];
    /* 0x54 */ ? sp54;                              /* inferred */
    /* 0x54 */ char pad_54[0x4];
    /* 0x58 */ f32 sp58;                            /* inferred */
    /* 0x5C */ char pad_5C[0x4];
};                                                  /* size = 0x60 */

struct _mips2c_stack_func_808692E0 {
    /* 0x00 */ char pad_0[0x28];
    /* 0x28 */ f32 sp28;                            /* inferred */
    /* 0x2C */ char pad_2C[0x4];
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ ? sp34;                              /* inferred */
    /* 0x34 */ char pad_34[0xC];
    /* 0x40 */ f32 sp40;                            /* inferred */
    /* 0x44 */ f32 sp44;                            /* inferred */
    /* 0x48 */ f32 sp48;                            /* inferred */
    /* 0x4C */ f32 sp4C;                            /* inferred */
    /* 0x50 */ char pad_50[0x4];
    /* 0x54 */ f32 sp54;                            /* inferred */
};                                                  /* size = 0x58 */

struct _mips2c_stack_func_80869600 {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ s32 *sp18;                           /* inferred */
    /* 0x1C */ char pad_1C[0x10];                   /* maybe part of sp18[5]? */
    /* 0x2C */ s32 *sp2C;                           /* inferred */
    /* 0x30 */ char pad_30[0x8];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80869850 {};              /* size 0x0 */

struct _mips2c_stack_func_80869874 {};              /* size 0x0 */

struct _mips2c_stack_func_808698B4 {};              /* size 0x0 */

? func_800B8B84(EnBox *, GlobalContext *, s32);     /* extern */
s32 func_800BE63C(EnBox *, s32 **);                 /* extern */
s32 func_800C9EBC(GlobalContext *, CollisionContext *, f32, f32, f32 *, ? *, ? *); /* extern */
s32 func_800F2178(s16);                             /* extern */
void func_80867BD0(EnBox *arg0, void (*arg1)(EnBox *, GlobalContext *)); /* static */
void func_80867BDC(EnBox *arg0, GlobalContext *arg1, PosRot *arg2); /* static */
void func_80867C14(void *arg0);                     /* static */
void func_80867C8C(void *arg0, GraphicsContext **arg1); /* static */
void func_80867FBC(void *arg0, GlobalContext *arg1, s32 arg2); /* static */
