void func_80A16D40(void *arg0, ? *arg1, s32 arg2);  /* static */
void func_80A16D6C(void *arg0, ? *arg1, s16 arg2);  /* static */
void func_80A17060(EnRaf *arg0, s32 arg1);          /* static */
void func_80A1712C(EnRaf *arg0);                    /* static */
void func_80A17414(EnRaf *arg0);                    /* static */
void func_80A17530(EnRaf *arg0);                    /* static */
void func_80A17848(EnRaf *arg0, GlobalContext *arg1); /* static */
void func_80A179C8(EnRaf *arg0, GlobalContext *arg1); /* static */
void func_80A17D14(EnRaf *arg0);                    /* static */
void func_80A17DDC(EnRaf *arg0);                    /* static */
void func_80A18080(EnRaf *arg0);                    /* static */
void func_80A1859C(GlobalContext *arg0, s32 arg1, Actor *arg2); /* static */
void func_80A18A90(Actor *arg0, Vec3f *arg1, f32 *arg2, f32 *arg3, f32 arg4, s32 arg5); /* static */
void func_80A18B8C(EnRaf *arg0, GlobalContext *arg1); /* static */
void func_80A18DA0(EnRaf *arg0, GlobalContext *arg1); /* static */
extern CollisionHeader D_06000108;
extern AnimationHeader D_06000A64;
extern ? D_060024E0;
extern void D_06002EF8;
extern void D_060032F8;
extern FlexSkeletonHeader D_06003428;
static ColliderCylinderInit D_80A18EE0 = {
    {0xA, 0x11, 0, 0x39, 0x10, 1},
    {0, {0xF7CFFFFF, 4, 0x10}, {0xF7CFFFFF, 0, 0}, 1, 0, 1},
    {0x32, 0xA, 0xFFF6, {0, 0, 0}},
};
static ? D_80A18F0C;                                /* unable to generate initializer */
static ? D_80A18F4C;                                /* unable to generate initializer */
static ? D_80A18F8C;                                /* unable to generate initializer */
static ? D_80A1918C;                                /* unable to generate initializer */
static DamageTable D_80A1939C = {
    {
        0xF0,
        0xF0,
        0,
        0xE1,
        0xF0,
        0xF0,
        0,
        0xF0,
        0xF0,
        0xF0,
        0xF0,
        0xF0,
        0xF0,
        0xF0,
        0xF0,
        0xF0,
        0xF0,
        0xF0,
        0xF0,
        0xF0,
        0,
        0,
        0xF0,
        0xF0,
        0xF0,
        0,
        0xF0,
        0,
        0,
        0,
        0,
        0xF0,
    },
};
static ? D_80A193BC;                                /* unable to generate initializer */
static ? D_80A193C8;                                /* unable to generate initializer */
static ? D_80A193E0;                                /* unable to generate initializer */
static ? D_80A193E8;                                /* unable to generate initializer */
static ? D_80A193F4;                                /* unable to generate initializer */
static ? D_80A19400;                                /* unable to generate initializer */
static ? D_80A1940C;                                /* unable to generate initializer */
static s16 D_80A19418 = {0, 4, 6, 0};
static ? D_80A19420;                                /* unable to generate initializer */
static Vec3f D_80A19438 = {0.0f, 1.5f, 0.7f};
static ? D_80A19444;                                /* unable to generate initializer */
static Vec3f D_80A1945C = {1.5f, 1.2f, 0.8f};
static s16 D_80A19468 = {0, 7, 9, 0xD, 0x13, 0};
static ? D_80A19474;                                /* unable to generate initializer */
static ? D_80A194B0;                                /* unable to generate initializer */

typedef struct EnRaf {
    /* 0x0000 */ Actor actor;
    /* 0x0144 */ s32 unk144;                        /* inferred */
    /* 0x0148 */ char pad148[0x14];                 /* maybe part of unk144[6]? */
    /* 0x015C */ SkelAnime unk15C;                  /* inferred */
    /* 0x01A0 */ Vec3s unk1A0;                      /* inferred */
    /* 0x01A6 */ char pad1A6[0x42];                 /* maybe part of unk1A0[12]? */
    /* 0x01E8 */ Vec3s unk1E8;                      /* inferred */
    /* 0x01EE */ char pad1EE[0x42];                 /* maybe part of unk1E8[12]? */
    /* 0x0230 */ void (*actionFunc)(EnRaf *, GlobalContext *);
    /* 0x0234 */ Vec3f unk234;                      /* inferred */
    /* 0x0240 */ char pad240[0x84];                 /* maybe part of unk234[12]? */
    /* 0x02C4 */ Vec3f unk2C4;                      /* inferred */
    /* 0x02D0 */ char pad2D0[0xC];                  /* maybe part of unk2C4[2]? */
    /* 0x02DC */ Vec3f unk2DC;                      /* inferred */
    /* 0x02E8 */ char pad2E8[0x6A];
    /* 0x0352 */ s16 unk352;                        /* inferred */
    /* 0x0354 */ s16 unk354;                        /* inferred */
    /* 0x0356 */ s16 unk356;                        /* inferred */
    /* 0x0358 */ char pad358[0x44];                 /* maybe part of unk356[35]? */
    /* 0x039C */ s16 unk39C;                        /* inferred */
    /* 0x039E */ u8 unk39E;                         /* inferred */
    /* 0x039F */ char pad39F[0x1];                  /* maybe part of unk39E[2]? */
    /* 0x03A0 */ f32 unk3A0;                        /* inferred */
    /* 0x03A4 */ f32 unk3A4;                        /* inferred */
    /* 0x03A8 */ f32 unk3A8;                        /* inferred */
    /* 0x03AC */ f32 unk3AC;                        /* inferred */
    /* 0x03B0 */ f32 unk3B0;                        /* inferred */
    /* 0x03B4 */ s16 unk3B4;                        /* inferred */
    /* 0x03B6 */ s16 unk3B6;                        /* inferred */
    /* 0x03B8 */ s16 unk3B8;                        /* inferred */
    /* 0x03BA */ s16 unk3BA;                        /* inferred */
    /* 0x03BC */ s16 unk3BC;                        /* inferred */
    /* 0x03BE */ s16 unk3BE;                        /* inferred */
    /* 0x03C0 */ s16 unk3C0;                        /* inferred */
    /* 0x03C2 */ s16 unk3C2;                        /* inferred */
    /* 0x03C4 */ s16 unk3C4;                        /* inferred */
    /* 0x03C6 */ s16 unk3C6;                        /* inferred */
    /* 0x03C8 */ s16 unk3C8;                        /* inferred */
    /* 0x03CA */ s16 unk3CA;                        /* inferred */
    /* 0x03CC */ s16 unk3CC;                        /* inferred */
    /* 0x03CE */ s16 unk3CE;                        /* inferred */
    /* 0x03D0 */ ColliderCylinder unk3D0;           /* inferred */
    /* 0x041C */ char pad41C[0x6C8];
} EnRaf;                                            /* size 0xAE4 */

void func_80A16D40(void *arg0, ? *arg1, s32 arg2) {
    if ((arg2 < 0x40) && (*(arg1 + arg2) != 0)) {
        *(arg0 + (arg2 * 2)) = 0;
    }
}

void func_80A16D6C(void *arg0, ? *arg1, s16 arg2) {
    if (*(arg1 + arg2) != 0) {
        *(arg0 + (arg2 * 2)) = 0;
    }
}

void EnRaf_Init(Actor *thisx, GlobalContext *globalCtx) {
    EnRaf *this = (EnRaf *) thisx;
    Vec3f sp60;
    CollisionHeader *sp54;
    s16 *temp_v0_2;
    s16 temp_a1;
    s16 temp_v0;
    s32 temp_s0;
    s32 temp_s0_2;
    Vec3f *phi_s2;
    Vec3f *phi_s1;
    s32 phi_s0;
    Vec3f *phi_s2_2;
    Vec3f *phi_s1_2;
    s32 phi_s0_2;

    sp60.x = D_80A193BC.unk0;
    sp60.y = D_80A193BC.unk4;
    sp60.z = D_80A193BC.unk8;
    sp54 = NULL;
    BcCheck3_BgActorInit((DynaPolyActor *) this, 0);
    BgCheck_RelocateMeshHeader(&D_06000108, &sp54);
