typedef struct EnRaf {
    /* 0x000 */ Actor actor;
    /* 0x144 */ s32 unk144;                         /* inferred */
    /* 0x148 */ char pad148[0x14];                  /* maybe part of unk144[6]? */
    /* 0x15C */ SkelAnime unk15C;                   /* inferred */
    /* 0x1A0 */ Vec3s unk1A0;                       /* inferred */
    /* 0x1A6 */ char pad1A6[0x42];                  /* maybe part of unk1A0[12]? */
    /* 0x1E8 */ Vec3s unk1E8;                       /* inferred */
    /* 0x1EE */ char pad1EE[0x42];                  /* maybe part of unk1E8[12]? */
    /* 0x230 */ void (*actionFunc)(EnRaf *, GlobalContext *);
    /* 0x234 */ Vec3f unk234;                       /* inferred */
    /* 0x240 */ char pad240[0x84];                  /* maybe part of unk234[12]? */
    /* 0x2C4 */ Vec3f unk2C4;                       /* inferred */
    /* 0x2D0 */ char pad2D0[0xC];
    /* 0x2DC */ Vec3f unk2DC;                       /* inferred */
    /* 0x2E8 */ char pad2E8[0xB4];                  /* maybe part of unk2DC[16]? */
    /* 0x39C */ s16 unk39C;                         /* inferred */
    /* 0x39E */ u8 unk39E;                          /* inferred */
    /* 0x39F */ char pad39F[0x1];
    /* 0x3A0 */ f32 unk3A0;                         /* inferred */
    /* 0x3A4 */ f32 unk3A4;                         /* inferred */
    /* 0x3A8 */ f32 unk3A8;                         /* inferred */
    /* 0x3AC */ f32 unk3AC;                         /* inferred */
    /* 0x3B0 */ f32 unk3B0;                         /* inferred */
    /* 0x3B4 */ s16 unk3B4;                         /* inferred */
    /* 0x3B6 */ s16 unk3B6;                         /* inferred */
    /* 0x3B8 */ s16 unk3B8;                         /* inferred */
    /* 0x3BA */ s16 unk3BA;                         /* inferred */
    /* 0x3BC */ s16 unk3BC;                         /* inferred */
    /* 0x3BE */ s16 unk3BE;                         /* inferred */
    /* 0x3C0 */ s16 unk3C0;                         /* inferred */
    /* 0x3C2 */ s16 unk3C2;                         /* inferred */
    /* 0x3C4 */ s16 unk3C4;                         /* inferred */
    /* 0x3C6 */ s16 unk3C6;                         /* inferred */
    /* 0x3C8 */ s16 unk3C8;                         /* inferred */
    /* 0x3CA */ s16 unk3CA;                         /* inferred */
    /* 0x3CC */ s16 unk3CC;                         /* inferred */
    /* 0x3CE */ s16 unk3CE;                         /* inferred */
    /* 0x3D0 */ ColliderCylinder unk3D0;            /* inferred */
    /* 0x41C */ char pad41C[0x6C8];                 /* maybe part of unk3D0[23]? */
} EnRaf;                                            /* size = 0xAE4 */

struct _mips2c_stack_EnRaf_Destroy {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnRaf_Draw {
    /* 0x00 */ char pad0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_EnRaf_Init {
    /* 0x00 */ char pad0[0x54];
    /* 0x54 */ CollisionHeader *sp54;               /* inferred */
    /* 0x58 */ char pad58[0x8];                     /* maybe part of sp54[3]? */
    /* 0x60 */ ? sp60;                              /* inferred */
    /* 0x60 */ char pad60[0x10];
};                                                  /* size = 0x70 */

struct _mips2c_stack_EnRaf_Update {
    /* 0x00 */ char pad0[0x6C];
    /* 0x6C */ ? sp6C;                              /* inferred */
    /* 0x6C */ char pad6C[0x4];
    /* 0x70 */ f32 sp70;                            /* inferred */
    /* 0x74 */ char pad74[0x4];
    /* 0x78 */ f32 sp78;                            /* inferred */
    /* 0x7C */ WaterBox *sp7C;                      /* inferred */
    /* 0x80 */ char pad80[0x8];
};                                                  /* size = 0x88 */

struct _mips2c_stack_func_80A16D40 {};              /* size 0x0 */

struct _mips2c_stack_func_80A16D6C {};              /* size 0x0 */

struct _mips2c_stack_func_80A17060 {
    /* 0x00 */ char pad0[0x2C];
    /* 0x2C */ AnimationHeaderCommon **sp2C;        /* inferred */
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ f32 sp34;                            /* inferred */
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80A1712C {
    /* 0x00 */ char pad0[0x3C];
    /* 0x3C */ ? sp3C;                              /* inferred */
    /* 0x3C */ char pad3C[0xC];
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_80A171D8 {
    /* 0x00 */ char pad0[0x24];
    /* 0x24 */ Actor *sp24;                         /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80A17414 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A17464 {
    /* 0x00 */ char pad0[0x20];
    /* 0x20 */ f32 sp20;                            /* inferred */
    /* 0x24 */ Actor *sp24;                         /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80A17530 {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80A175E4 {
    /* 0x00 */ char pad0[0x24];
    /* 0x24 */ PosRot *sp24;                        /* inferred */
    /* 0x28 */ char pad28[0x8];                     /* maybe part of sp24[3]? */
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ char pad34[0x4];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80A17848 {
    /* 0x00 */ char pad0[0x1C];
    /* 0x1C */ void *sp1C;                          /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80A178A0 {
    /* 0x00 */ char pad0[0x28];
    /* 0x28 */ f32 sp28;                            /* inferred */
    /* 0x2C */ Actor *sp2C;                         /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80A179C8 {
    /* 0x00 */ char pad0[0x80];
    /* 0x80 */ ActorContext *sp80;                  /* inferred */
    /* 0x84 */ char pad84[0x10];                    /* maybe part of sp80[5]? */
    /* 0x94 */ f32 sp94;                            /* inferred */
    /* 0x98 */ f32 sp98;                            /* inferred */
    /* 0x9C */ f32 sp9C;                            /* inferred */
    /* 0xA0 */ f32 spA0;                            /* inferred */
    /* 0xA4 */ f32 spA4;                            /* inferred */
    /* 0xA8 */ f32 spA8;                            /* inferred */
    /* 0xAC */ f32 spAC;                            /* inferred */
    /* 0xB0 */ f32 spB0;                            /* inferred */
    /* 0xB4 */ f32 spB4;                            /* inferred */
};                                                  /* size = 0xB8 */

struct _mips2c_stack_func_80A17C6C {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80A17D14 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A17D54 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A17DDC {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A17E1C {
    /* 0x00 */ char pad0[0x38];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80A18080 {};              /* size 0x0 */

struct _mips2c_stack_func_80A180B4 {
    /* 0x00 */ char pad0[0x3C];
    /* 0x3C */ ? sp3C;                              /* inferred */
    /* 0x3C */ char pad3C[0xC];
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_80A1859C {
    /* 0x00 */ char pad0[0x38];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80A18A90 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80A18B8C {
    /* 0x00 */ char pad0[0x68];
};                                                  /* size = 0x68 */

struct _mips2c_stack_func_80A18DA0 {
    /* 0x00 */ char pad0[0x38];
};                                                  /* size = 0x38 */

void func_80A16D40(void *arg0, ? *arg1, s32 arg2);  /* static */
void func_80A16D6C(void *arg0, ? *arg1, s16 arg2);  /* static */
void func_80A17060(EnRaf *arg0, s32 arg1);          /* static */
void func_80A1712C(EnRaf *arg0);                    /* static */
void func_80A17414(EnRaf *arg0);                    /* static */
void func_80A17530(EnRaf *arg0);                    /* static */
void func_80A17848(EnRaf *arg0, GlobalContext *arg1); /* static */
void func_80A179C8(EnRaf *arg0, GlobalContext *arg1); /* static */
void func_80A17D14(EnRaf *arg0);                    /* static */
void func_80A17DDC(EnRaf *arg0);                    /* static */
void func_80A18080(EnRaf *arg0);                    /* static */
void func_80A1859C(GlobalContext *arg0, s32 arg1, Actor *arg2); /* static */
void func_80A18A90(Actor *arg0, Vec3f *arg1, f32 *arg2, f32 *arg3, f32 arg4, s32 arg5); /* static */
