? func_800B6608(GlobalContext *, ?);                /* extern */
void func_80AE9A20(EnLiftNuts *arg0, GlobalContext *arg1); /* static */
void func_80AE9A80(EnLiftNuts *arg0, GlobalContext *arg1); /* static */
s16 func_80AE9AC4(EnLiftNuts *arg0, s32 arg1);      /* static */
s32 func_80AE9B4C(s32 arg0, s32 arg1, EnLiftNuts *); /* static */
s32 func_80AE9B8C(GlobalContext *, u16);            /* static */
void func_80AE9BCC(EnLiftNuts *arg0, GlobalContext *arg1); /* static */
void func_80AE9F28(EnLiftNuts *arg0);               /* static */
void func_80AE9F70(EnLiftNuts *arg0, GlobalContext *arg1); /* static */
void func_80AE9FC8(Actor *arg0);                    /* static */
void func_80AEA044(EnLiftNuts *arg0, GlobalContext *arg1); /* static */
void func_80AEA0B4(EnLiftNuts *arg0);               /* static */
void func_80AEA128(EnLiftNuts *arg0, GlobalContext *arg1); /* static */
void func_80AEA1A0(EnLiftNuts *arg0, GlobalContext *arg1); /* static */
void func_80AEA7A4(Actor *arg0, GlobalContext *arg1); /* static */
void func_80AEA910(Actor *arg0, GlobalContext *arg1); /* static */
void func_80AEABF0(Actor *arg0);                    /* static */
void func_80AEAC64(void *arg0, ? arg1);             /* static */
void func_80AEACF8(Actor *arg0, GlobalContext *arg1); /* static */
void func_80AEAEAC(Actor *arg0);                    /* static */
void func_80AEAF14(EnLiftNuts *arg0, GlobalContext *arg1); /* static */
void func_80AEAF8C(EnLiftNuts *arg0);               /* static */

void func_80AEB294(void *arg0, GlobalContext *arg1); /* static */
void func_80AEB3E0(void *arg0, GlobalContext *arg1); /* static */
void func_80AEB428(Actor *arg0, GlobalContext *arg1); /* static */
void func_80AEB584(Actor *arg0);                    /* static */
void func_80AEB598(Actor *arg0, GlobalContext *arg1); /* static */
void func_80AEB684(Actor *arg0, GlobalContext *);   /* static */
void func_80AEB698(Actor *arg0, GlobalContext *arg1); /* static */
void func_80AEB828(EnLiftNuts *arg0);               /* static */
void func_80AEB8A4(Actor *arg0, GlobalContext *arg1); /* static */
void func_80AEB934(EnLiftNuts *arg0, GlobalContext *arg1); /* static */
void func_80AEB974(Actor *arg0);                    /* static */
void func_80AEB9E0(EnLiftNuts *arg0, GlobalContext *arg1, EnLiftNuts *); /* static */
void func_80AEBB30(Actor *arg0, GlobalContext *arg1); /* static */
s32 func_80AEBC18(GlobalContext *arg0, s32 arg1, Gfx **arg2, Vec3f *arg3, Vec3s *arg5, Actor *actor); /* static */
void func_80AEBC90(GlobalContext *arg0, s32 arg1, Gfx **arg2, Vec3s *arg3, Actor *arg4); /* static */
extern AnimationHeader D_060029E8;
extern FlexSkeletonHeader D_0600AC70;
static ActorAnimationEntry D_80AEBD50 = {
    {(AnimationHeader *)0x6005488, 1.0f, 0.0f, 0.0f, 0, -4.0f},
    {(AnimationHeader *)0x600B0B4, 1.0f, 0.0f, 0.0f, 0, -4.0f},
    {(AnimationHeader *)0x6004AA0, 1.0f, 0.0f, 0.0f, 2, -4.0f},
    {(AnimationHeader *)0x60029E8, 1.0f, 0.0f, 0.0f, 2, -4.0f},
    {(AnimationHeader *)0x6005CA8, 1.0f, 0.0f, 0.0f, 2, -1.0f},
    {(AnimationHeader *)0x60038CC, 1.0f, 0.0f, 0.0f, 0, -4.0f},
    {(AnimationHeader *)0x6003CC0, 1.0f, 0.0f, 0.0f, 2, -1.0f},
    {(AnimationHeader *)0x60012F4, 1.0f, 0.0f, 0.0f, 2, -4.0f},
    {(AnimationHeader *)0x6004700, 0.0f, 0.0f, 0.0f, 2, -4.0f},
    {(AnimationHeader *)0x6001BC8, 1.0f, 0.0f, 0.0f, 0, -4.0f},
    {(AnimationHeader *)0x6003438, 1.0f, 0.0f, 0.0f, 2, -2.0f},
    {(AnimationHeader *)0x6001E2C, 1.0f, 0.0f, 0.0f, 0, -4.0f},
    {(AnimationHeader *)0x6000994, 1.0f, 0.0f, 0.0f, 2, -4.0f},
    {(AnimationHeader *)0x6002268, 1.0f, 0.0f, 0.0f, 2, -1.0f},
    {(AnimationHeader *)0x6002F08, 1.0f, 0.0f, 0.0f, 0, -4.0f},
    {(AnimationHeader *)0x600577C, 1.0f, 0.0f, 0.0f, 0, -4.0f},
    {(AnimationHeader *)0x6004E38, 1.0f, 0.0f, 0.0f, 2, -4.0f},
    {(AnimationHeader *)0x60029E8, 1.0f, 4.0f, 0.0f, 2, -4.0f},
    {(AnimationHeader *)0x60029E8, 1.0f, 8.0f, 0.0f, 2, 0.0f},
};
static ? D_80AEBF18;                                /* unable to generate initializer */
static ColliderCylinderInit D_80AEBF28 = {
    {0xA, 0, 0, 0x39, 0x20, 1},
    {0, {0, 0, 0}, {0, 0, 0}, 0, 0, 1},
    {0x19, 0x4B, 0, {0, 0, 0}},
};
static CollisionCheckInfoInit2 D_80AEBF54 = {0, 0, 0, 0, 0xFF};
static void D_80AEBF60;                             /* unable to generate initializer */
static s32 D_80AEBF64 = 0;
static s16 D_80AEBF68 = 0;
static s32 D_80AEBF6C = 0;
static s32 D_80AEBF70 = 0;
static s32 D_80AEBF74 = 0xAA825AFF;
static s32 D_80AEBF78 = 0x643C14FF;
static Vec3f D_80AEBF7C = {0.0f, 0.0f, 0.0f};

typedef struct EnLiftNuts {
    /* 0x0000 */ Actor actor;
    /* 0x0144 */ ColliderCylinder unk144;           /* inferred */
    /* 0x0190 */ SkelAnime unk190;                  /* inferred */
    /* 0x01D4 */ void (*actionFunc)(EnLiftNuts *, GlobalContext *);
    /* 0x01D8 */ f32 unk1D8;                        /* inferred */
    /* 0x01DC */ f32 unk1DC;                        /* inferred */
    /* 0x01E0 */ f32 unk1E0;                        /* inferred */
    /* 0x01E4 */ s32 unk1E4;                        /* inferred */
    /* 0x01E8 */ s32 unk1E8;                        /* inferred */
    /* 0x01EC */ void *unk1EC;                      /* inferred */
    /* 0x01F0 */ Vec3s unk1F0;                      /* inferred */
    /* 0x01F6 */ char pad1F6[0xA2];                 /* maybe part of unk1F0[28]? */
    /* 0x0298 */ Vec3s unk298;                      /* inferred */
    /* 0x029E */ char pad29E[0xB0];
    /* 0x034E */ s16 unk34E;                        /* inferred */
    /* 0x0350 */ char pad350[0x4];                  /* maybe part of unk34E[3]? */
    /* 0x0354 */ s16 unk354;                        /* inferred */
    /* 0x0356 */ s16 unk356;                        /* inferred */
} EnLiftNuts;                                       /* size 0x358 */

void func_80AE9A20(EnLiftNuts *arg0, GlobalContext *arg1) {
    if (D_80AEBF64 == 0) {
        func_800B6584(arg1, 0x1D2, &D_80AEBF60, 2U);
        D_80AEBF64 = 1;
    }
    arg0->unk1EC = &D_80AEBF60;
}

void func_80AE9A80(EnLiftNuts *arg0, GlobalContext *arg1) {
    if (D_80AEBF68 == 0) {
        func_800B6608(arg1, 0x1D2);
        D_80AEBF68 = 1;
    }
}

s16 func_80AE9AC4(EnLiftNuts *arg0, s32 arg1) {
    if (arg1 != 0) {
        if (arg1 != 1) {
            if (arg1 != 2) {
                // Duplicate return node #10. Try simplifying control flow for better match
                return 0;
            }
            if (D_80AEBF6C == 1) {
                arg0->unk34E = 0;
                D_80AEBF6C = 0;
                return 1;
            }
            // Duplicate return node #10. Try simplifying control flow for better match
