typedef struct ObjSkateblock {
    /* 0x000 */ Actor actor;
    /* 0x144 */ s32 unk_144;                        /* inferred */
    /* 0x148 */ char pad_148[0x14];                 /* maybe part of unk_144[6]? */
    /* 0x15C */ void (*actionFunc)(ObjSkateblock *, GlobalContext *);
    /* 0x160 */ char pad_160[0x60];                 /* maybe part of actionFunc[25]? */
    /* 0x1C0 */ u8 unk_1C0;                         /* inferred */
    /* 0x1C1 */ u8 unk_1C1;                         /* inferred */
    /* 0x1C2 */ char pad_1C2[0x2];                  /* maybe part of unk_1C1[3]? */
} ObjSkateblock;                                    /* size = 0x1C4 */

struct _mips2c_stack_ObjSkateblock_Destroy {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_ObjSkateblock_Draw {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ Gfx *sp20;                           /* inferred */
    /* 0x24 */ char pad_24[0x8];                    /* maybe part of sp20[3]? */
    /* 0x2C */ void *sp2C;                          /* inferred */
    /* 0x30 */ char pad_30[0x8];
};                                                  /* size = 0x38 */

struct _mips2c_stack_ObjSkateblock_Init {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_ObjSkateblock_Update {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A21150 {};              /* size 0x0 */

struct _mips2c_stack_func_80A211F4 {};              /* size 0x0 */

struct _mips2c_stack_func_80A212F0 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ f32 sp1C;                            /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80A21370 {
    /* 0x00 */ char pad_0[0x70];
    /* 0x70 */ s32 sp70;                            /* inferred */
    /* 0x74 */ char pad_74[0x14];                   /* maybe part of sp70[6]? */
    /* 0x88 */ s32 sp88;                            /* inferred */
    /* 0x8C */ f32 sp8C;                            /* inferred */
    /* 0x90 */ f32 sp90;                            /* inferred */
    /* 0x94 */ f32 sp94;                            /* inferred */
    /* 0x98 */ s32 sp98;                            /* inferred */
    /* 0x9C */ char pad_9C[0xC];
};                                                  /* size = 0xA8 */

struct _mips2c_stack_func_80A21548 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A216D4 {
    /* 0x00 */ char pad_0[0x96];
    /* 0x96 */ s16 sp96;                            /* inferred */
    /* 0x98 */ char pad_98[0x4];                    /* maybe part of sp96[3]? */
    /* 0x9C */ s32 sp9C;                            /* inferred */
    /* 0xA0 */ ? spA0;                              /* inferred */
    /* 0xA0 */ char pad_A0[0x4];
    /* 0xA4 */ ? spA4;                              /* inferred */
    /* 0xA4 */ char pad_A4[0xC];
    /* 0xB0 */ f32 spB0;                            /* inferred */
    /* 0xB4 */ char pad_B4[0x8];                    /* maybe part of spB0[3]? */
    /* 0xBC */ f32 spBC;                            /* inferred */
    /* 0xC0 */ f32 spC0;                            /* inferred */
    /* 0xC4 */ f32 spC4;                            /* inferred */
    /* 0xC8 */ f32 spC8;                            /* inferred */
    /* 0xCC */ f32 spCC;                            /* inferred */
    /* 0xD0 */ f32 spD0;                            /* inferred */
    /* 0xD4 */ f32 spD4;                            /* inferred */
    /* 0xD8 */ f32 spD8;                            /* inferred */
    /* 0xDC */ f32 spDC;                            /* inferred */
    /* 0xE0 */ char pad_E0[0x4];
    /* 0xE4 */ f32 spE4;                            /* inferred */
    /* 0xE8 */ f32 spE8;                            /* inferred */
    /* 0xEC */ char pad_EC[0x4];
};                                                  /* size = 0xF0 */

struct _mips2c_stack_func_80A21934 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ f32 sp1C;                            /* inferred */
    /* 0x20 */ char pad_20[0x4];
    /* 0x24 */ f32 sp24;                            /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80A21990 {
    /* 0x000 */ char pad_0[0xB4];
    /* 0x0B4 */ s32 spB4;                           /* inferred */
    /* 0x0B8 */ ? spB8;                             /* inferred */
    /* 0x0B8 */ char pad_B8[0x4];
    /* 0x0BC */ ? spBC;                             /* inferred */
    /* 0x0BC */ char pad_BC[0xC];
    /* 0x0C8 */ f32 spC8;                           /* inferred */
    /* 0x0CC */ char pad_CC[0x4];
    /* 0x0D0 */ f32 spD0;                           /* inferred */
    /* 0x0D4 */ f32 spD4;                           /* inferred */
    /* 0x0D8 */ f32 spD8;                           /* inferred */
    /* 0x0DC */ f32 spDC;                           /* inferred */
    /* 0x0E0 */ f32 spE0;                           /* inferred */
    /* 0x0E4 */ f32 spE4;                           /* inferred */
    /* 0x0E8 */ f32 spE8;                           /* inferred */
    /* 0x0EC */ f32 spEC;                           /* inferred */
    /* 0x0F0 */ f32 spF0;                           /* inferred */
    /* 0x0F4 */ f32 spF4;                           /* inferred */
    /* 0x0F8 */ char pad_F8[0x8];                   /* maybe part of spF4[3]? */
    /* 0x100 */ f32 sp100;                          /* inferred */
    /* 0x104 */ char pad_104[0x4];
};                                                  /* size = 0x108 */

struct _mips2c_stack_func_80A21C30 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ f32 sp1C;                            /* inferred */
    /* 0x20 */ char pad_20[0x4];
    /* 0x24 */ f32 sp24;                            /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80A21C88 {};              /* size 0x0 */

struct _mips2c_stack_func_80A21CB4 {};              /* size 0x0 */

struct _mips2c_stack_func_80A21CD8 {};              /* size 0x0 */

struct _mips2c_stack_func_80A21D1C {
    /* 0x00 */ char pad_0[0x4];
    /* 0x04 */ f32 sp4;                             /* inferred */
    /* 0x08 */ char pad_8[0x18];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80A21E9C {
    /* 0x00 */ char pad_0[0x38];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80A21F68 {};              /* size 0x0 */

struct _mips2c_stack_func_80A21F74 {
    /* 0x00 */ char pad_0[0x8A];
    /* 0x8A */ s16 sp8A;                            /* inferred */
    /* 0x8C */ char pad_8C[0x10];                   /* maybe part of sp8A[9]? */
    /* 0x9C */ f32 sp9C;                            /* inferred */
    /* 0xA0 */ f32 spA0;                            /* inferred */
    /* 0xA4 */ f32 spA4;                            /* inferred */
    /* 0xA8 */ f32 spA8;                            /* inferred */
    /* 0xAC */ f32 spAC;                            /* inferred */
    /* 0xB0 */ f32 spB0;                            /* inferred */
    /* 0xB4 */ char pad_B4[0x4];
};                                                  /* size = 0xB8 */

struct _mips2c_stack_func_80A22308 {};              /* size 0x0 */

struct _mips2c_stack_func_80A22334 {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ ? sp20;                              /* inferred */
    /* 0x20 */ char pad_20[0xC];
    /* 0x2C */ s32 sp2C;                            /* inferred */
    /* 0x30 */ s32 sp30;                            /* inferred */
    /* 0x34 */ char pad_34[0x4];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80A2244C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A224A4 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ s32 sp24;                            /* inferred */
    /* 0x28 */ s32 sp28;                            /* inferred */
    /* 0x2C */ char pad_2C[0x4];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80A22628 {};              /* size 0x0 */

struct _mips2c_stack_func_80A2264C {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ s32 sp20;                            /* inferred */
    /* 0x24 */ char pad_24[0x4];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80A22728 {};              /* size 0x0 */

struct _mips2c_stack_func_80A2273C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A227A4 {};              /* size 0x0 */

struct _mips2c_stack_func_80A227C0 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

f32 func_800C4240(s32, void *, void *, f32 *, f32 *, f32); /* extern */
s32 func_800C56E0(s32, f32 *, f32 *, f32 *, ? *, s32, s32, s32, s32, ? *, f32 *, f32); /* extern */
s32 func_80A21150(f32 *arg0);                       /* static */
void func_80A211F4(f32 *arg0, s32 arg1);            /* static */
void func_80A212F0(f32 *arg0, f32 *arg1, s16 arg2); /* static */
s32 func_80A21370(f32 *arg0, f32 *arg1);            /* static */
s32 func_80A21548(f32 *arg0, f32 *);                /* static */
s32 func_80A216D4(f32 *arg0, f32 *arg1, f32 arg2, Vec3f *arg3); /* static */
s32 func_80A21934(Actor *arg0, f32 *);              /* static */
s32 func_80A21990(f32 *arg0, s32 arg1, void *arg2); /* static */
? func_80A21C30(Actor *arg0, f32 *);                /* static */
void func_80A21C88(f32 *arg0, s16 arg1);            /* static */
