typedef struct EnTest6 {
    /* 0x000 */ Actor actor;
    /* 0x144 */ void (*actionFunc)(EnTest6 *, GlobalContext *);
    /* 0x148 */ char pad_148[0x4];
    /* 0x14C */ f32 unk_14C;                        /* inferred */
    /* 0x150 */ f32 unk_150;                        /* inferred */
    /* 0x154 */ f32 unk_154;                        /* inferred */
    /* 0x158 */ f32 unk_158;                        /* inferred */
    /* 0x15C */ f32 unk_15C;                        /* inferred */
    /* 0x160 */ f32 unk_160;                        /* inferred */
    /* 0x164 */ char pad_164[0x4];
    /* 0x168 */ LightInfo unk_168;                  /* inferred */
    /* 0x176 */ char pad_176[0x16];                 /* maybe part of unk_168[2]? */
    /* 0x18C */ ? unk_18C;                          /* inferred */
    /* 0x18C */ char pad_18C[0xC8];
    /* 0x254 */ void *unk_254;                      /* inferred */
    /* 0x258 */ s32 unk_258;                        /* inferred */
    /* 0x25C */ f32 unk_25C;                        /* inferred */
    /* 0x260 */ f32 unk_260;                        /* inferred */
    /* 0x264 */ f32 unk_264;                        /* inferred */
    /* 0x268 */ f32 unk_268;                        /* inferred */
    /* 0x26C */ f32 unk_26C;                        /* inferred */
    /* 0x270 */ f32 unk_270;                        /* inferred */
    /* 0x274 */ s16 unk_274;                        /* inferred */
    /* 0x276 */ s16 unk_276;                        /* inferred */
    /* 0x278 */ s16 unk_278;                        /* inferred */
    /* 0x27A */ s16 unk_27A;                        /* inferred */
    /* 0x27C */ s16 unk_27C;                        /* inferred */
    /* 0x27E */ char pad_27E[0x2];
    /* 0x280 */ s16 unk_280;                        /* inferred */
    /* 0x282 */ s16 unk_282;                        /* inferred */
    /* 0x284 */ s16 unk_284;                        /* inferred */
    /* 0x286 */ s16 unk_286;                        /* inferred */
} EnTest6;                                          /* size = 0x288 */

struct _mips2c_stack_EnTest6_Destroy {
    /* 0x00 */ char pad_0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_EnTest6_Draw {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnTest6_Init {
    /* 0x00 */ char pad_0[0x48];
};                                                  /* size = 0x48 */

struct _mips2c_stack_EnTest6_SetupAction {};        /* size 0x0 */

struct _mips2c_stack_EnTest6_Update {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A90730 {
    /* 0x00 */ char pad_0[0x44];
    /* 0x44 */ s32 sp44;                            /* inferred */
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_80A90C08 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A90C34 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A90C54 {};              /* size 0x0 */

struct _mips2c_stack_func_80A90D20 {};              /* size 0x0 */

struct _mips2c_stack_func_80A90D34 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ Gfx *sp24;                           /* inferred */
    /* 0x28 */ Gfx *sp28;                           /* inferred */
    /* 0x2C */ char pad_2C[0xC];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80A90FC0 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ MtxF *sp24;                          /* inferred */
    /* 0x28 */ void *sp28;                          /* inferred */
    /* 0x2C */ char pad_2C[0x1C];                   /* maybe part of sp28[8]? */
    /* 0x48 */ Gfx *sp48;                           /* inferred */
    /* 0x4C */ Gfx *sp4C;                           /* inferred */
    /* 0x50 */ char pad_50[0x14];                   /* maybe part of sp4C[6]? */
    /* 0x64 */ f32 sp64;                            /* inferred */
    /* 0x68 */ f32 sp68;                            /* inferred */
    /* 0x6C */ f32 sp6C;                            /* inferred */
    /* 0x70 */ void *sp70;                          /* inferred */
    /* 0x74 */ char pad_74[0xC];
};                                                  /* size = 0x80 */

struct _mips2c_stack_func_80A9156C {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80A91690 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A916F0 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A91760 {
    /* 0x00 */ char pad_0[0x3C];
    /* 0x3C */ EnTest6 *sp3C;                       /* inferred */
    /* 0x40 */ char pad_40[0xC];                    /* maybe part of sp3C[4]? */
    /* 0x4C */ f32 sp4C;                            /* inferred */
    /* 0x50 */ s32 sp50;                            /* inferred */
    /* 0x54 */ char pad_54[0x4];
    /* 0x58 */ f32 sp58;                            /* inferred */
    /* 0x5C */ char pad_5C[0x4];
    /* 0x60 */ f32 sp60;                            /* inferred */
    /* 0x64 */ f32 sp64;                            /* inferred */
    /* 0x68 */ f32 sp68;                            /* inferred */
    /* 0x6C */ f32 sp6C;                            /* inferred */
    /* 0x70 */ f32 sp70;                            /* inferred */
    /* 0x74 */ f32 sp74;                            /* inferred */
    /* 0x78 */ Camera *sp78;                        /* inferred */
    /* 0x7C */ char pad_7C[0xC];
};                                                  /* size = 0x88 */

struct _mips2c_stack_func_80A920C8 {};              /* size 0x0 */

struct _mips2c_stack_func_80A92118 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A92188 {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ f32 *sp2C;                           /* inferred */
    /* 0x30 */ s32 *sp30;                           /* inferred */
    /* 0x34 */ ? sp34;                              /* inferred */
    /* 0x34 */ char pad_34[0x12];
    /* 0x46 */ s16 sp46;                            /* inferred */
    /* 0x48 */ char pad_48[0x8];                    /* maybe part of sp46[5]? */
    /* 0x50 */ Actor *sp50;                         /* inferred */
    /* 0x54 */ char pad_54[0x4];
};                                                  /* size = 0x58 */

struct _mips2c_stack_func_80A92950 {
    /* 0x00 */ char pad_0[0x3C];
    /* 0x3C */ Actor *sp3C;                         /* inferred */
    /* 0x40 */ char pad_40[0x8];
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_80A93298 {
    /* 0x00 */ char pad_0[0x5C];
    /* 0x5C */ GraphicsContext *sp5C;               /* inferred */
    /* 0x60 */ char pad_60[0x18];
};                                                  /* size = 0x78 */

struct _mips2c_stack_func_80A9369C {
    /* 0x00 */ char pad_0[0x68];
    /* 0x68 */ GraphicsContext *sp68;               /* inferred */
    /* 0x6C */ char pad_6C[0x4];
    /* 0x70 */ void *sp70;                          /* inferred */
    /* 0x74 */ char pad_74[0x4];
    /* 0x78 */ s16 sp78;                            /* inferred */
    /* 0x7A */ char pad_7A[0x16];
};                                                  /* size = 0x90 */

struct _mips2c_stack_func_80A939E8 {
    /* 0x00 */ char pad_0[0x50];
    /* 0x50 */ s32 *sp50;                           /* inferred */
    /* 0x54 */ char pad_54[0x3C];                   /* maybe part of sp50[16]? */
    /* 0x90 */ void *sp90;                          /* inferred */
    /* 0x94 */ char pad_94[0x4];
};                                                  /* size = 0x98 */

? func_800FD698(GlobalContext *, s16, s16, f32);    /* extern */
? func_8016119C(Camera *, ? *);                     /* extern */
? func_80161998(? *, ? *);                          /* extern */
? func_8016566C(s16, s16);                          /* extern */
? func_80165690();                                  /* extern */
? func_8016981C(GlobalContext *, s32, s32 *, f32 *, ? *); /* extern */
? func_80169940(GlobalContext *, s16, f32);         /* extern */
? func_80169988(GlobalContext *, s16, ?);           /* extern */
? func_801A75E8(?);                                 /* extern */
void func_80A90730(EnTest6 *arg0, GlobalContext *arg1); /* static */
void func_80A90C08(s16 arg0);                       /* static */
void func_80A90C34();                               /* static */
void func_80A90C54(GlobalContext *arg0, f32 arg1);  /* static */
