typedef struct EnBigokuta {
    /* 0x000 */ Actor actor;
    /* 0x144 */ void (*unk144)(GlobalContext *, Actor *); /* inferred */
    /* 0x148 */ SkelAnime unk148;                   /* inferred */
    /* 0x18C */ void (*actionFunc)(EnBigokuta *, GlobalContext *);
    /* 0x190 */ u8 unk190;                          /* inferred */
    /* 0x191 */ char pad191[0x1];
    /* 0x192 */ s16 unk192;                         /* inferred */
    /* 0x194 */ char pad194[0x2];
    /* 0x196 */ s16 unk196;                         /* inferred */
    /* 0x198 */ Vec3s unk198;                       /* inferred */
    /* 0x19E */ char pad19E[0x72];                  /* maybe part of unk198[20]? */
    /* 0x210 */ Vec3s unk210;                       /* inferred */
    /* 0x216 */ char pad216[0x72];                  /* maybe part of unk210[20]? */
    /* 0x288 */ f32 unk288;                         /* inferred */
    /* 0x28C */ f32 unk28C;                         /* inferred */
    /* 0x290 */ f32 unk290;                         /* inferred */
    /* 0x294 */ char pad294[0x18];                  /* maybe part of unk290[7]? */
    /* 0x2AC */ f32 unk2AC;                         /* inferred */
    /* 0x2B0 */ f32 unk2B0;                         /* inferred */
    /* 0x2B4 */ f32 unk2B4;                         /* inferred */
    /* 0x2B8 */ char pad2B8[0xC];                   /* maybe part of unk2B4[4]? */
    /* 0x2C4 */ Vec3f unk2C4;                       /* inferred */
    /* 0x2D0 */ char pad2D0[0x90];                  /* maybe part of unk2C4[13]? */
    /* 0x360 */ ColliderCylinder unk360;            /* inferred */
    /* 0x3AC */ ColliderCylinder unk3AC;            /* inferred */
} EnBigokuta;                                       /* size = 0x3F8 */

struct _mips2c_stack_EnBigokuta_Destroy {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnBigokuta_Draw {
    /* 0x00 */ char pad0[0x30];
    /* 0x30 */ GraphicsContext *sp30;               /* inferred */
    /* 0x34 */ char pad34[0xC];
};                                                  /* size = 0x40 */

struct _mips2c_stack_EnBigokuta_Init {
    /* 0x00 */ char pad0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_EnBigokuta_Update {
    /* 0x00 */ char pad0[0x20];
    /* 0x20 */ ColliderCylinder *sp20;              /* inferred */
    /* 0x24 */ CollisionCheckContext *sp24;         /* inferred */
    /* 0x28 */ char pad28[0x8];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80AC28B4 {
    /* 0x00 */ char pad0[0x26];
    /* 0x26 */ s16 sp26;                            /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80AC299C {
    /* 0x00 */ char pad0[0x18];
    /* 0x18 */ Vec3f *sp18;                         /* inferred */
    /* 0x1C */ Camera *sp1C;                        /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80AC2A1C {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80AC2A7C {
    /* 0x00 */ char pad0[0x2C];
    /* 0x2C */ void *sp2C;                          /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80AC2B4C {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80AC2B98 {
    /* 0x00 */ char pad0[0x2C];
    /* 0x2C */ CollisionContext *sp2C;              /* inferred */
    /* 0x30 */ s32 sp30;                            /* inferred */
    /* 0x34 */ WaterBox *sp34;                      /* inferred */
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80AC2C30 {
    /* 0x00 */ char pad0[0x24];
    /* 0x24 */ f32 sp24;                            /* inferred */
    /* 0x28 */ f32 sp28;                            /* inferred */
    /* 0x2C */ f32 sp2C;                            /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80AC2C84 {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80AC2CE8 {
    /* 0x00 */ char pad0[0x24];
    /* 0x24 */ void *sp24;                          /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80AC2DAC {
    /* 0x00 */ char pad0[0x4C];
    /* 0x4C */ f32 sp4C;                            /* inferred */
    /* 0x50 */ f32 sp50;                            /* inferred */
    /* 0x54 */ f32 sp54;                            /* inferred */
};                                                  /* size = 0x58 */

struct _mips2c_stack_func_80AC2EBC {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80AC2F20 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80AC2F64 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80AC3054 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80AC30EC {
    /* 0x00 */ char pad0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80AC31EC {
    /* 0x00 */ char pad0[0x28];
    /* 0x28 */ Vec3f *sp28;                         /* inferred */
    /* 0x2C */ Vec3f *sp2C;                         /* inferred */
    /* 0x30 */ char pad30[0xA];                     /* maybe part of sp2C[3]? */
    /* 0x3A */ s16 sp3A;                            /* inferred */
    /* 0x3C */ char pad3C[0x4];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80AC33A4 {};              /* size 0x0 */

struct _mips2c_stack_func_80AC33C0 {
    /* 0x00 */ char pad0[0x24];
    /* 0x24 */ s32 sp24;                            /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80AC3460 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80AC34A8 {
    /* 0x00 */ char pad0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80AC35E8 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80AC3650 {
    /* 0x00 */ char pad0[0x68];
    /* 0x68 */ f32 sp68;                            /* inferred */
    /* 0x6C */ f32 sp6C;                            /* inferred */
    /* 0x70 */ f32 sp70;                            /* inferred */
    /* 0x74 */ f32 sp74;                            /* inferred */
    /* 0x78 */ f32 sp78;                            /* inferred */
    /* 0x7C */ f32 sp7C;                            /* inferred */
    /* 0x80 */ char pad80[0x4];
    /* 0x84 */ f32 sp84;                            /* inferred */
    /* 0x88 */ f32 sp88;                            /* inferred */
    /* 0x8C */ f32 sp8C;                            /* inferred */
};                                                  /* size = 0x90 */

struct _mips2c_stack_func_80AC3930 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80AC39A0 {
    /* 0x00 */ char pad0[0x38];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80AC3D48 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80AC4204 {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

void func_80AC28B4(Actor *arg0, GlobalContext *arg1, Vec3f *arg2, Vec3f *arg3); /* static */
void func_80AC299C(Actor *arg0, GlobalContext *arg1, s8); /* static */
void func_80AC2A1C(Actor *arg0, GlobalContext *arg1); /* static */
void func_80AC2A7C(Actor *arg0, GlobalContext *arg1); /* static */
void func_80AC2B4C(GlobalContext *arg0, Actor *arg1); /* static */
s32 func_80AC2B98(Actor *arg0, GlobalContext *arg1); /* static */
void func_80AC2C30(EnBigokuta *arg0, GlobalContext *arg1); /* static */
void func_80AC2C84(EnBigokuta *arg0);               /* static */
void func_80AC2CE8(Actor *arg0, GlobalContext *arg1); /* static */
void func_80AC2DAC(Actor *arg0, GlobalContext *arg1); /* static */
void func_80AC2EBC(Actor *arg0, ? arg1);            /* static */
void func_80AC2F20(Actor *arg0);                    /* static */
void func_80AC2F64(Actor *arg0, void *arg1);        /* static */
