struct _mips2c_stack_EnKgy_Destroy {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnKgy_Draw {
    /* 0x00 */ char pad0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_EnKgy_Init {
    /* 0x00 */ char pad0[0x48];
};                                                  /* size = 0x48 */

struct _mips2c_stack_EnKgy_Update {
    /* 0x00 */ char pad0[0x30];
    /* 0x30 */ s16 sp30;                            /* inferred */
    /* 0x32 */ s16 sp32;                            /* inferred */
    /* 0x34 */ s16 sp34;                            /* inferred */
    /* 0x36 */ char pad36[0xA];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80B40B38 {
    /* 0x00 */ char pad0[0x28];
    /* 0x28 */ AnimationHeaderCommon **sp28;        /* inferred */
    /* 0x2C */ char pad2C[0x4];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80B40BC0 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B40BFC {};              /* size 0x0 */

struct _mips2c_stack_func_80B40C38 {};              /* size 0x0 */

struct _mips2c_stack_func_80B40C74 {};              /* size 0x0 */

struct _mips2c_stack_func_80B40D00 {};              /* size 0x0 */

struct _mips2c_stack_func_80B40D30 {};              /* size 0x0 */

struct _mips2c_stack_func_80B40D64 {};              /* size 0x0 */

struct _mips2c_stack_func_80B40D8C {};              /* size 0x0 */

struct _mips2c_stack_func_80B40DB4 {};              /* size 0x0 */

struct _mips2c_stack_func_80B40E18 {};              /* size 0x0 */

struct _mips2c_stack_func_80B40E38 {};              /* size 0x0 */

struct _mips2c_stack_func_80B40E54 {};              /* size 0x0 */

struct _mips2c_stack_func_80B40E74 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B40EBC {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B40EE8 {
    /* 0x00 */ char pad0[0x34];
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ char pad3C[0xC];
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_80B411DC {};              /* size 0x0 */

struct _mips2c_stack_func_80B41368 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B413C8 {
    /* 0x00 */ char pad0[0x1C];
    /* 0x1C */ ? sp1C;                              /* inferred */
    /* 0x1C */ char pad1C[0xC];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80B41460 {};              /* size 0x0 */

struct _mips2c_stack_func_80B41528 {};              /* size 0x0 */

struct _mips2c_stack_func_80B415A8 {
    /* 0x00 */ char pad0[0x24];
    /* 0x24 */ s32 sp24;                            /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80B4163C {
    /* 0x00 */ char pad0[0x24];
    /* 0x24 */ SkelAnime *sp24;                     /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80B417B8 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80B41858 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80B418C4 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80B419B0 {
    /* 0x00 */ char pad0[0x20];
    /* 0x20 */ Actor *sp20;                         /* inferred */
    /* 0x24 */ char pad24[0x4];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80B41A48 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B41ACC {
    /* 0x00 */ char pad0[0x20];
    /* 0x20 */ void *sp20;                          /* inferred */
    /* 0x24 */ s32 sp24;                            /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80B41C30 {};              /* size 0x0 */

struct _mips2c_stack_func_80B41C54 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B41CBC {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80B41D64 {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80B41E18 {
    /* 0x00 */ char pad0[0x2C];
    /* 0x2C */ s32 sp2C;                            /* inferred */
    /* 0x30 */ void *sp30;                          /* inferred */
    /* 0x34 */ char pad34[0x8];                     /* maybe part of sp30[3]? */
    /* 0x3C */ Actor *sp3C;                         /* inferred */
    /* 0x40 */ char pad40[0x6];                     /* maybe part of sp3C[2]? */
    /* 0x46 */ u16 sp46;                            /* inferred */
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_80B42508 {
    /* 0x00 */ char pad0[0x20];
    /* 0x20 */ Actor *sp20;                         /* inferred */
    /* 0x24 */ char pad24[0x4];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80B425A0 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80B42660 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80B42714 {
    /* 0x00 */ char pad0[0x20];
    /* 0x20 */ Actor *sp20;                         /* inferred */
    /* 0x24 */ char pad24[0x4];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80B427C8 {
    /* 0x00 */ char pad0[0x24];
    /* 0x24 */ s32 sp24;                            /* inferred */
    /* 0x28 */ char pad28[0x8];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80B4296C {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80B42A8C {
    /* 0x00 */ char pad0[0x24];
    /* 0x24 */ s32 sp24;                            /* inferred */
    /* 0x28 */ char pad28[0x6];                     /* maybe part of sp24[2]? */
    /* 0x2E */ u16 sp2E;                            /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80B42D28 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80B42FA0 {};              /* size 0x0 */

struct _mips2c_stack_func_80B43008 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B43074 {
    /* 0x00 */ char pad0[0x1C];
    /* 0x1C */ GraphicsContext *sp1C;               /* inferred */
    /* 0x20 */ Gfx *sp20;                           /* inferred */
    /* 0x24 */ char pad24[0x4];
};                                                  /* size = 0x28 */

void func_80B40B38(EnKgy *arg0, s16 arg1, u8 arg2, f32 arg3); /* static */
void func_80B40BC0(EnKgy *arg0, s16 arg1, u16);     /* static */
EnKbt *func_80B40BFC(GlobalContext *arg0);          /* static */
ObjIcePoly *func_80B40C38(GlobalContext *arg0);     /* static */
void func_80B40C74(GlobalContext *arg0);            /* static */
void func_80B40D00(GlobalContext *arg0, s32);       /* static */
s32 func_80B40D8C(GlobalContext *arg0);             /* static */
void func_80B40E18(EnKgy *arg0, u16 arg1);          /* static */
void func_80B40E38(EnKgy *arg0);                    /* static */
s16 func_80B40E54(EnKgy *arg0);                     /* static */
void func_80B40E74(EnKgy *arg0, GlobalContext *arg1, u16 arg2); /* static */
void func_80B40EBC(s32 arg2, GlobalContext *, u16); /* static */
void func_80B40EE8(EnKgy *arg0, GlobalContext *arg1, Actor *); /* static */
