? func_800F0590(GlobalContext *, PosRot *, ?, ?);   /* extern */
? func_8013CD64(? *, PosRot *, Gfx *, f32, s32, ? *, ? *); /* extern */
? func_8013CF04(EnGrasshopper *, GlobalContext *, Gfx *); /* extern */
void func_809A6524(EnGrasshopper *arg0, s32 arg1);  /* static */
void func_809A65D8(EnGrasshopper *arg0);            /* static */
void func_809A6628(Actor *arg0);                    /* static */
void func_809A6668(EnGrasshopper *arg0, GlobalContext *arg1); /* static */
void func_809A6754(EnGrasshopper *arg0);            /* static */
void func_809A67A4(Actor *arg0, GlobalContext *arg1); /* static */
void func_809A6B6C(EnGrasshopper *arg0, GlobalContext *arg1); /* static */
void func_809A6E18(EnGrasshopper *arg0);            /* static */
void func_809A6E74(Actor *arg0, ? arg1);            /* static */
void func_809A6F8C(EnGrasshopper *arg0);            /* static */
void func_809A700C(Actor *arg0, GlobalContext *arg1); /* static */
void func_809A7134(EnGrasshopper *arg0, GlobalContext *arg1); /* static */
void func_809A71CC(Actor *arg0, GlobalContext *arg1); /* static */
void func_809A7494(EnGrasshopper *arg0);            /* static */
void func_809A753C(EnGrasshopper *arg0, GlobalContext *arg1); /* static */
void func_809A7844(EnGrasshopper *arg0);            /* static */
void func_809A78EC(EnGrasshopper *arg0, GlobalContext *arg1); /* static */
void func_809A797C(EnGrasshopper *arg0, GlobalContext *arg1); /* static */
void func_809A7A8C(EnGrasshopper *arg0, GlobalContext *arg1); /* static */
void func_809A7AE4(EnGrasshopper *arg0, GlobalContext *arg1); /* static */
void func_809A7BBC(EnGrasshopper *arg0, GlobalContext *arg1); /* static */
void func_809A7C98(EnGrasshopper *arg0);            /* static */
void func_809A7CE0(Actor *arg0, GlobalContext *arg1); /* static */
void func_809A8044(Actor *arg0, GlobalContext *arg1); /* static */
void func_809A847C(GlobalContext *arg0, s32 arg1, Gfx **arg2, Vec3s *arg3, Actor *arg4); /* static */
void func_809A8870(EnGrasshopper *arg0, f32 *arg1); /* static */
void func_809A8924(EnGrasshopper *arg0, GlobalContext *arg1); /* static */
void func_809A8A64(EnGrasshopper *arg0, GlobalContext *arg1); /* static */
extern AnimationHeader D_06000F9C;
extern SkeletonHeader D_06003F00;
static s32 D_809A8C80 = {0, 0, 0, 0, 0};
static ? D_809A8C94;                                /* unable to generate initializer */
static ? D_809A8CAC;                                /* unable to generate initializer */
static ? D_809A8CC4;                                /* unable to generate initializer */
static DamageTable D_809A8CDC = {
    {
        0xF1,
        0xF1,
        0,
        0xF1,
        0xF1,
        0xF1,
        0,
        0xE0,
        0xF1,
        0xF1,
        0xF0,
        0x22,
        0x32,
        0x42,
        0xF1,
        0xF1,
        0xF1,
        0xF2,
        0xF1,
        0xF1,
        0,
        0,
        0xF1,
        0xF1,
        0xF1,
        0,
        0,
        0,
        0,
        0,
        0,
        0xE1,
    },
};
static ColliderJntSphElementInit D_809A8D1C = {
    {{3, {0xF7CFFFFF, 0, 0}, {0xF7CFFFFF, 0, 0}, 1, 5, 1}, {7, {{0, 0, 0}, 0}, 0}},
    {{2, {0xF7CFFFFF, 7, 4}, {0xF7CFFFFF, 0, 0}, 1, 1, 0}, {6, {{0, 0, 0}, 0}, 0}},
};
static ColliderJntSphInit D_809A8D64 = {{2, 0x11, 9, 0x11, 0x10, 0}, 2, &D_809A8D1C};
static ? D_809A8D74;                                /* unable to generate initializer */
static ? D_809A8D94;                                /* unable to generate initializer */
static s32 D_809A8D9C = {
    0x3F800000,
    0,
    0x3F000000,
    0x3F800000,
    0,
    0xBF000000,
    0xBF800000,
    0,
    0x3F000000,
    0xBF800000,
    0,
    0xBF000000,
    0x3F000000,
    0,
    0x3F800000,
    0xBF000000,
    0,
    0x3F800000,
    0x3F000000,
    0,
    0xBF800000,
    0xBF000000,
    0,
    0xBF800000,
    0,
    0,
    0,
};
static ? D_809A8E08;                                /* unable to generate initializer */
static ? D_809A8E14;                                /* unable to generate initializer */
static ? D_809A8E20;                                /* unable to generate initializer */

typedef struct EnGrasshopper {
    /* 0x0000 */ Actor actor;
    /* 0x0144 */ SkelAnime unk144;                  /* inferred */
    /* 0x0188 */ Vec3s unk188;                      /* inferred */
    /* 0x018E */ char pad18E[0x8A];                 /* maybe part of unk188[24]? */
    /* 0x0218 */ Vec3s unk218;                      /* inferred */
    /* 0x021E */ char pad21E[0x8A];                 /* maybe part of unk218[24]? */
    /* 0x02A8 */ void (*actionFunc)(EnGrasshopper *, GlobalContext *);
    /* 0x02AC */ u8 unk2AC;                         /* inferred */
    /* 0x02AD */ char pad2AD[0x3];                  /* maybe part of unk2AC[4]? */
    /* 0x02B0 */ s16 unk2B0;                        /* inferred */
    /* 0x02B2 */ s16 unk2B2;                        /* inferred */
    /* 0x02B4 */ s16 unk2B4;                        /* inferred */
    /* 0x02B6 */ s16 unk2B6;                        /* inferred */
    /* 0x02B8 */ s16 unk2B8;                        /* inferred */
    /* 0x02BA */ char pad2BA[0x2];                  /* maybe part of unk2B8[2]? */
    /* 0x02BC */ f32 unk2BC;                        /* inferred */
    /* 0x02C0 */ f32 unk2C0;                        /* inferred */
    /* 0x02C4 */ Vec3f unk2C4;                      /* inferred */
    /* 0x02D0 */ char pad2D0[0x86];
    /* 0x0356 */ s16 unk356;                        /* inferred */
    /* 0x0358 */ s16 unk358;                        /* inferred */
    /* 0x035A */ s16 unk35A;                        /* inferred */
    /* 0x035C */ char pad35C[0x2];                  /* maybe part of unk35A[2]? */
    /* 0x035E */ s16 unk35E;                        /* inferred */
    /* 0x0360 */ f32 unk360;                        /* inferred */
    /* 0x0364 */ char pad364[0x4];                  /* maybe part of unk360[2]? */
    /* 0x0368 */ f32 unk368;                        /* inferred */
    /* 0x036C */ f32 unk36C;                        /* inferred */
    /* 0x0370 */ f32 unk370;                        /* inferred */
    /* 0x0374 */ f32 unk374;                        /* inferred */
    /* 0x0378 */ char pad378[0x2];
    /* 0x037A */ s16 unk37A;                        /* inferred */
    /* 0x037C */ s16 unk37C;                        /* inferred */
    /* 0x037E */ char pad37E[0x2];                  /* maybe part of unk37C[2]? */
    /* 0x0380 */ Vec3f unk380;                      /* inferred */
    /* 0x038C */ s16 unk38C;                        /* inferred */
    /* 0x038E */ char pad38E[0x26];                 /* maybe part of unk38C[20]? */
    /* 0x03B4 */ f32 unk3B4;                        /* inferred */
    /* 0x03B8 */ f32 unk3B8;                        /* inferred */
    /* 0x03BC */ f32 unk3BC;                        /* inferred */
    /* 0x03C0 */ f32 unk3C0;                        /* inferred */
    /* 0x03C4 */ f32 unk3C4;                        /* inferred */
    /* 0x03C8 */ f32 unk3C8;                        /* inferred */
    /* 0x03CC */ f32 unk3CC;                        /* inferred */
    /* 0x03D0 */ f32 unk3D0;                        /* inferred */
    /* 0x03D4 */ f32 unk3D4;                        /* inferred */
    /* 0x03D8 */ ? unk3D8;                          /* inferred */
    /* 0x03D9 */ char pad3D9[0x11F];
    /* 0x04F8 */ f32 unk4F8;                        /* inferred */
    /* 0x04FC */ Vec3f unk4FC;                      /* inferred */
    /* 0x0508 */ char pad508[0x8];
    /* 0x0510 */ ColliderJntSph unk510;             /* inferred */
    /* 0x0530 */ ColliderJntSphElement unk530;      /* inferred */
    /* 0x0570 */ char pad570[0x1300];               /* maybe part of unk530[77]? */
} EnGrasshopper;                                    /* size 0x1870 */

void EnGrasshopper_Init(Actor *thisx, GlobalContext *globalCtx) {
    EnGrasshopper *this = (EnGrasshopper *) thisx;
    Vec3f *sp30;
    ColliderJntSphElement *temp_v1;
    Vec3f *temp_a0;
    s16 temp_v0;
    s16 temp_v0_2;
    s16 temp_v0_3;
    s16 temp_v0_4;
    s32 *phi_v1;
    s16 phi_v0;

    this->actor.hintId = 0x15;
    this->actor.targetMode = 4;
    this->actor.colChkInfo.mass = 0x3C;
    this->actor.colChkInfo.health = 2;
    Collider_InitAndSetJntSph(globalCtx, &this->unk510, &this->actor, &D_809A8D64, &this->unk530);
    this->unk510.elements->dim.modelSphere.radius = 1;
    this->unk510.elements->dim.scale = 22.0f;
    this->unk510.elements->unk6E = 1;
    this->unk510.elements->unk78 = 16.0f;
    this->unk510.elements->unk68 = 0x3E8;
    this->unk510.elements->unk6C = 0;
    temp_v1 = this->unk510.elements;
