typedef struct EnGrasshopper {
    /* 0x0000 */ Actor actor;
    /* 0x0144 */ SkelAnime unk_144;                 /* inferred */
    /* 0x0188 */ Vec3s unk_188;                     /* inferred */
    /* 0x018E */ char pad_18E[0x8A];                /* maybe part of unk_188[24]? */
    /* 0x0218 */ Vec3s unk_218;                     /* inferred */
    /* 0x021E */ char pad_21E[0x8A];                /* maybe part of unk_218[24]? */
    /* 0x02A8 */ void (*actionFunc)(EnGrasshopper *, GlobalContext *);
    /* 0x02AC */ u8 unk_2AC;                        /* inferred */
    /* 0x02AD */ char pad_2AD[0x3];                 /* maybe part of unk_2AC[4]? */
    /* 0x02B0 */ s16 unk_2B0;                       /* inferred */
    /* 0x02B2 */ s16 unk_2B2;                       /* inferred */
    /* 0x02B4 */ s16 unk_2B4;                       /* inferred */
    /* 0x02B6 */ s16 unk_2B6;                       /* inferred */
    /* 0x02B8 */ s16 unk_2B8;                       /* inferred */
    /* 0x02BA */ char pad_2BA[0x2];
    /* 0x02BC */ f32 unk_2BC;                       /* inferred */
    /* 0x02C0 */ f32 unk_2C0;                       /* inferred */
    /* 0x02C4 */ Vec3f unk_2C4;                     /* inferred */
    /* 0x02D0 */ char pad_2D0[0x86];                /* maybe part of unk_2C4[12]? */
    /* 0x0356 */ s16 unk_356;                       /* inferred */
    /* 0x0358 */ s16 unk_358;                       /* inferred */
    /* 0x035A */ s16 unk_35A;                       /* inferred */
    /* 0x035C */ char pad_35C[0x2];
    /* 0x035E */ s16 unk_35E;                       /* inferred */
    /* 0x0360 */ f32 unk_360;                       /* inferred */
    /* 0x0364 */ char pad_364[0x4];
    /* 0x0368 */ f32 unk_368;                       /* inferred */
    /* 0x036C */ f32 unk_36C;                       /* inferred */
    /* 0x0370 */ f32 unk_370;                       /* inferred */
    /* 0x0374 */ f32 unk_374;                       /* inferred */
    /* 0x0378 */ char pad_378[0x2];
    /* 0x037A */ s16 unk_37A;                       /* inferred */
    /* 0x037C */ s16 unk_37C;                       /* inferred */
    /* 0x037E */ char pad_37E[0x2];
    /* 0x0380 */ Vec3f unk_380;                     /* inferred */
    /* 0x038C */ s16 unk_38C;                       /* inferred */
    /* 0x038E */ char pad_38E[0x2A];                /* maybe part of unk_38C[22]? */
    /* 0x03B8 */ f32 unk_3B8;                       /* inferred */
    /* 0x03BC */ char pad_3BC[0x4];
    /* 0x03C0 */ Vec3f unk_3C0;                     /* inferred */
    /* 0x03C4 */ f32 unk_3C4;                       /* overlap; inferred */
    /* 0x03C8 */ f32 unk_3C8;                       /* overlap; inferred */
    /* 0x03CC */ char pad_3CC[0xC];                 /* maybe part of unk_3C8[4]? */
    /* 0x03D8 */ ? unk_3D8;                         /* inferred */
    /* 0x03D8 */ char pad_3D8[0x120];
    /* 0x04F8 */ f32 unk_4F8;                       /* inferred */
    /* 0x04FC */ Vec3f unk_4FC;                     /* inferred */
    /* 0x0508 */ char pad_508[0x8];
    /* 0x0510 */ ColliderJntSph unk_510;            /* inferred */
    /* 0x0530 */ ColliderJntSphElement unk_530;     /* inferred */
    /* 0x0570 */ char pad_570[0x1300];              /* maybe part of unk_530[77]? */
} EnGrasshopper;                                    /* size = 0x1870 */

struct _mips2c_stack_EnGrasshopper_Destroy {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnGrasshopper_Draw {
    /* 0x00 */ char pad_0[0x50];
};                                                  /* size = 0x50 */

struct _mips2c_stack_EnGrasshopper_Init {
    /* 0x00 */ char pad_0[0x30];
    /* 0x30 */ Vec3f *sp30;                         /* inferred */
    /* 0x34 */ char pad_34[0x14];
};                                                  /* size = 0x48 */

struct _mips2c_stack_EnGrasshopper_Update {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ ColliderJntSph *sp2C;                /* inferred */
    /* 0x30 */ CollisionCheckContext *sp30;         /* inferred */
    /* 0x34 */ char pad_34[0xC];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_809A6524 {
    /* 0x00 */ char pad_0[0x30];
    /* 0x30 */ AnimationHeaderCommon **sp30;        /* inferred */
    /* 0x34 */ char pad_34[0x4];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_809A65D8 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809A6628 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809A6668 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_809A6754 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809A67A4 {
    /* 0x00 */ char pad_0[0x30];
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ char pad_3C[0x4];
    /* 0x40 */ f32 sp40;                            /* inferred */
    /* 0x44 */ f32 sp44;                            /* inferred */
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_809A6B6C {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ Actor *sp2C;                         /* inferred */
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ char pad_3C[0x6];                    /* maybe part of sp38[2]? */
    /* 0x42 */ s16 sp42;                            /* inferred */
    /* 0x44 */ f32 sp44;                            /* inferred */
    /* 0x48 */ f32 sp48;                            /* inferred */
    /* 0x4C */ f32 sp4C;                            /* inferred */
};                                                  /* size = 0x50 */

struct _mips2c_stack_func_809A6E18 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809A6E74 {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_809A6F8C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809A700C {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_809A7134 {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ void *sp18;                          /* inferred */
    /* 0x1C */ char pad_1C[0x4];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_809A71CC {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ PosRot *sp2C;                        /* inferred */
    /* 0x30 */ char pad_30[0x4];
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ char pad_38[0x4];
    /* 0x3C */ f32 sp3C;                            /* inferred */
    /* 0x40 */ WaterBox *sp40;                      /* inferred */
    /* 0x44 */ void *sp44;                          /* inferred */
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_809A7494 {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_809A753C {
    /* 0x00 */ char pad_0[0x40];
    /* 0x40 */ f32 sp40;                            /* inferred */
    /* 0x44 */ char pad_44[0x4];
    /* 0x48 */ f32 sp48;                            /* inferred */
    /* 0x4C */ WaterBox *sp4C;                      /* inferred */
    /* 0x50 */ char pad_50[0x1C];                   /* maybe part of sp4C[8]? */
    /* 0x6C */ f32 sp6C;                            /* inferred */
    /* 0x70 */ f32 sp70;                            /* inferred */
    /* 0x74 */ Actor *sp74;                         /* inferred */
};                                                  /* size = 0x78 */

struct _mips2c_stack_func_809A7844 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_809A78EC {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_809A797C {
    /* 0x00 */ char pad_0[0x34];
    /* 0x34 */ ? sp34;                              /* inferred */
    /* 0x34 */ char pad_34[0xC];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_809A7A8C {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_809A7AE4 {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_809A7BBC {
    /* 0x00 */ char pad_0[0x34];
    /* 0x34 */ f32 sp34;                            /* inferred */
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_809A7C98 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809A7CE0 {
    /* 0x00 */ char pad_0[0x64];
    /* 0x64 */ ? sp64;                              /* inferred */
    /* 0x64 */ char pad_64[0x6C];
    /* 0xD0 */ f32 spD0;                            /* inferred */
    /* 0xD4 */ f32 spD4;                            /* inferred */
    /* 0xD8 */ f32 spD8;                            /* inferred */
    /* 0xDC */ char pad_DC[0x4];
    /* 0xE0 */ f32 spE0;                            /* inferred */
    /* 0xE4 */ char pad_E4[0x4];
    /* 0xE8 */ f32 spE8;                            /* inferred */
    /* 0xEC */ char pad_EC[0x4];
    /* 0xF0 */ f32 spF0;                            /* inferred */
    /* 0xF4 */ WaterBox *spF4;                      /* inferred */
};                                                  /* size = 0xF8 */

struct _mips2c_stack_func_809A8044 {
    /* 0x00 */ char pad_0[0x3A];
    /* 0x3A */ s16 sp3A;                            /* inferred */
    /* 0x3C */ char pad_3C[0x4];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_809A847C {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ ? sp24;                              /* inferred */
    /* 0x24 */ char pad_24[0xC];
    /* 0x30 */ ? sp30;                              /* inferred */
    /* 0x30 */ char pad_30[0x10];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_809A8870 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_809A8924 {
    /* 0x00 */ char pad_0[0x40];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_809A8A64 {
    /* 0x000 */ char pad_0[0x70];
    /* 0x070 */ ? sp70;                             /* inferred */
    /* 0x070 */ char pad_70[0x40];
    /* 0x0B0 */ ? spB0;                             /* inferred */
    /* 0x0B0 */ char pad_B0[0x40];
    /* 0x0F0 */ ? spF0;                             /* inferred */
    /* 0x0F0 */ char pad_F0[0x40];
    /* 0x130 */ ? sp130;                            /* inferred */
    /* 0x130 */ char pad_130[0x40];
    /* 0x170 */ ? sp170;                            /* inferred */
    /* 0x170 */ char pad_170[0x40];
    /* 0x1B0 */ ? sp1B0;                            /* inferred */
    /* 0x1B0 */ char pad_1B0[0x50];
};                                                  /* size = 0x200 */

? func_800F0590(GlobalContext *, PosRot *, ?, ?);   /* extern */
? func_8013CD64(? *, PosRot *, Gfx *, f32, s32, ? *, ? *); /* extern */
? func_8013CF04(EnGrasshopper *, GlobalContext *, Gfx *); /* extern */
void func_809A6524(EnGrasshopper *arg0, s32 arg1);  /* static */
void func_809A65D8(EnGrasshopper *arg0);            /* static */
void func_809A6628(Actor *arg0);                    /* static */
void func_809A6668(EnGrasshopper *arg0, GlobalContext *arg1); /* static */
void func_809A6754(EnGrasshopper *arg0);            /* static */
void func_809A67A4(Actor *arg0, GlobalContext *arg1); /* static */
void func_809A6B6C(EnGrasshopper *, GlobalContext *); /* static */
void func_809A6E18(EnGrasshopper *arg0);            /* static */
void func_809A6E74(Actor *arg0, ? arg1);            /* static */
void func_809A6F8C(EnGrasshopper *arg0);            /* static */
