typedef struct EnKusa2 {
    /* 0x000 */ Actor actor;
    /* 0x144 */ ColliderCylinder unk_144;           /* inferred */
    /* 0x190 */ void (*actionFunc)(EnKusa2 *, GlobalContext *);
    /* 0x194 */ char pad_194[0x24];                 /* maybe part of actionFunc[10]? */
    /* 0x1B8 */ void *unk_1B8;                      /* inferred */
    /* 0x1BC */ char pad_1BC[0x2];
    /* 0x1BE */ s8 unk_1BE;                         /* inferred */
    /* 0x1BF */ char pad_1BF[0x1];
    /* 0x1C0 */ Actor *unk_1C0;                     /* inferred */
    /* 0x1C4 */ s16 unk_1C4;                        /* inferred */
    /* 0x1C6 */ char pad_1C6[0x2];
    /* 0x1C8 */ s16 unk_1C8;                        /* inferred */
    /* 0x1CA */ s16 unk_1CA;                        /* inferred */
    /* 0x1CC */ s16 unk_1CC;                        /* inferred */
    /* 0x1CE */ s8 unk_1CE;                         /* inferred */
    /* 0x1CF */ u8 unk_1CF;                         /* inferred */
    /* 0x1D0 */ s8 unk_1D0;                         /* inferred */
    /* 0x1D1 */ s8 unk_1D1;                         /* inferred */
    /* 0x1D2 */ char pad_1D2[0x2];                  /* maybe part of unk_1D1[3]? */
} EnKusa2;                                          /* size = 0x1D4 */

struct _mips2c_stack_EnKusa2_Destroy {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnKusa2_Draw {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnKusa2_Init {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ ColliderCylinder *sp24;              /* inferred */
    /* 0x28 */ char pad_28[0x8];
};                                                  /* size = 0x30 */

struct _mips2c_stack_EnKusa2_Update {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A5B160 {
    /* 0x00 */ char pad_0[0x78];
};                                                  /* size = 0x78 */

struct _mips2c_stack_func_80A5B334 {
    /* 0x00 */ char pad_0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80A5B3BC {};              /* size 0x0 */

struct _mips2c_stack_func_80A5B490 {
    /* 0x00 */ char pad_0[0x48];
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_80A5B508 {
    /* 0x00 */ char pad_0[0x4C];
    /* 0x4C */ f32 sp4C;                            /* inferred */
    /* 0x50 */ f32 sp50;                            /* inferred */
    /* 0x54 */ char pad_54[0x20];                   /* maybe part of sp50[9]? */
    /* 0x74 */ f32 sp74;                            /* inferred */
    /* 0x78 */ f32 sp78;                            /* inferred */
    /* 0x7C */ f32 sp7C;                            /* inferred */
    /* 0x80 */ f32 sp80;                            /* inferred */
    /* 0x84 */ f32 sp84;                            /* inferred */
    /* 0x88 */ f32 sp88;                            /* inferred */
    /* 0x8C */ f32 sp8C;                            /* inferred */
    /* 0x90 */ f32 sp90;                            /* inferred */
    /* 0x94 */ char pad_94[0x14];                   /* maybe part of sp90[6]? */
    /* 0xA8 */ f32 spA8;                            /* inferred */
    /* 0xAC */ f32 spAC;                            /* inferred */
    /* 0xB0 */ char pad_B0[0x4];
    /* 0xB4 */ f32 spB4;                            /* inferred */
    /* 0xB8 */ char pad_B8[0x8];
};                                                  /* size = 0xC0 */

struct _mips2c_stack_func_80A5B954 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A5BA58 {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ s32 sp20;                            /* inferred */
    /* 0x24 */ f32 sp24;                            /* inferred */
    /* 0x28 */ f32 sp28;                            /* inferred */
    /* 0x2C */ f32 sp2C;                            /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80A5BAFC {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80A5BB40 {
    /* 0x00 */ char pad_0[0x84];
    /* 0x84 */ f32 sp84;                            /* inferred */
    /* 0x88 */ f32 sp88;                            /* inferred */
    /* 0x8C */ f32 sp8C;                            /* inferred */
    /* 0x90 */ char pad_90[0x8];
};                                                  /* size = 0x98 */

struct _mips2c_stack_func_80A5BD14 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ void *sp1C;                          /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80A5BD94 {};              /* size 0x0 */

struct _mips2c_stack_func_80A5BDB0 {
    /* 0x00 */ char pad_0[0x50];
    /* 0x50 */ f32 sp50;                            /* inferred */
    /* 0x54 */ f32 sp54;                            /* inferred */
    /* 0x58 */ f32 sp58;                            /* inferred */
    /* 0x5C */ char pad_5C[0xC];
};                                                  /* size = 0x68 */

struct _mips2c_stack_func_80A5BF38 {};              /* size 0x0 */

struct _mips2c_stack_func_80A5BF60 {};              /* size 0x0 */

struct _mips2c_stack_func_80A5BF84 {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ CollisionCheckContext *sp18;         /* inferred */
    /* 0x1C */ ColliderCylinder *sp1C;              /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80A5BFD8 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80A5C074 {};              /* size 0x0 */

struct _mips2c_stack_func_80A5C0B8 {};              /* size 0x0 */

struct _mips2c_stack_func_80A5C104 {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ f32 sp20;                            /* inferred */
    /* 0x24 */ char pad_24[0x4];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80A5C2FC {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80A5C410 {
    /* 0x00 */ char pad_0[0x98];
    /* 0x98 */ f32 sp98;                            /* inferred */
    /* 0x9C */ f32 sp9C;                            /* inferred */
    /* 0xA0 */ f32 spA0;                            /* inferred */
    /* 0xA4 */ char pad_A4[0x4];
};                                                  /* size = 0xA8 */

struct _mips2c_stack_func_80A5C70C {};              /* size 0x0 */

struct _mips2c_stack_func_80A5C718 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80A5C7F0 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A5C918 {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ f32 sp2C;                            /* inferred */
    /* 0x30 */ char pad_30[0x4];
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ f32 sp3C;                            /* inferred */
    /* 0x40 */ f32 sp40;                            /* inferred */
    /* 0x44 */ char pad_44[0x8];                    /* maybe part of sp40[3]? */
    /* 0x4C */ f32 sp4C;                            /* inferred */
    /* 0x50 */ f32 sp50;                            /* inferred */
    /* 0x54 */ f32 sp54;                            /* inferred */
};                                                  /* size = 0x58 */

struct _mips2c_stack_func_80A5CAD4 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A5CAF4 {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80A5CB74 {
    /* 0x00 */ char pad_0[0x36];
    /* 0x36 */ s16 sp36;                            /* inferred */
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ s16 sp3C;                            /* inferred */
    /* 0x3E */ s16 sp3E;                            /* inferred */
    /* 0x40 */ f32 sp40;                            /* inferred */
    /* 0x44 */ f32 sp44;                            /* inferred */
    /* 0x48 */ f32 sp48;                            /* inferred */
    /* 0x4C */ char pad_4C[0x4];
};                                                  /* size = 0x50 */

struct _mips2c_stack_func_80A5CCD4 {};              /* size 0x0 */

struct _mips2c_stack_func_80A5CD0C {
    /* 0x00 */ char pad_0[0x8C];
    /* 0x8C */ s16 sp8C;                            /* inferred */
    /* 0x8E */ s16 sp8E;                            /* inferred */
    /* 0x90 */ s16 sp90;                            /* inferred */
    /* 0x92 */ char pad_92[0x2];
    /* 0x94 */ s16 sp94;                            /* inferred */
    /* 0x96 */ s16 sp96;                            /* inferred */
    /* 0x98 */ s16 sp98;                            /* inferred */
    /* 0x9A */ char pad_9A[0x2];
    /* 0x9C */ f32 sp9C;                            /* inferred */
    /* 0xA0 */ f32 spA0;                            /* inferred */
    /* 0xA4 */ f32 spA4;                            /* inferred */
    /* 0xA8 */ f32 spA8;                            /* inferred */
    /* 0xAC */ f32 spAC;                            /* inferred */
    /* 0xB0 */ f32 spB0;                            /* inferred */
    /* 0xB4 */ char pad_B4[0x4];
};                                                  /* size = 0xB8 */

struct _mips2c_stack_func_80A5CF44 {
    /* 0x00 */ char pad_0[0x8C];
    /* 0x8C */ s16 sp8C;                            /* inferred */
    /* 0x8E */ s16 sp8E;                            /* inferred */
    /* 0x90 */ s16 sp90;                            /* inferred */
    /* 0x92 */ char pad_92[0x2];
    /* 0x94 */ s16 sp94;                            /* inferred */
    /* 0x96 */ s16 sp96;                            /* inferred */
    /* 0x98 */ s16 sp98;                            /* inferred */
    /* 0x9A */ char pad_9A[0x2];
    /* 0x9C */ f32 sp9C;                            /* inferred */
    /* 0xA0 */ f32 spA0;                            /* inferred */
    /* 0xA4 */ f32 spA4;                            /* inferred */
    /* 0xA8 */ f32 spA8;                            /* inferred */
    /* 0xAC */ f32 spAC;                            /* inferred */
    /* 0xB0 */ f32 spB0;                            /* inferred */
    /* 0xB4 */ char pad_B4[0x4];
};                                                  /* size = 0xB8 */

struct _mips2c_stack_func_80A5D178 {
    /* 0x00 */ char pad_0[0x94];
    /* 0x94 */ s16 sp94;                            /* inferred */
    /* 0x96 */ s16 sp96;                            /* inferred */
    /* 0x98 */ s16 sp98;                            /* inferred */
    /* 0x9A */ char pad_9A[0x2];
    /* 0x9C */ s16 sp9C;                            /* inferred */
    /* 0x9E */ s16 sp9E;                            /* inferred */
    /* 0xA0 */ s16 spA0;                            /* inferred */
    /* 0xA2 */ char pad_A2[0x2];
    /* 0xA4 */ f32 spA4;                            /* inferred */
    /* 0xA8 */ f32 spA8;                            /* inferred */
    /* 0xAC */ f32 spAC;                            /* inferred */
    /* 0xB0 */ f32 spB0;                            /* inferred */
    /* 0xB4 */ f32 spB4;                            /* inferred */
    /* 0xB8 */ f32 spB8;                            /* inferred */
    /* 0xBC */ char pad_BC[0x4];
};                                                  /* size = 0xC0 */

struct _mips2c_stack_func_80A5D5E0 {};              /* size 0x0 */

struct _mips2c_stack_func_80A5D5F4 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A5D618 {};              /* size 0x0 */

struct _mips2c_stack_func_80A5D62C {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80A5D6B0 {};              /* size 0x0 */

struct _mips2c_stack_func_80A5D6C4 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80A5D754 {};              /* size 0x0 */

struct _mips2c_stack_func_80A5D794 {};              /* size 0x0 */

struct _mips2c_stack_func_80A5D7A4 {};              /* size 0x0 */

struct _mips2c_stack_func_80A5D7C4 {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ ColliderCylinder *sp20;              /* inferred */
    /* 0x24 */ CollisionCheckContext *sp24;         /* inferred */
    /* 0x28 */ char pad_28[0x2];
    /* 0x2A */ s16 sp2A;                            /* inferred */
    /* 0x2C */ char pad_2C[0x4];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80A5D964 {};              /* size 0x0 */

struct _mips2c_stack_func_80A5D9C8 {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ s32 sp2C;                            /* inferred */
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ char pad_3C[0x4];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80A5DC70 {};              /* size 0x0 */

struct _mips2c_stack_func_80A5DC98 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80A5DE18 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80A5DEB4 {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ s32 sp20;                            /* inferred */
    /* 0x24 */ char pad_24[0xC];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80A5E1D8 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A5E210 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80A5E418 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A5E4BC {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80A5E604 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ void *sp1C;                          /* inferred */
    /* 0x20 */ char pad_20[0x8];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80A5E6F0 {
    /* 0x00 */ char pad_0[0x40];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80A5E80C {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ Gfx *sp1C;                           /* inferred */
    /* 0x20 */ char pad_20[0x4];
    /* 0x24 */ GraphicsContext *sp24;               /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80A5E9B4 {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ s16 sp18;                            /* inferred */
    /* 0x1A */ s16 sp1A;                            /* inferred */
    /* 0x1C */ s16 sp1C;                            /* inferred */
    /* 0x1E */ char pad_1E[0x2];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80A5EA48 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

void func_80A5B160(EnKusa2 *arg0, GlobalContext *arg1); /* static */
void func_80A5B334(EnKusa2 *arg0, GlobalContext *arg1); /* static */
void func_80A5B3BC(EnKusa2 *arg0);                  /* static */
void func_80A5B490(EnKusa2 *arg0, GlobalContext *arg1); /* static */
void func_80A5B508(Actor *);                        /* static */
void func_80A5B954(f32 *arg0, f32 arg1, EnKusa2 *, GlobalContext *); /* static */
s32 func_80A5BA58(Actor *arg0, GlobalContext *arg1); /* static */
void func_80A5BAFC(Actor *arg0, GlobalContext *arg1); /* static */
void func_80A5BB40(EnKusa2 *arg0, GlobalContext *arg1, s32 arg2); /* static */
void func_80A5BD14(Actor *arg0, GlobalContext *arg1, s32 arg2); /* static */
void func_80A5BD94(Actor *arg0);                    /* static */
void func_80A5BDB0(EnKusa2 *arg0, GlobalContext *arg1); /* static */
