void func_80A5B160(EnKusa2 *arg0, GlobalContext *arg1); /* static */
void func_80A5B334(EnKusa2 *arg0, GlobalContext *arg1); /* static */
void func_80A5B3BC(EnKusa2 *arg0);                  /* static */
void func_80A5B490(EnKusa2 *arg0, GlobalContext *arg1); /* static */
void func_80A5B508(Actor *);                        /* static */
void func_80A5B954(f32 *arg0, f32 arg1, EnKusa2 *, GlobalContext *); /* static */
s32 func_80A5BA58(Actor *arg0, GlobalContext *arg1); /* static */
void func_80A5BAFC(Actor *arg0, GlobalContext *arg1); /* static */
void func_80A5BB40(EnKusa2 *arg0, GlobalContext *arg1, s32 arg2); /* static */
void func_80A5BD14(Actor *arg0, GlobalContext *arg1, s32 arg2); /* static */
void func_80A5BD94(Actor *arg0);                    /* static */
void func_80A5BDB0(EnKusa2 *arg0, GlobalContext *arg1); /* static */
void func_80A5BF38(EnKusa2 *arg0, s32 arg1);        /* static */
void func_80A5BF60(EnKusa2 *arg0, s32 arg1);        /* static */
void func_80A5BF84(Actor *arg0, GlobalContext *arg1); /* static */
s32 func_80A5BFD8(Actor *arg0, GlobalContext *arg1); /* static */
Vec3f *func_80A5C074(Vec3f *arg0);                  /* static */
f32 *func_80A5C0B8(s32 arg0);                       /* static */
Vec3f *func_80A5C104(Vec3f *arg1, f32 *arg2, f32 arg3, s16 arg4, s16 arg5, s32); /* static */
f32 *func_80A5C2FC(f32 arg1, Vec3f *arg2, Vec3f *arg3, f32 *arg4, s16 *arg5, s16 *); /* static */
void func_80A5C410(Vec3f *arg0, s32 arg1, Vec3f *arg2); /* static */
void func_80A5C70C(s32 arg0);                       /* static */
void func_80A5C718(void *arg0);                     /* static */
void func_80A5C7F0(Vec3f *arg0, Vec3f *arg1);       /* static */
void func_80A5C918(Vec3f *arg1, s32);               /* static */
void func_80A5CAD4(void *arg0);                     /* static */
void func_80A5CAF4(Vec3f *arg0);                    /* static */
void func_80A5CB74(Actor *arg0);                    /* static */
void func_80A5CCD4(EnKusa2 *arg0);                  /* static */
void func_80A5CD0C(EnKusa2 *arg0);                  /* static */
void func_80A5CF44(Actor *arg0);                    /* static */
void func_80A5D178(EnKusa2 *arg0);                  /* static */
void func_80A5D5E0(EnKusa2 *arg0);                  /* static */
void func_80A5D618(EnKusa2 *arg0);                  /* static */
void func_80A5D6B0(EnKusa2 *arg0);                  /* static */
void func_80A5D754(EnKusa2 *arg0);                  /* static */
void func_80A5D7A4(EnKusa2 *arg0);                  /* static */
void func_80A5D964(EnKusa2 *arg0);                  /* static */
void func_80A5DC70(EnKusa2 *arg0);                  /* static */
void func_80A5DE18(EnKusa2 *arg0);                  /* static */
void func_80A5E1D8(EnKusa2 *arg0);                  /* static */
void func_80A5E418(EnKusa2 *arg0);                  /* static */
void func_80A5E604(Actor *this, GlobalContext *globalCtx); /* static */
void func_80A5E6F0(Actor *arg0, GlobalContext *arg1); /* static */
void func_80A5E80C(GraphicsContext **arg0, s32 arg1, EnKusa2 *, GlobalContext *); /* static */
void func_80A5E9B4(Actor *arg0, GlobalContext *arg1); /* static */
void func_80A5EA48(GlobalContext *arg0, GlobalContext *arg1); /* static */
static ColliderCylinderInit D_80A5EAC0 = {
    {0xA, 0, 9, 0x29, 0x20, 1},
    {0, {0, 0, 0}, {0x580C71C, 0, 0}, 0, 1, 1},
    {6, 0x2C, 0, {0, 0, 0}},
};
static u8 D_80A5EAEC = 1;
static s16 D_80A5EAF0 = 0;
static ? D_80A5EAF4;                                /* unable to generate initializer */
static s16 D_80A5EAFC = 0;
static s16 D_80A5EAFE = 0;
static s16 D_80A5EB00 = 0;
static ? D_80A5EB04;                                /* unable to generate initializer */
static Vec3f D_80A5EB0C;                            /* type too large by 4; unable to generate initializer */
static f32 D_80A5EB14 = 0.0f;
static Vec3f D_80A5EB18;                            /* type too large by 4; unable to generate initializer */
static f32 D_80A5EB20 = 0.0f;
static ? D_80A5EB24;                                /* unable to generate initializer */
static s32 D_80A5EB48 = 0;
static s8 D_80A5EB4C = 0;
static InitChainEntry D_80A5EB50;                   /* unable to generate initializer */
static ? D_80A5EB68;                                /* unable to generate initializer */
static Vec3f D_80A5F1C0;
static u32 D_80A60900;
static ? D_80A60908;
static s16 D_80A60B08;
static s16 D_80A60B0A;
static s16 D_80A60B0C;
static s16 D_80A60B0E;
static s16 D_80A60B10;

typedef struct EnKusa2 {
    /* 0x0000 */ Actor actor;
    /* 0x0144 */ ColliderCylinder unk144;           /* inferred */
    /* 0x0190 */ void (*actionFunc)(EnKusa2 *, GlobalContext *);
    /* 0x0194 */ s32 unk194;                        /* inferred */
    /* 0x0198 */ char pad198[0x20];                 /* maybe part of unk194[9]? */
    /* 0x01B8 */ void *unk1B8;                      /* inferred */
    /* 0x01BC */ char pad1BC[0x2];
    /* 0x01BE */ s8 unk1BE;                         /* inferred */
    /* 0x01BF */ char pad1BF[0x1];                  /* maybe part of unk1BE[2]? */
    /* 0x01C0 */ Actor *unk1C0;                     /* inferred */
    /* 0x01C4 */ s16 unk1C4;                        /* inferred */
    /* 0x01C6 */ char pad1C6[0x2];                  /* maybe part of unk1C4[2]? */
    /* 0x01C8 */ s16 unk1C8;                        /* inferred */
    /* 0x01CA */ s16 unk1CA;                        /* inferred */
    /* 0x01CC */ s16 unk1CC;                        /* inferred */
    /* 0x01CE */ s8 unk1CE;                         /* inferred */
    /* 0x01CF */ u8 unk1CF;                         /* inferred */
    /* 0x01D0 */ s8 unk1D0;                         /* inferred */
    /* 0x01D1 */ s8 unk1D1;                         /* inferred */
    /* 0x01D2 */ char pad1D2[0x2];                  /* maybe part of unk1D1[3]? */
} EnKusa2;                                          /* size 0x1D4 */

void func_80A5B160(EnKusa2 *arg0, GlobalContext *arg1) {
    Actor **temp_s4;
    Actor **temp_v1;
    Actor *temp_v0;
    Actor *temp_v0_2;
    ActorContext *temp_s5;
    f32 temp_f20;
    f32 temp_f22;
    s16 temp_s1;
    s32 temp_s2;
    void *phi_s3;
    s32 phi_s2;

    if (arg0->unk194 == 0) {
        temp_v0 = Actor_SpawnAsChildAndCutscene(arg1 + 0x1CA0, arg1, 0x171, arg0->actor.world.pos.x, arg0->actor.world.pos.y, arg0->actor.world.pos.z, (s16) 0, (s16) (Rand_Next() >> 0x10), (s16) 0, 1, (u32) arg0->actor.cutscene, (s32) arg0->actor.unk20, NULL);
        temp_v1 = arg0 + 0x194;
        *temp_v1 = temp_v0;
        if (temp_v0 != 0) {
            temp_v0->room = arg0->actor.room;
            (*temp_v1)->unk1C0 = arg0;
        }
    }
    phi_s3 = arg0 + 4;
    phi_s2 = 1;
    do {
        temp_s1 = (phi_s2 << 0xD) - 0x2000;
