struct _mips2c_stack_EnMinifrog_BeginChoirCutscene {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_EnMinifrog_CheckChoirSuccess {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnMinifrog_ContinueChoirCutscene {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_EnMinifrog_Destroy {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnMinifrog_Draw {
    /* 0x00 */ char pad_0[0x34];
    /* 0x34 */ GraphicsContext *sp34;               /* inferred */
    /* 0x38 */ char pad_38[0x8];
};                                                  /* size = 0x40 */

struct _mips2c_stack_EnMinifrog_EndChoir {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_EnMinifrog_GetFrog {};         /* size 0x0 */

struct _mips2c_stack_EnMinifrog_GetFrogHP {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_EnMinifrog_Idle {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_EnMinifrog_Init {
    /* 0x00 */ char pad_0[0x38];
};                                                  /* size = 0x38 */

struct _mips2c_stack_EnMinifrog_Jump {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ SkelAnime *sp20;                     /* inferred */
    /* 0x24 */ char pad_24[0x4];
};                                                  /* size = 0x28 */

struct _mips2c_stack_EnMinifrog_JumpTimer {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnMinifrog_NextFrogMissing {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnMinifrog_NextFrogReturned {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnMinifrog_OverrideLimbDraw {}; /* size 0x0 */

struct _mips2c_stack_EnMinifrog_PostLimbDraw {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ Gfx *sp18;                           /* inferred */
    /* 0x1C */ char pad_1C[0x4];
    /* 0x20 */ GraphicsContext *sp20;               /* inferred */
    /* 0x24 */ char pad_24[0x4];
};                                                  /* size = 0x28 */

struct _mips2c_stack_EnMinifrog_ReturnFrogCutscene {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_EnMinifrog_SetCamera {
    /* 0x00 */ char pad_0[0x88];
    /* 0x88 */ ? sp88;                              /* inferred */
    /* 0x88 */ char pad_88[0x10];
    /* 0x98 */ f32 sp98;                            /* inferred */
    /* 0x9C */ f32 sp9C;                            /* inferred */
    /* 0xA0 */ f32 spA0;                            /* inferred */
    /* 0xA4 */ f32 spA4;                            /* inferred */
    /* 0xA8 */ f32 spA8;                            /* inferred */
    /* 0xAC */ f32 spAC;                            /* inferred */
    /* 0xB0 */ char pad_B0[0xC];                    /* maybe part of spAC[4]? */
    /* 0xBC */ f32 spBC;                            /* inferred */
    /* 0xC0 */ f32 spC0;                            /* inferred */
    /* 0xC4 */ f32 spC4;                            /* inferred */
};                                                  /* size = 0xC8 */

struct _mips2c_stack_EnMinifrog_SetJumpState {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_EnMinifrog_SetupNextFrogChoir {
    /* 0x00 */ char pad_0[0x27];
    /* 0x27 */ u8 sp27;                             /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_EnMinifrog_SetupNextFrogInit {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_EnMinifrog_SetupYellowFrogDialog {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_EnMinifrog_SpawnGrowAndShrink {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_EnMinifrog_TurnToMissingFrog {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnMinifrog_TurnToPlayer {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnMinifrog_Update {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ ColliderCylinder *sp2C;              /* inferred */
    /* 0x30 */ char pad_30[0x8];
};                                                  /* size = 0x38 */

struct _mips2c_stack_EnMinifrog_UpdateMissingFrog {}; /* size 0x0 */

struct _mips2c_stack_EnMinifrog_YellowFrogDialog {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

void EnMinifrog_BeginChoirCutscene(Actor *arg0, GlobalContext *arg1); /* static */
void EnMinifrog_CheckChoirSuccess(Actor *arg0, GlobalContext *arg1); /* static */
void EnMinifrog_ContinueChoirCutscene(Actor *arg0, GlobalContext *arg1); /* static */
void EnMinifrog_EndChoir(Actor *arg0, GlobalContext *arg1); /* static */
void EnMinifrog_GetFrogHP(Actor *arg0, GlobalContext *arg1); /* static */
void EnMinifrog_Jump(Actor *arg0, Actor *);         /* static */
void EnMinifrog_JumpTimer(Actor *arg0);             /* static */
void EnMinifrog_NextFrogMissing(Actor *arg0, void *arg1); /* static */
void EnMinifrog_NextFrogReturned(Actor *arg0, void *arg1); /* static */
s32 EnMinifrog_OverrideLimbDraw(GlobalContext *arg0, s32 arg1, Gfx **arg2, Vec3f *arg3, Vec3s *rot, Actor *actor); /* static */
