typedef struct ObjOshihiki {
    /* 0x000 */ Actor actor;
    /* 0x144 */ s32 unk_144;                        /* inferred */
    /* 0x148 */ char pad_148[0x8];                  /* maybe part of unk_144[3]? */
    /* 0x150 */ s16 unk_150;                        /* inferred */
    /* 0x152 */ char pad_152[0xA];                  /* maybe part of unk_150[6]? */
    /* 0x15C */ void (*actionFunc)(ObjOshihiki *, GlobalContext *);
    /* 0x160 */ u16 unk_160;                        /* inferred */
    /* 0x162 */ s16 unk_162;                        /* inferred */
    /* 0x164 */ f32 unk_164;                        /* inferred */
    /* 0x168 */ f32 unk_168;                        /* inferred */
    /* 0x16C */ char pad_16C[0x48];                 /* maybe part of unk_168[19]? */
    /* 0x1B4 */ s16 unk_1B4;                        /* inferred */
    /* 0x1B6 */ char pad_1B6[0x6];                  /* maybe part of unk_1B4[4]? */
    /* 0x1BC */ f32 unk_1BC;                        /* inferred */
    /* 0x1C0 */ f32 unk_1C0;                        /* inferred */
    /* 0x1C4 */ s8 unk_1C4;                         /* inferred */
    /* 0x1C5 */ u8 unk_1C5;                         /* inferred */
    /* 0x1C6 */ u8 unk_1C6;                         /* inferred */
    /* 0x1C7 */ u8 unk_1C7;                         /* inferred */
    /* 0x1C8 */ void *unk_1C8;                      /* inferred */
} ObjOshihiki;                                      /* size = 0x1CC */

struct _mips2c_stack_ObjOshihiki_Destroy {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_ObjOshihiki_Draw {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ Gfx *sp2C;                           /* inferred */
    /* 0x30 */ char pad_30[0x10];
};                                                  /* size = 0x40 */

struct _mips2c_stack_ObjOshihiki_Init {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_ObjOshihiki_Update {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80917290 {};              /* size 0x0 */

struct _mips2c_stack_func_809172E4 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8091734C {};              /* size 0x0 */

struct _mips2c_stack_func_80917378 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80917408 {};              /* size 0x0 */

struct _mips2c_stack_func_80917538 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80917604 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8091763C {};              /* size 0x0 */

struct _mips2c_stack_func_8091768C {};              /* size 0x0 */

struct _mips2c_stack_func_80917840 {
    /* 0x00 */ char pad_0[0x74];
    /* 0x74 */ f32 sp74;                            /* inferred */
    /* 0x78 */ f32 sp78;                            /* inferred */
    /* 0x7C */ f32 sp7C;                            /* inferred */
    /* 0x80 */ f32 sp80;                            /* inferred */
    /* 0x84 */ f32 sp84;                            /* inferred */
    /* 0x88 */ f32 sp88;                            /* inferred */
    /* 0x8C */ char pad_8C[0x4];
};                                                  /* size = 0x90 */

struct _mips2c_stack_func_809179A0 {};              /* size 0x0 */

struct _mips2c_stack_func_80917AEC {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80917B44 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80917B9C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80917C14 {
    /* 0x00 */ char pad_0[0x98];
    /* 0x98 */ ? sp98;                              /* inferred */
    /* 0x98 */ char pad_98[0x4];
    /* 0x9C */ ? sp9C;                              /* inferred */
    /* 0x9C */ char pad_9C[0x4];
    /* 0xA0 */ f32 spA0;                            /* inferred */
    /* 0xA4 */ f32 spA4;                            /* inferred */
    /* 0xA8 */ f32 spA8;                            /* inferred */
    /* 0xAC */ ? spAC;                              /* inferred */
    /* 0xAC */ char pad_AC[0xC];
    /* 0xB8 */ f32 spB8;                            /* inferred */
    /* 0xBC */ f32 spBC;                            /* inferred */
    /* 0xC0 */ f32 spC0;                            /* inferred */
    /* 0xC4 */ f32 spC4;                            /* inferred */
    /* 0xC8 */ f32 spC8;                            /* inferred */
    /* 0xCC */ f32 spCC;                            /* inferred */
    /* 0xD0 */ char pad_D0[0x10];                   /* maybe part of spCC[5]? */
    /* 0xE0 */ f32 spE0;                            /* inferred */
    /* 0xE4 */ f32 spE4;                            /* inferred */
};                                                  /* size = 0xE8 */

struct _mips2c_stack_func_80917E8C {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ DynaPolyActor *sp18;                 /* inferred */
    /* 0x1C */ char pad_1C[0x4];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80917F88 {};              /* size 0x0 */

struct _mips2c_stack_func_80917FC0 {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ void *sp18;                          /* inferred */
    /* 0x1C */ char pad_1C[0x4];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_809180C8 {};              /* size 0x0 */

struct _mips2c_stack_func_80918108 {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ s32 sp20;                            /* inferred */
    /* 0x24 */ DynaPolyActor *sp24;                 /* inferred */
    /* 0x28 */ void *sp28;                          /* inferred */
    /* 0x2C */ char pad_2C[0x4];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80918314 {};              /* size 0x0 */

struct _mips2c_stack_func_8091834C {
    /* 0x00 */ char pad_0[0x28];
    /* 0x28 */ s32 sp28;                            /* inferred */
    /* 0x2C */ char pad_2C[0xC];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_8091851C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80918574 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

f32 func_800C4240(s32, s32, s32, ObjOshihiki *, f32 *, f32); /* extern */
s32 func_800C56E0(s32, f32 *, f32 *, ? *, ? *, s32, s32, s32, s32, ? *, Actor *, f32); /* extern */
s32 func_80124020();                                /* extern */
void func_80917290(f32 *arg0, f32 *arg1, f32 arg2, f32 arg3); /* static */
s32 func_809172E4(Actor *arg0, Actor *arg1);        /* static */
void func_8091734C(ObjOshihiki *arg0);              /* static */
DynaPolyActor *func_80917378(Actor *arg0, Actor *arg1, Actor *); /* static */
void func_80917408(Actor *arg0);                    /* static */
s32 func_80917538(Actor *arg0, DynaPolyActor *arg1, GlobalContext *arg2); /* static */
void func_80917604(Actor *arg0, GlobalContext *arg1); /* static */
void func_8091763C(ObjOshihiki *arg0, GlobalContext *arg1); /* static */
void func_8091768C(ObjOshihiki *arg0, GlobalContext *arg1); /* static */
