CRASHED

typedef struct EnJg {
    /* 0x000 */ Actor actor;
    /* 0x144 */ char pad144[0x8];
    /* 0x14C */ ColliderCylinder unk14C;            /* inferred */
    /* 0x198 */ SkelAnime unk198;                   /* inferred */
    /* 0x1DC */ void (*actionFunc)(EnJg *, GlobalContext *);
    /* 0x1E0 */ Path *unk1E0;                       /* inferred */
    /* 0x1E4 */ char pad1E4[0x8];                   /* maybe part of unk1E0[3]? */
    /* 0x1EC */ Vec3s unk1EC;                       /* inferred */
    /* 0x1F2 */ Vec3s unk1F2;                       /* inferred */
    /* 0x1F8 */ Vec3s unk1F8;                       /* inferred */
    /* 0x1FE */ char pad1FE[0xCC];                  /* maybe part of unk1F8[35]? */
    /* 0x2CA */ Vec3s unk2CA;                       /* inferred */
    /* 0x2D0 */ char pad2D0[0xCE];                  /* maybe part of unk2CA[35]? */
    /* 0x39E */ s16 unk39E;                         /* inferred */
    /* 0x3A0 */ s16 unk3A0;                         /* inferred */
    /* 0x3A2 */ s16 unk3A2;                         /* inferred */
    /* 0x3A4 */ char pad3A4[0x24];                  /* maybe part of unk3A2[19]? */
    /* 0x3C8 */ s16 unk3C8;                         /* inferred */
    /* 0x3CA */ char pad3CA[0x4];                   /* maybe part of unk3C8[3]? */
    /* 0x3CE */ s16 unk3CE;                         /* inferred */
    /* 0x3D0 */ char pad3D0[0x4];                   /* maybe part of unk3CE[3]? */
} EnJg;                                             /* size = 0x3D4 */

struct _mips2c_stack_EnJg_Destroy {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnJg_Draw {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_EnJg_Init {
    /* 0x00 */ char pad0[0x30];
    /* 0x30 */ SkelAnime *sp30;                     /* inferred */
    /* 0x34 */ ColliderCylinder *sp34;              /* inferred */
    /* 0x38 */ char pad38[0x8];
};                                                  /* size = 0x40 */

struct _mips2c_stack_EnJg_Update {
    /* 0x00 */ char pad0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80B73A90 {};              /* size 0x0 */

struct _mips2c_stack_func_80B73AE4 {
    /* 0x00 */ char pad0[0x28];
    /* 0x28 */ Collider *sp28;                      /* inferred */
    /* 0x2C */ CollisionCheckContext *sp2C;         /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80B73B98 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B73C58 {
    /* 0x00 */ char pad0[0x28];
    /* 0x28 */ s32 sp28;                            /* inferred */
    /* 0x2C */ char pad2C[0x4];
    /* 0x30 */ ? sp30;                              /* inferred */
    /* 0x30 */ char pad30[0xC];
    /* 0x3C */ f32 sp3C;                            /* inferred */
    /* 0x40 */ f32 sp40;                            /* inferred */
    /* 0x44 */ f32 sp44;                            /* inferred */
    /* 0x48 */ char pad48[0x8];                     /* maybe part of sp44[3]? */
    /* 0x50 */ s32 sp50;                            /* inferred */
    /* 0x54 */ char pad54[0x4];
    /* 0x58 */ s32 sp58;                            /* inferred */
    /* 0x5C */ void *sp5C;                          /* inferred */
};                                                  /* size = 0x60 */

struct _mips2c_stack_func_80B73DF4 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B73E3C {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80B73F1C {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80B7406C {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B7408C {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80B74134 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80B741F8 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80B742F8 {
    /* 0x00 */ char pad0[0x24];
    /* 0x24 */ s16 sp24;                            /* inferred */
    /* 0x26 */ char pad26[0x1];
    /* 0x27 */ u8 sp27;                             /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80B74440 {
    /* 0x00 */ char pad0[0x2C];
    /* 0x2C */ u8 *sp2C;                            /* inferred */
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ char pad34[0x4];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80B747C8 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B74840 {
    /* 0x00 */ char pad0[0x3E];
    /* 0x3E */ s16 sp3E;                            /* inferred */
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80B749D0 {
    /* 0x00 */ char pad0[0x24];
    /* 0x24 */ SkelAnime *sp24;                     /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80B74AD8 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B74B54 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80B74BC8 {
    /* 0x00 */ char pad0[0x4C];
    /* 0x4C */ SkelAnime *sp4C;                     /* inferred */
    /* 0x50 */ char pad50[0x8];
};                                                  /* size = 0x58 */

struct _mips2c_stack_func_80B74E5C {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B750A0 {};              /* size 0x0 */

struct _mips2c_stack_func_80B7517C {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80B751F8 {
    /* 0x00 */ char pad0[0x24];
    /* 0x24 */ s16 sp24;                            /* inferred */
    /* 0x26 */ s16 sp26;                            /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80B75658 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80B75708 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

? func_800E0308(s32, Actor *);                      /* extern */
Actor *func_80B73A90(GlobalContext *arg0, u8 arg1); /* static */
void func_80B73AE4(Actor *arg0, GlobalContext *arg1); /* static */
s16 func_80B73B98(u8 *arg0, s32 arg1, void *arg2, f32 *arg3); /* static */
s32 func_80B73C58(Actor *arg0, u8 *arg1, s32 arg2); /* static */
s8 func_80B73DF4(void *arg0);                       /* static */
void func_80B73E3C(Actor *arg0, Actor *);           /* static */
void func_80B73F1C(EnJg *arg0, GlobalContext *arg1); /* static */
void func_80B7406C(Actor *arg0, GlobalContext *arg1); /* static */
void func_80B7408C(Actor *arg0, GlobalContext *arg1); /* static */
void func_80B74134(Actor *arg0, GlobalContext *arg1); /* static */
void func_80B741F8(Actor *arg0, GlobalContext *arg1); /* static */
void func_80B742F8(Actor *arg0, GlobalContext *arg1); /* static */
