typedef struct EnPoComposer {
    /* 0x000 */ Actor actor;
    /* 0x144 */ ColliderCylinder unk_144;           /* inferred */
    /* 0x190 */ ColliderJntSph unk_190;             /* inferred */
    /* 0x1B0 */ ColliderJntSphElement unk_1B0;      /* inferred */
    /* 0x1F0 */ SkelAnime unk_1F0;                  /* inferred */
    /* 0x234 */ void (*actionFunc)(EnPoComposer *, GlobalContext *);
    /* 0x238 */ MtxF unk_238;                       /* inferred */
    /* 0x278 */ LightNode *unk_278;                 /* inferred */
    /* 0x27C */ LightInfo unk_27C;                  /* inferred */
    /* 0x28A */ char pad_28A[0x6];
    /* 0x290 */ s32 unk_290;                        /* inferred */
    /* 0x294 */ Vec3s unk_294;                      /* inferred */
    /* 0x29A */ char pad_29A[0x42];                 /* maybe part of unk_294[12]? */
    /* 0x2DC */ Vec3s unk_2DC;                      /* inferred */
    /* 0x2E2 */ char pad_2E2[0x4A];                 /* maybe part of unk_2DC[13]? */
    /* 0x32C */ s16 unk_32C;                        /* inferred */
    /* 0x32E */ s16 unk_32E;                        /* inferred */
    /* 0x330 */ s16 unk_330;                        /* inferred */
    /* 0x332 */ char pad_332[0x2];
    /* 0x334 */ s16 unk_334;                        /* inferred */
    /* 0x336 */ ? unk_336;                          /* inferred */
    /* 0x336 */ char pad_336[0x1];
    /* 0x337 */ u8 unk_337;                         /* inferred */
    /* 0x338 */ u8 unk_338;                         /* inferred */
    /* 0x339 */ u8 unk_339;                         /* inferred */
    /* 0x33A */ ? unk_33A;                          /* inferred */
    /* 0x33A */ char pad_33A[0x1];
    /* 0x33B */ u8 unk_33B;                         /* inferred */
    /* 0x33C */ u8 unk_33C;                         /* inferred */
    /* 0x33D */ u8 unk_33D;                         /* inferred */
    /* 0x33E */ char pad_33E[0x2];                  /* maybe part of unk_33D[3]? */
} EnPoComposer;                                     /* size = 0x340 */

struct _mips2c_stack_EnPoComposer_Destroy {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnPoComposer_Draw {
    /* 0x00 */ char pad_0[0x5C];
    /* 0x5C */ Gfx *sp5C;                           /* inferred */
    /* 0x60 */ Gfx *sp60;                           /* inferred */
    /* 0x64 */ Gfx *sp64;                           /* inferred */
    /* 0x68 */ char pad_68[0x4];
    /* 0x6C */ Gfx *sp6C;                           /* inferred */
    /* 0x70 */ Gfx *sp70;                           /* inferred */
    /* 0x74 */ Gfx *sp74;                           /* inferred */
    /* 0x78 */ char pad_78[0x8];                    /* maybe part of sp74[3]? */
    /* 0x80 */ s16 sp80;                            /* inferred */
    /* 0x82 */ s16 sp82;                            /* inferred */
    /* 0x84 */ s16 sp84;                            /* inferred */
    /* 0x86 */ char pad_86[0x2];
    /* 0x88 */ f32 sp88;                            /* inferred */
    /* 0x8C */ f32 sp8C;                            /* inferred */
    /* 0x90 */ f32 sp90;                            /* inferred */
    /* 0x94 */ ? *sp94;                             /* inferred */
    /* 0x98 */ ? *sp98;                             /* inferred */
    /* 0x9C */ Gfx *sp9C;                           /* inferred */
    /* 0xA0 */ char pad_A0[0x8];
};                                                  /* size = 0xA8 */

struct _mips2c_stack_EnPoComposer_Init {
    /* 0x00 */ char pad_0[0x40];
};                                                  /* size = 0x40 */

struct _mips2c_stack_EnPoComposer_Update {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80BC5250 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80BC5294 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80BC52D4 {};              /* size 0x0 */

struct _mips2c_stack_func_80BC52F0 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80BC538C {};              /* size 0x0 */

struct _mips2c_stack_func_80BC53A0 {};              /* size 0x0 */

struct _mips2c_stack_func_80BC53B0 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80BC5404 {
    /* 0x00 */ char pad_0[0x34];
    /* 0x34 */ Actor *sp34;                         /* inferred */
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80BC552C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80BC5570 {};              /* size 0x0 */

struct _mips2c_stack_func_80BC5580 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80BC55E0 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80BC562C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80BC5670 {};              /* size 0x0 */

struct _mips2c_stack_func_80BC5680 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80BC56D0 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ SkelAnime *sp1C;                     /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80BC5738 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80BC5780 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ SkelAnime *sp1C;                     /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80BC57E8 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80BC5830 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ SkelAnime *sp1C;                     /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80BC5898 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80BC58E0 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ SkelAnime *sp24;                     /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80BC59BC {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80BC59EC {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ u32 sp20;                            /* inferred */
    /* 0x24 */ char pad_24[0x2];
    /* 0x26 */ u16 sp26;                            /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80BC5CC8 {};              /* size 0x0 */

struct _mips2c_stack_func_80BC5D34 {};              /* size 0x0 */

struct _mips2c_stack_func_80BC5DEC {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80BC5FE8 {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ CollisionCheckContext *sp18;         /* inferred */
    /* 0x1C */ ColliderCylinder *sp1C;              /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80BC60BC {};              /* size 0x0 */

struct _mips2c_stack_func_80BC617C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

? func_800B8D10(GlobalContext *, EnPoComposer *, f32, ?, f32, s32, s32); /* extern */
? func_801A1FB4(?, Vec3f *, ?, ?);                  /* extern */
void func_80BC5250(EnPoComposer *arg0);             /* static */
void func_80BC52D4(EnPoComposer *arg0, s32);        /* static */
void func_80BC538C(EnPoComposer *arg0, u16);        /* static */
void func_80BC53B0(Actor *arg0, u16);               /* static */
void func_80BC552C(Actor *arg0, u16);               /* static */
void func_80BC5580(Actor *arg0, u16);               /* static */
void func_80BC562C(Actor *arg0, u16);               /* static */
void func_80BC5680(Actor *arg0, u16);               /* static */
void func_80BC5738(Actor *arg0, u16);               /* static */
void func_80BC57E8(Actor *arg0, u16);               /* static */
void func_80BC5898(Actor *arg0, u16);               /* static */
