typedef struct EnTanron2 {
    /* 0x000 */ Actor actor;
    /* 0x144 */ void (*actionFunc)(EnTanron2 *, GlobalContext *);
    /* 0x148 */ s16 unk148;                         /* inferred */
    /* 0x14A */ s16 unk14A;                         /* inferred */
    /* 0x14C */ s16 unk14C;                         /* inferred */
    /* 0x14E */ s16 unk14E;                         /* inferred */
    /* 0x150 */ s16 unk150;                         /* inferred */
    /* 0x152 */ s16 unk152;                         /* inferred */
    /* 0x154 */ s16 unk154;                         /* inferred */
    /* 0x156 */ s16 unk156;                         /* inferred */
    /* 0x158 */ u8 unk158;                          /* inferred */
    /* 0x159 */ u8 unk159;                          /* inferred */
    /* 0x15A */ u8 unk15A;                          /* inferred */
    /* 0x15B */ s8 unk15B;                          /* inferred */
    /* 0x15C */ f32 unk15C;                         /* inferred */
    /* 0x160 */ f32 unk160;                         /* inferred */
    /* 0x164 */ ColliderCylinder unk164;            /* inferred */
    /* 0x1B0 */ ColliderCylinder unk1B0;            /* inferred */
} EnTanron2;                                        /* size = 0x1FC */

struct _mips2c_stack_EnTanron2_Destroy {};          /* size 0x0 */

struct _mips2c_stack_EnTanron2_Draw {
    /* 0x00 */ char pad0[0x3C];
    /* 0x3C */ ? *sp3C;                             /* inferred */
    /* 0x40 */ s32 *sp40;                           /* inferred */
    /* 0x44 */ char pad44[0x5C];
};                                                  /* size = 0xA0 */

struct _mips2c_stack_EnTanron2_Init {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_EnTanron2_Update {
    /* 0x00 */ char pad0[0x20];
    /* 0x20 */ ColliderCylinder *sp20;              /* inferred */
    /* 0x24 */ ColliderCylinder *sp24;              /* inferred */
    /* 0x28 */ void (*sp28)(EnTanron2 *, GlobalContext *); /* inferred */
    /* 0x2C */ char pad2C[0x1C];
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_80BB69C0 {};              /* size 0x0 */

struct _mips2c_stack_func_80BB69FC {
    /* 0x00 */ char pad0[0x30];
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ f32 sp34;                            /* inferred */
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80BB6B80 {};              /* size 0x0 */

struct _mips2c_stack_func_80BB6BD8 {
    /* 0x00 */ char pad0[0x22];
    /* 0x22 */ s16 sp22;                            /* inferred */
    /* 0x24 */ char pad24[0x4];                     /* maybe part of sp22[3]? */
    /* 0x28 */ f32 sp28;                            /* inferred */
    /* 0x2C */ f32 sp2C;                            /* inferred */
    /* 0x30 */ char pad30[0x2];
    /* 0x32 */ s16 sp32;                            /* inferred */
    /* 0x34 */ Actor *sp34;                         /* inferred */
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80BB6F64 {};              /* size 0x0 */

struct _mips2c_stack_func_80BB6F78 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80BB71C8 {
    /* 0x00 */ char pad0[0x90];
    /* 0x90 */ f32 sp90;                            /* inferred */
    /* 0x94 */ f32 sp94;                            /* inferred */
    /* 0x98 */ f32 sp98;                            /* inferred */
    /* 0x9C */ f32 sp9C;                            /* inferred */
    /* 0xA0 */ f32 spA0;                            /* inferred */
    /* 0xA4 */ f32 spA4;                            /* inferred */
    /* 0xA8 */ f32 spA8;                            /* inferred */
    /* 0xAC */ f32 spAC;                            /* inferred */
    /* 0xB0 */ f32 spB0;                            /* inferred */
    /* 0xB4 */ char padB4[0x4];
};                                                  /* size = 0xB8 */

struct _mips2c_stack_func_80BB7398 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80BB7408 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80BB7578 {
    /* 0x00 */ char pad0[0x24];
    /* 0x24 */ Vec3f *sp24;                         /* inferred */
    /* 0x28 */ char pad28[0xC];                     /* maybe part of sp24[4]? */
    /* 0x34 */ void *sp34;                          /* inferred */
    /* 0x38 */ char pad38[0x4];
    /* 0x3C */ s32 *sp3C;                           /* inferred */
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80BB7B90 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

void func_80BB69C0(EnTanron2 *arg0, f32, EnTanron2 *); /* static */
void func_80BB6B80(EnTanron2 *arg0, u16);           /* static */
void func_80BB6F64(EnTanron2 *arg0);                /* static */
void func_80BB71C8(EnTanron2 *arg0, GlobalContext *arg1); /* static */
void func_80BB7398(Actor *arg0, GlobalContext *arg1); /* static */
void func_80BB7578(EnTanron2 *arg0, GlobalContext *arg1); /* static */
void func_80BB7B90(Actor *this, GlobalContext *globalCtx); /* static */
extern ? D_06003450;
extern ? D_060034C8;
extern ? D_06004510;
extern s32 D_06004550;
extern ? func_80BB85A0;
static DamageTable D_80BB8170 = {
    {
        0xF1,
        0xF1,
        0,
        0xF2,
        0xF1,
        0xF2,
        0,
        0xF0,
        0xF2,
        0xF2,
        0xF2,
        0x22,
        0x32,
        0x42,
        0xF2,
        0xF1,
        0xF1,
        0xF1,
        0xF1,
