typedef struct MirRay {
    /* 0x000 */ Actor actor;
    /* 0x144 */ LightInfo unk144;                   /* inferred */
    /* 0x152 */ char pad152[0x12];                  /* maybe part of unk144[2]? */
    /* 0x164 */ ColliderJntSphElement unk164;       /* inferred */
    /* 0x1A4 */ ColliderQuad unk1A4;                /* inferred */
    /* 0x224 */ f32 unk224;                         /* inferred */
    /* 0x228 */ f32 unk228;                         /* inferred */
    /* 0x22C */ f32 unk22C;                         /* inferred */
    /* 0x230 */ char pad230[0x4];
    /* 0x234 */ f32 unk234;                         /* inferred */
    /* 0x238 */ f32 unk238;                         /* inferred */
    /* 0x23C */ char pad23C[0x4];
    /* 0x240 */ f32 unk240;                         /* inferred */
    /* 0x244 */ f32 unk244;                         /* inferred */
    /* 0x248 */ char pad248[0x4];
    /* 0x24C */ f32 unk24C;                         /* inferred */
    /* 0x250 */ f32 unk250;                         /* inferred */
    /* 0x254 */ char pad254[0x4];
    /* 0x258 */ f32 unk258;                         /* inferred */
    /* 0x25C */ f32 unk25C;                         /* inferred */
    /* 0x260 */ char pad260[0x4];
    /* 0x264 */ f32 unk264;                         /* inferred */
    /* 0x268 */ f32 unk268;                         /* inferred */
    /* 0x26C */ char pad26C[0x8];                   /* maybe part of unk268[3]? */
    /* 0x274 */ f32 unk274;                         /* inferred */
    /* 0x278 */ f32 unk278;                         /* inferred */
    /* 0x27C */ f32 unk27C;                         /* inferred */
    /* 0x280 */ f32 unk280;                         /* inferred */
    /* 0x284 */ f32 unk284;                         /* inferred */
    /* 0x288 */ f32 unk288;                         /* inferred */
    /* 0x28C */ s16 unk28C;                         /* inferred */
    /* 0x28E */ s16 unk28E;                         /* inferred */
    /* 0x290 */ char pad290[0x4];                   /* maybe part of unk28E[3]? */
    /* 0x294 */ LightNode *unk294;                  /* inferred */
    /* 0x298 */ LightInfo unk298;                   /* inferred */
    /* 0x2A6 */ u8 unk2A6;                          /* inferred */
    /* 0x2A7 */ char pad2A7[0x1];
} MirRay;                                           /* size = 0x2A8 */

struct _mips2c_stack_MirRay_Destroy {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_MirRay_Draw {
    /* 0x000 */ char pad0[0x74];
    /* 0x074 */ ? sp74;                             /* inferred */
    /* 0x074 */ char pad74[0x4C];
    /* 0x0C0 */ s32 spC0;                           /* inferred */
    /* 0x0C4 */ u8 spC4;                            /* inferred */
    /* 0x0C5 */ char padC5[0x3];                    /* maybe part of spC4[4]? */
    /* 0x0C8 */ ? spC8;                             /* inferred */
    /* 0x0C8 */ char padC8[0x1A4];
    /* 0x26C */ ? sp26C;                            /* inferred */
    /* 0x26C */ char pad26C[0xC];
};                                                  /* size = 0x278 */

struct _mips2c_stack_MirRay_Init {
    /* 0x00 */ char pad0[0x38];
    /* 0x38 */ LightInfo *sp38;                     /* inferred */
    /* 0x3C */ char pad3C[0xC];
};                                                  /* size = 0x48 */

struct _mips2c_stack_MirRay_Update {
    /* 0x00 */ char pad0[0x24];
    /* 0x24 */ Actor *sp24;                         /* inferred */
    /* 0x28 */ char pad28[0x8];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_808E2600 {};              /* size 0x0 */

struct _mips2c_stack_func_808E26C8 {
    /* 0x00 */ char pad0[0x34];
    /* 0x34 */ Vec3f *sp34;                         /* inferred */
    /* 0x38 */ Vec3f *sp38;                         /* inferred */
    /* 0x3C */ s16 sp3C;                            /* inferred */
    /* 0x3E */ s16 sp3E;                            /* inferred */
    /* 0x40 */ s16 sp40;                            /* inferred */
    /* 0x42 */ char pad42[0x2];
    /* 0x44 */ f32 sp44;                            /* inferred */
    /* 0x48 */ f32 sp48;                            /* inferred */
    /* 0x4C */ f32 sp4C;                            /* inferred */
    /* 0x50 */ char pad50[0x4];
    /* 0x54 */ void *sp54;                          /* inferred */
};                                                  /* size = 0x58 */

struct _mips2c_stack_func_808E2C68 {
    /* 0x00 */ char pad0[0x30];
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ char pad34[0x4];
    /* 0x38 */ void *sp38;                          /* inferred */
    /* 0x3C */ char pad3C[0x10];                    /* maybe part of sp38[5]? */
    /* 0x4C */ f32 sp4C;                            /* inferred */
    /* 0x50 */ f32 sp50;                            /* inferred */
    /* 0x54 */ f32 sp54;                            /* inferred */
};                                                  /* size = 0x58 */

struct _mips2c_stack_func_808E2E1C {
    /* 0x00 */ char pad0[0x60];
    /* 0x60 */ f32 sp60;                            /* inferred */
    /* 0x64 */ f32 sp64;                            /* inferred */
    /* 0x68 */ f32 sp68;                            /* inferred */
    /* 0x6C */ s32 sp6C;                            /* inferred */
    /* 0x70 */ ? sp70;                              /* inferred */
    /* 0x70 */ char pad70[0xC];
    /* 0x7C */ f32 sp7C;                            /* inferred */
    /* 0x80 */ f32 sp80;                            /* inferred */
    /* 0x84 */ f32 sp84;                            /* inferred */
    /* 0x88 */ f32 sp88;                            /* inferred */
    /* 0x8C */ f32 sp8C;                            /* inferred */
    /* 0x90 */ f32 sp90;                            /* inferred */
    /* 0x94 */ char pad94[0xC];
};                                                  /* size = 0xA0 */

struct _mips2c_stack_func_808E2FF8 {};              /* size 0x0 */

struct _mips2c_stack_func_808E30FC {
    /* 0x000 */ char pad0[0x80];
    /* 0x080 */ f32 sp80;                           /* inferred */
    /* 0x084 */ f32 sp84;                           /* inferred */
    /* 0x088 */ char pad88[0x38];                   /* maybe part of sp84[15]? */
    /* 0x0C0 */ f32 spC0;                           /* inferred */
    /* 0x0C4 */ f32 spC4;                           /* inferred */
    /* 0x0C8 */ f32 spC8;                           /* inferred */
    /* 0x0CC */ f32 spCC;                           /* inferred */
    /* 0x0D0 */ f32 spD0;                           /* inferred */
    /* 0x0D4 */ f32 spD4;                           /* inferred */
    /* 0x0D8 */ char padD8[0x4];
    /* 0x0DC */ f32 spDC;                           /* inferred */
    /* 0x0E0 */ f32 spE0;                           /* inferred */
    /* 0x0E4 */ f32 spE4;                           /* inferred */
    /* 0x0E8 */ f32 spE8;                           /* inferred */
    /* 0x0EC */ f32 spEC;                           /* inferred */
    /* 0x0F0 */ f32 spF0;                           /* inferred */
    /* 0x0F4 */ f32 spF4;                           /* inferred */
    /* 0x0F8 */ f32 spF8;                           /* inferred */
    /* 0x0FC */ f32 spFC;                           /* inferred */
    /* 0x100 */ f32 sp100;                          /* inferred */
    /* 0x104 */ f32 sp104;                          /* inferred */
    /* 0x108 */ f32 sp108;                          /* inferred */
    /* 0x10C */ f32 sp10C;                          /* inferred */
    /* 0x110 */ f32 sp110;                          /* inferred */
    /* 0x114 */ f32 sp114;                          /* inferred */
    /* 0x118 */ f32 sp118;                          /* inferred */
    /* 0x11C */ f32 sp11C;                          /* inferred */
    /* 0x120 */ f32 sp120;                          /* inferred */
    /* 0x124 */ f32 sp124;                          /* inferred */
    /* 0x128 */ f32 sp128;                          /* inferred */
    /* 0x12C */ f32 sp12C;                          /* inferred */
    /* 0x130 */ f32 sp130;                          /* inferred */
    /* 0x134 */ f32 sp134;                          /* inferred */
    /* 0x138 */ f32 sp138;                          /* inferred */
    /* 0x13C */ char pad13C[0xC];
};                                                  /* size = 0x148 */

struct _mips2c_stack_func_808E3984 {
    /* 0x00 */ char pad0[0x20];
    /* 0x20 */ f32 sp20;                            /* inferred */
    /* 0x24 */ f32 sp24;                            /* inferred */
    /* 0x28 */ f32 sp28;                            /* inferred */
    /* 0x2C */ f32 sp2C;                            /* inferred */
    /* 0x30 */ char pad30[0x4];
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ char pad3C[0x8];                     /* maybe part of sp38[3]? */
    /* 0x44 */ f32 sp44;                            /* inferred */
    /* 0x48 */ f32 sp48;                            /* inferred */
    /* 0x4C */ f32 sp4C;                            /* inferred */
    /* 0x50 */ f32 sp50;                            /* inferred */
    /* 0x54 */ f32 sp54;                            /* inferred */
    /* 0x58 */ f32 sp58;                            /* inferred */
    /* 0x5C */ ? sp5C;                              /* inferred */
    /* 0x5C */ char pad5C[0x1C];
    /* 0x78 */ f32 sp78;                            /* inferred */
    /* 0x7C */ f32 sp7C;                            /* inferred */
    /* 0x80 */ f32 sp80;                            /* inferred */
    /* 0x84 */ char pad84[0x4];
};                                                  /* size = 0x88 */

s32 func_800C57F8(void *, f32 *, f32 *, ? *, s32 *, s32); /* extern */
s32 func_80124088(GlobalContext *);                 /* extern */
s32 func_8017D2FC(f32, f32, f32, f32, f32 *, f32 *, f32 *, s32); /* extern */
void func_808E2600(MirRay *arg0);                   /* static */
void func_808E26C8(MirRay *arg0, GlobalContext *arg1); /* static */
void func_808E2C68(MirRay *arg0, GlobalContext *arg1); /* static */
void func_808E2E1C(MirRay *arg0, GlobalContext *arg1, ? *arg2); /* static */
void func_808E2FF8(? *arg0);                        /* static */
void func_808E30FC(MirRay *arg0, GlobalContext *arg1, ? *arg2); /* static */
s32 func_808E3984(Vec3f *arg0, Vec3f *arg1, f32 arg2, f32 arg3, f32 arg4, s32 arg5, s32 arg6); /* static */
extern ? D_06000168;
extern void D_060003F8;
extern ? D_060004B0;
static u8 D_808E3BF0 = 0;
static ColliderQuadInit D_808E3BF4 = {
