struct _mips2c_stack_EnClearTag_CreateDebrisEffect {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_EnClearTag_CreateFlashEffect {}; /* size 0x0 */

struct _mips2c_stack_EnClearTag_CreateIsolatedLightRayEffect {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_EnClearTag_CreateIsolatedSmokeEffect {
    /* 0x00 */ char pad0[0x18];
    /* 0x18 */ void *sp18;                          /* inferred */
    /* 0x1C */ char pad1C[0x4];
};                                                  /* size = 0x20 */

struct _mips2c_stack_EnClearTag_CreateLightRayEffect {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_EnClearTag_CreateShockwaveEffect {}; /* size 0x0 */

struct _mips2c_stack_EnClearTag_CreateSmokeEffect {
    /* 0x00 */ char pad0[0x18];
    /* 0x18 */ void *sp18;                          /* inferred */
    /* 0x1C */ char pad1C[0x4];
};                                                  /* size = 0x20 */

struct _mips2c_stack_EnClearTag_CreateSplashEffect {
    /* 0x00 */ char pad0[0x18];
    /* 0x18 */ void *sp18;                          /* inferred */
    /* 0x1C */ char pad1C[0x4];
};                                                  /* size = 0x20 */

struct _mips2c_stack_EnClearTag_Destroy {};         /* size 0x0 */

struct _mips2c_stack_EnClearTag_Draw {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnClearTag_DrawEffects {
    /* 0x000 */ char pad0[0x90];
    /* 0x090 */ EnClearTagEffect *sp90;             /* inferred */
    /* 0x094 */ char pad94[0xC8];                   /* maybe part of sp90[51]? */
    /* 0x15C */ ? sp15C;                            /* inferred */
    /* 0x15C */ char pad15C[0x40];
    /* 0x19C */ f32 sp19C;                          /* inferred */
    /* 0x1A0 */ WaterBox *sp1A0;                    /* inferred */
    /* 0x1A4 */ f32 sp1A4;                          /* inferred */
    /* 0x1A8 */ char pad1A8[0x4];
    /* 0x1AC */ f32 sp1AC;                          /* inferred */
    /* 0x1B0 */ char pad1B0[0x4];
    /* 0x1B4 */ s16 sp1B4;                          /* inferred */
    /* 0x1B6 */ char pad1B6[0x1];
    /* 0x1B7 */ u8 sp1B7;                           /* inferred */
};                                                  /* size = 0x1B8 */

struct _mips2c_stack_EnClearTag_Init {
    /* 0x00 */ char pad0[0x8C];
    /* 0x8C */ f32 sp8C;                            /* inferred */
    /* 0x90 */ f32 sp90;                            /* inferred */
    /* 0x94 */ f32 sp94;                            /* inferred */
    /* 0x98 */ f32 sp98;                            /* inferred */
    /* 0x9C */ f32 sp9C;                            /* inferred */
    /* 0xA0 */ f32 spA0;                            /* inferred */
    /* 0xA4 */ ? spA4;                              /* inferred */
    /* 0xA4 */ char padA4[0x4];
    /* 0xA8 */ f32 spA8;                            /* inferred */
    /* 0xAC */ char padAC[0x1C];
};                                                  /* size = 0xC8 */

struct _mips2c_stack_EnClearTag_Update {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnClearTag_UpdateCamera {
    /* 0x00 */ char pad0[0x24];
    /* 0x24 */ CutsceneContext *sp24;               /* inferred */
    /* 0x28 */ char pad28[0xC];                     /* maybe part of sp24[4]? */
    /* 0x34 */ void *sp34;                          /* inferred */
};                                                  /* size = 0x38 */

struct _mips2c_stack_EnClearTag_UpdateEffects {
    /* 0x00 */ char pad0[0x60];
    /* 0x60 */ ? sp60;                              /* inferred */
    /* 0x60 */ char pad60[0x4];
    /* 0x64 */ f32 sp64;                            /* inferred */
    /* 0x68 */ char pad68[0x4];
    /* 0x6C */ f32 sp6C;                            /* inferred */
    /* 0x70 */ char pad70[0x8];
};                                                  /* size = 0x78 */

void EnClearTag_CreateDebrisEffect(EnClearTag *arg0, ? *arg1, f32 *arg2, f32 *arg3, f32 arg4, f32 arg5); /* static */
void EnClearTag_CreateFlashEffect(EnClearTag *arg0, ? *arg1, f32 arg2, f32 arg3); /* static */
void EnClearTag_CreateIsolatedLightRayEffect(EnClearTag *arg0, ? *arg1, f32 *arg2, f32 *arg3, f32 arg4, f32 arg5, s16 arg6, s16 arg7); /* static */
void EnClearTag_CreateIsolatedSmokeEffect(EnClearTag *arg0, ? *arg1, f32 arg2); /* static */
void EnClearTag_CreateLightRayEffect(EnClearTag *arg0, ? *arg1, f32 *arg2, f32 *arg3, f32 arg4, f32 arg5, s16 arg6); /* static */
void EnClearTag_CreateShockwaveEffect(EnClearTag *arg0, ? *arg1, ?32 arg2, s16 arg3); /* static */
void EnClearTag_CreateSmokeEffect(EnClearTag *arg0, ? *arg1, f32 arg2); /* static */
void EnClearTag_CreateSplashEffect(EnClearTag *arg0, ? *arg1, s16 arg2); /* static */
