? func_801149A0(s16, s16, s16, s32);                /* extern */
void func_80C10984(Actor *arg0, s32 arg1);          /* static */
s32 func_80C10B0C(EnThiefbird *arg0, GlobalContext *arg1); /* static */
void func_80C10DE8(u32 *arg0, s32 arg1, s32 arg2, s32); /* static */
s32 func_80C10E98(GlobalContext *arg0);             /* static */
void func_80C11338(Actor *arg0, GlobalContext *arg1); /* static */
void func_80C11454(Actor *arg0);                    /* static */
void func_80C114C0(Actor *arg0, GlobalContext *arg1); /* static */
void func_80C11538(EnThiefbird *arg0, u16);         /* static */
void func_80C118E4(EnThiefbird *arg0);              /* static */
void func_80C11C60(Actor *arg0);                    /* static */
void func_80C11DC0(EnThiefbird *arg0);              /* static */
void func_80C11F6C(Actor *arg0, GlobalContext *arg1); /* static */
void func_80C12308(EnThiefbird *arg0);              /* static */
void func_80C1242C(EnThiefbird *arg0);              /* static */
void func_80C126A8(EnThiefbird *arg0);              /* static */
void func_80C12744(EnThiefbird *arg0);              /* static */
void func_80C12B1C(Actor *arg0, GlobalContext *arg1); /* static */
void func_80C12D00(EnThiefbird *arg0);              /* static */
s32 func_80C130EC(GlobalContext *arg0, s32 arg1, Gfx **arg2, Vec3f *arg3, Vec3s *arg4, Actor *arg5); /* static */
void func_80C1315C(GraphicsContext **arg0, s32 arg1, Gfx **arg2, Vec3s *arg3, Actor *arg4); /* static */
void func_80C13354(EnThiefbird *arg0, GraphicsContext **arg1); /* static */
extern AnimationHeader D_06000088;
extern AnimationHeader D_06000278;
extern AnimationHeader D_06000604;
extern ? D_06003060;
extern ? D_060030D8;
extern ? D_060033B0;
extern ? D_06003D58;
extern FlexSkeletonHeader D_060061A0;
extern AnimationHeader D_060063C4;
static ColliderJntSphElementInit D_80C135C0 = {
    {
        {0, {0xF7CFFFFF, 0, 0}, {0xF7CFFFFF, 0, 0}, 0, 1, 1},
        {1, {{0, 0, 0}, 0x18}, 0x64},
    },
    {
        {0, {0xF7CFFFFF, 0, 0}, {0xF7CFFFFF, 0, 0}, 0, 1, 1},
        {9, {{0x384, 0xFDA8, 0}, 0x14}, 0x64},
    },
    {
        {0, {0xF7CFFFFF, 0, 4}, {0xF7CFFFFF, 0, 0}, 9, 1, 1},
        {0xC, {{0x4B0, 0, 0}, 9}, 0x64},
    },
};
static ColliderJntSphInit D_80C1362C = {{3, 0x11, 9, 0x39, 0x10, 0}, 3, &D_80C135C0};
static CollisionCheckInfoInit D_80C1363C = {0x18, 0xF, 0x1E, 0x1E};
static DamageTable D_80C13644 = {
    {
        0x10,
        1,
        1,
        1,
        1,
        1,
        0,
        1,
        1,
        1,
        1,
        0x22,
        0x32,
        0x42,
        1,
        1,
        1,
        2,
        0x10,
        0x50,
        0,
        0,
        1,
        1,
        1,
        0,
        0,
        0,
        0,
        0,
        0,
        1,
    },
};
static s16 D_80C13664 = {5, 0xB, 0, 1, 2, 0x14};
static InitChainEntry D_80C13670;                   /* unable to generate initializer */
static ? D_80C1367C;                                /* unable to generate initializer */
static Vec3f D_80C1368C = {0.0f, -0.15f, 0.0f};
static ? D_80C13698;                                /* unable to generate initializer */
static Vec3f D_80C13920;
static s32 D_80C1392C;

typedef struct EnThiefbird {
    /* 0x0000 */ Actor actor;
    /* 0x0144 */ SkelAnime unk144;                  /* inferred */
    /* 0x0188 */ void (*actionFunc)(EnThiefbird *, GlobalContext *);
    /* 0x018C */ u8 unk18C;                         /* inferred */
    /* 0x018D */ char pad18D[0x1];                  /* maybe part of unk18C[2]? */
    /* 0x018E */ s16 unk18E;                        /* inferred */
    /* 0x0190 */ s16 unk190;                        /* inferred */
    /* 0x0192 */ s16 unk192;                        /* inferred */
    /* 0x0194 */ s16 unk194;                        /* inferred */
    /* 0x0196 */ s16 unk196;                        /* inferred */
    /* 0x0198 */ char pad198[0xA];                  /* maybe part of unk196[6]? */
    /* 0x01A2 */ Vec3s unk1A2;                      /* inferred */
    /* 0x01A8 */ char pad1A8[0x60];                 /* maybe part of unk1A2[17]? */
    /* 0x0208 */ Vec3s unk208;                      /* inferred */
    /* 0x020E */ char pad20E[0x62];
    /* 0x0270 */ ColliderJntSph unk270;             /* inferred */
    /* 0x0290 */ ColliderJntSphElement unk290;      /* inferred */
    /* 0x02D0 */ char pad2D0[0x80];                 /* maybe part of unk290[3]? */
    /* 0x0350 */ Vec3f unk350;                      /* inferred */
    /* 0x035C */ char pad35C[0x60];                 /* maybe part of unk350[9]? */
    /* 0x03BC */ Vec3f unk3BC;                      /* inferred */
    /* 0x03C8 */ char pad3C8[0xC];                  /* maybe part of unk3BC[2]? */
    /* 0x03D4 */ f32 unk3D4;                        /* inferred */
    /* 0x03D8 */ f32 unk3D8;                        /* inferred */
    /* 0x03DC */ f32 unk3DC;                        /* inferred */
    /* 0x03E0 */ f32 unk3E0;                        /* inferred */
    /* 0x03E4 */ char pad3E4[0x4];                  /* maybe part of unk3E0[2]? */
    /* 0x03E8 */ ? *unk3E8;                         /* inferred */
    /* 0x03EC */ Actor *unk3EC;                     /* inferred */
    /* 0x03F0 */ char pad3F0[0x5A0];                /* maybe part of unk3EC[361]? */
} EnThiefbird;                                      /* size 0x990 */

void EnThiefbird_Init(Actor *thisx, GlobalContext *globalCtx) {
    EnThiefbird *this = (EnThiefbird *) thisx;
    s32 temp_v1;
    void *temp_v0;
    void *temp_v0_2;
    void *temp_v0_3;
    void *temp_v0_4;
    s32 phi_v1;
    s32 phi_v1_2;

    Actor_ProcessInitChain(&this->actor, &D_80C13670);
    SkelAnime_InitSV(globalCtx, &this->unk144, &D_060061A0, &D_06000604, &this->unk1A2, &this->unk208, 0x11);
    Collider_InitAndSetJntSph(globalCtx, &this->unk270, &this->actor, &D_80C1362C, &this->unk290);
    phi_v1 = 0;
    phi_v1_2 = 0;
    if (0 != 0x80) {
        do {
            temp_v0 = this->unk270.elements + phi_v1;
            temp_v1 = phi_v1 + 0x40;
            temp_v0_2 = temp_v0 + 0x28;
            temp_v0_2->unkE = (s16) temp_v0->unk2E;
            temp_v0_2->unk8 = (s16) (s32) this->actor.world.pos.x;
