typedef struct EnThiefbird {
    /* 0x000 */ Actor actor;
    /* 0x144 */ SkelAnime unk_144;                  /* inferred */
    /* 0x188 */ void (*actionFunc)(EnThiefbird *, GlobalContext *);
    /* 0x18C */ u8 unk_18C;                         /* inferred */
    /* 0x18D */ char pad_18D[0x1];
    /* 0x18E */ s16 unk_18E;                        /* inferred */
    /* 0x190 */ s16 unk_190;                        /* inferred */
    /* 0x192 */ s16 unk_192;                        /* inferred */
    /* 0x194 */ s16 unk_194;                        /* inferred */
    /* 0x196 */ char pad_196[0xC];                  /* maybe part of unk_194[7]? */
    /* 0x1A2 */ Vec3s unk_1A2;                      /* inferred */
    /* 0x1A8 */ char pad_1A8[0x60];                 /* maybe part of unk_1A2[17]? */
    /* 0x208 */ Vec3s unk_208;                      /* inferred */
    /* 0x20E */ char pad_20E[0x62];                 /* maybe part of unk_208[17]? */
    /* 0x270 */ ColliderJntSph unk_270;             /* inferred */
    /* 0x290 */ ColliderJntSphElement unk_290;      /* inferred */
    /* 0x2D0 */ char pad_2D0[0x80];                 /* maybe part of unk_290[3]? */
    /* 0x350 */ Vec3f unk_350;                      /* inferred */
    /* 0x35C */ char pad_35C[0x60];                 /* maybe part of unk_350[9]? */
    /* 0x3BC */ Vec3f unk_3BC;                      /* inferred */
    /* 0x3C8 */ char pad_3C8[0xC];
    /* 0x3D4 */ f32 unk_3D4;                        /* inferred */
    /* 0x3D8 */ f32 unk_3D8;                        /* inferred */
    /* 0x3DC */ f32 unk_3DC;                        /* inferred */
    /* 0x3E0 */ f32 unk_3E0;                        /* inferred */
    /* 0x3E4 */ char pad_3E4[0x4];
    /* 0x3E8 */ s32 unk_3E8;                        /* inferred */
    /* 0x3EC */ Actor *unk_3EC;                     /* inferred */
    /* 0x3F0 */ char pad_3F0[0x5A0];                /* maybe part of unk_3EC[361]? */
} EnThiefbird;                                      /* size = 0x990 */

typedef struct {
    /* 0x00 */ Vec3f pos;
    /* 0x0C */ Vec3s rot;
    /* 0x12 */ s16 unk_12;                          /* inferred */
} PosRot;                                           /* size = 0x14 */

struct _mips2c_stack_EnThiefbird_Destroy {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnThiefbird_Draw {
    /* 0x00 */ char pad_0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_EnThiefbird_Init {
    /* 0x00 */ char pad_0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_EnThiefbird_Update {
    /* 0x00 */ char pad_0[0x28];
    /* 0x28 */ ColliderJntSph *sp28;                /* inferred */
    /* 0x2C */ CollisionCheckContext *sp2C;         /* inferred */
    /* 0x30 */ char pad_30[0x8];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80C10984 {
    /* 0x00 */ char pad_0[0x60];
};                                                  /* size = 0x60 */

struct _mips2c_stack_func_80C10B0C {
    /* 0x00 */ char pad_0[0x1E];
    /* 0x1E */ s16 sp1E;                            /* inferred */
    /* 0x20 */ s32 sp20;                            /* inferred */
    /* 0x24 */ s32 sp24;                            /* inferred */
    /* 0x28 */ s32 sp28;                            /* inferred */
    /* 0x2C */ s32 sp2C;                            /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80C10DE8 {
    /* 0x0 */ char pad_0[0x4];
    /* 0x4 */ s32 sp4;                              /* inferred */
};                                                  /* size = 0x8 */

struct _mips2c_stack_func_80C10E98 {
    /* 0x00 */ char pad_0[0x4C];
    /* 0x4C */ s32 sp4C;                            /* inferred */
    /* 0x50 */ s32 sp50;                            /* inferred */
    /* 0x54 */ s32 sp54;                            /* inferred */
    /* 0x58 */ s32 sp58;                            /* inferred */
    /* 0x5C */ s32 sp5C;                            /* inferred */
    /* 0x60 */ char pad_60[0x4];
    /* 0x64 */ f32 sp64;                            /* inferred */
    /* 0x68 */ f32 sp68;                            /* inferred */
    /* 0x6C */ f32 sp6C;                            /* inferred */
    /* 0x70 */ char pad_70[0x4];
    /* 0x74 */ u32 sp74;                            /* inferred */
    /* 0x78 */ s32 sp78;                            /* inferred */
    /* 0x7C */ char pad_7C[0xC];                    /* maybe part of sp78[4]? */
    /* 0x88 */ s32 sp88;                            /* inferred */
    /* 0x8C */ char pad_8C[0x8];                    /* maybe part of sp88[3]? */
    /* 0x94 */ ? sp94;                              /* inferred */
    /* 0x94 */ char pad_94[0x4];
    /* 0x98 */ s32 sp98;                            /* inferred */
    /* 0x9C */ char pad_9C[0x4];
    /* 0xA0 */ s32 spA0;                            /* inferred */
    /* 0xA4 */ char pad_A4[0x4];
    /* 0xA8 */ s32 spA8;                            /* inferred */
    /* 0xAC */ s32 spAC;                            /* inferred */
    /* 0xB0 */ s32 spB0;                            /* inferred */
    /* 0xB4 */ char pad_B4[0xC];
};                                                  /* size = 0xC0 */

struct _mips2c_stack_func_80C11338 {
    /* 0x00 */ char pad_0[0x40];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80C11454 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80C114C0 {
    /* 0x00 */ char pad_0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80C11538 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80C11590 {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ SkelAnime *sp2C;                     /* inferred */
    /* 0x30 */ char pad_30[0x8];                    /* maybe part of sp2C[3]? */
    /* 0x38 */ s32 sp38;                            /* inferred */
    /* 0x3C */ Actor *sp3C;                         /* inferred */
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80C118E4 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80C1193C {
    /* 0x00 */ char pad_0[0x28];
    /* 0x28 */ SkelAnime *sp28;                     /* inferred */
    /* 0x2C */ char pad_2C[0x8];                    /* maybe part of sp28[3]? */
    /* 0x34 */ Actor *sp34;                         /* inferred */
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80C11C60 {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80C11D14 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80C11DC0 {};              /* size 0x0 */

struct _mips2c_stack_func_80C11DF0 {
    /* 0x00 */ char pad_0[0x48];
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_80C11F6C {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80C1215C {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ f32 sp2C;                            /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80C12308 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80C12378 {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80C1242C {
    /* 0x00 */ char pad_0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80C124B0 {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ f32 sp2C;                            /* inferred */
    /* 0x30 */ char pad_30[0xC];                    /* maybe part of sp2C[4]? */
    /* 0x3C */ Actor *sp3C;                         /* inferred */
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80C126A8 {};              /* size 0x0 */

struct _mips2c_stack_func_80C126D8 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80C12744 {
    /* 0x00 */ char pad_0[0x34];
    /* 0x34 */ SkelAnime *sp34;                     /* inferred */
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80C127F4 {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ Vec3f *sp2C;                         /* inferred */
    /* 0x30 */ char pad_30[0x14];                   /* maybe part of sp2C[6]? */
    /* 0x44 */ Actor *sp44;                         /* inferred */
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_80C12B1C {
    /* 0x00 */ char pad_0[0x38];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80C12D00 {
    /* 0x00 */ char pad_0[0x68];
};                                                  /* size = 0x68 */

struct _mips2c_stack_func_80C130EC {};              /* size 0x0 */

struct _mips2c_stack_func_80C1315C {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ s32 sp18;                            /* inferred */
    /* 0x1C */ s32 sp1C;                            /* inferred */
    /* 0x20 */ char pad_20[0xC];                    /* maybe part of sp1C[4]? */
    /* 0x2C */ GraphicsContext *sp2C;               /* inferred */
    /* 0x30 */ char pad_30[0xC];                    /* maybe part of sp2C[4]? */
    /* 0x3C */ GraphicsContext *sp3C;               /* inferred */
    /* 0x40 */ char pad_40[0x4];
    /* 0x44 */ Gfx *sp44;                           /* inferred */
    /* 0x48 */ char pad_48[0x8];
};                                                  /* size = 0x50 */

struct _mips2c_stack_func_80C13354 {
    /* 0x00 */ char pad_0[0x5C];
    /* 0x5C */ GraphicsContext *sp5C;               /* inferred */
    /* 0x60 */ char pad_60[0x10];
};                                                  /* size = 0x70 */

? func_801149A0(s16, s16, s16, s32);                /* extern */
void func_80C10984(Actor *arg0, s32 arg1);          /* static */
s32 func_80C10B0C(EnThiefbird *arg0, GlobalContext *arg1); /* static */
void func_80C10DE8(u32 *arg0, s32 arg1, s32 arg2, s32); /* static */
s32 func_80C10E98(GlobalContext *arg0);             /* static */
void func_80C11338(Actor *arg0, GlobalContext *arg1); /* static */
void func_80C11454(Actor *arg0);                    /* static */
void func_80C114C0(Actor *arg0, GlobalContext *arg1); /* static */
void func_80C11538(EnThiefbird *arg0, u16);         /* static */
void func_80C118E4(EnThiefbird *arg0);              /* static */
void func_80C11C60(Actor *arg0);                    /* static */
void func_80C11DC0(EnThiefbird *arg0);              /* static */
void func_80C11F6C(Actor *arg0, GlobalContext *arg1); /* static */
