? func_800E0308(Camera *, Actor *);                 /* extern */
? func_8013A7C0(?);                                 /* extern */
? func_8013AD9C(s16, s16, void *, void *, s32, s32); /* extern */
Actor *func_8094DEE0(GlobalContext *arg0, GlobalContext *arg1, u8 arg2, s16 arg3); /* static */
void func_8094DF90(GlobalContext *arg1, u8);        /* static */
s32 func_8094DFF8(EnGm *arg0, GlobalContext *arg1); /* static */
s32 func_8094E054(Actor *arg0, GlobalContext *arg1, s32 arg2); /* static */
s32 func_8094E0F8(EnGm *arg0, GlobalContext *arg1); /* static */
void func_8094E1DC(Actor *arg0, GlobalContext *arg1); /* static */
void func_8094E278(GlobalContext *arg0);            /* static */
void func_8094E2D0(EnGm *arg0);                     /* static */
s32 func_8094E454(Actor *arg0, s16 arg1, s32);      /* static */
s8 func_8094E4D0(Actor *arg0, s32 arg1);            /* static */
s32 func_8094E52C(Actor *arg0, GlobalContext *arg1); /* static */
s32 func_8094E69C(Actor *arg0, GlobalContext *arg1); /* static */
s32 func_8094EA34(GlobalContext *arg0, GlobalContext *arg1); /* static */
s32 func_8094EB1C(Actor *arg0, GlobalContext *arg1); /* static */
? *func_8094EDBC(Actor *arg0, GlobalContext *arg1); /* static */
s32 func_8094EE84(Actor *arg0, GlobalContext *arg1); /* static */
s32 func_8094EFC4(EnGm *arg0, GlobalContext *arg1); /* static */
Actor *func_8094F074(EnGm *arg0, GlobalContext *arg1); /* static */
void func_8094F0E0(void *arg0);                     /* static */

void func_809514BC(void **arg0, s32 arg1, Gfx **arg2, Vec3s *arg3, Actor *arg4); /* static */
void func_80951594(GlobalContext *arg0, s32 arg1, Actor *arg2); /* static */
extern ? D_06007528;
extern FlexSkeletonHeader D_060078B0;
static void D_80951820;                             /* unable to generate initializer */
static ? D_80951A0C;                                /* unable to generate initializer */
static ? D_80951A88;                                /* unable to generate initializer */
static ? D_80951A90;                                /* unable to generate initializer */
static ? D_80951A98;                                /* unable to generate initializer */
static ? D_80951AD8;                                /* unable to generate initializer */
static ? D_80951B98;                                /* unable to generate initializer */
static ? D_80951BE8;                                /* unable to generate initializer */
static ? D_80951C2C;                                /* unable to generate initializer */
static ? D_80951C34;                                /* unable to generate initializer */
static ColliderCylinderInit D_80951C5C = {
    {1, 0, 0, 0x39, 0x10, 1},
    {1, {0, 0, 0}, {0, 0, 0}, 0, 0, 1},
    {0xE, 0x3E, 0, {0, 0, 0}},
};
static ColliderSphereInit D_80951C88 = {
    {0xA, 0, 0, 0x39, 0x10, 4},
    {0, {0, 0, 0}, {0, 0, 0}, 0, 0, 1},
    {0, {{0, 0, 0}, 0x14}, 0x64},
};
static CollisionCheckInfoInit2 D_80951CB4 = {0, 0, 0, 0, 0xFF};
static ActorAnimationEntryS D_80951CC0 = {
    {(AnimationHeader *)0x6009CDC, 1.0f, 0, 0xFFFF, 0, 0},
    {(AnimationHeader *)0x6009CDC, 1.0f, 0, 0xFFFF, 0, 0xFFFC},
    {(AnimationHeader *)0x600A5E0, 1.0f, 0, 0xFFFF, 0, 0},
    {(AnimationHeader *)0x600A70C, 1.0f, 0, 1, 0, 0},
    {(AnimationHeader *)0x6008090, 1.0f, 0, 0xFFFF, 0, 0},
    {(AnimationHeader *)0x600898C, 1.0f, 0, 0xFFFF, 2, 0xFFFC},
    {(AnimationHeader *)0x6009450, 1.0f, 0, 0xFFFF, 2, 0xFFFC},
    {(AnimationHeader *)0x600AD18, 1.0f, 0, 0xFFFF, 0, 0},
    {(AnimationHeader *)0x600AD18, 1.0f, 0, 0xFFFF, 0, 0xFFFC},
    {(AnimationHeader *)0x600B8B0, 1.0f, 0, 0xFFFF, 2, 0},
    {(AnimationHeader *)0x600BA80, 1.0f, 0, 0xFFFF, 0, 0xFFFC},
    {(AnimationHeader *)0x600C03C, 1.0f, 0, 0xFFFF, 0, 0xFFFC},
    {(AnimationHeader *)0x600B990, 1.0f, 0, 0xFFFF, 0, 0xFFFC},
};
static Vec3f D_80951D90 = {64.0f, 0.0f, -122.0f};
static Vec3f D_80951D9C = {64.0f, 0.0f, -122.0f};
static Vec3f D_80951DA8 = {278.0f, 0.0f, 223.0f};
static Vec3s D_80951DB4 = {0, 0xC000, 0};
static Vec3f D_80951DBC = {-525.0f, 214.0f, 515.0f};
static Vec3s D_80951DC8 = {0, 0x38E0, 0};
static Vec3f D_80951DD0 = {-334.0f, 225.0f, 903.0f};
static Vec3s D_80951DDC = {0, 0x7FFF, 0};
static ? D_80951DE4;                                /* unable to generate initializer */
static ? D_80951E14;                                /* unable to generate initializer */
static Vec3f D_80951E24 = {1400.0f, 0.0f, 0.0f};
static ? D_80951E30;                                /* unable to generate initializer */

typedef struct EnGm {
    /* 0x0000 */ Actor actor;
    /* 0x0144 */ SkelAnime unk144;                  /* inferred */
    /* 0x0188 */ void (*actionFunc)(EnGm *, GlobalContext *);
    /* 0x018C */ char pad18C[0x4];                  /* maybe part of actionFunc[2]? */
    /* 0x0190 */ ColliderCylinder unk190;           /* inferred */
    /* 0x01DC */ ColliderSphere unk1DC;             /* inferred */
    /* 0x0234 */ char pad234[0x24];
    /* 0x0258 */ u8 unk258;                         /* inferred */
    /* 0x0259 */ s8 unk259;                         /* inferred */
    /* 0x025A */ char pad25A[0x2];                  /* maybe part of unk259[3]? */
    /* 0x025C */ s32 unk25C;                        /* inferred */
    /* 0x0260 */ s8 unk260;                         /* inferred */
    /* 0x0261 */ char pad261[0x1];                  /* maybe part of unk260[2]? */
    /* 0x0262 */ s8 unk262;                         /* inferred */
    /* 0x0263 */ char pad263[0x1];                  /* maybe part of unk262[2]? */
    /* 0x0264 */ s32 *unk264;                       /* inferred */
    /* 0x0268 */ Actor *unk268;                     /* inferred */
    /* 0x026C */ char pad26C[0x48];                 /* maybe part of unk268[19]? */
    /* 0x02B4 */ Vec3s unk2B4;                      /* inferred */
    /* 0x02BA */ char pad2BA[0x72];                 /* maybe part of unk2B4[20]? */
    /* 0x032C */ Vec3s unk32C;                      /* inferred */
    /* 0x0332 */ char pad332[0x72];                 /* maybe part of unk32C[20]? */
    /* 0x03A4 */ u16 unk3A4;                        /* inferred */
    /* 0x03A6 */ char pad3A6[0x2];                  /* maybe part of unk3A4[2]? */
    /* 0x03A8 */ f32 unk3A8;                        /* inferred */
    /* 0x03AC */ char pad3AC[0x8];                  /* maybe part of unk3A8[3]? */
    /* 0x03B4 */ f32 unk3B4;                        /* inferred */
    /* 0x03B8 */ s16 unk3B8;                        /* inferred */
    /* 0x03BA */ char pad3BA[0x2];                  /* maybe part of unk3B8[2]? */
    /* 0x03BC */ s16 unk3BC;                        /* inferred */
    /* 0x03BE */ s16 unk3BE;                        /* inferred */
    /* 0x03C0 */ s16 unk3C0;                        /* inferred */
    /* 0x03C2 */ s16 unk3C2;                        /* inferred */
    /* 0x03C4 */ s16 unk3C4;                        /* inferred */
    /* 0x03C6 */ s16 unk3C6;                        /* inferred */
    /* 0x03C8 */ s16 unk3C8;                        /* inferred */
    /* 0x03CA */ s16 unk3CA;                        /* inferred */
    /* 0x03CC */ s16 unk3CC;                        /* inferred */
    /* 0x03CE */ s16 unk3CE;                        /* inferred */
    /* 0x03D0 */ char pad3D0[0x2];                  /* maybe part of unk3CE[2]? */
    /* 0x03D2 */ s16 unk3D2;                        /* inferred */
    /* 0x03D4 */ char pad3D4[0x4];                  /* maybe part of unk3D2[3]? */
    /* 0x03D8 */ s16 unk3D8;                        /* inferred */
    /* 0x03DA */ char pad3DA[0xA];                  /* maybe part of unk3D8[6]? */
    /* 0x03E4 */ void *unk3E4;                      /* inferred */
    /* 0x03E8 */ s32 unk3E8;                        /* inferred */
    /* 0x03EC */ char pad3EC[0xC];                  /* maybe part of unk3E8[4]? */
    /* 0x03F8 */ s32 unk3F8;                        /* inferred */
    /* 0x03FC */ s32 unk3FC;                        /* inferred */
    /* 0x0400 */ s32 unk400;                        /* inferred */
} EnGm;                                             /* size 0x404 */

Actor *func_8094DEE0(GlobalContext *arg0, GlobalContext *arg1, u8 arg2, s16 arg3) {
    Actor *temp_v0;
    Actor *temp_v1;
    Actor *phi_s0;
    Actor *phi_s0_2;

    phi_s0 = NULL;
    phi_s0_2 = NULL;
loop_1:
    temp_v0 = func_ActorCategoryIterateById(arg1, phi_s0, arg2 & 0xFF & 0xFF, (s32) arg3);
    phi_s0_2 = temp_v0;
    if ((temp_v0 != 0) && ((temp_v0 == arg0) || (temp_v0->update == 0))) {
        temp_v1 = temp_v0->next;
        if (temp_v1 == 0) {

        } else {
            phi_s0 = temp_v1;
            goto loop_1;
        }
    }
    return phi_s0_2;
}

void func_8094DF90(GlobalContext *arg1) {
    ? phi_a1;

    phi_a1 = -1;
    switch (arg1) {
    case 9:
    case 13:
    case 15:
        phi_a1 = 0xB;
        break;
    case 10:
    case 11:
    case 16:
    case 17:
        phi_a1 = 0x11;
        break;
    case 12:
    case 14:
