typedef struct EnAob01 {
    /* 0x000 */ Actor actor;
    /* 0x144 */ void (*actionFunc)(EnAob01 *, GlobalContext *);
    /* 0x148 */ SkelAnime unk148;                   /* inferred */
    /* 0x18C */ ColliderCylinder unk18C;            /* inferred */
    /* 0x19F */ u8 unk19F;                          /* overlap; inferred */
    /* 0x1A0 */ char pad1A0[0x70];                  /* maybe part of unk19F[113]? */
    /* 0x210 */ u16 unk210;                         /* inferred */
    /* 0x212 */ Vec3s unk212;                       /* inferred */
    /* 0x218 */ char pad218[0x5A];                  /* maybe part of unk212[16]? */
    /* 0x272 */ Vec3s unk272;                       /* inferred */
    /* 0x278 */ char pad278[0x5A];                  /* maybe part of unk272[16]? */
    /* 0x2D2 */ u16 unk2D2;                         /* inferred */
    /* 0x2D4 */ ? unk2D4;                           /* inferred */
    /* 0x2D4 */ char pad2D4[0x4];
    /* 0x2D8 */ u16 unk2D8;                         /* inferred */
    /* 0x2DA */ ? unk2DA;                           /* inferred */
    /* 0x2DA */ char pad2DA[0x4];
    /* 0x2DE */ u16 unk2DE;                         /* inferred */
    /* 0x2E0 */ ? unk2E0;                           /* inferred */
    /* 0x2E0 */ char pad2E0[0x4];
    /* 0x2E4 */ u16 unk2E4;                         /* inferred */
    /* 0x2E6 */ ? unk2E6;                           /* inferred */
    /* 0x2E6 */ char pad2E6[0x4];
    /* 0x2EA */ u16 unk2EA;                         /* inferred */
    /* 0x2EC */ ? unk2EC;                           /* inferred */
    /* 0x2EC */ char pad2EC[0x4];
    /* 0x2F0 */ u16 unk2F0;                         /* inferred */
    /* 0x2F2 */ ? unk2F2;                           /* inferred */
    /* 0x2F2 */ char pad2F2[0x4];
    /* 0x2F6 */ u16 unk2F6;                         /* inferred */
    /* 0x2F8 */ char pad2F8[0xFC];                  /* maybe part of unk2F6[127]? */
    /* 0x3F4 */ Actor *unk3F4;                      /* inferred */
    /* 0x3F8 */ char pad3F8[0x38];                  /* maybe part of unk3F4[15]? */
    /* 0x430 */ s16 unk430;                         /* inferred */
    /* 0x432 */ s16 unk432;                         /* inferred */
    /* 0x434 */ s32 unk434;                         /* inferred */
    /* 0x438 */ char pad438[0x4];
    /* 0x43C */ s32 unk43C;                         /* inferred */
    /* 0x440 */ s16 unk440;                         /* inferred */
    /* 0x442 */ char pad442[0x2];
} EnAob01;                                          /* size = 0x444 */

struct _mips2c_stack_EnAob01_Destroy {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnAob01_Draw {
    /* 0x00 */ char pad0[0x40];
    /* 0x40 */ Gfx *sp40;                           /* inferred */
    /* 0x44 */ Gfx *sp44;                           /* inferred */
    /* 0x48 */ char pad48[0x8];                     /* maybe part of sp44[3]? */
    /* 0x50 */ f32 sp50;                            /* inferred */
    /* 0x54 */ f32 sp54;                            /* inferred */
    /* 0x58 */ f32 sp58;                            /* inferred */
    /* 0x5C */ ? sp5C;                              /* inferred */
    /* 0x5C */ char pad5C[0x14];
};                                                  /* size = 0x70 */

struct _mips2c_stack_EnAob01_Init {
    /* 0x00 */ char pad0[0x34];
    /* 0x34 */ ColliderCylinder *sp34;              /* inferred */
    /* 0x38 */ SkelAnime *sp38;                     /* inferred */
    /* 0x3C */ char pad3C[0xC];
};                                                  /* size = 0x48 */

struct _mips2c_stack_EnAob01_Update {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809C10B0 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809C1124 {};              /* size 0x0 */

struct _mips2c_stack_func_809C1158 {
    /* 0x00 */ char pad0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_809C11EC {
    /* 0x00 */ char pad0[0x60];
};                                                  /* size = 0x60 */

struct _mips2c_stack_func_809C1304 {
    /* 0x00 */ char pad0[0x78];
};                                                  /* size = 0x78 */

struct _mips2c_stack_func_809C1424 {
    /* 0x00 */ char pad0[0x1E];
    /* 0x1E */ s16 sp1E;                            /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_809C14D0 {
    /* 0x00 */ char pad0[0x1E];
    /* 0x1E */ s16 sp1E;                            /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_809C15BC {
    /* 0x00 */ char pad0[0x1E];
    /* 0x1E */ s16 sp1E;                            /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_809C165C {
    /* 0x00 */ char pad0[0x18];
    /* 0x18 */ Collider *sp18;                      /* inferred */
    /* 0x1C */ CollisionCheckContext *sp1C;         /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_809C16DC {
    /* 0x00 */ char pad0[0x1C];
    /* 0x1C */ s32 sp1C;                            /* inferred */
    /* 0x20 */ char pad20[0x8];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_809C1C9C {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809C1D64 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_809C1EC8 {
    /* 0x00 */ char pad0[0x30];
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ char pad3C[0x4];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_809C2060 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_809C21E0 {
    /* 0x00 */ char pad0[0x2F];
    /* 0x2F */ u8 sp2F;                             /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_809C2504 {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_809C2594 {};              /* size 0x0 */

struct _mips2c_stack_func_809C25E4 {};              /* size 0x0 */

struct _mips2c_stack_func_809C2680 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809C26E4 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809C2730 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809C2788 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809C2824 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_809C28B8 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_809C2A64 {
    /* 0x00 */ char pad0[0x2F];
    /* 0x2F */ u8 sp2F;                             /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_809C2BE4 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809C2C9C {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_809C2D0C {
    /* 0x00 */ char pad0[0x2F];
    /* 0x2F */ u8 sp2F;                             /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_809C2EC4 {};              /* size 0x0 */

struct _mips2c_stack_func_809C2F34 {};              /* size 0x0 */

struct _mips2c_stack_func_809C2FA0 {
    /* 0x00 */ char pad0[0x34];
    /* 0x34 */ ? sp34;                              /* inferred */
    /* 0x34 */ char pad34[0x10];
    /* 0x44 */ ? sp44;                              /* inferred */
    /* 0x44 */ char pad44[0xC];
};                                                  /* size = 0x50 */

struct _mips2c_stack_func_809C33D8 {
    /* 0x00 */ char pad0[0x24];
    /* 0x24 */ void *sp24;                          /* inferred */
    /* 0x28 */ char pad28[0x4];
    /* 0x2C */ s32 *sp2C;                           /* inferred */
    /* 0x30 */ char pad30[0x8];                     /* maybe part of sp2C[3]? */
    /* 0x38 */ ? sp38;                              /* inferred */
    /* 0x38 */ char pad38[0x10];
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_809C35B4 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809C35F4 {};              /* size 0x0 */

s32 func_800F2178(s16);                             /* extern */
void func_809C10B0(EnAob01 *arg0, s32 arg1);        /* static */
void func_809C1124();                               /* static */
void func_809C1158(EnAob01 *arg0, GlobalContext *arg1); /* static */
void func_809C11EC(EnAob01 *arg0, GlobalContext *arg1); /* static */
void func_809C1304(EnAob01 *arg0, GlobalContext *arg1); /* static */
s32 func_809C1424(EnAob01 *arg0);                   /* static */
s32 func_809C14D0(EnAob01 *arg0);                   /* static */
s32 func_809C15BC(EnAob01 *arg0);                   /* static */
void func_809C165C(EnAob01 *arg0, GlobalContext *arg1); /* static */
void func_809C16DC(Actor *arg0, GlobalContext *arg1); /* static */
void func_809C1EC8(EnAob01 *arg0, GlobalContext *arg1); /* static */
