typedef struct EnZod {
    /* 0x000 */ Actor actor;
    /* 0x144 */ Vec3s unk144;                       /* inferred */
    /* 0x14A */ char pad14A[0x36];                  /* maybe part of unk144[10]? */
    /* 0x180 */ Vec3s unk180;                       /* inferred */
    /* 0x186 */ char pad186[0x36];                  /* maybe part of unk180[10]? */
    /* 0x1BC */ SkelAnime unk1BC;                   /* inferred */
    /* 0x200 */ ColliderCylinder unk200;            /* inferred */
    /* 0x24C */ s16 unk24C;                         /* inferred */
    /* 0x24E */ s16 unk24E;                         /* inferred */
    /* 0x250 */ Vec3s unk250;                       /* inferred */
    /* 0x256 */ u16 unk256;                         /* inferred */
    /* 0x258 */ u16 unk258;                         /* inferred */
    /* 0x25A */ u16 unk25A;                         /* inferred */
    /* 0x25C */ s16 unk25C;                         /* inferred */
    /* 0x25E */ s16 unk25E;                         /* inferred */
    /* 0x260 */ s16 unk260;                         /* inferred */
    /* 0x262 */ s16 unk262;                         /* inferred */
    /* 0x264 */ s16 unk264;                         /* inferred */
    /* 0x266 */ s16 unk266;                         /* inferred */
    /* 0x268 */ f32 unk268;                         /* inferred */
    /* 0x26C */ f32 unk26C;                         /* inferred */
    /* 0x270 */ char pad270[0x10];                  /* maybe part of unk26C[5]? */
    /* 0x280 */ f32 unk280;                         /* inferred */
    /* 0x284 */ f32 unk284;                         /* inferred */
    /* 0x288 */ char pad288[0x10];                  /* maybe part of unk284[5]? */
    /* 0x298 */ s16 unk298;                         /* inferred */
    /* 0x29A */ u16 unk29A;                         /* inferred */
    /* 0x29C */ void (*actionFunc)(EnZod *, GlobalContext *);
} EnZod;                                            /* size = 0x2A0 */

struct _mips2c_stack_EnZod_Destroy {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnZod_Draw {
    /* 0x00 */ char pad0[0x30];
    /* 0x30 */ Gfx *sp30;                           /* inferred */
    /* 0x34 */ char pad34[0x4];
};                                                  /* size = 0x38 */

struct _mips2c_stack_EnZod_Init {
    /* 0x00 */ char pad0[0x34];
    /* 0x34 */ SkelAnime *sp34;                     /* inferred */
    /* 0x38 */ char pad38[0x10];
};                                                  /* size = 0x48 */

struct _mips2c_stack_EnZod_Update {
    /* 0x00 */ char pad0[0x30];
    /* 0x30 */ ColliderCylinder *sp30;              /* inferred */
    /* 0x34 */ char pad34[0x4];
    /* 0x38 */ s16 sp38;                            /* inferred */
    /* 0x3A */ s16 sp3A;                            /* inferred */
    /* 0x3C */ s16 sp3C;                            /* inferred */
    /* 0x3E */ char pad3E[0xA];
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_80BAF1EC {
    /* 0x00 */ char pad0[0x26];
    /* 0x26 */ u16 sp26;                            /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80BAF2B4 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80BAF338 {
    /* 0x00 */ char pad0[0x30];
    /* 0x30 */ AnimationHeaderCommon **sp30;        /* inferred */
    /* 0x34 */ char pad34[0x4];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80BAF3E0 {
    /* 0x00 */ char pad0[0x20];
    /* 0x20 */ SkelAnime *sp20;                     /* inferred */
    /* 0x24 */ char pad24[0x4];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80BAF4D8 {};              /* size 0x0 */

struct _mips2c_stack_func_80BAF7CC {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80BAF99C {
    /* 0x00 */ char pad0[0x20];
    /* 0x20 */ f32 sp20;                            /* inferred */
    /* 0x24 */ f32 sp24;                            /* inferred */
    /* 0x28 */ f32 sp28;                            /* inferred */
    /* 0x2C */ char pad2C[0x4];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80BAFA44 {
    /* 0x00 */ char pad0[0x1E];
    /* 0x1E */ u16 sp1E;                            /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80BAFADC {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80BAFB84 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80BAFC00 {};              /* size 0x0 */

struct _mips2c_stack_func_80BAFC10 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80BAFD00 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80BAFDB4 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80BAFE34 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80BAFF14 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80BB0128 {};              /* size 0x0 */

struct _mips2c_stack_func_80BB0170 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80BB01B0 {
    /* 0x00 */ char pad0[0x74];
    /* 0x74 */ f32 sp74;                            /* inferred */
    /* 0x78 */ char pad78[0x24];                    /* maybe part of sp74[10]? */
    /* 0x9C */ f32 sp9C;                            /* inferred */
    /* 0xA0 */ char padA0[0x24];                    /* maybe part of sp9C[10]? */
    /* 0xC4 */ f32 spC4;                            /* inferred */
    /* 0xC8 */ char padC8[0x28];
};                                                  /* size = 0xF0 */

? func_801A1FB4(?, f32 *, ?, ?);                    /* extern */
void func_80BAF1EC(EnZod *arg0, GlobalContext *arg1); /* static */
s32 func_80BAF2B4(Actor *arg0, GlobalContext *arg1); /* static */
void func_80BAF338(EnZod *arg0, s16 arg1, u8 arg2, u16); /* static */
void func_80BAF3E0(EnZod *arg0, GlobalContext *);   /* static */
void func_80BAF4D8(EnZod *arg0);                    /* static */
void func_80BAF7CC(EnZod *arg0, GlobalContext *arg1); /* static */
void func_80BAF99C(EnZod *arg0, GlobalContext *arg1); /* static */
void func_80BAFA44(EnZod *arg0, GlobalContext *arg1); /* static */
void func_80BAFADC(EnZod *arg0, GlobalContext *arg1); /* static */
void func_80BAFB84(EnZod *arg0, GlobalContext *arg1); /* static */
void func_80BAFC00(EnZod *arg0, GlobalContext *arg1); /* static */
void func_80BAFC10(EnZod *arg0, GlobalContext *arg1); /* static */
