? func_800BE3D0(EnSnowman *, s16, ActorShape *);    /* extern */
void func_80B16FC0(Actor *arg0, GlobalContext *arg1); /* static */
void func_80B17144(EnSnowman *arg0, GlobalContext *arg1); /* static */
void func_80B173D0(EnSnowman *arg0);                /* static */
void func_80B177EC(EnSnowman *arg0, GlobalContext *arg1); /* static */
void func_80B179D0(EnSnowman *arg0);                /* static */
void func_80B17CE8(EnSnowman *arg0);                /* static */
void func_80B17EB4(EnSnowman *arg0);                /* static */
void func_80B17F4C(EnSnowman *arg0, GlobalContext *arg1, EnSnowman *); /* static */
void func_80B180A4(Actor *arg0);                    /* static */
void func_80B18380(Actor *arg0);                    /* static */
void func_80B183C4(Actor *arg0);                    /* static */
void func_80B18600(EnSnowman *arg0);                /* static */
void func_80B18908(EnSnowman *arg0);                /* static */
void func_80B189D4(Actor *arg0);                    /* static */
void func_80B18A28(Actor *arg0, PosRot *arg1, s16 arg2); /* static */
void func_80B18B30(EnSnowman *arg0, Actor *arg1, Actor *, Actor *); /* static */
void func_80B18BB4(Actor *arg0, GlobalContext *arg1, f32 *arg2); /* static */
void func_80B18F50(Actor *arg0, GlobalContext *arg1); /* static */
void func_80B19474(Actor *this, GlobalContext *globalCtx); /* static */
void func_80B19718(GraphicsContext **arg0, s32 arg1, Gfx **arg2, Vec3s *arg3, Actor *arg4); /* static */
void func_80B19948(Actor *thisx, GlobalContext *globalCtx); /* static */
void func_80B19998(Actor *thisx, GlobalContext *globalCtx); /* static */
extern AnimationHeader D_06000404;
extern AnimationHeader D_060007B4;
extern FlexSkeletonHeader D_060045A0;
extern AnimationHeader D_06004628;
extern AnimationHeader D_060046D8;
extern FlexSkeletonHeader D_06004A90;
extern AnimationHeader D_06004F14;
extern AnimationHeader D_0600544C;
extern AnimationHeader D_0600554C;
extern AnimationHeader D_060058CC;
static ColliderCylinderInit D_80B19A00 = {
    {4, 0, 9, 0x39, 0x10, 1},
    {0, {0, 0, 0}, {0xF7CFFFFF, 0, 0}, 0, 5, 1},
    {0x3C, 0x50, 0, {0, 0, 0}},
};
static ColliderCylinderInit D_80B19A2C = {
    {0xA, 0x11, 9, 0x38, 0x10, 1},
    {0, {0xF7CFFFFF, 0, 4}, {0xF7CFFFFF, 0, 0}, 0x19, 1, 1},
    {0x3C, 0x50, 0, {0, 0, 0}},
};
static DamageTable D_80B19A58 = {
    {
        0x10,
        1,
        1,
        1,
        1,
        1,
        0,
        0xF1,
        2,
        1,
        1,
        0x22,
        1,
        0x42,
        1,
        0x10,
        1,
        2,
        0x10,
        0x50,
        0,
        0,
        1,
        1,
        1,
        0,
        0,
        0,
        0,
        0,
        0,
        1,
    },
};
static CollisionCheckInfoInit D_80B19A78 = {2, 0x3C, 0x50, 0x96};
static Color_RGBA8 D_80B19A80 = {0xFA, 0xFA, 0xFA, 0xFF};
static Color_RGBA8 D_80B19A84 = {0xB4, 0xB4, 0xB4, 0xFF};
static Vec3f D_80B19A88 = {0.0f, 1.5f, 0.0f};
static ? D_80B19A94;                                /* unable to generate initializer */
static Gfx *D_80B19AA0 = {(Gfx *)0x6005CB0, (Gfx *)0x6006190, (Gfx *)0x6006620};
static InitChainEntry D_80B19AAC;                   /* unable to generate initializer */
static Vec3f D_80B19AB8 = {0.0f, -1.0f, 0.0f};
static Vec3f D_80B19AC4 = {0.0f, -0.5f, 0.0f};
static ? D_80B19AD0;                                /* unable to generate initializer */
static ? D_80B19ADA;                                /* unable to generate initializer */
static Vec3f D_80B19ADC = {
    {2000.0f, 3000.0f, 0.0f},
    {2000.0f, -2000.0f, 0.0f},
    {3000.0f, 0.0f, 0.0f},
    {1000.0f, 0.0f, 3000.0f},
    {1000.0f, 0.0f, -3000.0f},
};
static ? D_80B19B18;                                /* unable to generate initializer */

typedef struct EnSnowman {
    /* 0x0000 */ Actor actor;
    /* 0x0144 */ SkelAnime unk144;                  /* inferred */
    /* 0x0188 */ SkelAnime unk188;                  /* inferred */
    /* 0x01CC */ Vec3s unk1CC;                      /* inferred */
    /* 0x01D2 */ char pad1D2[0x42];                 /* maybe part of unk1CC[12]? */
    /* 0x0214 */ Vec3s unk214;                      /* inferred */
    /* 0x021A */ char pad21A[0x42];                 /* maybe part of unk214[12]? */
    /* 0x025C */ Vec3s unk25C;                      /* inferred */
    /* 0x0262 */ char pad262[0xC];                  /* maybe part of unk25C[3]? */
    /* 0x026E */ Vec3s unk26E;                      /* inferred */
    /* 0x0274 */ char pad274[0xC];                  /* maybe part of unk26E[3]? */
    /* 0x0280 */ void (*actionFunc)(EnSnowman *, GlobalContext *);
    /* 0x0284 */ void (*unk284)(EnSnowman *, GlobalContext *); /* inferred */
    /* 0x0288 */ u8 unk288;                         /* inferred */
    /* 0x0289 */ u8 unk289;                         /* inferred */
    /* 0x028A */ u8 unk28A;                         /* inferred */
    /* 0x028B */ u8 unk28B;                         /* inferred */
    /* 0x028C */ s16 unk28C;                        /* inferred */
    /* 0x028E */ s16 unk28E;                        /* inferred */
    /* 0x0290 */ s16 unk290;                        /* inferred */
    /* 0x0292 */ char pad292[0x2];                  /* maybe part of unk290[2]? */
    /* 0x0294 */ f32 unk294;                        /* inferred */
    /* 0x0298 */ f32 unk298;                        /* inferred */
    /* 0x029C */ f32 unk29C;                        /* inferred */
    /* 0x02A0 */ f32 unk2A0;                        /* inferred */
    /* 0x02A4 */ f32 unk2A4;                        /* inferred */
    /* 0x02A8 */ f32 unk2A8;                        /* inferred */
    /* 0x02AC */ char pad2AC[0x8];                  /* maybe part of unk2A8[3]? */
    /* 0x02B4 */ f32 unk2B4;                        /* inferred */
    /* 0x02B8 */ f32 unk2B8;                        /* inferred */
    /* 0x02BC */ f32 unk2BC;                        /* inferred */
    /* 0x02C0 */ Vec3f unk2C0;                      /* inferred */
    /* 0x02CC */ char pad2CC[0x60];                 /* maybe part of unk2C0[9]? */
    /* 0x032C */ ColliderCylinder unk32C;           /* inferred */
} EnSnowman;                                        /* size 0x378 */

void EnSnowman_Init(Actor *thisx, GlobalContext *globalCtx) {
    EnSnowman *this = (EnSnowman *) thisx;
    s32 sp54;
    Actor *sp50;
    ActorContext *sp48;
    Actor *temp_a0_2;
    Actor *temp_a1;
    Actor *temp_v0_2;
    ActorContext *temp_a0;
    f32 temp_f2;
    f32 temp_f6;
    s16 temp_v0;
    s32 temp_cond;
    s32 temp_v1;
    s32 phi_v1;

    Actor_ProcessInitChain(&this->actor, &D_80B19AAC);
    temp_v0 = this->actor.params;
    temp_v1 = ((s32) temp_v0 >> 8) & 0xFF;
    phi_v1 = temp_v1;
    if (temp_v1 == 0xFF) {
        phi_v1 = 0;
    }
    this->actor.params = temp_v0 & 7;
    if ((s32) this->actor.params < 3) {
        sp54 = phi_v1;
        SkelAnime_InitSV(globalCtx, &this->unk144, &D_060045A0, &D_0600554C, &this->unk1CC, &this->unk214, 0xC);
