typedef struct EnSnowman {
    /* 0x000 */ Actor actor;
    /* 0x144 */ SkelAnime unk_144;                  /* inferred */
    /* 0x188 */ SkelAnime unk_188;                  /* inferred */
    /* 0x1CC */ Vec3s unk_1CC;                      /* inferred */
    /* 0x1D2 */ char pad_1D2[0x42];                 /* maybe part of unk_1CC[12]? */
    /* 0x214 */ Vec3s unk_214;                      /* inferred */
    /* 0x21A */ char pad_21A[0x42];                 /* maybe part of unk_214[12]? */
    /* 0x25C */ Vec3s unk_25C;                      /* inferred */
    /* 0x262 */ char pad_262[0xC];                  /* maybe part of unk_25C[3]? */
    /* 0x26E */ Vec3s unk_26E;                      /* inferred */
    /* 0x274 */ char pad_274[0xC];                  /* maybe part of unk_26E[3]? */
    /* 0x280 */ void (*actionFunc)(EnSnowman *, GlobalContext *);
    /* 0x284 */ void (*unk_284)(EnSnowman *, GlobalContext *); /* inferred */
    /* 0x288 */ u8 unk_288;                         /* inferred */
    /* 0x289 */ u8 unk_289;                         /* inferred */
    /* 0x28A */ u8 unk_28A;                         /* inferred */
    /* 0x28B */ u8 unk_28B;                         /* inferred */
    /* 0x28C */ s16 unk_28C;                        /* inferred */
    /* 0x28E */ s16 unk_28E;                        /* inferred */
    /* 0x290 */ s16 unk_290;                        /* inferred */
    /* 0x292 */ char pad_292[0x2];
    /* 0x294 */ f32 unk_294;                        /* inferred */
    /* 0x298 */ f32 unk_298;                        /* inferred */
    /* 0x29C */ f32 unk_29C;                        /* inferred */
    /* 0x2A0 */ f32 unk_2A0;                        /* inferred */
    /* 0x2A4 */ f32 unk_2A4;                        /* inferred */
    /* 0x2A8 */ f32 unk_2A8;                        /* inferred */
    /* 0x2AC */ char pad_2AC[0x8];                  /* maybe part of unk_2A8[3]? */
    /* 0x2B4 */ f32 unk_2B4;                        /* inferred */
    /* 0x2B8 */ f32 unk_2B8;                        /* inferred */
    /* 0x2BC */ f32 unk_2BC;                        /* inferred */
    /* 0x2C0 */ Vec3f unk_2C0;                      /* inferred */
    /* 0x2CC */ char pad_2CC[0x60];                 /* maybe part of unk_2C0[9]? */
    /* 0x32C */ ColliderCylinder unk_32C;           /* inferred */
} EnSnowman;                                        /* size = 0x378 */

struct _mips2c_stack_EnSnowman_Destroy {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnSnowman_Draw {
    /* 0x00 */ char pad_0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_EnSnowman_Init {
    /* 0x00 */ char pad_0[0x48];
    /* 0x48 */ ActorContext *sp48;                  /* inferred */
    /* 0x4C */ char pad_4C[0x4];
    /* 0x50 */ Actor *sp50;                         /* inferred */
    /* 0x54 */ s32 sp54;                            /* inferred */
    /* 0x58 */ char pad_58[0x8];
};                                                  /* size = 0x60 */

struct _mips2c_stack_EnSnowman_Update {
    /* 0x00 */ char pad_0[0x28];
    /* 0x28 */ ColliderCylinder *sp28;              /* inferred */
    /* 0x2C */ char pad_2C[0xC];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80B16FC0 {
    /* 0x00 */ char pad_0[0x78];
    /* 0x78 */ f32 sp78;                            /* inferred */
    /* 0x7C */ f32 sp7C;                            /* inferred */
    /* 0x80 */ f32 sp80;                            /* inferred */
    /* 0x84 */ char pad_84[0x4];
};                                                  /* size = 0x88 */

struct _mips2c_stack_func_80B17144 {
    /* 0x00 */ char pad_0[0x94];
    /* 0x94 */ f32 sp94;                            /* inferred */
    /* 0x98 */ f32 sp98;                            /* inferred */
    /* 0x9C */ f32 sp9C;                            /* inferred */
    /* 0xA0 */ f32 spA0;                            /* inferred */
    /* 0xA4 */ f32 spA4;                            /* inferred */
    /* 0xA8 */ f32 spA8;                            /* inferred */
    /* 0xAC */ char pad_AC[0x4];
};                                                  /* size = 0xB0 */

struct _mips2c_stack_func_80B173D0 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B1746C {
    /* 0x00 */ char pad_0[0x28];
    /* 0x28 */ PosRot *sp28;                        /* inferred */
    /* 0x2C */ s32 sp2C;                            /* inferred */
    /* 0x30 */ char pad_30[0x6];                    /* maybe part of sp2C[2]? */
    /* 0x36 */ s16 sp36;                            /* inferred */
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ f32 sp3C;                            /* inferred */
    /* 0x40 */ f32 sp40;                            /* inferred */
    /* 0x44 */ Actor *sp44;                         /* inferred */
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_80B177EC {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80B178B8 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ Actor *sp24;                         /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80B179D0 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B17A58 {
    /* 0x00 */ char pad_0[0x34];
    /* 0x34 */ SkelAnime *sp34;                     /* inferred */
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ f32 sp3C;                            /* inferred */
    /* 0x40 */ f32 sp40;                            /* inferred */
    /* 0x44 */ f32 sp44;                            /* inferred */
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_80B17CE8 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B17D78 {
    /* 0x00 */ char pad_0[0x3C];
    /* 0x3C */ SkelAnime *sp3C;                     /* inferred */
    /* 0x40 */ s32 sp40;                            /* inferred */
    /* 0x44 */ Actor *sp44;                         /* inferred */
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_80B17EB4 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B17EFC {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B17F4C {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80B17FE0 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80B180A4 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80B18124 {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ f32 sp2C;                            /* inferred */
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ f32 sp3C;                            /* inferred */
    /* 0x40 */ f32 sp40;                            /* inferred */
    /* 0x44 */ f32 sp44;                            /* inferred */
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_80B18380 {};              /* size 0x0 */

struct _mips2c_stack_func_80B183A4 {};              /* size 0x0 */

struct _mips2c_stack_func_80B183C4 {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80B1848C {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ PosRot *sp20;                        /* inferred */
    /* 0x24 */ char pad_24[0x4];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80B18600 {};              /* size 0x0 */

struct _mips2c_stack_func_80B1861C {
    /* 0x00 */ char pad_0[0xA0];
    /* 0xA0 */ f32 spA0;                            /* inferred */
    /* 0xA4 */ f32 spA4;                            /* inferred */
    /* 0xA8 */ f32 spA8;                            /* inferred */
    /* 0xAC */ f32 spAC;                            /* inferred */
    /* 0xB0 */ f32 spB0;                            /* inferred */
    /* 0xB4 */ f32 spB4;                            /* inferred */
};                                                  /* size = 0xB8 */

struct _mips2c_stack_func_80B18908 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80B189C4 {};              /* size 0x0 */

struct _mips2c_stack_func_80B189D4 {};              /* size 0x0 */

struct _mips2c_stack_func_80B18A04 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B18A28 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ s32 sp24;                            /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80B18B30 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B18BB4 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B18C7C {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ f32 *sp24;                           /* inferred */
    /* 0x28 */ char pad_28[0x8];                    /* maybe part of sp24[3]? */
    /* 0x30 */ Actor *sp30;                         /* inferred */
    /* 0x34 */ Actor *sp34;                         /* inferred */
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80B18F50 {
    /* 0x00 */ char pad_0[0x38];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80B19474 {
    /* 0x00 */ char pad_0[0x50];
};                                                  /* size = 0x50 */

struct _mips2c_stack_func_80B19718 {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ s8 *sp2C;                            /* inferred */
    /* 0x30 */ char pad_30[0x20];
};                                                  /* size = 0x50 */

struct _mips2c_stack_func_80B19948 {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80B19998 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

? func_800BE3D0(EnSnowman *, s16, ActorShape *);    /* extern */
void func_80B16FC0(Actor *arg0, GlobalContext *arg1); /* static */
void func_80B17144(EnSnowman *arg0, GlobalContext *arg1); /* static */
void func_80B173D0(EnSnowman *arg0);                /* static */
void func_80B177EC(EnSnowman *arg0, GlobalContext *arg1); /* static */
void func_80B179D0(EnSnowman *arg0);                /* static */
void func_80B17CE8(EnSnowman *arg0);                /* static */
void func_80B17EB4(EnSnowman *arg0);                /* static */
void func_80B17F4C(EnSnowman *arg0, GlobalContext *arg1, EnSnowman *); /* static */
void func_80B180A4(Actor *arg0);                    /* static */
void func_80B18380(Actor *arg0);                    /* static */
void func_80B183C4(Actor *arg0);                    /* static */
void func_80B18600(EnSnowman *arg0);                /* static */
