typedef struct Boss03 {
    /* 0x000 */ Actor actor;
    /* 0x144 */ char pad_144[0x4];
    /* 0x148 */ SkelAnime unk_148;                  /* inferred */
    /* 0x18C */ Vec3s unk_18C;                      /* inferred */
    /* 0x192 */ char pad_192[0x54];                 /* maybe part of unk_18C[15]? */
    /* 0x1E6 */ Vec3s unk_1E6;                      /* inferred */
    /* 0x1EC */ char pad_1EC[0x54];                 /* maybe part of unk_1E6[15]? */
    /* 0x240 */ s16 unk_240;                        /* inferred */
    /* 0x242 */ u8 unk_242;                         /* inferred */
    /* 0x243 */ char pad_243[0x9];                  /* maybe part of unk_242[10]? */
    /* 0x24C */ s16 unk_24C;                        /* inferred */
    /* 0x24E */ s16 unk_24E;                        /* inferred */
    /* 0x250 */ s16 unk_250;                        /* inferred */
    /* 0x252 */ s8 unk_252;                         /* inferred */
    /* 0x253 */ u8 unk_253;                         /* inferred */
    /* 0x254 */ s16 unk_254;                        /* inferred */
    /* 0x256 */ char pad_256[0x2];
    /* 0x258 */ f32 unk_258;                        /* inferred */
    /* 0x25C */ s16 unk_25C;                        /* inferred */
    /* 0x25E */ s16 unk_25E;                        /* inferred */
    /* 0x260 */ f32 unk_260;                        /* inferred */
    /* 0x264 */ char pad_264[0x4];
    /* 0x268 */ f32 unk_268;                        /* inferred */
    /* 0x26C */ f32 unk_26C;                        /* inferred */
    /* 0x270 */ f32 unk_270;                        /* inferred */
    /* 0x274 */ s16 unk_274;                        /* inferred */
    /* 0x276 */ s16 unk_276;                        /* inferred */
    /* 0x278 */ f32 unk_278;                        /* inferred */
    /* 0x27C */ f32 unk_27C;                        /* inferred */
    /* 0x280 */ s16 unk_280;                        /* inferred */
    /* 0x282 */ char pad_282[0x2];
    /* 0x284 */ f32 unk_284;                        /* inferred */
    /* 0x288 */ f32 unk_288;                        /* inferred */
    /* 0x28C */ f32 unk_28C;                        /* inferred */
    /* 0x290 */ u8 unk_290;                         /* inferred */
    /* 0x291 */ char pad_291[0x3];                  /* maybe part of unk_290[4]? */
    /* 0x294 */ f32 unk_294;                        /* inferred */
    /* 0x298 */ f32 unk_298;                        /* inferred */
    /* 0x29C */ s16 unk_29C;                        /* inferred */
    /* 0x29E */ s16 unk_29E;                        /* inferred */
    /* 0x2A0 */ s16 unk_2A0;                        /* inferred */
    /* 0x2A2 */ char pad_2A2[0x2];
    /* 0x2A4 */ s16 unk_2A4;                        /* inferred */
    /* 0x2A6 */ char pad_2A6[0x2];
    /* 0x2A8 */ s16 unk_2A8;                        /* inferred */
    /* 0x2AA */ char pad_2AA[0x2];
    /* 0x2AC */ f32 unk_2AC;                        /* inferred */
    /* 0x2B0 */ f32 unk_2B0;                        /* inferred */
    /* 0x2B4 */ f32 unk_2B4;                        /* inferred */
    /* 0x2B8 */ f32 unk_2B8;                        /* inferred */
    /* 0x2BC */ u8 unk_2BC;                         /* inferred */
    /* 0x2BD */ u8 unk_2BD;                         /* inferred */
    /* 0x2BE */ s16 unk_2BE;                        /* inferred */
    /* 0x2C0 */ char pad_2C0[0x4];                  /* maybe part of unk_2BE[3]? */
    /* 0x2C4 */ f32 unk_2C4;                        /* inferred */
    /* 0x2C8 */ f32 unk_2C8;                        /* inferred */
    /* 0x2CC */ f32 unk_2CC;                        /* inferred */
    /* 0x2D0 */ f32 unk_2D0;                        /* inferred */
    /* 0x2D4 */ u8 unk_2D4;                         /* inferred */
    /* 0x2D5 */ u8 unk_2D5;                         /* inferred */
    /* 0x2D6 */ s16 unk_2D6;                        /* inferred */
    /* 0x2D8 */ s16 unk_2D8;                        /* inferred */
    /* 0x2DA */ s16 unk_2DA;                        /* inferred */
    /* 0x2DC */ char pad_2DC[0x48];                 /* maybe part of unk_2DA[37]? */
    /* 0x324 */ s16 unk_324;                        /* inferred */
    /* 0x326 */ char pad_326[0x2];
    /* 0x328 */ void (*actionFunc)(Boss03 *, GlobalContext *);
    /* 0x32C */ ColliderJntSph unk_32C;             /* inferred */
    /* 0x34C */ ColliderJntSphElement unk_34C;      /* inferred */
    /* 0x38C */ char pad_38C[0x40];
    /* 0x3CC */ ColliderJntSph unk_3CC;             /* inferred */
    /* 0x3EC */ ColliderJntSphElement unk_3EC;      /* inferred */
    /* 0x42C */ char pad_42C[0x100];                /* maybe part of unk_3EC[5]? */
    /* 0x52C */ f32 unk_52C;                        /* inferred */
    /* 0x530 */ u32 unk_530;                        /* inferred */
    /* 0x534 */ u16 unk_534;                        /* inferred */
    /* 0x536 */ s16 unk_536;                        /* inferred */
    /* 0x538 */ f32 unk_538;                        /* inferred */
    /* 0x53C */ f32 unk_53C;                        /* inferred */
    /* 0x540 */ f32 unk_540;                        /* inferred */
    /* 0x544 */ f32 unk_544;                        /* inferred */
    /* 0x548 */ f32 unk_548;                        /* inferred */
    /* 0x54C */ f32 unk_54C;                        /* inferred */
    /* 0x550 */ Vec3f unk_550;                      /* inferred */
    /* 0x55C */ f32 unk_55C;                        /* inferred */
    /* 0x560 */ f32 unk_560;                        /* inferred */
    /* 0x564 */ f32 unk_564;                        /* inferred */
    /* 0x568 */ f32 unk_568;                        /* inferred */
    /* 0x56C */ f32 unk_56C;                        /* inferred */
    /* 0x570 */ f32 unk_570;                        /* inferred */
    /* 0x574 */ char pad_574[0x4];
    /* 0x578 */ f32 unk_578;                        /* inferred */
} Boss03;                                           /* size = 0x57C */

struct _mips2c_stack_Boss03_Destroy {};             /* size 0x0 */

struct _mips2c_stack_Boss03_Draw {
    /* 0x00 */ char pad_0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_Boss03_Init {
    /* 0x00 */ char pad_0[0x70];
    /* 0x70 */ f32 sp70;                            /* inferred */
    /* 0x74 */ f32 sp74;                            /* inferred */
    /* 0x78 */ f32 sp78;                            /* inferred */
    /* 0x7C */ char pad_7C[0xC];
};                                                  /* size = 0x88 */

struct _mips2c_stack_Boss03_Update {
    /* 0x00 */ char pad_0[0x44];
    /* 0x44 */ ColliderJntSph *sp44;                /* inferred */
    /* 0x48 */ ColliderJntSph *sp48;                /* inferred */
    /* 0x4C */ char pad_4C[0x4];
    /* 0x50 */ void (*sp50)(Actor *, GlobalContext *); /* inferred */
    /* 0x54 */ char pad_54[0x4];
    /* 0x58 */ f32 sp58;                            /* inferred */
    /* 0x5C */ char pad_5C[0x2];
    /* 0x5E */ s16 sp5E;                            /* inferred */
    /* 0x60 */ f32 sp60;                            /* inferred */
    /* 0x64 */ f32 sp64;                            /* inferred */
    /* 0x68 */ f32 sp68;                            /* inferred */
    /* 0x6C */ f32 sp6C;                            /* inferred */
    /* 0x70 */ f32 sp70;                            /* inferred */
    /* 0x74 */ f32 sp74;                            /* inferred */
    /* 0x78 */ f32 sp78;                            /* inferred */
    /* 0x7C */ f32 sp7C;                            /* inferred */
    /* 0x80 */ f32 sp80;                            /* inferred */
    /* 0x84 */ char pad_84[0x4];
    /* 0x88 */ Actor *sp88;                         /* inferred */
    /* 0x8C */ char pad_8C[0x4];
    /* 0x90 */ Boss03 *sp90;                        /* inferred */
    /* 0x94 */ char pad_94[0x4];
};                                                  /* size = 0x98 */

struct _mips2c_stack_func_809E2760 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809E2788 {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ void *sp18;                          /* inferred */
    /* 0x1C */ char pad_1C[0x4];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_809E2880 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_809E299C {
    /* 0x00 */ char pad_0[0x34];
    /* 0x34 */ ? sp34;                              /* inferred */
    /* 0x34 */ char pad_34[0xC];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_809E2AB4 {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ void *sp18;                          /* inferred */
    /* 0x1C */ char pad_1C[0x4];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_809E2B8C {};              /* size 0x0 */

struct _mips2c_stack_func_809E2C1C {};              /* size 0x0 */

struct _mips2c_stack_func_809E2C3C {};              /* size 0x0 */

struct _mips2c_stack_func_809E2D64 {};              /* size 0x0 */

struct _mips2c_stack_func_809E2DA0 {
    /* 0x00 */ char pad_0[0x88];
    /* 0x88 */ f32 sp88;                            /* inferred */
    /* 0x8C */ f32 sp8C;                            /* inferred */
    /* 0x90 */ f32 sp90;                            /* inferred */
    /* 0x94 */ f32 sp94;                            /* inferred */
    /* 0x98 */ f32 sp98;                            /* inferred */
    /* 0x9C */ f32 sp9C;                            /* inferred */
    /* 0xA0 */ f32 spA0;                            /* inferred */
    /* 0xA4 */ f32 spA4;                            /* inferred */
    /* 0xA8 */ f32 spA8;                            /* inferred */
    /* 0xAC */ char pad_AC[0x4];
};                                                  /* size = 0xB0 */

struct _mips2c_stack_func_809E344C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809E34B8 {
    /* 0x00 */ char pad_0[0x40];
    /* 0x40 */ f32 sp40;                            /* inferred */
    /* 0x44 */ char pad_44[0x8];                    /* maybe part of sp40[3]? */
    /* 0x4C */ Actor *sp4C;                         /* inferred */
    /* 0x50 */ char pad_50[0x18];
};                                                  /* size = 0x68 */

struct _mips2c_stack_func_809E38EC {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809E3968 {
    /* 0x00 */ char pad_0[0x38];
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ char pad_3C[0x7];                    /* maybe part of sp38[2]? */
    /* 0x43 */ u8 sp43;                             /* inferred */
    /* 0x44 */ f32 sp44;                            /* inferred */
    /* 0x48 */ f32 sp48;                            /* inferred */
    /* 0x4C */ char pad_4C[0x4];
    /* 0x50 */ f32 sp50;                            /* inferred */
    /* 0x54 */ char pad_54[0x4];
    /* 0x58 */ f32 sp58;                            /* inferred */
    /* 0x5C */ char pad_5C[0x4];
    /* 0x60 */ f32 sp60;                            /* inferred */
    /* 0x64 */ char pad_64[0x4];
    /* 0x68 */ f32 sp68;                            /* inferred */
    /* 0x6C */ char pad_6C[0x4];
};                                                  /* size = 0x70 */

struct _mips2c_stack_func_809E3D34 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809E3D98 {
    /* 0x00 */ char pad_0[0x28];
    /* 0x28 */ f32 sp28;                            /* inferred */
    /* 0x2C */ char pad_2C[0x4];
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ char pad_34[0x4];
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ char pad_3C[0x4];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_809E4180 {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ f32 sp20;                            /* inferred */
    /* 0x24 */ f32 sp24;                            /* inferred */
    /* 0x28 */ f32 sp28;                            /* inferred */
    /* 0x2C */ char pad_2C[0x4];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_809E421C {
    /* 0x00 */ char pad_0[0x28];
    /* 0x28 */ f32 sp28;                            /* inferred */
    /* 0x2C */ SkelAnime *sp2C;                     /* inferred */
    /* 0x30 */ char pad_30[0x10];                   /* maybe part of sp2C[5]? */
    /* 0x40 */ f32 sp40;                            /* inferred */
    /* 0x44 */ char pad_44[0x4];
    /* 0x48 */ f32 sp48;                            /* inferred */
    /* 0x4C */ char pad_4C[0x8];                    /* maybe part of sp48[3]? */
    /* 0x54 */ Actor *sp54;                         /* inferred */
};                                                  /* size = 0x58 */

struct _mips2c_stack_func_809E4674 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809E475C {
    /* 0x00 */ char pad_0[0x28];
    /* 0x28 */ Actor *sp28;                         /* inferred */
    /* 0x2C */ char pad_2C[0x4];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_809E4910 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ void *sp1C;                          /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_809E497C {
    /* 0x00 */ char pad_0[0x3C];
    /* 0x3C */ Vec3s *sp3C;                         /* inferred */
    /* 0x40 */ char pad_40[0x8];                    /* maybe part of sp3C[3]? */
    /* 0x48 */ Actor *sp48;                         /* inferred */
    /* 0x4C */ f32 sp4C;                            /* inferred */
    /* 0x50 */ f32 sp50;                            /* inferred */
    /* 0x54 */ f32 sp54;                            /* inferred */
};                                                  /* size = 0x58 */

struct _mips2c_stack_func_809E4C34 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809E4C90 {
    /* 0x00 */ char pad_0[0x30];
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ char pad_3C[0x4];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_809E4E2C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809E4E80 {
    /* 0x00 */ char pad_0[0x34];
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ f32 *sp38;                           /* inferred */
    /* 0x3C */ char pad_3C[0x14];                   /* maybe part of sp38[6]? */
    /* 0x50 */ f32 sp50;                            /* inferred */
    /* 0x54 */ char pad_54[0x2];
    /* 0x56 */ s16 sp56;                            /* inferred */
    /* 0x58 */ char pad_58[0x2];
    /* 0x5A */ s16 sp5A;                            /* inferred */
    /* 0x5C */ f32 sp5C;                            /* inferred */
    /* 0x60 */ char pad_60[0x4];
    /* 0x64 */ f32 sp64;                            /* inferred */
    /* 0x68 */ char pad_68[0x4];
    /* 0x6C */ f32 sp6C;                            /* inferred */
    /* 0x70 */ f32 sp70;                            /* inferred */
    /* 0x74 */ f32 sp74;                            /* inferred */
    /* 0x78 */ f32 sp78;                            /* inferred */
    /* 0x7C */ char pad_7C[0x4];
};                                                  /* size = 0x80 */

struct _mips2c_stack_func_809E5ADC {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_809E5B64 {
    /* 0x00 */ char pad_0[0x44];
    /* 0x44 */ f32 *sp44;                           /* inferred */
    /* 0x48 */ f32 *sp48;                           /* inferred */
    /* 0x4C */ f32 sp4C;                            /* inferred */
    /* 0x50 */ char pad_50[0xC];                    /* maybe part of sp4C[4]? */
    /* 0x5C */ Actor *sp5C;                         /* inferred */
    /* 0x60 */ Camera *sp60;                        /* inferred */
    /* 0x64 */ f32 sp64;                            /* inferred */
    /* 0x68 */ char pad_68[0x10];                   /* maybe part of sp64[5]? */
    /* 0x78 */ f32 sp78;                            /* inferred */
    /* 0x7C */ f32 sp7C;                            /* inferred */
    /* 0x80 */ f32 sp80;                            /* inferred */
    /* 0x84 */ f32 sp84;                            /* inferred */
    /* 0x88 */ char pad_88[0x4];
    /* 0x8C */ f32 sp8C;                            /* inferred */
    /* 0x90 */ f32 sp90;                            /* inferred */
    /* 0x94 */ f32 sp94;                            /* inferred */
    /* 0x98 */ f32 sp98;                            /* inferred */
    /* 0x9C */ char pad_9C[0x2];
    /* 0x9E */ s16 sp9E;                            /* inferred */
};                                                  /* size = 0xA0 */

struct _mips2c_stack_func_809E65F4 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809E6640 {
    /* 0x00 */ char pad_0[0x40];
    /* 0x40 */ f32 *sp40;                           /* inferred */
    /* 0x44 */ CutsceneContext *sp44;               /* inferred */
    /* 0x48 */ char pad_48[0xC];                    /* maybe part of sp44[4]? */
    /* 0x54 */ Actor *sp54;                         /* inferred */
};                                                  /* size = 0x58 */

struct _mips2c_stack_func_809E69A4 {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ void (*sp18)(Actor *, GlobalContext *); /* inferred */
    /* 0x1C */ void *sp1C;                          /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_809E6A38 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_809E6B70 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809E6BC0 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_809E6CB4 {
    /* 0x00 */ char pad_0[0x30];
    /* 0x30 */ void (*sp30)(Actor *, GlobalContext *); /* inferred */
    /* 0x34 */ char pad_34[0x17];                   /* maybe part of sp30[6]? */
    /* 0x4B */ u8 sp4B;                             /* inferred */
    /* 0x4C */ char pad_4C[0x4];
};                                                  /* size = 0x50 */

struct _mips2c_stack_func_809E7920 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809E79C4 {};              /* size 0x0 */

struct _mips2c_stack_func_809E7AA8 {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ s8 *sp20;                            /* inferred */
    /* 0x24 */ ? sp24;                              /* inferred */
    /* 0x24 */ char pad_24[0x40];
    /* 0x64 */ void *sp64;                          /* inferred */
    /* 0x68 */ ? sp68;                              /* inferred */
    /* 0x68 */ char pad_68[0xF];
    /* 0x77 */ s8 sp77;                             /* inferred */
    /* 0x78 */ char pad_78[0x8];
};                                                  /* size = 0x80 */

struct _mips2c_stack_func_809E7D00 {
    /* 0x00 */ char pad_0[0x88];
    /* 0x88 */ ? sp88;                              /* inferred */
    /* 0x88 */ char pad_88[0xC];
    /* 0x94 */ f32 sp94;                            /* inferred */
    /* 0x98 */ f32 sp98;                            /* inferred */
    /* 0x9C */ f32 sp9C;                            /* inferred */
    /* 0xA0 */ char pad_A0[0x8];
};                                                  /* size = 0xA8 */

struct _mips2c_stack_func_809E81E4 {
    /* 0x00 */ char pad_0[0x48];
    /* 0x48 */ ? *sp48;                             /* inferred */
    /* 0x4C */ ? *sp4C;                             /* inferred */
    /* 0x50 */ char pad_50[0xC];                    /* maybe part of sp4C[4]? */
    /* 0x5C */ Gfx *sp5C;                           /* inferred */
    /* 0x60 */ char pad_60[0xC];                    /* maybe part of sp5C[4]? */
    /* 0x6C */ Gfx *sp6C;                           /* inferred */
    /* 0x70 */ char pad_70[0x4];
    /* 0x74 */ Gfx *sp74;                           /* inferred */
    /* 0x78 */ char pad_78[0xC];                    /* maybe part of sp74[4]? */
    /* 0x84 */ Gfx *sp84;                           /* inferred */
    /* 0x88 */ char pad_88[0x4];
    /* 0x8C */ Gfx *sp8C;                           /* inferred */
    /* 0x90 */ char pad_90[0x14];                   /* maybe part of sp8C[6]? */
    /* 0xA4 */ void *spA4;                          /* inferred */
    /* 0xA8 */ char pad_A8[0x10];
};                                                  /* size = 0xB8 */

struct _mips2c_stack_func_809E8810 {
    /* 0x00 */ char pad_0[0x50];
    /* 0x50 */ Actor *sp50;                         /* inferred */
    /* 0x54 */ char pad_54[0x1];
    /* 0x55 */ u8 sp55;                             /* inferred */
    /* 0x56 */ char pad_56[0xA];
};                                                  /* size = 0x60 */

struct _mips2c_stack_func_809E8BEC {
    /* 0x00 */ char pad_0[0x50];
};                                                  /* size = 0x50 */

? func_800BC848(Boss03 *, GlobalContext *, ?, ?);   /* extern */
? func_8016566C(?);                                 /* extern */
? func_80165690();                                  /* extern */
? func_80169940(GlobalContext *, s16, f32);         /* extern */
void func_809E2760(Vec3f *arg0, s32 arg1, void *);  /* static */
void func_809E2788(GlobalContext *arg0, f32 *arg1); /* static */
void func_809E2880(GlobalContext *arg0, f32 *arg1); /* static */
void func_809E299C(GlobalContext *arg0, void *arg1, ? *arg2); /* static */
void func_809E2AB4(GlobalContext *arg0, f32 *arg1); /* static */
void func_809E2B8C(s8 arg0, void *arg1, ? *arg2, s8); /* static */
void func_809E2C1C(s32 arg0, s32 arg1, s32 arg2);   /* static */
f32 func_809E2C3C();                                /* static */
void *func_809E2D64(GlobalContext *arg0);           /* static */
