? func_800BC848(Boss03 *, GlobalContext *, ?, ?);   /* extern */
? func_8016566C(?);                                 /* extern */
? func_80165690();                                  /* extern */
? func_80169940(GlobalContext *, s16, f32);         /* extern */
void func_809E2760(Vec3f *arg0, s32 arg1, void *);  /* static */
void func_809E2788(GlobalContext *arg0, f32 *arg1); /* static */
void func_809E2880(GlobalContext *arg0, f32 *arg1); /* static */
void func_809E299C(GlobalContext *arg0, void *arg1, Vec3f *arg2); /* static */
void func_809E2AB4(GlobalContext *arg0, f32 *arg1); /* static */
void func_809E2B8C(s8 arg0, void *arg1, Vec3f *arg2, s8); /* static */
void func_809E2C1C(s32 arg0, s32 arg1, s32 arg2);   /* static */
f32 func_809E2C3C();                                /* static */
Actor *func_809E2D64(GlobalContext *arg0);          /* static */
void func_809E2DA0(Boss03 *arg0, GlobalContext *arg1); /* static */
void func_809E38EC(Boss03 *arg0, GlobalContext *arg1); /* static */
void func_809E3D34(f32 arg0, Boss03 *arg1, GlobalContext *arg2, u8); /* static */
void func_809E4180(Boss03 *arg0, GlobalContext *arg1); /* static */
void func_809E4674(Boss03 *arg0, GlobalContext *arg1); /* static */
void func_809E4910(Boss03 *arg0, GlobalContext *arg1); /* static */
void func_809E4C34(f32 arg0, Boss03 *arg1, GlobalContext *); /* static */
void func_809E4E2C(Boss03 *arg0, GlobalContext *arg1); /* static */
void func_809E5ADC(Actor *arg0, GlobalContext *arg1); /* static */

s32 func_809E79C4(GlobalContext *arg0, s32 arg1, Gfx **arg2, Vec3f *arg3, Vec3s *arg4, Actor *arg5); /* static */
void func_809E7AA8(GlobalContext *arg0, s32 arg1, Gfx **arg2, Vec3s *arg3, Actor *arg4); /* static */
void func_809E7D00(GlobalContext *arg0);            /* static */
void func_809E81E4(GlobalContext *arg0);            /* static */
void func_809E8810(Actor *this, GlobalContext *globalCtx); /* static */
void func_809E8BEC(Actor *this, GlobalContext *globalCtx); /* static */
extern ? D_06004260;
extern ? D_060042B0;
extern ? D_060042F8;
extern ? D_06007E50;
extern ? D_06007EB0;
extern void D_06007EC8;
extern FlexSkeletonHeader D_060093A8;
extern AnimationHeader D_06009554;
extern AnimationHeader D_060099D0;
extern AnimationHeader D_06009C14;
extern AnimationHeader D_06009CF8;
extern AnimationHeader D_0600A6C8;
static ? D_809E8EA0;                                /* unable to generate initializer */
static ColliderJntSphElementInit D_809E8ECC = {
    {
        {3, {0xF7CFFFFF, 0, 8}, {0xF7CFFFFF, 0, 0}, 1, 1, 1},
        {0, {{0, 0, 0}, 0x46}, 0x64},
    },
    {
        {3, {0xF7CFFFFF, 0, 8}, {0xF7CFFFFF, 0, 0}, 1, 1, 1},
        {1, {{0, 0, 0}, 0x32}, 0x64},
    },
};
static ColliderJntSphInit D_809E8F14 = {{3, 0x11, 9, 9, 0x10, 0}, 2, &D_809E8ECC};
static ColliderJntSphElementInit D_809E8F24 = {
    {
        {3, {0xF7CFFFFF, 0, 8}, {0xF7CFFFFF, 0, 0}, 1, 1, 1},
        {2, {{0, 0, 0}, 0x14}, 0x64},
    },
    {
        {3, {0xF7CFFFFF, 0, 8}, {0xF7CFFFFF, 0, 0}, 1, 1, 1},
        {5, {{0, 0, 0}, 0x14}, 0x64},
    },
    {
        {3, {0xF7CFFFFF, 0, 8}, {0xF7CFFFFF, 0, 0}, 1, 1, 1},
        {6, {{0, 0, 0}, 0x46}, 0x64},
    },
    {
        {3, {0xF7CFFFFF, 0, 8}, {0xF7CFFFFF, 0, 0}, 1, 1, 1},
        {7, {{0, 0, 0}, 0x46}, 0x64},
    },
    {
        {3, {0xF7CFFFFF, 0, 8}, {0xF7CFFFFF, 0, 0}, 1, 1, 1},
        {8, {{0, 0, 0}, 0x1E}, 0x64},
    },
};
static ColliderJntSphInit D_809E8FD8 = {{9, 0x11, 9, 9, 0x10, 0}, 5, &D_809E8F24};
static ? D_809E8FE8;                                /* unable to generate initializer */
static Color_RGBA8 D_809E90FC = {0x3C, 0x32, 0x14, 0xFF};
static Color_RGBA8 D_809E9100 = {0x28, 0x1E, 0x1E, 0xFF};
static ? D_809E9104;                                /* unable to generate initializer */
static ? D_809E9128;                                /* unable to generate initializer */
static ? D_809E9136;                                /* unable to generate initializer */
static Vec3f D_809E9148 = {600.0f, -100.0f, 0.0f};
static ? D_809E9154;                                /* unable to generate initializer */
static Vec3f D_809E91A8 = {100000.0f, 100000.0f, 100000.0f};
static Vec3f D_809E91B4 = {300.0f, -100.0f, -200.0f};
static ? D_809E91C0;                                /* unable to generate initializer */
static u8 D_809E9840;
static u8 D_809E9841;
static u8 D_809E9842;
static Vec3f D_809E9848;
static void D_809E9858;
static s8 D_809E989C;
static ? D_809E98E0;
static Boss03 *D_809EC030;
static s32 D_809EC034;
static s32 D_809EC038;
static s32 D_809EC03C;

typedef struct Boss03 {
    /* 0x0000 */ Actor actor;
    /* 0x0144 */ char pad144[0x4];
    /* 0x0148 */ SkelAnime unk148;                  /* inferred */
    /* 0x018C */ Vec3s unk18C;                      /* inferred */
    /* 0x0192 */ char pad192[0x54];                 /* maybe part of unk18C[15]? */
    /* 0x01E6 */ Vec3s unk1E6;                      /* inferred */
    /* 0x01EC */ char pad1EC[0x54];                 /* maybe part of unk1E6[15]? */
    /* 0x0240 */ s16 unk240;                        /* inferred */
    /* 0x0242 */ u8 unk242;                         /* inferred */
    /* 0x0243 */ char pad243[0x9];                  /* maybe part of unk242[10]? */
    /* 0x024C */ s16 unk24C;                        /* inferred */
    /* 0x024E */ s16 unk24E;                        /* inferred */
    /* 0x0250 */ s16 unk250;                        /* inferred */
    /* 0x0252 */ s8 unk252;                         /* inferred */
    /* 0x0253 */ u8 unk253;                         /* inferred */
    /* 0x0254 */ s16 unk254;                        /* inferred */
    /* 0x0256 */ char pad256[0x2];                  /* maybe part of unk254[2]? */
    /* 0x0258 */ f32 unk258;                        /* inferred */
    /* 0x025C */ s16 unk25C;                        /* inferred */
    /* 0x025E */ s16 unk25E;                        /* inferred */
    /* 0x0260 */ f32 unk260;                        /* inferred */
    /* 0x0264 */ char pad264[0x4];                  /* maybe part of unk260[2]? */
    /* 0x0268 */ f32 unk268;                        /* inferred */
    /* 0x026C */ f32 unk26C;                        /* inferred */
    /* 0x0270 */ f32 unk270;                        /* inferred */
    /* 0x0274 */ s16 unk274;                        /* inferred */
    /* 0x0276 */ s16 unk276;                        /* inferred */
    /* 0x0278 */ f32 unk278;                        /* inferred */
    /* 0x027C */ f32 unk27C;                        /* inferred */
    /* 0x0280 */ s16 unk280;                        /* inferred */
    /* 0x0282 */ char pad282[0x2];                  /* maybe part of unk280[2]? */
    /* 0x0284 */ f32 unk284;                        /* inferred */
    /* 0x0288 */ f32 unk288;                        /* inferred */
    /* 0x028C */ f32 unk28C;                        /* inferred */
    /* 0x0290 */ u8 unk290;                         /* inferred */
    /* 0x0291 */ char pad291[0x3];                  /* maybe part of unk290[4]? */
    /* 0x0294 */ f32 unk294;                        /* inferred */
    /* 0x0298 */ f32 unk298;                        /* inferred */
    /* 0x029C */ s16 unk29C;                        /* inferred */
    /* 0x029E */ s16 unk29E;                        /* inferred */
    /* 0x02A0 */ s16 unk2A0;                        /* inferred */
    /* 0x02A2 */ char pad2A2[0x2];                  /* maybe part of unk2A0[2]? */
    /* 0x02A4 */ s16 unk2A4;                        /* inferred */
    /* 0x02A6 */ char pad2A6[0x2];                  /* maybe part of unk2A4[2]? */
    /* 0x02A8 */ s16 unk2A8;                        /* inferred */
    /* 0x02AA */ char pad2AA[0x2];                  /* maybe part of unk2A8[2]? */
    /* 0x02AC */ f32 unk2AC;                        /* inferred */
    /* 0x02B0 */ f32 unk2B0;                        /* inferred */
    /* 0x02B4 */ f32 unk2B4;                        /* inferred */
    /* 0x02B8 */ f32 unk2B8;                        /* inferred */
    /* 0x02BC */ u8 unk2BC;                         /* inferred */
    /* 0x02BD */ u8 unk2BD;                         /* inferred */
    /* 0x02BE */ s16 unk2BE;                        /* inferred */
    /* 0x02C0 */ char pad2C0[0x4];                  /* maybe part of unk2BE[3]? */
    /* 0x02C4 */ f32 unk2C4;                        /* inferred */
    /* 0x02C8 */ f32 unk2C8;                        /* inferred */
    /* 0x02CC */ f32 unk2CC;                        /* inferred */
    /* 0x02D0 */ f32 unk2D0;                        /* inferred */
    /* 0x02D4 */ u8 unk2D4;                         /* inferred */
    /* 0x02D5 */ u8 unk2D5;                         /* inferred */
    /* 0x02D6 */ s16 unk2D6;                        /* inferred */
    /* 0x02D8 */ s16 unk2D8;                        /* inferred */
    /* 0x02DA */ s16 unk2DA;                        /* inferred */
    /* 0x02DC */ char pad2DC[0x48];                 /* maybe part of unk2DA[37]? */
    /* 0x0324 */ s16 unk324;                        /* inferred */
    /* 0x0326 */ char pad326[0x2];                  /* maybe part of unk324[2]? */
    /* 0x0328 */ void (*actionFunc)(Boss03 *, GlobalContext *);
    /* 0x032C */ ColliderJntSph unk32C;             /* inferred */
    /* 0x034C */ ColliderJntSphElement unk34C;      /* inferred */
    /* 0x038C */ char pad38C[0x40];                 /* maybe part of unk34C[2]? */
    /* 0x03CC */ ColliderJntSph unk3CC;             /* inferred */
    /* 0x03EC */ ColliderJntSphElement unk3EC;      /* inferred */
    /* 0x042C */ char pad42C[0x100];                /* maybe part of unk3EC[5]? */
    /* 0x052C */ f32 unk52C;                        /* inferred */
    /* 0x0530 */ u32 unk530;                        /* inferred */
    /* 0x0534 */ u16 unk534;                        /* inferred */
    /* 0x0536 */ s16 unk536;                        /* inferred */
    /* 0x0538 */ f32 unk538;                        /* inferred */
    /* 0x053C */ f32 unk53C;                        /* inferred */
    /* 0x0540 */ f32 unk540;                        /* inferred */
    /* 0x0544 */ f32 unk544;                        /* inferred */
    /* 0x0548 */ f32 unk548;                        /* inferred */
    /* 0x054C */ f32 unk54C;                        /* inferred */
    /* 0x0550 */ Vec3f unk550;                      /* inferred */
    /* 0x055C */ f32 unk55C;                        /* inferred */
    /* 0x0560 */ f32 unk560;                        /* inferred */
    /* 0x0564 */ f32 unk564;                        /* inferred */
    /* 0x0568 */ f32 unk568;                        /* inferred */
    /* 0x056C */ f32 unk56C;                        /* inferred */
    /* 0x0570 */ f32 unk570;                        /* inferred */
    /* 0x0574 */ char pad574[0x4];                  /* maybe part of unk570[2]? */
    /* 0x0578 */ f32 unk578;                        /* inferred */
} Boss03;                                           /* size 0x57C */

void func_809E2760(Vec3f *arg0, s32 arg1) {
    func_8019F420(arg0, arg1 & 0xFFFF);
}

void func_809E2788(GlobalContext *arg0, f32 *arg1) {
    void *sp18;
    s16 temp_v0;
    u8 temp_v1;
    void *phi_a2;
    s16 phi_v0;

    phi_a2 = arg0->specialEffects;
    phi_v0 = 0;
loop_1:
    temp_v1 = phi_a2->unk0;
    temp_v0 = phi_v0 + 1;
    phi_v0 = temp_v0;
    if ((temp_v1 == 0) || (temp_v1 == 1)) {
        phi_a2->unk0 = 4U;
        phi_a2->unk4 = (s32) arg1->unk0;
        phi_a2->unk8 = (s32) arg1->unk4;
        phi_a2->unkC = (s32) arg1->unk8;
        phi_a2->unk34 = 0.1f;
        phi_a2->unk38 = 0.4f;
        phi_a2->unk10 = (f32) D_801D15B0.x;
        phi_a2->unk14 = (f32) D_801D15B0.y;
        phi_a2->unk18 = (f32) D_801D15B0.z;
        phi_a2->unk1C = (f32) D_801D15B0.x;
        phi_a2->unk20 = (f32) D_801D15B0.y;
        phi_a2->unk2C = 0x96;
