typedef struct EnSth2 {
    /* 0x000 */ Actor actor;
    /* 0x144 */ SkelAnime unk_144;                  /* inferred */
    /* 0x188 */ Vec3s unk_188;                      /* inferred */
    /* 0x18E */ char pad_18E[0x5A];                 /* maybe part of unk_188[16]? */
    /* 0x1E8 */ Vec3s unk_1E8;                      /* inferred */
    /* 0x1EE */ char pad_1EE[0x5A];                 /* maybe part of unk_1E8[16]? */
    /* 0x248 */ s16 unk_248;                        /* inferred */
    /* 0x24A */ u8 unk_24A;                         /* inferred */
    /* 0x24B */ char pad_24B[0x1];
    /* 0x24C */ void (*unk_24C)(s32, ?);            /* inferred */
} EnSth2;                                           /* size = 0x250 */

struct _mips2c_stack_EnSth2_Destroy {};             /* size 0x0 */

struct _mips2c_stack_EnSth2_Init {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_EnSth2_Update {
    /* 0x00 */ char pad_0[0x34];
    /* 0x34 */ SkelAnime *sp34;                     /* inferred */
    /* 0x38 */ char pad_38[0x8];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80BF75A0 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80BF7688 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80BF76AC {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ s32 sp1C;                            /* inferred */
    /* 0x20 */ char pad_20[0x8];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80BF77AC {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80BF7814 {
    /* 0x00 */ char pad_0[0x28];
    /* 0x28 */ Gfx *sp28;                           /* inferred */
    /* 0x2C */ Gfx *sp2C;                           /* inferred */
    /* 0x30 */ char pad_30[0x4];
    /* 0x34 */ GraphicsContext *sp34;               /* inferred */
    /* 0x38 */ char pad_38[0x8];
};                                                  /* size = 0x40 */

void func_80BF75A0(s32 arg0, ? arg1);               /* static */
void func_80BF7688(Actor *this, GlobalContext *globalCtx); /* static */
s32 func_80BF76AC(GlobalContext *arg0, s32 arg1, Gfx **arg2, Vec3f *arg3, Vec3s *arg4, Actor *actor); /* static */
void func_80BF77AC(void **arg0, s32 arg1, Gfx **arg2, Vec3s *arg3, Actor *arg4); /* static */
void func_80BF7814(Actor *this, GlobalContext *globalCtx); /* static */
extern FlexSkeletonHeader D_060031F8;
static ? D_80BF7940;                                /* unable to generate initializer */
static ? D_80BF79C0;                                /* unable to generate initializer */
static ? D_80BF7AC0;                                /* unable to generate initializer */
static ? D_80BF7B40;                                /* unable to generate initializer */
static ? D_80BF7BC0;                                /* unable to generate initializer */
static ? D_80BF83C0;                                /* unable to generate initializer */
static ? D_80BF88C0;                                /* unable to generate initializer */
static ? D_80BF8950;                                /* unable to generate initializer */
static ? D_80BF8A90;                                /* unable to generate initializer */
static ? D_80BF8AC0;                                /* unable to generate initializer */
static ? D_80BF8B20;                                /* unable to generate initializer */
static ? D_80BF8D20;                                /* unable to generate initializer */
static ? D_80BF8E50;                                /* unable to generate initializer */
static Gfx D_80BF9550[100] = {
    {{0xD7000002, 0xFFFFFFFF}},
    {{0xE7000000, 0}},
    {{0xE200001C, 0xC8112078}},
    {{0xFC127E60, 0xFFFFF3F8}},
    {{0xE3001001, 0}},
    {{0xFD100000, (u32) &D_80BF83C0}},
    {{0xF5100000, 0x70D0350}},
    {{0xE6000000, 0}},
    {{0xF3000000, 0x71FF100}},
    {{0xE7000000, 0}},
    {{0xF5101000, 0xD0350}},
    {{0xF2000000, 0x7C03C}},
    {{0xFA000080, 0xFFFFFFFF}},
    {{0xD9000000, 0x230405}},
    {{0x1009012, (u32) &D_80BF88C0}},
    {{0x6000204, 0x20604}},
    {{0x6040800, 0x80A00}},
    {{0x6080C0A, 0xA0E}},
    {{0x60A0C0E, 0x100200}},
    {{0x5100602, 0}},
    {{0xE7000000, 0}},
    {{0xFD100000, (u32) &D_80BF7BC0}},
    {{0xF5100000, 0x70D4350}},
    {{0xE6000000, 0}},
    {{0xF3000000, 0x73FF100}},
    {{0xE7000000, 0}},
    {{0xF5101000, 0xD4350}},
    {{0xF2000000, 0x7C07C}},
    {{0x1014028, (u32) &D_80BF8950}},
    {{0x6000204, 0x6080A}},
    {{0x60C080E, 0xA080C}},
    {{0x60C0E10, 0x121416}},
    {{0x6181412, 0x1A021C}},
    {{0x61E1A1C, 0x202224}},
    {{0x6242226, 0x1C0200}},
    {{0xE7000000, 0}},
    {{0xFD100000, (u32) &D_80BF7B40}},
    {{0xF5100000, 0x70CC130}},
    {{0xE6000000, 0}},
    {{0xF3000000, 0x703F400}},
    {{0xE7000000, 0}},
    {{0xF5100400, 0xCC130}},
    {{0xF2000000, 0x1C01C}},
    {{0x1003006, (u32) &D_80BF8A90}},
    {{0x5000204, 0}},
    {{0xE7000000, 0}},
    {{0xFD100000, (u32) &D_80BF7AC0}},
    {{0xF5100000, 0x70CC330}},
    {{0xE6000000, 0}},
    {{0xF3000000, 0x703F400}},
    {{0xE7000000, 0}},
    {{0xF5100400, 0xCC330}},
    {{0xF2000000, 0x1C01C}},
    {{0x100600C, (u32) &D_80BF8AC0}},
    {{0x6000204, 0x6080A}},
    {{0xE7000000, 0}},
    {{0xFD100000, (u32) &D_80BF79C0}},
    {{0xF5100000, 0x70D0030}},
    {{0xE6000000, 0}},
    {{0xF3000000, 0x707F400}},
    {{0xE7000000, 0}},
    {{0xF5100400, 0xD0030}},
    {{0xF2000000, 0x1C03C}},
    {{0x1020040, (u32) &D_80BF8B20}},
    {{0x6000204, 0x6080A}},
    {{0x60A0802, 0xC0200}},
    {{0x60C0A02, 0xE060A}},
    {{0x6100E0C, 0xE0A0C}},
    {{0x6060E12, 0xE1012}},
    {{0x6101412, 0x16181A}},
    {{0x61C161A, 0x1E2022}},
    {{0x61E2420, 0x26282A}},
    {{0x62C2E30, 0x40832}},
    {{0x6323404, 0x121436}},
    {{0x6380612, 0x123A38}},
    {{0x63C3E04, 0x141036}},
    {{0x63C003E, 0x36100C}},
    {{0x50C003C, 0}},
    {{0x1013026, (u32) &D_80BF8D20}},
    {{0x6000204, 0x6080A}},
    {{0x60C0E10, 0xE1210}},
    {{0x6141618, 0x141A16}},
    {{0x61C1E20, 0x222420}},
    {{0xE7000000, 0}},
    {{0xFD100000, (u32) &D_80BF7940}},
    {{0xF5100000, 0x70CC330}},
    {{0xE6000000, 0}},
    {{0xF3000000, 0x703F400}},
    {{0xE7000000, 0}},
    {{0xF5100400, 0xCC330}},
    {{0xF2000000, 0x1C01C}},
    {{0x101F03E, (u32) &D_80BF8E50}},
    {{0x6000204, 0x20604}},
    {{0x6060208, 0xA0802}},
    {{0x60C020E, 0x101214}},
    {{0x616181A, 0x1C1E20}},
    {{0x6222426, 0x282A2C}},
    {{0x60A0200, 0x2E3032}},
    {{0x6343638, 0x3A3C16}},
    {{0xDF000000, 0}},
};
static ? D_80BF9870;                                /* unable to generate initializer */
static s16 D_80BF99F8[724] = {
    0,
    0x8FF,
    0xC000,
    0x8FF,
    0x9DD,
    0xB7C,
    0xC62,
    0xB95,
    0xA10,
    0x94C,
    0x9E6,
    0xB1E,
    0xC60,
    0xD1C,
    0xD53,
    0xD6D,
    0xD6E,
    0xD5C,
    0xD3A,
    0xD0C,
    0xCD7,
    0xCA0,
    0xC5C,
    0xC05,
    0xB9E,
    0xB2F,
    0xABC,
    0xA4B,
    0x9E3,
    0x988,
    0x93F,
    0x910,
    0x8FF,
    0,
    0x2F,
    0x87,
    0xB7,
    0x87,
    0x2F,
    0,
    0x1D,
    0x5B,
    0x9A,
    0xB7,
    0xB0,
    0x9E,
    0x84,
    0x65,
    0x45,
    0x27,
    0xF,
    0,
    0xFFF8,
    0xFFF3,
    0xFFF1,
    0xFFF0,
    0xFFF2,
    0xFFF4,
    0xFFF7,
    0xFFFA,
    0xFFFD,
    0xFFFF,
    0,
    0xC81,
    0x506,
    0xF8FC,
    0xF308,
    0xF854,
    0x374,
    0x9DD,
    0x4CE,
    0xFB9E,
    0xF32F,
    0xEE40,
    0xEC9C,
    0xEBBE,
    0xEBC7,
    0xEC8C,
    0xEDBB,
    0xEF1E,
    0xF095,
    0xF20A,
    0xF3C1,
    0xF5F6,
    0xF891,
    0xFB7D,
    0xFE9F,
    0x1DA,
    0x504,
    0x7E9,
    0xA4C,
    0xBEA,
    0xC81,
    0xDD2B,
    0xDE1C,
    0xE1B2,
    0xE4E4,
    0xE200,
    0xDE75,
    0xDD7B,
    0xDE3A,
    0xE0B3,
    0xE4D8,
    0xE8AC,
    0xEA53,
    0xEB50,
    0xEB53,
    0xEA8A,
    0xE966,
    0xE82F,
    0xE706,
    0xE5F8,
    0xE4D8,
    0xE391,
    0xE245,
    0xE10D,
    0xDFF7,
    0xDF0D,
    0xDE54,
    0xDDCB,
    0xDD70,
    0xDD3C,
    0xDD2B,
    0xCC69,
    0xD5FA,
    0xE662,
    0xEF82,
    0xE741,
    0xD7CF,
    0xCF65,
    0xD5D7,
    0xE233,
    0xEED7,
    0xF75C,
    0xFA5C,
    0xFBDB,
    0xFB74,
    0xF97F,
    0xF6CB,
    0xF3DD,
    0xF0FE,
    0xEE5E,
    0xEB8E,
    0xE82C,
    0xE470,
    0xE07F,
    0xDC7C,
    0xD889,
    0xD4D0,
    0xD181,
    0xCED6,
    0xCD0E,
    0xCC69,
    0x471F,
    0x4037,
    0x303A,
    0x2450,
    0x2F13,
    0x3E80,
    0x44D4,
    0x3FED,
    0x345D,
    0x248D,
    0x16E4,
    0x110F,
    0xD94,
    0xD8D,
    0x1062,
    0x147C,
    0x18DD,
    0x1D16,
    0x20EF,
    0x2515,
    0x29DF,
    0x2EDA,
    0x33BB,
    0x3850,
    0x3C74,
    0x400B,
    0x42FE,
    0x4536,
    0x469F,
    0x471F,
    0xE9BF,
    0xEABE,
    0xECA4,
    0xEDD2,
    0xED52,
    0xEC19,
    0xEB60,
    0xEBE3,
    0xECE6,
    0xED69,
    0xED52,
    0xED32,
    0xED09,
    0xECD9,
    0xECA4,
    0xEC69,
    0xEC2B,
    0xEBEB,
    0xEBA9,
    0xEB67,
    0xEB25,
    0xEAE6,
    0xEAAA,
    0xEA73,
    0xEA40,
    0xEA15,
    0xE9F1,
    0xE9D6,
    0xE9C5,
    0xE9BF,
    0xFD3D,
    0xFB20,
    0xF869,
    0xF761,
    0xF84E,
    0xFAC2,
    0xFC81,
    0xFB22,
    0xF903,
    0xF77C,
    0xF6D7,
    0xF6B8,
    0xF6B4,
    0xF6C6,
    0xF6E6,
    0xF712,
    0xF746,
    0xF77D,
    0xF7B4,
    0xF7F5,
    0xF84D,
    0xF8BD,
    0xF944,
    0xF9E1,
    0xFA91,
    0xFB4B,
    0xFC01,
    0xFCA1,
    0xFD12,
    0xFD3D,
    0xB14B,
    0xB21B,
    0xB631,
    0xBA68,
    0xB6A1,
    0xB293,
    0xB1BB,
    0xB275,
    0xB53A,
    0xBA9F,
    0xC043,
    0xC2FF,
    0xC4CD,
    0xC514,
    0xC413,
    0xC288,
    0xC0E3,
    0xBF4F,
    0xBDD8,
    0xBC3B,
    0xBA63,
    0xB88A,
    0xB6D0,
    0xB549,
    0xB401,
    0xB2FC,
    0xB239,
    0xB1B3,
    0xB165,
    0xB14B,
    0xF374,
    0xFAF2,
    0x701,
    0xCF6,
    0x7A9,
    0xFC85,
    0xF61A,
    0xFB2B,
    0x45E,
    0xCCF,
    0x11C0,
    0x1366,
    0x1443,
    0x143B,
    0x1375,
    0x1245,
    0x10E2,
    0xF6B,
    0xDF5,
    0xC3D,
    0xA07,
    0x76B,
    0x47F,
    0x15C,
    0xFE20,
    0xFAF5,
    0xF80E,
    0xF5AB,
    0xF40C,
    0xF374,
    0x22D8,
    0x21E7,
    0x1E52,
    0x1B1F,
    0x1E04,
    0x218F,
    0x2288,
    0x21C9,
    0x1F51,
    0x1B2B,
    0x1756,
    0x15AE,
    0x14B2,
    0x14AE,
    0x1578,
    0x169D,
    0x17D4,
    0x18FD,
    0x1A0B,
    0x1B2B,
    0x1C73,
    0x1DBE,
    0x1EF7,
    0x200D,
    0x20F6,
    0x21B0,
    0x2238,
    0x2293,
    0x22C7,
    0x22D8,
    0xCC5E,
    0xD5F3,
    0xE660,
    0xEF82,
    0xE73E,
    0xD7C8,
    0xCF5B,
    0xD5CF,
    0xE230,
    0xEED6,
    0xF75E,
    0xFA5E,
    0xFBDE,
    0xFB77,
    0xF981,
    0xF6CC,
    0xF3DE,
    0xF0FE,
    0xEE5E,
    0xEB8C,
    0xE82A,
    0xE46C,
    0xE07B,
    0xDC77,
    0xD883,
    0xD4C8,
    0xD178,
    0xCECC,
    0xCD04,
    0xCC5E,
    0x4721,
    0x4039,
    0x303B,
    0x2450,
    0x2F13,
    0x3E82,
    0x44D7,
    0x3FEF,
    0x345E,
    0x248D,
    0x16E2,
    0x110B,
    0xD8E,
    0xD87,
    0x105E,
    0x1479,
    0x18DB,
    0x1D14,
    0x20EF,
    0x2515,
    0x29DF,
    0x2EDB,
    0x33BD,
    0x3852,
    0x3C76,
    0x400D,
    0x4300,
    0x4539,
    0x46A2,
    0x4721,
    0x1525,
    0x1449,
    0x12B3,
    0x11E3,
    0x12DA,
    0x1496,
    0x158D,
    0x14BE,
    0x1329,
    0x124B,
    0x124C,
    0x1258,
    0x126D,
    0x128B,
    0x12B0,
    0x12DB,
    0x130B,
    0x133F,
    0x1375,
    0x13AD,
    0x13E4,
    0x141B,
    0x1450,
    0x1482,
    0x14AF,
    0x14D6,
    0x14F7,
    0x1510,
    0x1520,
    0x1525,
    0x133,
    0x349,
    0x5F3,
    0x6F4,
    0x60D,
    0x3A4,
    0x1EB,
    0x345,
    0x55A,
    0x6D7,
    0x777,
    0x794,
    0x795,
    0x782,
    0x760,
    0x733,
    0x6FF,
    0x6C8,
    0x692,
    0x653,
    0x5FD,
    0x591,
    0x50E,
    0x476,
    0x3CC,
    0x318,
    0x266,
    0x1CB,
    0x15D,
    0x133,
    0xAFF7,
    0xB0CE,
    0xB4F3,
    0xB933,
    0xB565,
    0xB14A,
    0xB06C,
    0xB12C,
    0xB3FC,
    0xB96E,
    0xBF1A,
    0xC1DA,
    0xC3AC,
    0xC3F6,
    0xC2F7,
    0xC16D,
    0xBFC8,
    0xBE34,
    0xBCBB,
    0xBB1B,
    0xB940,
    0xB761,
    0xB5A1,
    0xB413,
    0xB2C4,
    0xB1B8,
    0xB0EE,
    0xB064,
    0xB012,
    0xAFF7,
    0x85B4,
    0x82A4,
    0x7CF4,
    0x79E3,
    0x7CE3,
    0x8283,
    0x85B4,
    0x858E,
    0x84AE,
    0x834F,
    0x81AC,
    0x8000,
    0x7E86,
    0x7D78,
    0x7D11,
    0x7D2D,
    0x7D7C,
    0x7DF7,
    0x7E94,
    0x7F4E,
    0x801B,
    0x80F4,
    0x81D1,
    0x82AA,
    0x8377,
    0x8430,
    0x84CE,
    0x8549,
    0x8598,
    0x85B4,
    0,
    0,
    0x8000,
    0x8000,
    0x8000,
    0,
    0,
    0,
    0,
    0x8000,
    0x8000,
    0x8000,
    0x8000,
    0x8000,
    0x8000,
    0x8000,
    0x8000,
    0x8000,
    0x8000,
    0x8000,
    0x8000,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0xE4AB,
    0xD131,
    0xD321,
    0xE71D,
    0xD4D8,
    0xCDC2,
    0xE021,
    0xD7CC,
    0xC4D1,
    0xD19B,
    0xE444,
    0xEBF5,
    0xEB10,
    0xE8E1,
    0xE593,
    0xE14E,
    0xDC3C,
    0xD687,
    0xD058,
    0xC9D9,
    0xC333,
    0xC370,
    0xC9E7,
    0xD008,
    0xD5A9,
    0xDAA1,
    0xDEC7,
    0xE1F1,
    0xE3F6,
    0xE4AB,
    0x8000,
    0x8000,
    0,
    0,
    0,
    0x8000,
    0x8000,
    0x8000,
    0x8000,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0x8000,
    0x8000,
    0x8000,
    0x8000,
    0x8000,
    0x8000,
    0x8000,
    0x8000,
    0x8000,
    0,
    0,
    0x8000,
    0x8000,
    0x8000,
    0,
    0,
    0,
    0,
    0x8000,
    0x8000,
    0x8000,
    0x8000,
    0x8000,
    0x8000,
    0x8000,
    0x8000,
    0x8000,
    0x8000,
    0x8000,
    0x8000,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0x1B55,
    0x2ECF,
    0x2CDF,
    0x18E3,
    0x2B28,
    0x323E,
    0x1FDF,
    0x2834,
    0x3B2F,
    0x2E65,
    0x1BBC,
    0x140B,
    0x14F0,
    0x171F,
    0x1A6D,
    0x1EB2,
    0x23C4,
    0x2979,
    0x2FA8,
    0x3627,
    0x3CCD,
    0x3C90,
    0x3619,
    0x2FF8,
    0x2A57,
    0x255F,
    0x2139,
    0x1E0F,
    0x1C0A,
    0x1B55,
    0x8000,
    0x8000,
    0,
    0,
    0,
    0x8000,
    0x8000,
    0x8000,
    0x8000,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0x8000,
    0x8000,
    0x8000,
    0x8000,
    0x8000,
    0x8000,
    0x8000,
    0x8000,
    0x8000,
    0,
    0x289,
    0x73E,
    0x9C7,
    0x89B,
    0x5D5,
    0x297,
    0,
    0xFE01,
    0xFBE4,
    0xF9D2,
    0xF7F1,
    0xF669,
    0xF561,
    0xF500,
    0xF524,
    0xF589,
    0xF625,
    0xF6EE,
    0xF7DA,
    0xF8DF,
    0xF9F3,
    0xFB0D,
    0xFC21,
    0xFD26,
    0xFE12,
    0xFEDB,
    0xFF77,
    0xFFDC,
    0,
    0,
};
static JointIndex D_80BF9FA0[16] = {
    {0, 3, 0x21},
    {2, 0, 2},
    {0x3F, 0x5D, 0x7B},
    {0, 0, 0x99},
    {0xB7, 0xD5, 0xF3},
    {0x111, 0x12F, 0x14D},
    {0, 0, 0x16B},
    {0x189, 0x1A7, 0x1C5},
    {0, 0, 0x1E3},
    {0x201, 0x21F, 0x23D},
    {0, 0, 0},
    {0, 0, 0},
    {0x25B, 0x279, 0x297},
    {0, 0, 0},
    {0, 0, 0},
    {0, 0, 0x2B5},
};
static AnimationHeader D_80BFA000 = {{0x1E, 0}, &D_80BF99F8, &D_80BF9FA0, 3};
static Vec3f D_80BFA010 = {700.0f, 400.0f, 0.0f};
static ? D_80BFA01C;                                /* unable to generate initializer */

void EnSth2_Init(Actor *thisx, GlobalContext *globalCtx) {
    EnSth2 *this = (EnSth2 *) thisx;
    this->unk_24A = Object_GetIndex(&globalCtx->objectCtx, 0x26A);
    Actor_SetScale((Actor *) this, 0.01f);
    ActorShape_Init(&this->actor.shape, 0.0f, func_800B3FC0, 36.0f);
    this->unk_248 = 0;
    if ((globalCtx->actorCtx.unk5 & 2) != 0) {
        this->actor.flags |= 0x30;
        this->unk_24C = func_80BF75A0;
        return;
    }
    Actor_MarkForDeath((Actor *) this);
}

void EnSth2_Destroy(Actor *thisx, GlobalContext *globalCtx) {
    EnSth2 *this = (EnSth2 *) thisx;

}

void func_80BF75A0(s32 arg0, ? arg1) {
    SkelAnime_FrameUpdateMatrix(arg0 + 0x144);
}

void EnSth2_Update(Actor *thisx, GlobalContext *globalCtx) {
    SkelAnime *sp34;
    SkelAnime *temp_a1;
    EnSth2 *this = (EnSth2 *) thisx;

    if (Object_IsLoaded(&globalCtx->objectCtx, (s32) this->unk_24A) != 0) {
        this->actor.objBankIndex = (s8) this->unk_24A;
        Actor_SetObjectSegment(globalCtx, (Actor *) this);
        temp_a1 = &this->unk_144;
        sp34 = temp_a1;
        SkelAnime_InitSV(globalCtx, temp_a1, &D_060031F8, &D_80BFA000, &this->unk_188, &this->unk_1E8, 0x10);
        SkelAnime_ChangeAnimDefaultRepeat(sp34, &D_80BFA000);
        this->actor.update = func_80BF7688;
        this->actor.draw = func_80BF7814;
    }
}

void func_80BF7688(Actor *this, GlobalContext *globalCtx) {
    this->unk_24C();
}

s32 func_80BF76AC(GlobalContext *arg0, s32 arg1, Gfx **arg2, Vec3f *arg3, Vec3s *arg4) {
    s32 sp1C;
    s32 temp_v0;

    if (arg1 == 0xF) {
        *arg2 = D_80BF9550;
    }
    if ((arg1 == 8) || (arg1 == 0xA) || (arg1 == 0xD)) {
        temp_v0 = arg1 * 0x32;
        sp1C = temp_v0;
        arg4->y += (s32) (Math_SinS((s16) (arg0->state.frames * (temp_v0 + 0x814))) * 200.0f);
        arg4->z += (s32) (Math_CosS((s16) (arg0->state.frames * (temp_v0 + 0x940))) * 200.0f);
    }
    return 0;
}

void func_80BF77AC(void **arg0, s32 arg1, Gfx **arg2, Vec3s *arg3, Actor *arg4) {
    void *temp_a0;
    void *temp_v1;

    if (arg1 == 0xF) {
        SysMatrix_MultiplyVector3fByState(&D_80BFA010, arg4 + 0x3C);
        temp_a0 = *arg0;
        temp_v1 = temp_a0->unk_2B0;
        temp_a0->unk_2B0 = (void *) (temp_v1 + 8);
        temp_v1->unk_4 = &D_80BF9870;
        temp_v1->unk_0 = 0xDE000000;
    }
}

void func_80BF7814(Actor *this, GlobalContext *globalCtx) {
    GraphicsContext *sp34;
    Gfx *sp2C;
    Gfx *sp28;
    Gfx *temp_v0;
    Gfx *temp_v0_2;
    GraphicsContext *temp_a0;

    temp_a0 = globalCtx->state.gfxCtx;
    sp34 = temp_a0;
    func_8012C28C(temp_a0);
    temp_v0 = sp34->polyOpa.p;
    sp34->polyOpa.p = temp_v0 + 8;
    temp_v0->words.w0 = 0xDB060020;
    sp34 = sp34;
    sp2C = temp_v0;
    sp2C->words.w1 = Gfx_EnvColor(globalCtx->state.gfxCtx, (s32) D_80BFA01C.unk_3, (s32) D_80BFA01C.unk_4, (s32) D_80BFA01C.unk_5, 0xFF);
    temp_v0_2 = sp34->polyOpa.p;
    sp34->polyOpa.p = temp_v0_2 + 8;
    temp_v0_2->words.w0 = 0xDB060024;
    sp28 = temp_v0_2;
    sp28->words.w1 = Gfx_EnvColor(globalCtx->state.gfxCtx, 0x5A, 0x6E, 0x82, 0xFF);
    SkelAnime_DrawSV(globalCtx, this->unk_148, this->unk_164, (s32) this->unk_146, func_80BF76AC, (void (*)(GlobalContext *, s32, Gfx **, Vec3s *, Actor *)) func_80BF77AC, this);
}
