typedef struct DmStk {
    /* 0x000 */ Actor actor;
    /* 0x144 */ ObjectContext unk_144;              /* inferred */
    /* 0x290 */ void (*actionFunc)(DmStk *, GlobalContext *); /* overlap */
    /* 0x294 */ ColliderCylinder unk_294;           /* overlap; inferred */
    /* 0x2E0 */ s16 unk_2E0;                        /* overlap; inferred */
    /* 0x2E4 */ s32 unk_2E4;                        /* overlap; inferred */
    /* 0x2E8 */ s32 unk_2E8;                        /* overlap; inferred */
    /* 0x2EC */ s32 unk_2EC;                        /* overlap; inferred */
    /* 0x2F0 */ s32 unk_2F0;                        /* overlap; inferred */
    /* 0x2F8 */ s32 unk_2F8;                        /* overlap; inferred */
    /* 0x2FC */ s32 unk_2FC;                        /* overlap; inferred */
    /* 0x300 */ f32 unk_300;                        /* overlap; inferred */
    /* 0x328 */ u16 unk_328;                        /* overlap; inferred */
    /* 0x32C */ s8 unk_32C;                         /* overlap; inferred */
    /* 0x32D */ s8 unk_32D;                         /* overlap; inferred */
    /* 0x32E */ s8 unk_32E;                         /* overlap; inferred */
    /* 0x32F */ s8 unk_32F;                         /* overlap; inferred */
    /* 0x330 */ s32 unk_330;                        /* overlap; inferred */
    /* 0x334 */ s8 unk_334;                         /* overlap; inferred */
    /* 0x335 */ s8 unk_335;                         /* overlap; inferred */
    /* 0x336 */ s8 unk_336;                         /* overlap; inferred */
    /* 0x337 */ s8 unk_337;                         /* overlap; inferred */
    /* 0x338 */ s8 unk_338;                         /* overlap; inferred */
    /* 0x339 */ u8 unk_339;                         /* overlap; inferred */
    /* 0x33A */ u8 unk_33A;                         /* overlap; inferred */
    /* 0x33B */ u8 unk_33B;                         /* overlap; inferred */
} DmStk;                                            /* size = 0x33C */

struct _mips2c_stack_DmStk_Destroy {};              /* size 0x0 */

struct _mips2c_stack_DmStk_Draw {
    /* 0x00 */ char pad_0[0x38];
};                                                  /* size = 0x38 */

struct _mips2c_stack_DmStk_Init {
    /* 0x00 */ char pad_0[0x30];
    /* 0x30 */ ColliderCylinder *sp30;              /* inferred */
    /* 0x34 */ ObjectContext *sp34;                 /* inferred */
    /* 0x38 */ char pad_38[0x8];
};                                                  /* size = 0x40 */

struct _mips2c_stack_DmStk_Update {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80A9FDB0 {};              /* size 0x0 */

struct _mips2c_stack_func_80A9FE3C {
    /* 0x00 */ char pad_0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80A9FED8 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80AA00CC {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80AA0100 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80AA0158 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80AA01C0 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80AA0264 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ Actor *sp1C;                         /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80AA0420 {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ Actor *sp18;                         /* inferred */
    /* 0x1C */ char pad_1C[0x4];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80AA05F0 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80AA0634 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80AA066C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80AA071C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80AA076C {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ Actor *sp1C;                         /* inferred */
    /* 0x20 */ char pad_20[0x8];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80AA09DC {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80AA0B08 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80AA0DA8 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80AA0E1C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80AA0E90 {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ Actor *sp18;                         /* inferred */
    /* 0x1C */ char pad_1C[0x4];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80AA16F4 {};              /* size 0x0 */

struct _mips2c_stack_func_80AA1704 {};              /* size 0x0 */

struct _mips2c_stack_func_80AA1714 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ f32 sp1C;                            /* inferred */
    /* 0x20 */ f32 sp20;                            /* inferred */
    /* 0x24 */ char pad_24[0x4];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80AA17F8 {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ s16 sp18;                            /* inferred */
    /* 0x1A */ char pad_1A[0x2];
    /* 0x1C */ s16 sp1C;                            /* inferred */
    /* 0x1E */ s16 sp1E;                            /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80AA18D8 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80AA192C {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80AA1998 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80AA19EC {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80AA1A50 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80AA1AC8 {};              /* size 0x0 */

struct _mips2c_stack_func_80AA1AF8 {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ Actor *sp2C;                         /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80AA1B9C {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ Actor *sp2C;                         /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80AA1C64 {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ ObjectContext *sp2C;                 /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80AA1D1C {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ Actor *sp2C;                         /* inferred */
    /* 0x30 */ u32 sp30;                            /* inferred */
    /* 0x34 */ char pad_34[0x4];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80AA26CC {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ CollisionCheckContext *sp1C;         /* inferred */
    /* 0x20 */ ColliderCylinder *sp20;              /* inferred */
    /* 0x24 */ char pad_24[0x4];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80AA2720 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ Actor *sp1C;                         /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80AA27EC {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80AA2B14 {};              /* size 0x0 */

struct _mips2c_stack_func_80AA2BC0 {
    /* 0x00 */ char pad_0[0x28];
    /* 0x28 */ Gfx *sp28;                           /* inferred */
    /* 0x2C */ char pad_2C[0x4];
    /* 0x30 */ GraphicsContext *sp30;               /* inferred */
    /* 0x34 */ char pad_34[0x4];
    /* 0x38 */ Gfx *sp38;                           /* inferred */
    /* 0x3C */ char pad_3C[0x18];                   /* maybe part of sp38[7]? */
    /* 0x54 */ Gfx *sp54;                           /* inferred */
    /* 0x58 */ char pad_58[0x4];
    /* 0x5C */ GraphicsContext *sp5C;               /* inferred */
    /* 0x60 */ char pad_60[0x28];                   /* maybe part of sp5C[11]? */
    /* 0x88 */ Gfx *sp88;                           /* inferred */
    /* 0x8C */ char pad_8C[0x4];
    /* 0x90 */ GraphicsContext *sp90;               /* inferred */
    /* 0x94 */ char pad_94[0xC];
};                                                  /* size = 0xA0 */

struct _mips2c_stack_func_80AA33A4 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

s32 func_800B8718(DmStk *, GlobalContext *);        /* extern */
? func_800B874C(DmStk *, GlobalContext *, f32, f32); /* extern */
? func_8019FE74(? *, ?, ?, Actor *);                /* extern */
? func_801A0654(s32, ?, ?, Actor *);                /* extern */
? func_801A479C(Vec3f *, ?, ?, Actor *);            /* extern */
? func_801A4A28(?, Actor *);                        /* extern */
void func_80A9FDB0(DmStk *arg0, GlobalContext *arg1); /* static */
void func_80A9FE3C(SkelAnime *arg2, GlobalContext *arg3, u16 arg4, void *, s32); /* static */
void func_80A9FED8(Actor *arg0, void *arg1);        /* static */
void func_80AA00CC(Actor *arg0, void *arg1);        /* static */
void func_80AA0100(Actor *arg0, void *arg1);        /* static */
void func_80AA0158(Actor *arg0, void *arg1);        /* static */
void func_80AA01C0(Actor *arg0, void *arg1);        /* static */
