typedef struct Boss05 {
    /* 0x000 */ Actor actor;
    /* 0x144 */ s32 unk144;                         /* inferred */
    /* 0x148 */ char pad148[0x14];                  /* maybe part of unk144[6]? */
    /* 0x15C */ u8 unk15C;                          /* inferred */
    /* 0x15D */ char pad15D[0x1];
    /* 0x15E */ s16 unk15E;                         /* inferred */
    /* 0x160 */ s16 unk160;                         /* inferred */
    /* 0x162 */ s16 unk162;                         /* inferred */
    /* 0x164 */ char pad164[0x2];
    /* 0x166 */ s16 unk166;                         /* inferred */
    /* 0x168 */ s16 unk168;                         /* inferred */
    /* 0x16A */ s16 unk16A;                         /* inferred */
    /* 0x16C */ s16 unk16C;                         /* inferred */
    /* 0x16E */ char pad16E[0x2];
    /* 0x170 */ void (*actionFunc)(Boss05 *, GlobalContext *);
    /* 0x174 */ u8 unk174;                          /* inferred */
    /* 0x175 */ char pad175[0x1];
    /* 0x176 */ s16 unk176;                         /* inferred */
    /* 0x178 */ s16 unk178;                         /* inferred */
    /* 0x17A */ s16 unk17A;                         /* inferred */
    /* 0x17C */ f32 unk17C;                         /* inferred */
    /* 0x180 */ f32 unk180;                         /* inferred */
    /* 0x184 */ f32 unk184;                         /* inferred */
    /* 0x188 */ u8 unk188;                          /* inferred */
    /* 0x189 */ u8 unk189;                          /* inferred */
    /* 0x18A */ char pad18A[0x2];                   /* maybe part of unk189[3]? */
    /* 0x18C */ Vec3f unk18C;                       /* inferred */
    /* 0x198 */ f32 unk198;                         /* inferred */
    /* 0x19C */ s16 unk19C;                         /* inferred */
    /* 0x19E */ s16 unk19E;                         /* inferred */
    /* 0x1A0 */ s16 unk1A0;                         /* inferred */
    /* 0x1A2 */ s16 unk1A2;                         /* inferred */
    /* 0x1A4 */ char pad1A4[0x24];                  /* maybe part of unk1A2[19]? */
    /* 0x1C8 */ ColliderJntSph unk1C8;              /* inferred */
    /* 0x1E8 */ ColliderJntSphElement unk1E8;       /* inferred */
    /* 0x228 */ char pad228[0x40];
    /* 0x268 */ SkelAnime unk268;                   /* inferred */
    /* 0x2AC */ Vec3s unk2AC;                       /* inferred */
    /* 0x2B2 */ char pad2B2[0x36];                  /* maybe part of unk2AC[10]? */
    /* 0x2E8 */ Vec3s unk2E8;                       /* inferred */
    /* 0x2EE */ char pad2EE[0x36];                  /* maybe part of unk2E8[10]? */
    /* 0x324 */ f32 unk324;                         /* inferred */
    /* 0x328 */ f32 unk328;                         /* inferred */
    /* 0x32C */ f32 unk32C;                         /* inferred */
    /* 0x330 */ s16 unk330;                         /* inferred */
    /* 0x332 */ s16 unk332;                         /* inferred */
    /* 0x334 */ s16 unk334;                         /* inferred */
    /* 0x336 */ char pad336[0x2];
    /* 0x338 */ f32 unk338;                         /* inferred */
    /* 0x33C */ Vec3f unk33C;                       /* inferred */
    /* 0x348 */ s16 unk348;                         /* inferred */
    /* 0x34A */ char pad34A[0x2];
    /* 0x34C */ f32 unk34C;                         /* inferred */
    /* 0x350 */ char pad350[0x4];
    /* 0x354 */ f32 unk354;                         /* inferred */
    /* 0x358 */ f32 unk358;                         /* inferred */
    /* 0x35C */ f32 unk35C;                         /* inferred */
    /* 0x360 */ f32 unk360;                         /* inferred */
    /* 0x364 */ f32 unk364;                         /* inferred */
    /* 0x368 */ ColliderJntSph unk368;              /* inferred */
    /* 0x388 */ ColliderJntSphElement unk388;       /* inferred */
    /* 0x3C8 */ SkelAnime unk3C8;                   /* inferred */
    /* 0x40C */ Vec3s unk40C;                       /* inferred */
    /* 0x412 */ char pad412[0x72];                  /* maybe part of unk40C[20]? */
    /* 0x484 */ Vec3s unk484;                       /* inferred */
    /* 0x48A */ char pad48A[0x72];                  /* maybe part of unk484[20]? */
    /* 0x4FC */ f32 unk4FC;                         /* inferred */
    /* 0x500 */ s16 unk500;                         /* inferred */
    /* 0x502 */ s16 unk502;                         /* inferred */
    /* 0x504 */ char pad504[0x4];                   /* maybe part of unk502[3]? */
} Boss05;                                           /* size = 0x508 */

struct _mips2c_stack_Boss05_Destroy {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Boss05_Draw {
    /* 0x00 */ char pad0[0x34];
    /* 0x34 */ GraphicsContext *sp34;               /* inferred */
    /* 0x38 */ char pad38[0x8];
};                                                  /* size = 0x40 */

struct _mips2c_stack_Boss05_Init {
    /* 0x00 */ char pad0[0x34];
    /* 0x34 */ CollisionHeader *sp34;               /* inferred */
    /* 0x38 */ char pad38[0x8];
};                                                  /* size = 0x40 */

struct _mips2c_stack_Boss05_Update {
    /* 0x00 */ char pad0[0x2C];
    /* 0x2C */ ColliderJntSph *sp2C;                /* inferred */
    /* 0x30 */ CollisionCheckContext *sp30;         /* inferred */
    /* 0x34 */ char pad34[0xC];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_809EE4E0 {
    /* 0x00 */ char pad0[0x80];
    /* 0x80 */ f32 sp80;                            /* inferred */
    /* 0x84 */ f32 sp84;                            /* inferred */
    /* 0x88 */ f32 sp88;                            /* inferred */
    /* 0x8C */ f32 sp8C;                            /* inferred */
    /* 0x90 */ f32 sp90;                            /* inferred */
    /* 0x94 */ f32 sp94;                            /* inferred */
};                                                  /* size = 0x98 */

struct _mips2c_stack_func_809EE668 {};              /* size 0x0 */

struct _mips2c_stack_func_809EECBC {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809EEDD0 {};              /* size 0x0 */

struct _mips2c_stack_func_809EEDE8 {
    /* 0x000 */ char pad0[0x5C];
    /* 0x05C */ s16 *sp5C;                          /* inferred */
    /* 0x060 */ s16 *sp60;                          /* inferred */
    /* 0x064 */ char pad64[0x8];                    /* maybe part of sp60[3]? */
    /* 0x06C */ s16 *sp6C;                          /* inferred */
    /* 0x070 */ f32 sp70;                           /* inferred */
    /* 0x074 */ s32 sp74;                           /* inferred */
    /* 0x078 */ char pad78[0x8];                    /* maybe part of sp74[3]? */
    /* 0x080 */ f32 sp80;                           /* inferred */
    /* 0x084 */ char pad84[0x10];                   /* maybe part of sp80[5]? */
    /* 0x094 */ ? sp94;                             /* inferred */
    /* 0x094 */ char pad94[0x4];
    /* 0x098 */ f32 sp98;                           /* inferred */
    /* 0x09C */ char pad9C[0x8];                    /* maybe part of sp98[3]? */
    /* 0x0A4 */ f32 spA4;                           /* inferred */
    /* 0x0A8 */ char padA8[0xC];                    /* maybe part of spA4[4]? */
    /* 0x0B4 */ s32 spB4;                           /* inferred */
    /* 0x0B8 */ s32 spB8;                           /* inferred */
    /* 0x0BC */ s32 spBC;                           /* inferred */
    /* 0x0C0 */ s32 spC0;                           /* inferred */
    /* 0x0C4 */ s32 spC4;                           /* inferred */
    /* 0x0C8 */ s32 spC8;                           /* inferred */
    /* 0x0CC */ s32 spCC;                           /* inferred */
    /* 0x0D0 */ s32 spD0;                           /* inferred */
    /* 0x0D4 */ s32 spD4;                           /* inferred */
    /* 0x0D8 */ ? spD8;                             /* inferred */
    /* 0x0D8 */ char padD8[0x2B];
    /* 0x103 */ u8 sp103;                           /* inferred */
    /* 0x104 */ char pad104[0x4];                   /* maybe part of sp103[5]? */
    /* 0x108 */ Actor *sp108;                       /* inferred */
    /* 0x10C */ char pad10C[0x4];
};                                                  /* size = 0x110 */

struct _mips2c_stack_func_809EF9BC {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_809EFAB4 {
    /* 0x00 */ char pad0[0x74];
    /* 0x74 */ f32 sp74;                            /* inferred */
    /* 0x78 */ f32 sp78;                            /* inferred */
    /* 0x7C */ f32 sp7C;                            /* inferred */
    /* 0x80 */ ? sp80;                              /* inferred */
    /* 0x80 */ char pad80[0x4];
    /* 0x84 */ f32 sp84;                            /* inferred */
    /* 0x88 */ char pad88[0x8];
};                                                  /* size = 0x90 */

struct _mips2c_stack_func_809EFE50 {
    /* 0x00 */ char pad0[0x27];
    /* 0x27 */ u8 sp27;                             /* inferred */
    /* 0x28 */ char pad28[0x8];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_809F0014 {};              /* size 0x0 */

struct _mips2c_stack_func_809F0058 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809F00CC {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809F010C {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_809F01CC {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809F0244 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_809F02D0 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_809F0374 {
    /* 0x00 */ char pad0[0x20];
    /* 0x20 */ f32 sp20;                            /* inferred */
    /* 0x24 */ f32 sp24;                            /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_809F0474 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809F04C0 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_809F0538 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809F0590 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_809F0650 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809F06B8 {
    /* 0x00 */ char pad0[0x1C];
    /* 0x1C */ SkelAnime *sp1C;                     /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_809F0708 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_809F0780 {
    /* 0x00 */ char pad0[0x7C];
    /* 0x7C */ f32 sp7C;                            /* inferred */
    /* 0x80 */ f32 sp80;                            /* inferred */
    /* 0x84 */ f32 sp84;                            /* inferred */
    /* 0x88 */ char pad88[0x8];
};                                                  /* size = 0x90 */

struct _mips2c_stack_func_809F0A0C {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_809F0A64 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_809F0ABC {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809F0B0C {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_809F1050 {};              /* size 0x0 */

struct _mips2c_stack_func_809F1170 {
    /* 0x00 */ char pad0[0x20];
    /* 0x20 */ void *sp20;                          /* inferred */
    /* 0x24 */ ? sp24;                              /* inferred */
    /* 0x24 */ char pad24[0xC];
    /* 0x30 */ ? sp30;                              /* inferred */
    /* 0x30 */ char pad30[0xC];
    /* 0x3C */ ? sp3C;                              /* inferred */
    /* 0x3C */ char pad3C[0x44];
};                                                  /* size = 0x80 */

struct _mips2c_stack_func_809F1284 {};              /* size 0x0 */

struct _mips2c_stack_func_809F12A0 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_809F135C {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809F1404 {};              /* size 0x0 */

struct _mips2c_stack_func_809F1430 {};              /* size 0x0 */

struct _mips2c_stack_func_809F1464 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809F14AC {};              /* size 0x0 */

struct _mips2c_stack_func_809F1550 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

void func_809EE4E0(Actor *arg0, GlobalContext *arg1, u8); /* static */
void func_809EE668(s32 arg0, void *arg1, ? *arg2);  /* static */
s32 func_809EECBC(Actor *arg0, GlobalContext *arg1); /* static */
void func_809EEDD0(Boss05 *arg0, GlobalContext *arg1); /* static */
void func_809EFE50(Actor *arg0, GlobalContext *arg1); /* static */
s32 func_809F0014(GlobalContext *arg0, ? arg1);     /* static */
void func_809F0058(Boss05 *arg0, GlobalContext *arg1); /* static */
void func_809F00CC(Boss05 *arg0, GlobalContext *arg1); /* static */
void func_809F01CC(Boss05 *arg0, GlobalContext *arg1); /* static */
void func_809F02D0(Boss05 *arg0, GlobalContext *arg1); /* static */
void func_809F0474(Boss05 *arg0, GlobalContext *arg1); /* static */
void func_809F0538(Boss05 *arg0, GlobalContext *arg1); /* static */
void func_809F0650(Boss05 *arg0, GlobalContext *arg1); /* static */
