void func_80954960(EnKanban *arg0);                 /* static */
void func_80954BE8(Actor *arg0, GlobalContext *arg1); /* static */
extern ? D_0405AED0;
extern ? D_06000C30;
extern ? D_06001630;
static ColliderCylinderInit D_80957300 = {
    {0xA, 0x11, 9, 0x39, 0x10, 1},
    {0, {0xF7CFFFFF, 0, 0}, {0xF3CFFFFF, 0, 0}, 1, 1, 1},
    {0x14, 0x32, 5, {0, 0, 0}},
};
static u16 D_8095732C = 1;
static u16 D_8095732E = 2;
static u16 D_80957330 = 4;
static ? D_80957332;                                /* unable to generate initializer */
static ? D_80957344;                                /* unable to generate initializer */
static ? D_80957428;                                /* unable to generate initializer */
static ? D_8095750C;                                /* unable to generate initializer */
static ? D_80957530;                                /* unable to generate initializer */
static ? D_8095753C;                                /* unable to generate initializer */
static s32 D_80957548 = 0xB98C46FF;
static s32 D_8095754C = 0xFFFFFFFF;
static u32 D_80957550 = 0x6000CB0;
static u32 D_80957554 = 0x6000DB8;
static u32 D_80957558 = {
    0x6000E78,
    0x6000F38,
    0x6000FF8,
    0x60010B8,
    0x60011C0,
    0x60012C8,
    0x60013D0,
    0x6001488,
    0x6001540,
};
static u16 D_8095757C = {
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0x100,
    0x100,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,

    0,
    0,
    0,
    0,
    0x400,
    0x400,
    0x400,
    0x400,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0x400,
    0x400,
    0x400,
    0x400,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0x400,
    0x400,
    0x400,
    0x400,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0x400,
    0x400,
    0x400,
    0x400,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0x400,
    0x400,
    0x400,
    0x400,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0x400,
    0x400,
    0x400,
    0x400,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0x400,
    0x400,
    0x400,
    0x400,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0x400,
    0x400,
    0x400,
    0x400,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0x400,
    0x400,
    0x400,
    0x400,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0x400,
    0x400,
    0x400,
    0x400,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0x400,
    0x400,
    0x400,
    0x400,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0x400,
    0x400,
    0x400,
    0x400,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
    0,
};
static ? D_80957D7C;                                /* unable to generate initializer */
static ? D_80957DE0;                                /* unable to generate initializer */

typedef struct EnKanban {
    /* 0x0000 */ Actor actor;
    /* 0x0144 */ char pad144[0x4];
    /* 0x0148 */ u8 unk148;                         /* inferred */
    /* 0x0149 */ char pad149[0x1];                  /* maybe part of unk148[2]? */
    /* 0x014A */ s16 unk14A;                        /* inferred */
    /* 0x014C */ u8 unk14C;                         /* inferred */
    /* 0x014D */ char pad14D[0x1];                  /* maybe part of unk14C[2]? */
    /* 0x014E */ u16 unk14E;                        /* inferred */
    /* 0x0150 */ u8 unk150;                         /* inferred */
    /* 0x0151 */ char pad151[0x1];                  /* maybe part of unk150[2]? */
    /* 0x0152 */ s16 unk152;                        /* inferred */
    /* 0x0154 */ f32 unk154;                        /* inferred */
    /* 0x0158 */ f32 unk158;                        /* inferred */
    /* 0x015C */ f32 unk15C;                        /* inferred */
    /* 0x0160 */ s16 unk160;                        /* inferred */
    /* 0x0162 */ char pad162[0x2];                  /* maybe part of unk160[2]? */
    /* 0x0164 */ s16 unk164;                        /* inferred */
    /* 0x0166 */ s16 unk166;                        /* inferred */
    /* 0x0168 */ s16 unk168;                        /* inferred */
    /* 0x016A */ s16 unk16A;                        /* inferred */
    /* 0x016C */ s8 unk16C;                         /* inferred */
    /* 0x016D */ s8 unk16D;                         /* inferred */
    /* 0x016E */ s16 unk16E;                        /* inferred */
    /* 0x0170 */ s16 unk170;                        /* inferred */
    /* 0x0172 */ u8 unk172;                         /* inferred */
    /* 0x0173 */ char pad173[0x1];                  /* maybe part of unk172[2]? */
    /* 0x0174 */ f32 unk174;                        /* inferred */
    /* 0x0178 */ f32 unk178;                        /* inferred */
    /* 0x017C */ s16 unk17C;                        /* inferred */
    /* 0x017E */ char pad17E[0x2];                  /* maybe part of unk17C[2]? */
    /* 0x0180 */ f32 unk180;                        /* inferred */
    /* 0x0184 */ char pad184[0x4];                  /* maybe part of unk180[2]? */
    /* 0x0188 */ f32 unk188;                        /* inferred */
    /* 0x018C */ u8 unk18C;                         /* inferred */
    /* 0x018D */ u8 unk18D;                         /* inferred */
    /* 0x018E */ s16 unk18E;                        /* inferred */
    /* 0x0190 */ s16 unk190;                        /* inferred */
    /* 0x0192 */ s16 unk192;                        /* inferred */
    /* 0x0194 */ char pad194[0x2];                  /* maybe part of unk192[2]? */
    /* 0x0196 */ u8 unk196;                         /* inferred */
    /* 0x0197 */ s8 unk197;                         /* inferred */
    /* 0x0198 */ s8 unk198;                         /* inferred */
    /* 0x0199 */ u8 unk199;                         /* inferred */
    /* 0x019A */ u8 unk19A;                         /* inferred */
    /* 0x019B */ char pad19B[0x1];                  /* maybe part of unk19A[2]? */
    /* 0x019C */ Actor *unk19C;                     /* inferred */
    /* 0x01A0 */ s16 unk1A0;                        /* inferred */
    /* 0x01A2 */ char pad1A2[0x2];                  /* maybe part of unk1A0[2]? */
    /* 0x01A4 */ ColliderCylinder unk1A4;           /* inferred */
} EnKanban;                                         /* size 0x1F0 */

void func_80954960(EnKanban *arg0) {
    f32 sp1C;
    f32 sp18;
    f32 temp_f16;
    void *temp_v0;

    temp_v0 = arg0->actor.floorPoly;
    if (temp_v0 != 0) {
        sp1C = (f32) temp_v0->normal.x * 0.00003051851f;
        temp_f16 = (f32) temp_v0->normal.y * 0.00003051851f;
        sp18 = temp_f16;
        arg0->unk180 = -func_80086B30(-((f32) temp_v0->normal.z * 0.00003051851f) * temp_f16, 1.0f);
        arg0->unk188 = func_80086B30(-sp1C * temp_f16, 1.0f);
    }
}

void EnKanban_Init(Actor *thisx, GlobalContext *globalCtx) {
    EnKanban *this = (EnKanban *) thisx;
    ColliderCylinder *sp28;
    ColliderCylinder *temp_a1;
    s16 temp_v0;

    Actor_SetScale(&this->actor, 0.01f);
    if (this->actor.params != -0x23) {
        this->actor.targetMode = 0;
        this->actor.flags |= 1;
        temp_a1 = &this->unk1A4;
