typedef struct EnKanban {
    /* 0x000 */ Actor actor;
    /* 0x144 */ char pad_144[0x4];
    /* 0x148 */ u8 unk_148;                         /* inferred */
    /* 0x149 */ char pad_149[0x1];
    /* 0x14A */ s16 unk_14A;                        /* inferred */
    /* 0x14C */ u8 unk_14C;                         /* inferred */
    /* 0x14D */ char pad_14D[0x1];
    /* 0x14E */ u16 unk_14E;                        /* inferred */
    /* 0x150 */ u8 unk_150;                         /* inferred */
    /* 0x151 */ char pad_151[0x1];
    /* 0x152 */ s16 unk_152;                        /* inferred */
    /* 0x154 */ f32 unk_154;                        /* inferred */
    /* 0x158 */ f32 unk_158;                        /* inferred */
    /* 0x15C */ f32 unk_15C;                        /* inferred */
    /* 0x160 */ s16 unk_160;                        /* inferred */
    /* 0x162 */ char pad_162[0x2];
    /* 0x164 */ s16 unk_164;                        /* inferred */
    /* 0x166 */ s16 unk_166;                        /* inferred */
    /* 0x168 */ s16 unk_168;                        /* inferred */
    /* 0x16A */ s16 unk_16A;                        /* inferred */
    /* 0x16C */ s8 unk_16C;                         /* inferred */
    /* 0x16D */ s8 unk_16D;                         /* inferred */
    /* 0x16E */ s16 unk_16E;                        /* inferred */
    /* 0x170 */ s16 unk_170;                        /* inferred */
    /* 0x172 */ u8 unk_172;                         /* inferred */
    /* 0x173 */ char pad_173[0x1];
    /* 0x174 */ f32 unk_174;                        /* inferred */
    /* 0x178 */ f32 unk_178;                        /* inferred */
    /* 0x17C */ s16 unk_17C;                        /* inferred */
    /* 0x17E */ char pad_17E[0x2];
    /* 0x180 */ f32 unk_180;                        /* inferred */
    /* 0x184 */ char pad_184[0x4];
    /* 0x188 */ f32 unk_188;                        /* inferred */
    /* 0x18C */ u8 unk_18C;                         /* inferred */
    /* 0x18D */ u8 unk_18D;                         /* inferred */
    /* 0x18E */ s16 unk_18E;                        /* inferred */
    /* 0x190 */ s16 unk_190;                        /* inferred */
    /* 0x192 */ s16 unk_192;                        /* inferred */
    /* 0x194 */ char pad_194[0x2];
    /* 0x196 */ u8 unk_196;                         /* inferred */
    /* 0x197 */ s8 unk_197;                         /* inferred */
    /* 0x198 */ s8 unk_198;                         /* inferred */
    /* 0x199 */ u8 unk_199;                         /* inferred */
    /* 0x19A */ u8 unk_19A;                         /* inferred */
    /* 0x19B */ char pad_19B[0x1];
    /* 0x19C */ Actor *unk_19C;                     /* inferred */
    /* 0x1A0 */ s16 unk_1A0;                        /* inferred */
    /* 0x1A2 */ char pad_1A2[0x2];
    /* 0x1A4 */ ColliderCylinder unk_1A4;           /* inferred */
} EnKanban;                                         /* size = 0x1F0 */

struct _mips2c_stack_EnKanban_Destroy {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnKanban_Draw {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ Gfx *sp20;                           /* inferred */
    /* 0x24 */ char pad_24[0x8];                    /* maybe part of sp20[3]? */
    /* 0x2C */ Gfx *sp2C;                           /* inferred */
    /* 0x30 */ char pad_30[0x10];                   /* maybe part of sp2C[5]? */
    /* 0x40 */ Gfx *sp40;                           /* inferred */
    /* 0x44 */ char pad_44[0x18];                   /* maybe part of sp40[7]? */
    /* 0x5C */ Gfx *sp5C;                           /* inferred */
    /* 0x60 */ char pad_60[0x8];                    /* maybe part of sp5C[3]? */
    /* 0x68 */ Gfx *sp68;                           /* inferred */
    /* 0x6C */ char pad_6C[0x10];                   /* maybe part of sp68[5]? */
    /* 0x7C */ Actor *sp7C;                         /* inferred */
    /* 0x80 */ char pad_80[0x8];                    /* maybe part of sp7C[3]? */
    /* 0x88 */ f32 sp88;                            /* inferred */
    /* 0x8C */ char pad_8C[0x4];
};                                                  /* size = 0x90 */

struct _mips2c_stack_EnKanban_Init {
    /* 0x00 */ char pad_0[0x28];
    /* 0x28 */ ColliderCylinder *sp28;              /* inferred */
    /* 0x2C */ char pad_2C[0x4];
};                                                  /* size = 0x30 */

struct _mips2c_stack_EnKanban_Update {
    /* 0x000 */ char pad_0[0x50];
    /* 0x050 */ ActorShape *sp50;                   /* inferred */
    /* 0x054 */ CollisionCheckContext *sp54;        /* inferred */
    /* 0x058 */ char pad_58[0xA];                   /* maybe part of sp54[3]? */
    /* 0x062 */ s16 sp62;                           /* inferred */
    /* 0x064 */ s16 sp64;                           /* inferred */
    /* 0x066 */ s16 sp66;                           /* inferred */
    /* 0x068 */ f32 sp68;                           /* inferred */
    /* 0x06C */ f32 sp6C;                           /* inferred */
    /* 0x070 */ f32 sp70;                           /* inferred */
    /* 0x074 */ f32 sp74;                           /* inferred */
    /* 0x078 */ char pad_78[0x10];                  /* maybe part of sp74[5]? */
    /* 0x088 */ f32 sp88;                           /* inferred */
    /* 0x08C */ char pad_8C[0xC];                   /* maybe part of sp88[4]? */
    /* 0x098 */ s32 sp98;                           /* inferred */
    /* 0x09C */ s32 sp9C;                           /* inferred */
    /* 0x0A0 */ f32 spA0;                           /* inferred */
    /* 0x0A4 */ f32 spA4;                           /* inferred */
    /* 0x0A8 */ f32 spA8;                           /* inferred */
    /* 0x0AC */ f32 spAC;                           /* inferred */
    /* 0x0B0 */ f32 spB0;                           /* inferred */
    /* 0x0B4 */ f32 spB4;                           /* inferred */
    /* 0x0B8 */ ? spB8;                             /* inferred */
    /* 0x0B8 */ char pad_B8[0x10];
    /* 0x0C8 */ f32 spC8;                           /* inferred */
    /* 0x0CC */ char pad_CC[0x4];
    /* 0x0D0 */ f32 spD0;                           /* inferred */
    /* 0x0D4 */ char pad_D4[0x8];                   /* maybe part of spD0[3]? */
    /* 0x0DC */ f32 spDC;                           /* inferred */
    /* 0x0E0 */ f32 spE0;                           /* inferred */
    /* 0x0E4 */ f32 spE4;                           /* inferred */
    /* 0x0E8 */ f32 spE8;                           /* inferred */
    /* 0x0EC */ char pad_EC[0x2];
    /* 0x0EE */ s16 spEE;                           /* inferred */
    /* 0x0F0 */ ColliderInfo *spF0;                 /* inferred */
    /* 0x0F4 */ char pad_F4[0x8];                   /* maybe part of spF0[3]? */
    /* 0x0FC */ f32 spFC;                           /* inferred */
    /* 0x100 */ f32 sp100;                          /* inferred */
    /* 0x104 */ f32 sp104;                          /* inferred */
    /* 0x108 */ Actor *sp108;                       /* inferred */
    /* 0x10C */ char pad_10C[0x13];                 /* maybe part of sp108[5]? */
    /* 0x11F */ u8 sp11F;                           /* inferred */
};                                                  /* size = 0x120 */

struct _mips2c_stack_func_80954960 {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ f32 sp18;                            /* inferred */
    /* 0x1C */ f32 sp1C;                            /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80954BE8 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

void func_80954960(EnKanban *arg0);                 /* static */
void func_80954BE8(Actor *arg0, GlobalContext *arg1); /* static */
extern ? D_0405AED0;
extern ? D_06000C30;
extern ? D_06001630;
static ColliderCylinderInit D_80957300 = {
    {0xA, 0x11, 9, 0x39, 0x10, 1},
    {0, {0xF7CFFFFF, 0, 0}, {0xF3CFFFFF, 0, 0}, 1, 1, 1},
    {0x14, 0x32, 5, {0, 0, 0}},
};
static u16 D_8095732C = 1;
static u16 D_8095732E = 2;
static u16 D_80957330 = 4;
static ? D_80957332;                                /* unable to generate initializer */
static ? D_80957344;                                /* unable to generate initializer */
static ? D_80957428;                                /* unable to generate initializer */
static ? D_8095750C;                                /* unable to generate initializer */
static ? D_80957530;                                /* unable to generate initializer */
