CRASHED

typedef struct ObjMine {
    /* 0x0000 */ Actor actor;
    /* 0x0144 */ ColliderJntSph unk_144;            /* inferred */
    /* 0x0164 */ ColliderJntSphElement unk_164;     /* inferred */
    /* 0x01A4 */ void (*actionFunc)(ObjMine *, GlobalContext *);
    /* 0x01A8 */ f32 unk_1A8;                       /* inferred */
    /* 0x01AC */ s32 unk_1AC;                       /* inferred */
    /* 0x01B0 */ s32 unk_1B0;                       /* inferred */
    /* 0x01B4 */ void *unk_1B4;                     /* inferred */
    /* 0x01B8 */ char pad_1B8[0x11FC];              /* maybe part of unk_1B4[1152]? */
} ObjMine;                                          /* size = 0x13B4 */

struct _mips2c_stack_ObjMine_Destroy {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_ObjMine_Draw {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ Gfx *sp24;                           /* inferred */
    /* 0x28 */ char pad_28[0x10];
};                                                  /* size = 0x38 */

struct _mips2c_stack_ObjMine_Init {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ ColliderJntSph *sp2C;                /* inferred */
    /* 0x30 */ ActorShape *sp30;                    /* inferred */
    /* 0x34 */ s32 sp34;                            /* inferred */
    /* 0x38 */ s32 sp38;                            /* inferred */
    /* 0x3C */ s32 sp3C;                            /* inferred */
    /* 0x40 */ char pad_40[0x4];
    /* 0x44 */ s32 sp44;                            /* inferred */
    /* 0x48 */ char pad_48[0x8];
};                                                  /* size = 0x50 */

struct _mips2c_stack_ObjMine_Update {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ ColliderJntSph *sp20;                /* inferred */
    /* 0x24 */ CollisionCheckContext *sp24;         /* inferred */
    /* 0x28 */ char pad_28[0x8];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80A811D0 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A8120C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A81288 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A8131C {
    /* 0x00 */ char pad_0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80A81384 {
    /* 0x00 */ char pad_0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80A8140C {};              /* size 0x0 */

struct _mips2c_stack_func_80A8146C {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ Vec3f *sp20;                         /* inferred */
    /* 0x24 */ char pad_24[0x8];                    /* maybe part of sp20[3]? */
    /* 0x2C */ ? sp2C;                              /* inferred */
    /* 0x2C */ char pad_2C[0x12];
    /* 0x3E */ s16 sp3E;                            /* inferred */
    /* 0x40 */ ? sp40;                              /* inferred */
    /* 0x40 */ char pad_40[0x18];
};                                                  /* size = 0x58 */

struct _mips2c_stack_func_80A81544 {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ f32 sp20;                            /* inferred */
    /* 0x24 */ f32 sp24;                            /* inferred */
    /* 0x28 */ f32 sp28;                            /* inferred */
    /* 0x2C */ void *sp2C;                          /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80A81640 {};              /* size 0x0 */

struct _mips2c_stack_func_80A8164C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A81684 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A81714 {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ f32 sp20;                            /* inferred */
    /* 0x24 */ ? sp24;                              /* inferred */
    /* 0x24 */ char pad_24[0xC];
    /* 0x30 */ ? sp30;                              /* inferred */
    /* 0x30 */ char pad_30[0xC];
    /* 0x3C */ ? sp3C;                              /* inferred */
    /* 0x3C */ char pad_3C[0xC];
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_80A81818 {};              /* size 0x0 */

struct _mips2c_stack_func_80A81868 {};              /* size 0x0 */

struct _mips2c_stack_func_80A819A4 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80A81A00 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ Vec3f *sp1C;                         /* inferred */
    /* 0x20 */ Vec3f *sp20;                         /* inferred */
    /* 0x24 */ Vec3f *sp24;                         /* inferred */
    /* 0x28 */ f32 sp28;                            /* inferred */
    /* 0x2C */ f32 sp2C;                            /* inferred */
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ char pad_34[0x4];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80A81AA4 {};              /* size 0x0 */

struct _mips2c_stack_func_80A81B14 {};              /* size 0x0 */

struct _mips2c_stack_func_80A81B7C {
    /* 0x00 */ char pad_0[0x58];
    /* 0x58 */ f32 sp58;                            /* inferred */
    /* 0x5C */ char pad_5C[0xC];
};                                                  /* size = 0x68 */

struct _mips2c_stack_func_80A81D70 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80A81DEC {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ void *sp18;                          /* inferred */
    /* 0x1C */ ? sp1C;                              /* inferred */
    /* 0x1C */ char pad_1C[0x1C];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80A81E7C {
    /* 0x00 */ char pad_0[0x38];
    /* 0x38 */ void *sp38;                          /* inferred */
    /* 0x3C */ f32 sp3C;                            /* inferred */
    /* 0x40 */ f32 sp40;                            /* inferred */
    /* 0x44 */ u32 sp44;                            /* inferred */
    /* 0x48 */ CollisionPoly *sp48;                 /* inferred */
    /* 0x4C */ f32 sp4C;                            /* inferred */
    /* 0x50 */ char pad_50[0x4];
    /* 0x54 */ f32 sp54;                            /* inferred */
    /* 0x58 */ f32 sp58;                            /* inferred */
    /* 0x5C */ f32 sp5C;                            /* inferred */
    /* 0x60 */ f32 sp60;                            /* inferred */
    /* 0x64 */ ? sp64;                              /* inferred */
    /* 0x64 */ char pad_64[0xC];
    /* 0x70 */ f32 sp70;                            /* inferred */
    /* 0x74 */ f32 sp74;                            /* inferred */
    /* 0x78 */ f32 sp78;                            /* inferred */
    /* 0x7C */ f32 sp7C;                            /* inferred */
    /* 0x80 */ f32 sp80;                            /* inferred */
    /* 0x84 */ f32 sp84;                            /* inferred */
    /* 0x88 */ char pad_88[0x8];
};                                                  /* size = 0x90 */

struct _mips2c_stack_func_80A828A8 {
    /* 0x00 */ char pad_0[0x70];
    /* 0x70 */ f32 *sp70;                           /* inferred */
    /* 0x74 */ char pad_74[0x4];
    /* 0x78 */ f32 sp78;                            /* inferred */
    /* 0x7C */ f32 sp7C;                            /* inferred */
    /* 0x80 */ char pad_80[0x4];
    /* 0x84 */ f32 sp84;                            /* inferred */
    /* 0x88 */ f32 sp88;                            /* inferred */
    /* 0x8C */ f32 sp8C;                            /* inferred */
    /* 0x90 */ ? sp90;                              /* inferred */
    /* 0x90 */ char pad_90[0xC];
    /* 0x9C */ f32 sp9C;                            /* inferred */
    /* 0xA0 */ char pad_A0[0x8];                    /* maybe part of sp9C[3]? */
    /* 0xA8 */ ? spA8;                              /* inferred */
    /* 0xA8 */ char pad_A8[0x1C];
    /* 0xC4 */ s32 spC4;                            /* inferred */
    /* 0xC8 */ ? spC8;                              /* inferred */
    /* 0xC8 */ char pad_C8[0xC];
    /* 0xD4 */ ? spD4;                              /* inferred */
    /* 0xD4 */ char pad_D4[0xC];
    /* 0xE0 */ ? spE0;                              /* inferred */
    /* 0xE0 */ char pad_E0[0x10];
};                                                  /* size = 0xF0 */

struct _mips2c_stack_func_80A82C28 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A82F84 {};              /* size 0x0 */

struct _mips2c_stack_func_80A82F98 {};              /* size 0x0 */

struct _mips2c_stack_func_80A82FA8 {};              /* size 0x0 */

struct _mips2c_stack_func_80A82FC8 {
    /* 0x00 */ char pad_0[0x28];
    /* 0x28 */ Vec3f *sp28;                         /* inferred */
    /* 0x2C */ Vec3f *sp2C;                         /* inferred */
    /* 0x30 */ char pad_30[0x8];                    /* maybe part of sp2C[3]? */
    /* 0x38 */ ? sp38;                              /* inferred */
    /* 0x38 */ char pad_38[0x40];
    /* 0x78 */ ? sp78;                              /* inferred */
    /* 0x78 */ char pad_78[0xC];
    /* 0x84 */ ? sp84;                              /* inferred */
    /* 0x84 */ char pad_84[0xC];
    /* 0x90 */ s32 sp90;                            /* inferred */
    /* 0x94 */ char pad_94[0x8];                    /* maybe part of sp90[3]? */
    /* 0x9C */ f32 sp9C;                            /* inferred */
    /* 0xA0 */ ? spA0;                              /* inferred */
    /* 0xA0 */ char pad_A0[0x10];
};                                                  /* size = 0xB0 */

struct _mips2c_stack_func_80A83214 {};              /* size 0x0 */

struct _mips2c_stack_func_80A83258 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A832BC {};              /* size 0x0 */

struct _mips2c_stack_func_80A832D0 {
    /* 0x00 */ char pad_0[0x30];
    /* 0x30 */ Actor *sp30;                         /* inferred */
    /* 0x34 */ f32 *sp34;                           /* inferred */
    /* 0x38 */ char pad_38[0xC];                    /* maybe part of sp34[4]? */
    /* 0x44 */ f32 sp44;                            /* inferred */
    /* 0x48 */ f32 sp48;                            /* inferred */
    /* 0x4C */ f32 sp4C;                            /* inferred */
    /* 0x50 */ f32 sp50;                            /* inferred */
    /* 0x54 */ f32 sp54;                            /* inferred */
    /* 0x58 */ f32 sp58;                            /* inferred */
    /* 0x5C */ f32 sp5C;                            /* inferred */
    /* 0x60 */ f32 sp60;                            /* inferred */
    /* 0x64 */ f32 sp64;                            /* inferred */
    /* 0x68 */ char pad_68[0x4];
    /* 0x6C */ f32 sp6C;                            /* inferred */
    /* 0x70 */ f32 sp70;                            /* inferred */
    /* 0x74 */ char pad_74[0x10];                   /* maybe part of sp70[5]? */
    /* 0x84 */ s16 sp84;                            /* inferred */
    /* 0x86 */ s16 sp86;                            /* inferred */
    /* 0x88 */ char pad_88[0x8];                    /* maybe part of sp86[5]? */
    /* 0x90 */ f32 sp90;                            /* inferred */
    /* 0x94 */ s32 sp94;                            /* inferred */
    /* 0x98 */ char pad_98[0x8];                    /* maybe part of sp94[3]? */
    /* 0xA0 */ s32 spA0;                            /* inferred */
    /* 0xA4 */ char pad_A4[0x4];
};                                                  /* size = 0xA8 */

struct _mips2c_stack_func_80A83A74 {};              /* size 0x0 */

struct _mips2c_stack_func_80A83A88 {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ Actor *sp20;                         /* inferred */
    /* 0x24 */ CollisionCheckContext *sp24;         /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80A83B14 {};              /* size 0x0 */

struct _mips2c_stack_func_80A83B28 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ f32 *sp24;                           /* inferred */
    /* 0x28 */ Actor *sp28;                         /* inferred */
    /* 0x2C */ char pad_2C[0x6];                    /* maybe part of sp28[2]? */
    /* 0x32 */ s16 sp32;                            /* inferred */
    /* 0x34 */ char pad_34[0x4];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80A83CEC {};              /* size 0x0 */

struct _mips2c_stack_func_80A83D00 {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ Actor *sp20;                         /* inferred */
    /* 0x24 */ CollisionCheckContext *sp24;         /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80A83E7C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A83FBC {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ Gfx *sp20;                           /* inferred */
    /* 0x24 */ char pad_24[0x14];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80A84088 {
    /* 0x00 */ char pad_0[0x4C];
    /* 0x4C */ f32 *sp4C;                           /* inferred */
    /* 0x50 */ char pad_50[0x30];                   /* maybe part of sp4C[13]? */
    /* 0x80 */ GraphicsContext *sp80;               /* inferred */
    /* 0x84 */ char pad_84[0x4];
    /* 0x88 */ f32 sp88;                            /* inferred */
    /* 0x8C */ f32 sp8C;                            /* inferred */
    /* 0x90 */ f32 sp90;                            /* inferred */
    /* 0x94 */ f32 sp94;                            /* inferred */
    /* 0x98 */ f32 sp98;                            /* inferred */
    /* 0x9C */ f32 sp9C;                            /* inferred */
    /* 0xA0 */ char pad_A0[0x18];
};                                                  /* size = 0xB8 */

struct _mips2c_stack_func_80A84338 {
    /* 0x00 */ char pad_0[0x40];
    /* 0x40 */ GraphicsContext *sp40;               /* inferred */
    /* 0x44 */ char pad_44[0x1C];
};                                                  /* size = 0x60 */

void func_80A811D0(ObjMine *arg0, s32 arg1);        /* static */
s32 func_80A8120C(Vec3f *arg0, Vec3f *arg1, Actor *); /* static */
s32 func_80A81288(Vec3f *arg0, f32 *arg1, f32 *arg2, f32 *arg3); /* static */
void func_80A8131C(ObjMine *arg0, GlobalContext *arg1); /* static */
void func_80A81384(Actor *arg0, GlobalContext *arg1); /* static */
s32 func_80A8140C(Actor *arg0);                     /* static */
void func_80A8146C(Actor *arg0, s16 *arg1, s16 *arg2); /* static */
void func_80A81544(Actor *arg0, Vec3f *arg1, f32 *); /* static */
void func_80A81640(Actor *arg0);                    /* static */
void func_80A8164C(f32 *arg0);                      /* static */
void func_80A81684(f32 *arg0);                      /* static */
? func_80A81714(Vec3f *arg0, Vec3f *arg1, f32 arg2); /* static */
void func_80A81818(Actor *arg0);                    /* static */
