typedef struct EnBomBowlMan {
    /* 0x000 */ Actor actor;
    /* 0x144 */ SkelAnime unk_144;                  /* inferred */
    /* 0x188 */ Vec3s unk_188;                      /* inferred */
    /* 0x18E */ char pad_18E[0x78];                 /* maybe part of unk_188[21]? */
    /* 0x206 */ Vec3s unk_206;                      /* inferred */
    /* 0x20C */ char pad_20C[0x78];                 /* maybe part of unk_206[21]? */
    /* 0x284 */ void (*actionFunc)(EnBomBowlMan *, GlobalContext *);
    /* 0x288 */ s16 unk_288;                        /* inferred */
    /* 0x28A */ s16 unk_28A;                        /* inferred */
    /* 0x28C */ char pad_28C[0x2];
    /* 0x28E */ s16 unk_28E;                        /* inferred */
    /* 0x290 */ s16 unk_290;                        /* inferred */
    /* 0x292 */ char pad_292[0x2];
    /* 0x294 */ Path *unk_294;                      /* inferred */
    /* 0x298 */ s16 unk_298;                        /* inferred */
    /* 0x29A */ s16 unk_29A;                        /* inferred */
    /* 0x29C */ s16 unk_29C;                        /* inferred */
    /* 0x29E */ char pad_29E[0x2];
    /* 0x2A0 */ Vec3f unk_2A0;                      /* inferred */
    /* 0x2AC */ char pad_2AC[0xC];
    /* 0x2B8 */ s16 unk_2B8;                        /* inferred */
    /* 0x2BA */ s16 unk_2BA;                        /* inferred */
    /* 0x2BC */ s16 unk_2BC;                        /* inferred */
    /* 0x2BE */ char pad_2BE[0x2];
    /* 0x2C0 */ u16 unk_2C0;                        /* inferred */
    /* 0x2C2 */ s16 unk_2C2;                        /* inferred */
    /* 0x2C4 */ f32 unk_2C4;                        /* inferred */
    /* 0x2C8 */ f32 unk_2C8;                        /* inferred */
    /* 0x2CC */ char pad_2CC[0x4];
    /* 0x2D0 */ s16 unk_2D0;                        /* inferred */
    /* 0x2D2 */ s16 unk_2D2;                        /* inferred */
    /* 0x2D4 */ s16 unk_2D4;                        /* inferred */
    /* 0x2D6 */ s16 unk_2D6;                        /* inferred */
    /* 0x2D8 */ s32 unk_2D8;                        /* inferred */
    /* 0x2DC */ char pad_2DC[0x14];                 /* maybe part of unk_2D8[6]? */
    /* 0x2F0 */ s16 unk_2F0;                        /* inferred */
    /* 0x2F2 */ s16 unk_2F2;                        /* inferred */
    /* 0x2F4 */ s16 unk_2F4;                        /* inferred */
    /* 0x2F6 */ s16 unk_2F6;                        /* inferred */
    /* 0x2F8 */ s32 unk_2F8;                        /* inferred */
} EnBomBowlMan;                                     /* size = 0x2FC */

struct _mips2c_stack_EnBomBowlMan_Destroy {};       /* size 0x0 */

struct _mips2c_stack_EnBomBowlMan_Draw {
    /* 0x00 */ char pad_0[0x30];
    /* 0x30 */ Gfx *sp30;                           /* inferred */
    /* 0x34 */ Gfx *sp34;                           /* inferred */
    /* 0x38 */ Gfx *sp38;                           /* inferred */
    /* 0x3C */ char pad_3C[0xC];
};                                                  /* size = 0x48 */

struct _mips2c_stack_EnBomBowlMan_Init {
    /* 0x00 */ char pad_0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_EnBomBowlMan_Update {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_809C493C {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_809C49CC {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_809C4B50 {};              /* size 0x0 */

struct _mips2c_stack_func_809C4B6C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809C4BC4 {
    /* 0x00 */ char pad_0[0x7C];
    /* 0x7C */ f32 sp7C;                            /* inferred */
    /* 0x80 */ f32 sp80;                            /* inferred */
    /* 0x84 */ f32 sp84;                            /* inferred */
    /* 0x88 */ char pad_88[0x8];
};                                                  /* size = 0x90 */

struct _mips2c_stack_func_809C4DA4 {
    /* 0x00 */ char pad_0[0x28];
    /* 0x28 */ s32 sp28;                            /* inferred */
    /* 0x2C */ char pad_2C[0x4];
    /* 0x30 */ Actor *sp30;                         /* inferred */
    /* 0x34 */ Actor *sp34;                         /* inferred */
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_809C51B4 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ Actor *sp1C;                         /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_809C52B4 {};              /* size 0x0 */

struct _mips2c_stack_func_809C5310 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809C53A4 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809C5408 {
    /* 0x00 */ char pad_0[0x28];
    /* 0x28 */ PosRot *sp28;                        /* inferred */
    /* 0x2C */ PosRot *sp2C;                        /* inferred */
    /* 0x30 */ char pad_30[0x10];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_809C5524 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809C5598 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_809C5738 {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ PosRot *sp2C;                        /* inferred */
    /* 0x30 */ char pad_30[0x10];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_809C59A4 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_809C59F0 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_809C5AA4 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_809C5B1C {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_809C5BA0 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809C5BF4 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ Actor *sp24;                         /* inferred */
    /* 0x28 */ Camera *sp28;                        /* inferred */
    /* 0x2C */ f32 sp2C;                            /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_809C5F44 {};              /* size 0x0 */

? func_800E0308(Camera *, s32, Camera *);           /* extern */
void func_809C493C(Actor *arg0, s32 arg1, f32 arg2, Actor *); /* static */
void func_809C49CC(Actor *arg0);                    /* static */
void func_809C4B50(Actor *arg0);                    /* static */
void func_809C4B6C(Actor *arg0, EnBomBowlMan *);    /* static */
void func_809C4BC4(EnBomBowlMan *arg0, GlobalContext *arg1); /* static */
void func_809C52B4(EnBomBowlMan *arg0);             /* static */
void func_809C53A4(EnBomBowlMan *arg0);             /* static */
void func_809C5524(f32 arg0, EnBomBowlMan *arg1, GlobalContext *); /* static */
void func_809C59A4(EnBomBowlMan *arg0, GlobalContext *arg1); /* static */
void func_809C5BA0(EnBomBowlMan *arg0, GlobalContext *); /* static */
