typedef struct Boss01 {
    /* 0x000 */ Actor actor;
    /* 0x144 */ s16 unk_144;                        /* inferred */
    /* 0x146 */ char pad_146[0x2];
    /* 0x148 */ s32 unk_148;                        /* inferred */
    /* 0x14C */ u8 unk_14C;                         /* inferred */
    /* 0x14D */ char pad_14D[0x1];
    /* 0x14E */ s16 unk_14E;                        /* inferred */
    /* 0x150 */ char pad_150[0x4];                  /* maybe part of unk_14E[3]? */
    /* 0x154 */ f32 unk_154;                        /* inferred */
    /* 0x158 */ f32 unk_158;                        /* inferred */
    /* 0x15C */ s16 unk_15C;                        /* inferred */
    /* 0x15E */ s16 unk_15E;                        /* inferred */
    /* 0x160 */ s8 unk_160;                         /* inferred */
    /* 0x161 */ u8 unk_161;                         /* inferred */
    /* 0x162 */ u8 unk_162;                         /* inferred */
    /* 0x163 */ u8 unk_163;                         /* inferred */
    /* 0x164 */ SkelAnime unk_164;                  /* inferred */
    /* 0x1A8 */ f32 unk_1A8;                        /* inferred */
    /* 0x1AC */ f32 unk_1AC;                        /* inferred */
    /* 0x1B0 */ char pad_1B0[0x8];                  /* maybe part of unk_1AC[3]? */
    /* 0x1B8 */ u8 unk_1B8;                         /* inferred */
    /* 0x1B9 */ u8 unk_1B9;                         /* inferred */
    /* 0x1BA */ u8 unk_1BA;                         /* inferred */
    /* 0x1BB */ u8 unk_1BB;                         /* inferred */
    /* 0x1BC */ u8 unk_1BC;                         /* inferred */
    /* 0x1BD */ char pad_1BD[0x1];
    /* 0x1BE */ s16 unk_1BE;                        /* inferred */
    /* 0x1C0 */ u8 unk_1C0;                         /* inferred */
    /* 0x1C1 */ char pad_1C1[0x3];                  /* maybe part of unk_1C0[4]? */
    /* 0x1C4 */ f32 unk_1C4;                        /* inferred */
    /* 0x1C8 */ f32 unk_1C8;                        /* inferred */
    /* 0x1CC */ s16 unk_1CC;                        /* inferred */
    /* 0x1CE */ s16 unk_1CE;                        /* inferred */
    /* 0x1D0 */ Vec3s unk_1D0;                      /* inferred */
    /* 0x1D6 */ char pad_1D6[0x132];                /* maybe part of unk_1D0[52]? */
    /* 0x308 */ Vec3s unk_308;                      /* inferred */
    /* 0x30E */ char pad_30E[0x14A];                /* maybe part of unk_308[56]? */
    /* 0x458 */ f32 unk_458;                        /* inferred */
    /* 0x45C */ f32 unk_45C;                        /* inferred */
    /* 0x460 */ f32 unk_460;                        /* inferred */
    /* 0x464 */ void (*actionFunc)(Boss01 *, GlobalContext *);
    /* 0x468 */ ColliderJntSph unk_468;             /* inferred */
    /* 0x488 */ ColliderJntSphElement unk_488;      /* inferred */
    /* 0x4C8 */ char pad_4C8[0x80];                 /* maybe part of unk_488[3]? */
    /* 0x548 */ ColliderJntSph unk_548;             /* inferred */
    /* 0x568 */ ColliderJntSphElement unk_568;      /* inferred */
    /* 0x5A8 */ ColliderJntSph unk_5A8;             /* inferred */
    /* 0x5C8 */ ColliderJntSphElement unk_5C8;      /* inferred */
    /* 0x608 */ char pad_608[0x280];                /* maybe part of unk_5C8[11]? */
    /* 0x888 */ ColliderJntSph unk_888;             /* inferred */
    /* 0x8A8 */ ColliderJntSphElement unk_8A8;      /* inferred */
    /* 0x8E8 */ char pad_8E8[0x40];
    /* 0x928 */ f32 unk_928;                        /* inferred */
    /* 0x92C */ f32 unk_92C;                        /* inferred */
    /* 0x930 */ f32 unk_930;                        /* inferred */
    /* 0x934 */ char pad_934[0xA8];                 /* maybe part of unk_930[43]? */
    /* 0x9DC */ u32 unk_9DC;                        /* inferred */
    /* 0x9E0 */ s16 unk_9E0;                        /* inferred */
    /* 0x9E2 */ s16 unk_9E2;                        /* inferred */
    /* 0x9E4 */ f32 unk_9E4;                        /* inferred */
    /* 0x9E8 */ f32 unk_9E8;                        /* inferred */
    /* 0x9EC */ f32 unk_9EC;                        /* inferred */
    /* 0x9F0 */ f32 unk_9F0;                        /* inferred */
    /* 0x9F4 */ f32 unk_9F4;                        /* inferred */
    /* 0x9F8 */ f32 unk_9F8;                        /* inferred */
    /* 0x9FC */ f32 unk_9FC;                        /* inferred */
    /* 0xA00 */ f32 unk_A00;                        /* inferred */
    /* 0xA04 */ f32 unk_A04;                        /* inferred */
    /* 0xA08 */ Vec3f unk_A08;                      /* inferred */
    /* 0xA0C */ f32 unk_A0C;                        /* overlap; inferred */
    /* 0xA14 */ f32 unk_A14;                        /* inferred */
    /* 0xA18 */ f32 unk_A18;                        /* inferred */
    /* 0xA1C */ f32 unk_A1C;                        /* inferred */
    /* 0xA20 */ f32 unk_A20;                        /* inferred */
    /* 0xA24 */ f32 unk_A24;                        /* inferred */
    /* 0xA28 */ f32 unk_A28;                        /* inferred */
    /* 0xA2C */ ColliderCylinder unk_A2C;           /* inferred */
    /* 0xA78 */ ColliderCylinder unk_A78;           /* inferred */
    /* 0xAC4 */ f32 unk_AC4;                        /* inferred */
    /* 0xAC8 */ f32 unk_AC8;                        /* inferred */
    /* 0xACC */ f32 unk_ACC;                        /* inferred */
    /* 0xAD0 */ f32 unk_AD0;                        /* inferred */
    /* 0xAD4 */ f32 unk_AD4;                        /* inferred */
    /* 0xAD8 */ u8 unk_AD8;                         /* inferred */
    /* 0xAD9 */ u8 unk_AD9;                         /* inferred */
    /* 0xADA */ s16 unk_ADA;                        /* inferred */
} Boss01;                                           /* size = 0xADC */

struct _mips2c_stack_Boss01_Destroy {};             /* size 0x0 */

struct _mips2c_stack_Boss01_Draw {
    /* 0x00 */ char pad_0[0x38];
    /* 0x38 */ Gfx *sp38;                           /* inferred */
    /* 0x3C */ char pad_3C[0x14];
};                                                  /* size = 0x50 */

struct _mips2c_stack_Boss01_Init {
    /* 0x00 */ char pad_0[0x40];
    /* 0x40 */ ActorContext *sp40;                  /* inferred */
    /* 0x44 */ char pad_44[0xC];
};                                                  /* size = 0x50 */

struct _mips2c_stack_Boss01_Update {
    /* 0x00 */ char pad_0[0x40];
    /* 0x40 */ ColliderJntSph *sp40;                /* inferred */
    /* 0x44 */ ColliderJntSph *sp44;                /* inferred */
    /* 0x48 */ CollisionCheckContext *sp48;         /* inferred */
    /* 0x4C */ char pad_4C[0x14];                   /* maybe part of sp48[6]? */
    /* 0x60 */ s16 sp60;                            /* inferred */
    /* 0x62 */ s16 sp62;                            /* inferred */
    /* 0x64 */ char pad_64[0xC];                    /* maybe part of sp62[7]? */
    /* 0x70 */ Actor *sp70;                         /* inferred */
    /* 0x74 */ char pad_74[0xC];
};                                                  /* size = 0x80 */

struct _mips2c_stack_func_809D0530 {};              /* size 0x0 */

struct _mips2c_stack_func_809D0550 {};              /* size 0x0 */

struct _mips2c_stack_func_809D0678 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_809D082C {};              /* size 0x0 */

struct _mips2c_stack_func_809D089C {};              /* size 0x0 */

struct _mips2c_stack_func_809D092C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809D0AA4 {
    /* 0x00 */ char pad_0[0x98];
    /* 0x98 */ f32 sp98;                            /* inferred */
    /* 0x9C */ f32 sp9C;                            /* inferred */
    /* 0xA0 */ f32 spA0;                            /* inferred */
    /* 0xA4 */ f32 spA4;                            /* inferred */
    /* 0xA8 */ f32 spA8;                            /* inferred */
    /* 0xAC */ f32 spAC;                            /* inferred */
    /* 0xB0 */ f32 spB0;                            /* inferred */
    /* 0xB4 */ f32 spB4;                            /* inferred */
    /* 0xB8 */ f32 spB8;                            /* inferred */
    /* 0xBC */ char pad_BC[0x4];
};                                                  /* size = 0xC0 */

struct _mips2c_stack_func_809D119C {
    /* 0x00 */ char pad_0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_809D1258 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809D12B4 {
    /* 0x00 */ char pad_0[0x30];
    /* 0x30 */ f32 *sp30;                           /* inferred */
    /* 0x34 */ SkelAnime *sp34;                     /* inferred */
    /* 0x38 */ f32 *sp38;                           /* inferred */
    /* 0x3C */ char pad_3C[0x4];
    /* 0x40 */ ? sp40;                              /* inferred */
    /* 0x40 */ char pad_40[0x4];
    /* 0x44 */ f32 sp44;                            /* inferred */
    /* 0x48 */ char pad_48[0x4];
    /* 0x4C */ Camera *sp4C;                        /* inferred */
    /* 0x50 */ char pad_50[0x3];
    /* 0x53 */ u8 sp53;                             /* inferred */
    /* 0x54 */ Actor *sp54;                         /* inferred */
};                                                  /* size = 0x58 */

struct _mips2c_stack_func_809D1AB8 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809D1B2C {
    /* 0x00 */ char pad_0[0x48];
    /* 0x48 */ CutsceneContext *sp48;               /* inferred */
    /* 0x4C */ char pad_4C[0x8];                    /* maybe part of sp48[3]? */
    /* 0x54 */ f32 sp54;                            /* inferred */
    /* 0x58 */ char pad_58[0x4];
    /* 0x5C */ f32 sp5C;                            /* inferred */
    /* 0x60 */ f32 sp60;                            /* inferred */
    /* 0x64 */ f32 sp64;                            /* inferred */
    /* 0x68 */ f32 sp68;                            /* inferred */
    /* 0x6C */ Actor *sp6C;                         /* inferred */
};                                                  /* size = 0x70 */

struct _mips2c_stack_func_809D1E5C {};              /* size 0x0 */

struct _mips2c_stack_func_809D1E74 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809D1EA4 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_809D20D0 {
    /* 0x00 */ char pad_0[0x38];
    /* 0x38 */ SkelAnime *sp38;                     /* inferred */
    /* 0x3C */ char pad_3C[0xC];                    /* maybe part of sp38[4]? */
    /* 0x48 */ Actor *sp48;                         /* inferred */
    /* 0x4C */ f32 sp4C;                            /* inferred */
    /* 0x50 */ f32 sp50;                            /* inferred */
    /* 0x54 */ f32 sp54;                            /* inferred */
    /* 0x58 */ Actor *sp58;                         /* inferred */
    /* 0x5C */ char pad_5C[0x2];
    /* 0x5E */ s16 sp5E;                            /* inferred */
};                                                  /* size = 0x60 */

struct _mips2c_stack_func_809D2588 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809D25E8 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_809D2664 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809D26B8 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ SkelAnime *sp24;                     /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_809D2780 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809D27D4 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_809D2858 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_809D2914 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ SkelAnime *sp24;                     /* inferred */
    /* 0x28 */ char pad_28[0xC];                    /* maybe part of sp24[4]? */
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ char pad_38[0x4];
    /* 0x3C */ f32 sp3C;                            /* inferred */
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_809D2A44 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809D2AA0 {
    /* 0x00 */ char pad_0[0x30];
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ char pad_34[0x4];
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ char pad_3C[0xC];
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_809D2BCC {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ SkelAnime *sp24;                     /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_809D2CDC {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_809D2DE8 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809D2E4C {
    /* 0x00 */ char pad_0[0x28];
    /* 0x28 */ SkelAnime *sp28;                     /* inferred */
    /* 0x2C */ f32 sp2C;                            /* inferred */
    /* 0x30 */ char pad_30[0x4];
    /* 0x34 */ f32 sp34;                            /* inferred */
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_809D3074 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809D30D0 {
    /* 0x00 */ char pad_0[0x28];
    /* 0x28 */ SkelAnime *sp28;                     /* inferred */
    /* 0x2C */ f32 sp2C;                            /* inferred */
    /* 0x30 */ char pad_30[0x4];
    /* 0x34 */ f32 sp34;                            /* inferred */
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_809D32B4 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ void (*sp24)(Boss01 *, GlobalContext *); /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_809D3374 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_809D3400 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809D345C {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ SkelAnime *sp24;                     /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_809D34D4 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809D3530 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ SkelAnime *sp24;                     /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_809D35A8 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ void (*sp1C)(Boss01 *, f32);         /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_809D365C {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ SkelAnime *sp24;                     /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_809D370C {
    /* 0x00 */ char pad_0[0x38];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_809D3A7C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809D3ADC {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ SkelAnime *sp24;                     /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_809D3C10 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_809D3CD0 {
    /* 0x00 */ char pad_0[0x58];
    /* 0x58 */ f32 *sp58;                           /* inferred */
    /* 0x5C */ f32 *sp5C;                           /* inferred */
    /* 0x60 */ CutsceneContext *sp60;               /* inferred */
    /* 0x64 */ char pad_64[0x8];                    /* maybe part of sp60[3]? */
    /* 0x6C */ ? sp6C;                              /* inferred */
    /* 0x6C */ char pad_6C[0x4];
    /* 0x70 */ f32 sp70;                            /* inferred */
    /* 0x74 */ char pad_74[0x16];                   /* maybe part of sp70[6]? */
    /* 0x8A */ s16 sp8A;                            /* inferred */
    /* 0x8C */ f32 sp8C;                            /* inferred */
    /* 0x90 */ f32 sp90;                            /* inferred */
    /* 0x94 */ f32 sp94;                            /* inferred */
    /* 0x98 */ ? sp98;                              /* inferred */
    /* 0x98 */ char pad_98[0x4];
    /* 0x9C */ f32 sp9C;                            /* inferred */
    /* 0xA0 */ char pad_A0[0x4];
    /* 0xA4 */ s16 spA4;                            /* inferred */
    /* 0xA6 */ char pad_A6[0x2];
    /* 0xA8 */ Camera *spA8;                        /* inferred */
    /* 0xAC */ char pad_AC[0x8];                    /* maybe part of spA8[3]? */
    /* 0xB4 */ f32 spB4;                            /* inferred */
    /* 0xB8 */ f32 spB8;                            /* inferred */
    /* 0xBC */ f32 spBC;                            /* inferred */
};                                                  /* size = 0xC0 */

struct _mips2c_stack_func_809D441C {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_809D4464 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809D44C0 {
    /* 0x00 */ char pad_0[0x80];
    /* 0x80 */ f32 sp80;                            /* inferred */
    /* 0x84 */ f32 sp84;                            /* inferred */
    /* 0x88 */ f32 sp88;                            /* inferred */
    /* 0x8C */ f32 sp8C;                            /* inferred */
    /* 0x90 */ f32 sp90;                            /* inferred */
    /* 0x94 */ f32 sp94;                            /* inferred */
};                                                  /* size = 0x98 */

struct _mips2c_stack_func_809D4668 {};              /* size 0x0 */

struct _mips2c_stack_func_809D519C {
    /* 0x00 */ char pad_0[0x78];
};                                                  /* size = 0x78 */

struct _mips2c_stack_func_809D5584 {};              /* size 0x0 */

struct _mips2c_stack_func_809D55CC {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ MtxF *sp18;                          /* inferred */
    /* 0x1C */ s8 *sp1C;                            /* inferred */
    /* 0x20 */ char pad_20[0x4];
    /* 0x24 */ Gfx *sp24;                           /* inferred */
    /* 0x28 */ char pad_28[0x4];
    /* 0x2C */ Gfx *sp2C;                           /* inferred */
    /* 0x30 */ char pad_30[0xC];                    /* maybe part of sp2C[4]? */
    /* 0x3C */ GraphicsContext *sp3C;               /* inferred */
    /* 0x40 */ ? sp40;                              /* inferred */
    /* 0x40 */ char pad_40[0xF];
    /* 0x4F */ s8 sp4F;                             /* inferred */
    /* 0x50 */ char pad_50[0x8];
};                                                  /* size = 0x58 */

struct _mips2c_stack_func_809D5B0C {
    /* 0x00 */ char pad_0[0x34];
    /* 0x34 */ Actor *sp34;                         /* inferred */
    /* 0x38 */ char pad_38[0x8];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_809D5BC4 {
    /* 0x00 */ char pad_0[0x60];
    /* 0x60 */ u8 *sp60;                            /* inferred */
    /* 0x64 */ char pad_64[0x4];
    /* 0x68 */ f32 sp68;                            /* inferred */
    /* 0x6C */ f32 sp6C;                            /* inferred */
    /* 0x70 */ char pad_70[0x4];
    /* 0x74 */ f32 sp74;                            /* inferred */
    /* 0x78 */ f32 sp78;                            /* inferred */
    /* 0x7C */ f32 sp7C;                            /* inferred */
    /* 0x80 */ char pad_80[0x10];                   /* maybe part of sp7C[5]? */
    /* 0x90 */ s32 sp90;                            /* inferred */
    /* 0x94 */ char pad_94[0x14];
};                                                  /* size = 0xA8 */

struct _mips2c_stack_func_809D5FB4 {
    /* 0x00 */ char pad_0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_809D606C {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ Gfx *sp1C;                           /* inferred */
    /* 0x20 */ char pad_20[0x10];                   /* maybe part of sp1C[5]? */
    /* 0x30 */ GraphicsContext *sp30;               /* inferred */
    /* 0x34 */ char pad_34[0xC];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_809D62D4 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809D6314 {
    /* 0x00 */ char pad_0[0x22];
    /* 0x22 */ s16 sp22;                            /* inferred */
    /* 0x24 */ char pad_24[0x4];                    /* maybe part of sp22[3]? */
    /* 0x28 */ Actor *sp28;                         /* inferred */
    /* 0x2C */ f32 sp2C;                            /* inferred */
    /* 0x30 */ char pad_30[0x8];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_809D6424 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809D6488 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809D64E0 {};              /* size 0x0 */

struct _mips2c_stack_func_809D6540 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_809D6588 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809D65E0 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_809D670C {
    /* 0x00 */ char pad_0[0x28];
    /* 0x28 */ void *sp28;                          /* inferred */
    /* 0x2C */ s32 *sp2C;                           /* inferred */
    /* 0x30 */ char pad_30[0xC];                    /* maybe part of sp2C[4]? */
    /* 0x3C */ f32 sp3C;                            /* inferred */
    /* 0x40 */ char pad_40[0x4];
    /* 0x44 */ f32 sp44;                            /* inferred */
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_809D694C {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ ColliderCylinder *sp2C;              /* inferred */
    /* 0x30 */ CollisionCheckContext *sp30;         /* inferred */
    /* 0x34 */ char pad_34[0xC];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_809D6B08 {};              /* size 0x0 */

struct _mips2c_stack_func_809D6BB4 {
    /* 0x00 */ char pad_0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_809D6C98 {
    /* 0x00 */ char pad_0[0x88];
    /* 0x88 */ f32 sp88;                            /* inferred */
    /* 0x8C */ f32 sp8C;                            /* inferred */
    /* 0x90 */ f32 sp90;                            /* inferred */
    /* 0x94 */ f32 sp94;                            /* inferred */
    /* 0x98 */ f32 sp98;                            /* inferred */
    /* 0x9C */ f32 sp9C;                            /* inferred */
    /* 0xA0 */ f32 spA0;                            /* inferred */
    /* 0xA4 */ f32 spA4;                            /* inferred */
    /* 0xA8 */ f32 spA8;                            /* inferred */
    /* 0xAC */ char pad_AC[0x4];
};                                                  /* size = 0xB0 */

struct _mips2c_stack_func_809D6E7C {
    /* 0x00 */ char pad_0[0x78];
};                                                  /* size = 0x78 */

struct _mips2c_stack_func_809D73D4 {
    /* 0x00 */ char pad_0[0x84];
    /* 0x84 */ Gfx *sp84;                           /* inferred */
    /* 0x88 */ MtxF *sp88;                          /* inferred */
    /* 0x8C */ char pad_8C[0x44];
};                                                  /* size = 0xD0 */

? EffectSsKFire_Spawn(GlobalContext *, f32 *, Vec3f *, ? *, s32, s32); /* extern */
? func_800BC848(Actor *, GlobalContext *, ?, ?);    /* extern */
? func_8013EC44(?, ?, ?, ?);                        /* extern */
? func_8016981C(GlobalContext *, s16, ? *, SkelAnime *, f32 *); /* extern */
void func_809D0530(s32 arg0, s32 arg1, s32 arg2);   /* static */
f32 func_809D0550();                                /* static */
void func_809D0678(void *arg0, f32 *arg1, s16 arg2); /* static */
void func_809D082C(void *arg0, PosRot *arg1);       /* static */
void func_809D089C(s8 arg0, MtxF *arg1, ? *arg2);   /* static */
void func_809D092C(Boss01 *arg0, GlobalContext *arg1, u8 arg2); /* static */
void func_809D0AA4(Boss01 *arg0, GlobalContext *arg1, s32 arg2); /* static */
void func_809D119C(Boss01 *arg0, GlobalContext *arg1); /* static */
