? EffectSsKFire_Spawn(GlobalContext *, f32 *, Vec3f *, ? *, s32, s32); /* extern */
? func_800BC848(Actor *, GlobalContext *, ?, ?);    /* extern */
? func_8013EC44(?, ?, ?, ?);                        /* extern */
? func_8016981C(GlobalContext *, s16, ? *, SkelAnime *, f32 *); /* extern */
void func_809D0530(s32 arg0, s32 arg1, s32 arg2);   /* static */
f32 func_809D0550();                                /* static */
void func_809D0678(void *arg0, f32 *arg1, s16 arg2); /* static */
void func_809D082C(void *arg0, PosRot *arg1);       /* static */
void func_809D089C(s8 arg0, MtxF *arg1, Vec3f *arg2); /* static */
void func_809D092C(Boss01 *arg0, GlobalContext *arg1, u8 arg2); /* static */
void func_809D0AA4(Boss01 *arg0, GlobalContext *arg1, s32 arg2); /* static */
void func_809D119C(Boss01 *arg0, GlobalContext *arg1); /* static */
void func_809D1258(Boss01 *arg0, GlobalContext *arg1); /* static */
void func_809D1AB8(Boss01 *arg0, u8 arg1);          /* static */
void func_809D1E5C(Boss01 *arg0, GlobalContext *arg1); /* static */
void func_809D1EA4(Boss01 *arg0, GlobalContext *arg1, s32 arg2, Boss01 *); /* static */
void func_809D2588(Actor *arg0, GlobalContext *arg1, s16); /* static */
void func_809D2664(Boss01 *arg0, GlobalContext *arg1); /* static */
void func_809D2780(Boss01 *arg0, GlobalContext *arg1); /* static */
void func_809D2858(Boss01 *arg0, GlobalContext *arg1, Boss01 *); /* static */
void func_809D2914(Actor *arg0, GlobalContext *arg1); /* static */

        {3, {0xF7CFFFFF, 4, 4}, {0xF7CFFFFF, 0, 0}, 9, 1, 1},
        {0, {{0, 0, 0}, 0x24}, 0x64},
    },
};
static ColliderJntSphInit D_809D7C64 = {{3, 0x11, 9, 9, 0x10, 0}, 2, &D_809D7C1C};
static ColliderCylinderInit D_809D7C74 = {
    {3, 0x11, 9, 0x39, 0x10, 1},
    {3, {0xF7CFFFFF, 0, 4}, {0xF7FFFFFF, 0, 0}, 1, 1, 1},
    {0xF, 0xF, 0xA, {0, 0, 0}},
};
static ColliderCylinderInit D_809D7CA0 = {
    {3, 0x11, 9, 0x39, 0x10, 1},
    {3, {0xF7CFFFFF, 0, 4}, {0xF7FFFFFF, 0, 0}, 1, 1, 1},
    {8, 0xF, 0xA, {0, 0, 0}},
};
static Color_RGBA8 D_809D7CEC = {0x3C, 0x32, 0x14, 0xFF};
static Color_RGBA8 D_809D7CF0 = {0x28, 0x1E, 0x1E, 0xFF};
static ? D_809D7CF4;                                /* unable to generate initializer */
static f32 D_809D7D24 = {0.0f, 350.0f, -350.0f, 350.0f, -350.0f};
static ? D_809D7D38;                                /* unable to generate initializer */
static Color_RGBA8 D_809D7D4C = {0xAA, 0xFF, 0xFF, 0xFF};
static Color_RGBA8 D_809D7D50 = {0xC8, 0xC8, 0xFF, 0xFF};
static Vec3f D_809D7D54 = {0.0f, -1.0f, 0.0f};
static u8 D_809D7D60 = {0, 2, 4, 6, 8, 0xA, 0xC, 0xE, 0x10, 0x12, 0x14, 0};
static u8 D_809D7D6C = {1, 3, 5, 7, 9, 0xB, 0xD, 0xF, 0x11, 0x13, 0x15, 0};
static ? D_809D7D78;                                /* unable to generate initializer */
static ? D_809D7D7A;                                /* unable to generate initializer */
static ? D_809D7D7F;                                /* unable to generate initializer */
static ? D_809D7D84;                                /* unable to generate initializer */
static ? D_809D7D8F;                                /* unable to generate initializer */
static ? D_809D7D97;                                /* unable to generate initializer */
static ? D_809D7D98;                                /* unable to generate initializer */
static ? D_809D7DB4;                                /* unable to generate initializer */
static Vec3f D_809D7E38 = {0.0f, 500.0f, 0.0f};
static Vec3f D_809D7E44 = {500.0f, -2500.0f, 0.0f};
static Vec3f D_809D7E50 = {1500.0f, -7000.0f, 0.0f};
static Vec3f D_809D7E5C = {5000.0f, 0.0f, 9000.0f};
static ? D_809D7E68;                                /* unable to generate initializer */
static Vec3f D_809D7EA0 = {10000.0f, 10000.0f, 10000.0f};
static s32 D_809D7EAC = {1, 2, 3, 3, 2, 1};
static s32 D_809D7EC4 = {2, 3, 4, 4, 4, 3, 2};
static s32 D_809D7EE0 = {2, 3, 4, 4, 4, 4, 3, 2};
static s32 D_809D7F00 = {2, 4, 5, 5, 6, 6, 6, 6, 5, 5, 4, 2};
static ? D_809D7F30;                                /* unable to generate initializer */
static ? D_809D7F6C;                                /* unable to generate initializer */
static s16 D_809D8A10;
static Boss01 *D_809D8A14;
static Actor *D_809D8A18;
static f32 D_809D8A1C;
static f32 D_809D8A20;
static f32 D_809D8A24;
static f32 D_809D8A28;
static f32 D_809D8A2C;
static f32 D_809D8A30;
static f32 D_809D8A34;
static u8 D_809D8A38;
static Vec3f D_809D8A40;
static s32 D_809D8A4C;
static s32 D_809D8A50;
static s32 D_809D8A54;
static void D_809D8A58;

typedef struct Boss01 {
    /* 0x0000 */ Actor actor;
    /* 0x0144 */ s16 unk144;                        /* inferred */
    /* 0x0146 */ char pad146[0x2];                  /* maybe part of unk144[2]? */
    /* 0x0148 */ s32 unk148;                        /* inferred */
    /* 0x014C */ u8 unk14C;                         /* inferred */
    /* 0x014D */ char pad14D[0x1];                  /* maybe part of unk14C[2]? */
    /* 0x014E */ s16 unk14E;                        /* inferred */
    /* 0x0150 */ char pad150[0x4];                  /* maybe part of unk14E[3]? */
    /* 0x0154 */ f32 unk154;                        /* inferred */
    /* 0x0158 */ f32 unk158;                        /* inferred */
    /* 0x015C */ s16 unk15C;                        /* inferred */
    /* 0x015E */ s16 unk15E;                        /* inferred */
    /* 0x0160 */ s8 unk160;                         /* inferred */
    /* 0x0161 */ u8 unk161;                         /* inferred */
    /* 0x0162 */ u8 unk162;                         /* inferred */
    /* 0x0163 */ u8 unk163;                         /* inferred */
    /* 0x0164 */ SkelAnime unk164;                  /* inferred */
    /* 0x01A8 */ f32 unk1A8;                        /* inferred */
    /* 0x01AC */ f32 unk1AC;                        /* inferred */
    /* 0x01B0 */ f32 unk1B0;                        /* inferred */
    /* 0x01B4 */ char pad1B4[0x4];                  /* maybe part of unk1B0[2]? */
    /* 0x01B8 */ u8 unk1B8;                         /* inferred */
    /* 0x01B9 */ u8 unk1B9;                         /* inferred */
    /* 0x01BA */ u8 unk1BA;                         /* inferred */
    /* 0x01BB */ u8 unk1BB;                         /* inferred */
    /* 0x01BC */ u8 unk1BC;                         /* inferred */
    /* 0x01BD */ char pad1BD[0x1];                  /* maybe part of unk1BC[2]? */
    /* 0x01BE */ s16 unk1BE;                        /* inferred */
    /* 0x01C0 */ u8 unk1C0;                         /* inferred */
    /* 0x01C1 */ u8 unk1C1;                         /* inferred */
    /* 0x01C2 */ char pad1C2[0x2];                  /* maybe part of unk1C1[3]? */
    /* 0x01C4 */ f32 unk1C4;                        /* inferred */
    /* 0x01C8 */ f32 unk1C8;                        /* inferred */
    /* 0x01CC */ s16 unk1CC;                        /* inferred */
    /* 0x01CE */ s16 unk1CE;                        /* inferred */
    /* 0x01D0 */ Vec3s unk1D0;                      /* inferred */
    /* 0x01D6 */ char pad1D6[0x132];                /* maybe part of unk1D0[52]? */
    /* 0x0308 */ Vec3s unk308;                      /* inferred */
    /* 0x030E */ char pad30E[0x14A];                /* maybe part of unk308[56]? */
    /* 0x0458 */ f32 unk458;                        /* inferred */
    /* 0x045C */ f32 unk45C;                        /* inferred */
    /* 0x0460 */ f32 unk460;                        /* inferred */
    /* 0x0464 */ void (*actionFunc)(Boss01 *, GlobalContext *);
    /* 0x0468 */ ColliderJntSph unk468;             /* inferred */
    /* 0x0488 */ ColliderJntSphElement unk488;      /* inferred */
    /* 0x04C8 */ char pad4C8[0x80];                 /* maybe part of unk488[3]? */
    /* 0x0548 */ ColliderJntSph unk548;             /* inferred */
    /* 0x0568 */ ColliderJntSphElement unk568;      /* inferred */
    /* 0x05A8 */ ColliderJntSph unk5A8;             /* inferred */
    /* 0x05C8 */ ColliderJntSphElement unk5C8;      /* inferred */
    /* 0x0608 */ char pad608[0x280];                /* maybe part of unk5C8[11]? */
    /* 0x0888 */ ColliderJntSph unk888;             /* inferred */
    /* 0x08A8 */ ColliderJntSphElement unk8A8;      /* inferred */
    /* 0x08E8 */ char pad8E8[0x40];                 /* maybe part of unk8A8[2]? */
    /* 0x0928 */ f32 unk928;                        /* inferred */
    /* 0x092C */ f32 unk92C;                        /* inferred */
    /* 0x0930 */ f32 unk930;                        /* inferred */
    /* 0x0934 */ char pad934[0xA8];                 /* maybe part of unk930[43]? */
    /* 0x09DC */ u32 unk9DC;                        /* inferred */
    /* 0x09E0 */ s16 unk9E0;                        /* inferred */
    /* 0x09E2 */ s16 unk9E2;                        /* inferred */
    /* 0x09E4 */ f32 unk9E4;                        /* inferred */
    /* 0x09E8 */ f32 unk9E8;                        /* inferred */
    /* 0x09EC */ f32 unk9EC;                        /* inferred */
    /* 0x09F0 */ f32 unk9F0;                        /* inferred */
    /* 0x09F4 */ f32 unk9F4;                        /* inferred */
    /* 0x09F8 */ f32 unk9F8;                        /* inferred */
    /* 0x09FC */ f32 unk9FC;                        /* inferred */
    /* 0x0A00 */ f32 unkA00;                        /* inferred */
    /* 0x0A04 */ f32 unkA04;                        /* inferred */
    /* 0x0A08 */ Vec3f unkA08;                      /* inferred */
    /* 0x0A0C */ f32 unkA0C;                        /* overlap; inferred */
    /* 0x0A10 */ char padA10[0x4];                  /* maybe part of unkA0C[2]? */
    /* 0x0A14 */ f32 unkA14;                        /* inferred */
    /* 0x0A18 */ f32 unkA18;                        /* inferred */
    /* 0x0A1C */ f32 unkA1C;                        /* inferred */
    /* 0x0A20 */ f32 unkA20;                        /* inferred */
    /* 0x0A24 */ f32 unkA24;                        /* inferred */
    /* 0x0A28 */ f32 unkA28;                        /* inferred */
    /* 0x0A2C */ ColliderCylinder unkA2C;           /* inferred */
    /* 0x0A78 */ ColliderCylinder unkA78;           /* inferred */
    /* 0x0AC4 */ f32 unkAC4;                        /* inferred */
    /* 0x0AC8 */ f32 unkAC8;                        /* inferred */
    /* 0x0ACC */ f32 unkACC;                        /* inferred */
    /* 0x0AD0 */ f32 unkAD0;                        /* inferred */
    /* 0x0AD4 */ f32 unkAD4;                        /* inferred */
    /* 0x0AD8 */ u8 unkAD8;                         /* inferred */
    /* 0x0AD9 */ u8 unkAD9;                         /* inferred */
    /* 0x0ADA */ s16 unkADA;                        /* inferred */
} Boss01;                                           /* size 0xADC */

void func_809D0530(s32 arg0, s32 arg1, s32 arg2) {
    D_809D8A4C = arg0;
    D_809D8A50 = arg1;
    D_809D8A54 = arg2;
}

f32 func_809D0550(void) {
    f32 temp_f2;
    f32 temp_f2_2;
    f32 temp_f6;
    s32 temp_f16;
    s32 temp_hi;
    s32 temp_hi_2;
    s32 temp_t7;
    f32 phi_f2;
    f32 phi_f2_2;

    temp_hi = (s32) (D_809D8A4C * 0xAB) % 0x763D;
    temp_hi_2 = (s32) (D_809D8A50 * 0xAC) % 0x7663;
    temp_f16 = temp_hi_2;
    temp_t7 = (s32) (D_809D8A54 * 0xAA) % 0x7673;
    temp_f6 = (f32) temp_hi;
    D_809D8A4C = temp_hi;
    D_809D8A50 = temp_hi_2;
    D_809D8A54 = temp_t7;
    temp_f2 = (temp_f6 / 30269.0f) + ((f32) temp_f16 / 30307.0f) + ((f32) temp_t7 / 30323.0f);
    phi_f2 = temp_f2;
    phi_f2_2 = temp_f2;
    if (temp_f2 >= 1.0f) {
        do {
            temp_f2_2 = phi_f2 - 1.0f;
            phi_f2 = temp_f2_2;
