typedef struct DmChar01 {
    /* 0x000 */ Actor actor;
    /* 0x144 */ s32 unk_144;                        /* inferred */
    /* 0x148 */ char pad_148[0x58];                 /* maybe part of unk_144[23]? */
    /* 0x1A0 */ void (*actionFunc)(DmChar01 *, GlobalContext *);
    /* 0x1A4 */ char pad_1A4[0x8];                  /* maybe part of actionFunc[3]? */
    /* 0x1AC */ s16 unk_1AC;                        /* inferred */
    /* 0x1AE */ char pad_1AE[0x198];                /* maybe part of unk_1AC[205]? */
    /* 0x346 */ s16 unk_346;                        /* inferred */
    /* 0x348 */ f32 unk_348;                        /* inferred */
    /* 0x34C */ u8 unk_34C;                         /* inferred */
    /* 0x34D */ u8 unk_34D;                         /* inferred */
    /* 0x34E */ char pad_34E[0x2];                  /* maybe part of unk_34D[3]? */
} DmChar01;                                         /* size = 0x350 */

struct _mips2c_stack_DmChar01_Destroy {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_DmChar01_Draw {
    /* 0x00 */ char pad_0[0x44];
    /* 0x44 */ f32 sp44;                            /* inferred */
    /* 0x48 */ f32 sp48;                            /* inferred */
    /* 0x4C */ f32 sp4C;                            /* inferred */
    /* 0x50 */ char pad_50[0xC];                    /* maybe part of sp4C[4]? */
    /* 0x5C */ Gfx *sp5C;                           /* inferred */
    /* 0x60 */ char pad_60[0x10];                   /* maybe part of sp5C[5]? */
    /* 0x70 */ GraphicsContext *sp70;               /* inferred */
    /* 0x74 */ char pad_74[0x4];
    /* 0x78 */ Gfx *sp78;                           /* inferred */
    /* 0x7C */ Gfx *sp7C;                           /* inferred */
    /* 0x80 */ char pad_80[0x14];                   /* maybe part of sp7C[6]? */
    /* 0x94 */ Gfx *sp94;                           /* inferred */
    /* 0x98 */ Gfx *sp98;                           /* inferred */
    /* 0x9C */ char pad_9C[0x14];                   /* maybe part of sp98[6]? */
    /* 0xB0 */ GraphicsContext *spB0;               /* inferred */
    /* 0xB4 */ char pad_B4[0x3];
    /* 0xB7 */ u8 spB7;                             /* inferred */
    /* 0xB8 */ s32 spB8;                            /* inferred */
    /* 0xBC */ f32 spBC;                            /* inferred */
    /* 0xC0 */ char pad_C0[0x8];
};                                                  /* size = 0xC8 */

struct _mips2c_stack_DmChar01_Init {
    /* 0x00 */ char pad_0[0x38];
};                                                  /* size = 0x38 */

struct _mips2c_stack_DmChar01_Update {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80AA8698 {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ Actor *sp18;                         /* inferred */
    /* 0x1C */ Actor *sp1C;                         /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80AA884C {
    /* 0x00 */ char pad_0[0x1E];
    /* 0x1E */ s16 sp1E;                            /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80AA88A8 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80AA892C {
    /* 0x00 */ char pad_0[0x60];
};                                                  /* size = 0x60 */

struct _mips2c_stack_func_80AA8C28 {
    /* 0x00 */ char pad_0[0x70];
};                                                  /* size = 0x70 */

struct _mips2c_stack_func_80AA8F0C {};              /* size 0x0 */

struct _mips2c_stack_func_80AA8F1C {};              /* size 0x0 */

struct _mips2c_stack_func_80AA8F2C {
    /* 0x00 */ char pad_0[0x38];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80AA9020 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80AA90AC {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80AA90F4 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

void func_80AA8698(DmChar01 *, GlobalContext *);    /* static */
void func_80AA884C(DmChar01 *, GlobalContext *);    /* static */
void func_80AA88A8(DmChar01 *, GlobalContext *);    /* static */
void func_80AA892C(DmChar01 *, GlobalContext *);    /* static */
void func_80AA8C28(DmChar01 *, GlobalContext *);    /* static */
void func_80AA8F0C(DmChar01 *arg0, GlobalContext *arg1); /* static */
void func_80AA8F1C(DmChar01 *, GlobalContext *);    /* static */
void func_80AA8F2C(DmChar01 *, GlobalContext *);    /* static */
void func_80AA9020(DmChar01 *, GlobalContext *);    /* static */
void func_80AA90AC(DmChar01 *, GlobalContext *);    /* static */
void func_80AA90F4(DmChar01 *, GlobalContext *);    /* static */
extern ? D_06009928;
extern void D_06009D70;
extern CollisionHeader D_06009E4C;
extern Gfx D_0600A398;
extern void D_0600A5C0;
extern Gfx D_0600A8F8;
extern void D_0600AA50;
