typedef struct EnHorseLinkChild {
    /* 0x000 */ Actor actor;
    /* 0x144 */ s32 unk_144;                        /* inferred */
    /* 0x148 */ s32 unk_148;                        /* inferred */
    /* 0x14C */ ? unk_14C;                          /* inferred */
    /* 0x14C */ char pad_14C[0x4C];
    /* 0x198 */ SkelAnime unk_198;                  /* inferred */
    /* 0x1DC */ char pad_1DC[0x8];
    /* 0x1E4 */ u8 unk_1E4;                         /* inferred */
    /* 0x1E5 */ char pad_1E5[0x3];                  /* maybe part of unk_1E4[4]? */
    /* 0x1E8 */ s32 unk_1E8;                        /* inferred */
    /* 0x1EC */ ColliderCylinder unk_1EC;           /* inferred */
    /* 0x238 */ ColliderJntSph unk_238;             /* inferred */
    /* 0x258 */ ColliderJntSphElement unk_258;      /* inferred */
    /* 0x298 */ char pad_298[0x4];
} EnHorseLinkChild;                                 /* size = 0x29C */

struct _mips2c_stack_EnHorseLinkChild_Destroy {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnHorseLinkChild_Draw {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_EnHorseLinkChild_Init {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ ColliderJntSph *sp2C;                /* inferred */
    /* 0x30 */ char pad_30[0x8];
};                                                  /* size = 0x38 */

struct _mips2c_stack_EnHorseLinkChild_Update {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ ColliderCylinder *sp2C;              /* inferred */
    /* 0x30 */ char pad_30[0x8];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_808DE5C0 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_808DE660 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_808DE728 {};              /* size 0x0 */

struct _mips2c_stack_func_808DE9A8 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_808DEA0C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_808DEA54 {
    /* 0x00 */ char pad_0[0x30];
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ char pad_34[0x4];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_808DEB14 {
    /* 0x00 */ char pad_0[0x34];
    /* 0x34 */ f32 *sp34;                           /* inferred */
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ char pad_3C[0x8];                    /* maybe part of sp38[3]? */
    /* 0x44 */ f32 sp44;                            /* inferred */
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_808DECA0 {
    /* 0x00 */ char pad_0[0x30];
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ char pad_34[0x4];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_808DED40 {
    /* 0x00 */ char pad_0[0x30];
    /* 0x30 */ f32 *sp30;                           /* inferred */
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ char pad_38[0x10];
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_808DEFE8 {
    /* 0x00 */ char pad_0[0x30];
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ char pad_34[0x4];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_808DF088 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ Vec3f *sp24;                         /* inferred */
    /* 0x28 */ char pad_28[0xA];                    /* maybe part of sp24[3]? */
    /* 0x32 */ s16 sp32;                            /* inferred */
    /* 0x34 */ Actor *sp34;                         /* inferred */
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_808DF194 {
    /* 0x00 */ char pad_0[0x30];
    /* 0x30 */ f32 *sp30;                           /* inferred */
    /* 0x34 */ PosRot *sp34;                        /* inferred */
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ char pad_3C[0x8];                    /* maybe part of sp38[3]? */
    /* 0x44 */ f32 sp44;                            /* inferred */
    /* 0x48 */ u32 sp48;                            /* inferred */
    /* 0x4C */ s32 sp4C;                            /* inferred */
    /* 0x50 */ f32 sp50;                            /* inferred */
    /* 0x54 */ Actor *sp54;                         /* inferred */
};                                                  /* size = 0x58 */

struct _mips2c_stack_func_808DF560 {
    /* 0x00 */ char pad_0[0x30];
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ char pad_34[0x4];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_808DF620 {
    /* 0x00 */ char pad_0[0x30];
    /* 0x30 */ f32 *sp30;                           /* inferred */
    /* 0x34 */ char pad_34[0x2];
    /* 0x36 */ s16 sp36;                            /* inferred */
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_808DF788 {
    /* 0x00 */ char pad_0[0x30];
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ char pad_34[0x4];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_808DF838 {
    /* 0x00 */ char pad_0[0x30];
    /* 0x30 */ f32 *sp30;                           /* inferred */
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ char pad_38[0x10];
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_808DFC3C {
    /* 0x00 */ char pad_0[0x40];
    /* 0x40 */ f32 sp40;                            /* inferred */
    /* 0x44 */ f32 sp44;                            /* inferred */
    /* 0x48 */ f32 sp48;                            /* inferred */
    /* 0x4C */ f32 sp4C;                            /* inferred */
    /* 0x50 */ f32 sp50;                            /* inferred */
    /* 0x54 */ f32 sp54;                            /* inferred */
};                                                  /* size = 0x58 */

struct _mips2c_stack_func_808DFDC8 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ s32 *sp1C;                           /* inferred */
    /* 0x20 */ char pad_20[0x10];
};                                                  /* size = 0x30 */

? func_800F415C(Actor *, PosRot *, ?);              /* extern */
? func_80138258(EnHorseLinkChild *, GlobalContext *, ? *, void (*)(void *, GlobalContext *, ?), ? (*)(void *, void **, s32, ?), s32); /* extern */
? func_80138300(?, u8, f32 *, f32 *);               /* extern */
? func_8013859C(GlobalContext *, ? *, ? *, ? *);    /* extern */
? func_80138700(GlobalContext *, ? *);              /* extern */
void func_808DE5C0(EnHorseLinkChild *arg0, EnHorseLinkChild *); /* static */
void func_808DE660(EnHorseLinkChild *arg0);         /* static */
f32 func_808DE728(Actor *arg0, s32);                /* static */
void func_808DE9A8(Actor *arg0, Actor *);           /* static */
void func_808DEA0C(Actor *arg0, ? arg1);            /* static */
void func_808DEA54(Actor *arg0, s32 arg1);          /* static */
void func_808DEB14(Actor *arg0, void *arg1);        /* static */
