typedef struct EnPoSisters {
    /* 0x000 */ Actor actor;
    /* 0x144 */ SkelAnime unk_144;                  /* inferred */
    /* 0x188 */ void (*actionFunc)(EnPoSisters *, GlobalContext *);
    /* 0x18C */ u8 unk_18C;                         /* inferred */
    /* 0x18D */ u8 unk_18D;                         /* inferred */
    /* 0x18E */ u8 unk_18E;                         /* inferred */
    /* 0x18F */ s8 unk_18F;                         /* inferred */
    /* 0x190 */ u8 unk_190;                         /* inferred */
    /* 0x191 */ u8 unk_191;                         /* inferred */
    /* 0x192 */ s16 unk_192;                        /* inferred */
    /* 0x194 */ s16 unk_194;                        /* inferred */
    /* 0x196 */ Vec3s unk_196;                      /* inferred */
    /* 0x19C */ char pad_19C[0x42];                 /* maybe part of unk_196[12]? */
    /* 0x1DE */ Vec3s unk_1DE;                      /* inferred */
    /* 0x1E4 */ char pad_1E4[0x42];                 /* maybe part of unk_1DE[12]? */
    /* 0x226 */ u8 unk_226;                         /* inferred */
    /* 0x227 */ u8 unk_227;                         /* inferred */
    /* 0x228 */ u8 unk_228;                         /* inferred */
    /* 0x229 */ u8 unk_229;                         /* inferred */
    /* 0x22A */ char pad_22A[0x2];                  /* maybe part of unk_229[3]? */
    /* 0x22C */ f32 unk_22C;                        /* inferred */
    /* 0x230 */ f32 unk_230;                        /* inferred */
    /* 0x234 */ f32 unk_234;                        /* inferred */
    /* 0x238 */ char pad_238[0x4];
    /* 0x23C */ f32 unk_23C;                        /* inferred */
    /* 0x240 */ char pad_240[0x4C];                 /* maybe part of unk_23C[20]? */
    /* 0x28C */ Vec3f unk_28C;                      /* inferred */
    /* 0x298 */ char pad_298[0x54];                 /* maybe part of unk_28C[8]? */
    /* 0x2EC */ f32 unk_2EC;                        /* inferred */
    /* 0x2F0 */ f32 unk_2F0;                        /* inferred */
    /* 0x2F4 */ f32 unk_2F4;                        /* inferred */
    /* 0x2F8 */ LightNode *unk_2F8;                 /* inferred */
    /* 0x2FC */ LightInfo unk_2FC;                  /* inferred */
    /* 0x30A */ char pad_30A[0x2];
    /* 0x30C */ ColliderCylinder unk_30C;           /* inferred */
    /* 0x358 */ MtxF unk_358;                       /* inferred */
} EnPoSisters;                                      /* size = 0x398 */

struct _mips2c_stack_EnPoSisters_Destroy {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnPoSisters_Draw {
    /* 0x00 */ char pad_0[0x74];
    /* 0x74 */ Gfx *sp74;                           /* inferred */
    /* 0x78 */ void (*sp78)(EnPoSisters *, GlobalContext *); /* inferred */
    /* 0x7C */ char pad_7C[0x4];
    /* 0x80 */ void (*sp80)(EnPoSisters *, GlobalContext *); /* inferred */
    /* 0x84 */ char pad_84[0x60];                   /* maybe part of sp80[25]? */
    /* 0xE4 */ EnPoSisters *spE4;                   /* inferred */
};                                                  /* size = 0xE8 */

struct _mips2c_stack_EnPoSisters_Init {
    /* 0x00 */ char pad_0[0x34];
    /* 0x34 */ LightInfo *sp34;                     /* inferred */
    /* 0x38 */ char pad_38[0x8];
};                                                  /* size = 0x40 */

struct _mips2c_stack_EnPoSisters_Update {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ ColliderCylinder *sp2C;              /* inferred */
    /* 0x30 */ char pad_30[0xC];                    /* maybe part of sp2C[4]? */
    /* 0x3C */ s32 sp3C;                            /* inferred */
    /* 0x40 */ f32 sp40;                            /* inferred */
    /* 0x44 */ f32 sp44;                            /* inferred */
    /* 0x48 */ f32 sp48;                            /* inferred */
    /* 0x4C */ char pad_4C[0xC];
};                                                  /* size = 0x58 */

struct _mips2c_stack_func_80B1A648 {
    /* 0x00 */ char pad_0[0x40];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80B1A768 {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ f32 sp20;                            /* inferred */
    /* 0x24 */ char pad_24[0x4];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80B1A894 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ f32 sp24;                            /* inferred */
    /* 0x28 */ char pad_28[0x8];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80B1A9B0 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B1AA88 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B1AAE8 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B1AB5C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B1ABB8 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ SkelAnime *sp1C;                     /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80B1AC40 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B1ACB8 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ f32 *sp24;                           /* inferred */
    /* 0x28 */ SkelAnime *sp28;                     /* inferred */
    /* 0x2C */ char pad_2C[0x4];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80B1AE28 {};              /* size 0x0 */

struct _mips2c_stack_func_80B1AE3C {
    /* 0x00 */ char pad_0[0x22];
    /* 0x22 */ s16 sp22;                            /* inferred */
    /* 0x24 */ Actor *sp24;                         /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80B1AF8C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B1B020 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B1B0E0 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B1B168 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ SkelAnime *sp24;                     /* inferred */
    /* 0x28 */ char pad_28[0x8];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80B1B280 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B1B2F0 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80B1B3A8 {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80B1B444 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80B1B5B4 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B1B628 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ SkelAnime *sp24;                     /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80B1B70C {
    /* 0x00 */ char pad_0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80B1B7BC {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B1B860 {
    /* 0x00 */ char pad_0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80B1B940 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B1BA3C {};              /* size 0x0 */

struct _mips2c_stack_func_80B1BA90 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80B1BC4C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B1BCA0 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B1BCF0 {
    /* 0x00 */ char pad_0[0x40];
    /* 0x40 */ ActorContext *sp40;                  /* inferred */
    /* 0x44 */ Actor *sp44;                         /* inferred */
    /* 0x48 */ Actor *sp48;                         /* inferred */
    /* 0x4C */ Actor *sp4C;                         /* inferred */
};                                                  /* size = 0x50 */

struct _mips2c_stack_func_80B1BE4C {
    /* 0x00 */ char pad_0[0x34];
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ f32 sp3C;                            /* inferred */
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80B1BF2C {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ Actor *sp1C;                         /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80B1C030 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B1C0A4 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B1C2E8 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B1C340 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B1C408 {
    /* 0x00 */ char pad_0[0x3C];
    /* 0x3C */ f32 sp3C;                            /* inferred */
    /* 0x40 */ f32 sp40;                            /* inferred */
    /* 0x44 */ f32 sp44;                            /* inferred */
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_80B1C974 {};              /* size 0x0 */

struct _mips2c_stack_func_80B1CB44 {};              /* size 0x0 */

struct _mips2c_stack_func_80B1CD34 {
    /* 0x00 */ char pad_0[0x34];
    /* 0x34 */ s8 *sp34;                            /* inferred */
    /* 0x38 */ void *sp38;                          /* inferred */
    /* 0x3C */ char pad_3C[0x4];
    /* 0x40 */ s32 *sp40;                           /* inferred */
    /* 0x44 */ char pad_44[0xC];
};                                                  /* size = 0x50 */

void func_80B1A648(void *arg0, s32 arg1, void *arg2); /* static */
void func_80B1A768(EnPoSisters *arg0, GlobalContext *arg1, EnPoSisters *); /* static */
void func_80B1A894(Actor *arg0, GlobalContext *arg1); /* static */
void func_80B1A9B0(EnPoSisters *arg0, GlobalContext *); /* static */
void func_80B1AA88(EnPoSisters *arg0);              /* static */
void func_80B1AB5C(EnPoSisters *arg0);              /* static */
void func_80B1AC40(EnPoSisters *arg0, EnPoSisters *); /* static */
void func_80B1AE28(EnPoSisters *arg0);              /* static */
void func_80B1AF8C(EnPoSisters *arg0);              /* static */
void func_80B1B0E0(EnPoSisters *arg0);              /* static */
void func_80B1B280(EnPoSisters *arg0);              /* static */
void func_80B1B3A8(Actor *arg0);                    /* static */
void func_80B1B5B4(EnPoSisters *arg0);              /* static */
