struct _mips2c_stack_EnFirefly_Destroy {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnFirefly_Die {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_EnFirefly_DisturbDiveAttack {
    /* 0x00 */ char pad_0[0x28];
    /* 0x28 */ f32 sp28;                            /* inferred */
    /* 0x2C */ f32 sp2C;                            /* inferred */
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ Actor *sp34;                         /* inferred */
};                                                  /* size = 0x38 */

struct _mips2c_stack_EnFirefly_DiveAttack {
    /* 0x00 */ char pad_0[0x30];
    /* 0x30 */ SkelAnime *sp30;                     /* inferred */
    /* 0x34 */ char pad_34[0x4];
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ f32 sp3C;                            /* inferred */
    /* 0x40 */ f32 sp40;                            /* inferred */
    /* 0x44 */ Actor *sp44;                         /* inferred */
};                                                  /* size = 0x48 */

struct _mips2c_stack_EnFirefly_Draw {
    /* 0x00 */ char pad_0[0x30];
    /* 0x30 */ GraphicsContext *sp30;               /* inferred */
    /* 0x34 */ char pad_34[0xC];
};                                                  /* size = 0x40 */

struct _mips2c_stack_EnFirefly_Extinguish {};       /* size 0x0 */

struct _mips2c_stack_EnFirefly_Fall {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_EnFirefly_FlyAway {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_EnFirefly_FlyIdle {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ SkelAnime *sp2C;                     /* inferred */
    /* 0x30 */ char pad_30[0xC];                    /* maybe part of sp2C[4]? */
    /* 0x3C */ s32 sp3C;                            /* inferred */
};                                                  /* size = 0x40 */

struct _mips2c_stack_EnFirefly_Ignite {};           /* size 0x0 */

struct _mips2c_stack_EnFirefly_Init {
    /* 0x00 */ char pad_0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_EnFirefly_OverrideLimbDraw {}; /* size 0x0 */

struct _mips2c_stack_EnFirefly_Perch {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ SkelAnime *sp24;                     /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_EnFirefly_PostLimbDraw {
    /* 0x00 */ char pad_0[0x5C];
    /* 0x5C */ f32 sp5C;                            /* inferred */
    /* 0x60 */ f32 sp60;                            /* inferred */
    /* 0x64 */ f32 sp64;                            /* inferred */
};                                                  /* size = 0x68 */

struct _mips2c_stack_EnFirefly_Rebound {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_EnFirefly_ReturnToPerch {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_EnFirefly_SeekTorch {
    /* 0x00 */ char pad_0[0x34];
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ f32 sp3C;                            /* inferred */
    /* 0x40 */ char pad_40[0x10];
};                                                  /* size = 0x50 */

struct _mips2c_stack_EnFirefly_SetupDie {};         /* size 0x0 */

struct _mips2c_stack_EnFirefly_SetupDisturbDiveAttack {}; /* size 0x0 */

struct _mips2c_stack_EnFirefly_SetupDiveAttack {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnFirefly_SetupFall {
    /* 0x00 */ char pad_0[0x38];
};                                                  /* size = 0x38 */

struct _mips2c_stack_EnFirefly_SetupFlyAway {};     /* size 0x0 */

struct _mips2c_stack_EnFirefly_SetupFlyIdle {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_EnFirefly_SetupPerch {};       /* size 0x0 */

struct _mips2c_stack_EnFirefly_SetupRebound {};     /* size 0x0 */

struct _mips2c_stack_EnFirefly_SetupStunned {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ void (*sp2C)(EnFirefly *, GlobalContext *); /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_EnFirefly_SpawnIceEffects {
    /* 0x00 */ char pad_0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_EnFirefly_Stunned {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnFirefly_Update {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ ColliderSphere *sp2C;                /* inferred */
    /* 0x30 */ CollisionCheckContext *sp30;         /* inferred */
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ char pad_38[0x8];
};                                                  /* size = 0x40 */

struct _mips2c_stack_EnFirefly_UpdateDamage {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

void EnFirefly_Extinguish(EnFirefly *arg0);         /* static */
void EnFirefly_Ignite(Actor *arg0);                 /* static */
s32 EnFirefly_OverrideLimbDraw(GlobalContext *arg0, s32 arg1, Gfx **arg2, Vec3f *arg3, Vec3s *arg5, Actor *actor, Gfx **gfx); /* static */
void EnFirefly_PostLimbDraw(GlobalContext *arg0, s32 arg1, Gfx **arg2, Vec3s *arg3, Actor *arg4, Gfx **arg5); /* static */
s32 EnFirefly_ReturnToPerch(Actor *arg0, GlobalContext *arg1); /* static */
s32 EnFirefly_SeekTorch(Actor *arg0, GlobalContext *arg1); /* static */
void EnFirefly_SetupFall(Actor *arg0, GlobalContext *arg1, Actor *); /* static */
void EnFirefly_SetupFlyIdle(Actor *arg0);           /* static */
void EnFirefly_SetupRebound(EnFirefly *arg0);       /* static */
void EnFirefly_SetupStunned(Actor *arg0);           /* static */
void EnFirefly_SpawnIceEffects(Actor *arg0, GlobalContext *arg1); /* static */
