typedef struct EnNeoReeba {
    /* 0x000 */ Actor actor;
    /* 0x144 */ SkelAnime unk_144;                  /* inferred */
    /* 0x188 */ ColliderCylinder unk_188;           /* inferred */
    /* 0x1D4 */ Vec3s unk_1D4;                      /* inferred */
    /* 0x1DA */ char pad_1DA[0x66];                 /* maybe part of unk_1D4[18]? */
    /* 0x240 */ Vec3s unk_240;                      /* inferred */
    /* 0x246 */ char pad_246[0x66];                 /* maybe part of unk_240[18]? */
    /* 0x2AC */ void (*actionFunc)(EnNeoReeba *, GlobalContext *);
    /* 0x2B0 */ f32 unk_2B0;                        /* inferred */
    /* 0x2B4 */ f32 unk_2B4;                        /* inferred */
    /* 0x2B8 */ f32 unk_2B8;                        /* inferred */
    /* 0x2BC */ f32 unk_2BC;                        /* inferred */
    /* 0x2C0 */ f32 unk_2C0;                        /* inferred */
    /* 0x2C4 */ f32 unk_2C4;                        /* inferred */
    /* 0x2C8 */ char pad_2C8[0x30];                 /* maybe part of unk_2C4[13]? */
    /* 0x2F8 */ f32 unk_2F8;                        /* inferred */
    /* 0x2FC */ f32 unk_2FC;                        /* inferred */
    /* 0x300 */ char pad_300[0x8];                  /* maybe part of unk_2FC[3]? */
    /* 0x308 */ s16 unk_308;                        /* inferred */
    /* 0x30A */ s16 unk_30A;                        /* inferred */
    /* 0x30C */ s16 unk_30C;                        /* inferred */
    /* 0x30E */ s16 unk_30E;                        /* inferred */
    /* 0x310 */ u8 unk_310;                         /* inferred */
    /* 0x311 */ char pad_311[0x3];                  /* maybe part of unk_310[4]? */
} EnNeoReeba;                                       /* size = 0x314 */

struct _mips2c_stack_EnNeoReeba_Destroy {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnNeoReeba_Draw {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_EnNeoReeba_Init {
    /* 0x00 */ char pad_0[0x30];
    /* 0x30 */ ColliderCylinder *sp30;              /* inferred */
    /* 0x34 */ char pad_34[0x4];
};                                                  /* size = 0x38 */

struct _mips2c_stack_EnNeoReeba_Update {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80B7CA34 {};              /* size 0x0 */

struct _mips2c_stack_func_80B7CA70 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ Vec3f *sp24;                         /* inferred */
    /* 0x28 */ char pad_28[0x8];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80B7CB3C {};              /* size 0x0 */

struct _mips2c_stack_func_80B7CB88 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80B7CCE0 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B7CD28 {
    /* 0x00 */ char pad_0[0x38];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80B7CE34 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B7CE94 {
    /* 0x00 */ char pad_0[0x38];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80B7CFA0 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B7CFFC {
    /* 0x00 */ char pad_0[0x38];
    /* 0x38 */ Vec3f *sp38;                         /* inferred */
    /* 0x3C */ f32 sp3C;                            /* inferred */
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80B7D130 {};              /* size 0x0 */

struct _mips2c_stack_func_80B7D150 {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ Vec3f *sp20;                         /* inferred */
    /* 0x24 */ char pad_24[0x8];                    /* maybe part of sp20[3]? */
    /* 0x2C */ Actor *sp2C;                         /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80B7D254 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B7D2E4 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B7D360 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B7D398 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B7D3EC {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B7D47C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B7D4FC {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80B7D5A4 {
    /* 0x00 */ char pad_0[0x38];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80B7D6D0 {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80B7D788 {
    /* 0x00 */ char pad_0[0x30];
    /* 0x30 */ Vec3f *sp30;                         /* inferred */
    /* 0x34 */ char pad_34[0xC];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80B7D9B8 {
    /* 0x00 */ char pad_0[0x28];
    /* 0x28 */ CollisionCheckContext *sp28;         /* inferred */
    /* 0x2C */ ColliderCylinder *sp2C;              /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80B7DC80 {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80B7DD7C {
    /* 0x00 */ char pad_0[0x50];
    /* 0x50 */ f32 sp50;                            /* inferred */
    /* 0x54 */ f32 sp54;                            /* inferred */
    /* 0x58 */ char pad_58[0x8];
};                                                  /* size = 0x60 */

struct _mips2c_stack_func_80B7DF34 {
    /* 0x00 */ char pad_0[0x50];
};                                                  /* size = 0x50 */

struct _mips2c_stack_func_80B7E0BC {
    /* 0x00 */ char pad_0[0x8C];
    /* 0x8C */ Vec3f *sp8C;                         /* inferred */
    /* 0x90 */ char pad_90[0x14];                   /* maybe part of sp8C[6]? */
    /* 0xA4 */ f32 spA4;                            /* inferred */
    /* 0xA8 */ f32 spA8;                            /* inferred */
    /* 0xAC */ f32 spAC;                            /* inferred */
};                                                  /* size = 0xB0 */

struct _mips2c_stack_func_80B7E260 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B7E378 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

void func_80B7CA34(EnNeoReeba *arg0);               /* static */
void func_80B7CA70(Actor *arg0, GlobalContext *arg1); /* static */
void func_80B7CB3C(Actor *arg0, Actor *, f32);      /* static */
void func_80B7CB88(Actor *arg0, void *arg1);        /* static */
void func_80B7CCE0(f32 arg0, Actor *);              /* static */
void func_80B7CD28(EnNeoReeba *arg0, GlobalContext *arg1); /* static */
void func_80B7CE34(Actor *arg0);                    /* static */
void func_80B7CE94(Actor *arg0, GlobalContext *arg1); /* static */
void func_80B7CFA0(Actor *arg0);                    /* static */
void func_80B7CFFC(Actor *arg0, GlobalContext *arg1); /* static */
void func_80B7D130(f32 arg0, f32, Actor *);         /* static */
void func_80B7D150(Actor *arg0, void *arg1);        /* static */
void func_80B7D254(Actor *arg0);                    /* static */
