typedef struct EnBb {
    /* 0x000 */ Actor actor;
    /* 0x144 */ SkelAnime unk_144;                  /* inferred */
    /* 0x188 */ Vec3s unk_188;                      /* inferred */
    /* 0x18E */ char pad_18E[0x5A];                 /* maybe part of unk_188[16]? */
    /* 0x1E8 */ Vec3s unk_1E8;                      /* inferred */
    /* 0x1EE */ char pad_1EE[0x5A];                 /* maybe part of unk_1E8[16]? */
    /* 0x248 */ void (*actionFunc)(EnBb *, GlobalContext *);
    /* 0x24C */ char pad_24C[0x1];
    /* 0x24D */ u8 unk_24D;                         /* inferred */
    /* 0x24E */ char pad_24E[0x2];                  /* maybe part of unk_24D[3]? */
    /* 0x250 */ s16 unk_250;                        /* inferred */
    /* 0x252 */ char pad_252[0x2];
    /* 0x254 */ s16 unk_254;                        /* inferred */
    /* 0x256 */ char pad_256[0xA];                  /* maybe part of unk_254[6]? */
    /* 0x260 */ f32 unk_260;                        /* inferred */
    /* 0x264 */ f32 unk_264;                        /* inferred */
    /* 0x268 */ f32 unk_268;                        /* inferred */
    /* 0x26C */ f32 unk_26C;                        /* inferred */
    /* 0x270 */ f32 unk_270;                        /* inferred */
    /* 0x274 */ f32 unk_274;                        /* inferred */
    /* 0x278 */ Vec3f unk_278;                      /* inferred */
    /* 0x284 */ char pad_284[0x30];                 /* maybe part of unk_278[5]? */
    /* 0x2B4 */ Vec3f unk_2B4;                      /* inferred */
    /* 0x2C0 */ char pad_2C0[0x34];                 /* maybe part of unk_2B4[5]? */
    /* 0x2F4 */ ColliderSphere unk_2F4;             /* inferred */
} EnBb;                                             /* size = 0x34C */

struct _mips2c_stack_EnBb_Destroy {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnBb_Draw {
    /* 0x00 */ char pad_0[0x4C];
    /* 0x4C */ Gfx *sp4C;                           /* inferred */
    /* 0x50 */ Gfx *sp50;                           /* inferred */
    /* 0x54 */ char pad_54[0x18];                   /* maybe part of sp50[7]? */
    /* 0x6C */ MtxF *sp6C;                          /* inferred */
    /* 0x70 */ char pad_70[0x8];
};                                                  /* size = 0x78 */

struct _mips2c_stack_EnBb_Init {
    /* 0x00 */ char pad_0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_EnBb_Update {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_808C1E94 {};              /* size 0x0 */

struct _mips2c_stack_func_808C1F00 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_808C1F74 {
    /* 0x00 */ char pad_0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_808C1FF4 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_808C20D4 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ Vec3f *sp24;                         /* inferred */
    /* 0x28 */ void (*sp28)(Actor *, GlobalContext *); /* inferred */
    /* 0x2C */ char pad_2C[0x4];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_808C2238 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ SkelAnime *sp24;                     /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_808C2344 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_808C23EC {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ SkelAnime *sp24;                     /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_808C254C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_808C25E0 {
    /* 0x00 */ char pad_0[0x3C];
    /* 0x3C */ SkelAnime *sp3C;                     /* inferred */
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_808C272C {
    /* 0x00 */ char pad_0[0x70];
    /* 0x70 */ f32 sp70;                            /* inferred */
    /* 0x74 */ char pad_74[0x4];
    /* 0x78 */ f32 sp78;                            /* inferred */
    /* 0x7C */ char pad_7C[0x4];
};                                                  /* size = 0x80 */

struct _mips2c_stack_func_808C28CC {
    /* 0x00 */ char pad_0[0x40];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_808C2A00 {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_808C2B1C {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_808C2B94 {};              /* size 0x0 */

struct _mips2c_stack_func_808C2BD0 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_808C2C38 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_808C2CB4 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_808C2CF0 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_808C2D78 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_808C2E34 {
    /* 0x00 */ char pad_0[0x38];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_808C32EC {};              /* size 0x0 */

struct _mips2c_stack_func_808C3324 {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ s8 *sp20;                            /* inferred */
    /* 0x24 */ char pad_24[0x4];
    /* 0x28 */ Gfx *sp28;                           /* inferred */
    /* 0x2C */ char pad_2C[0x4];
    /* 0x30 */ GraphicsContext *sp30;               /* inferred */
    /* 0x34 */ char pad_34[0xC];
};                                                  /* size = 0x40 */

? func_800BE568(Actor *, f32 *);                    /* extern */
void func_808C1E94(Actor *arg0);                    /* static */
void func_808C1F00(Actor *arg0);                    /* static */
void func_808C1F74(Actor *arg0, GlobalContext *arg1); /* static */
void func_808C1FF4(Actor *arg0);                    /* static */
void func_808C20D4(EnBb *arg0);                     /* static */
void func_808C2238(Actor *arg0, GlobalContext *arg1); /* static */
void func_808C2344(Actor *arg0);                    /* static */
void func_808C254C(Actor *arg0);                    /* static */
void func_808C272C(Actor *arg0, GlobalContext *arg1); /* static */
void func_808C2A00(Actor *arg0);                    /* static */
void func_808C2B94(Actor *arg0);                    /* static */
void func_808C2C38(EnBb *arg0);                     /* static */
