typedef struct EnBaba {
    /* 0x000 */ Actor actor;
    /* 0x144 */ s32 unk_144;                        /* inferred */
    /* 0x148 */ void (*actionFunc)(EnBaba *, GlobalContext *);
    /* 0x14C */ char pad_14C[0x4];
    /* 0x150 */ SkelAnime unk_150;                  /* inferred */
    /* 0x194 */ ColliderCylinder unk_194;           /* inferred */
    /* 0x1D4 */ s16 unk_1D4;                        /* overlap; inferred */
    /* 0x1D6 */ s16 unk_1D6;                        /* overlap; inferred */
    /* 0x1E0 */ s16 unk_1E0;                        /* inferred */
    /* 0x1E2 */ char pad_1E2[0x2];
    /* 0x1E4 */ Path *unk_1E4;                      /* inferred */
    /* 0x1E8 */ s16 unk_1E8;                        /* inferred */
    /* 0x1EA */ char pad_1EA[0x1C];                 /* maybe part of unk_1E8[15]? */
    /* 0x206 */ Vec3s unk_206;                      /* inferred */
    /* 0x20C */ char pad_20C[0x66];                 /* maybe part of unk_206[18]? */
    /* 0x272 */ Vec3s unk_272;                      /* inferred */
    /* 0x278 */ char pad_278[0x18C];                /* maybe part of unk_272[67]? */
    /* 0x404 */ s16 unk_404;                        /* inferred */
    /* 0x406 */ char pad_406[0x4];                  /* maybe part of unk_404[3]? */
    /* 0x40A */ u16 unk_40A;                        /* inferred */
    /* 0x40C */ s32 unk_40C;                        /* inferred */
    /* 0x410 */ char pad_410[0x24];                 /* maybe part of unk_40C[10]? */
    /* 0x434 */ u8 unk_434;                         /* inferred */
    /* 0x435 */ char pad_435[0x1];
    /* 0x436 */ s16 unk_436;                        /* inferred */
    /* 0x438 */ char pad_438[0x8];                  /* maybe part of unk_436[5]? */
} EnBaba;                                           /* size = 0x440 */

struct _mips2c_stack_EnBaba_Destroy {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnBaba_Draw {
    /* 0x00 */ char pad_0[0x34];
    /* 0x34 */ Gfx *sp34;                           /* inferred */
    /* 0x38 */ char pad_38[0x4];
    /* 0x3C */ GraphicsContext *sp3C;               /* inferred */
    /* 0x40 */ f32 sp40;                            /* inferred */
    /* 0x44 */ f32 sp44;                            /* inferred */
    /* 0x48 */ f32 sp48;                            /* inferred */
    /* 0x4C */ f32 sp4C;                            /* inferred */
    /* 0x50 */ f32 sp50;                            /* inferred */
    /* 0x54 */ f32 sp54;                            /* inferred */
    /* 0x58 */ char pad_58[0x8];
};                                                  /* size = 0x60 */

struct _mips2c_stack_EnBaba_Init {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ ColliderCylinder *sp24;              /* inferred */
    /* 0x28 */ char pad_28[0x8];
};                                                  /* size = 0x30 */

struct _mips2c_stack_EnBaba_Update {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80BA8820 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80BA886C {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80BA8C4C {};              /* size 0x0 */

struct _mips2c_stack_func_80BA8C90 {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ Collider *sp18;                      /* inferred */
    /* 0x1C */ CollisionCheckContext *sp1C;         /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80BA8D2C {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ ? sp2C;                              /* inferred */
    /* 0x2C */ char pad_2C[0xC];
    /* 0x38 */ s32 sp38;                            /* inferred */
    /* 0x3C */ char pad_3C[0x2];
    /* 0x3E */ s16 sp3E;                            /* inferred */
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80BA8DF4 {
    /* 0x00 */ char pad_0[0x30];
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ void *sp3C;                          /* inferred */
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80BA8F88 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ s32 sp1C;                            /* inferred */
    /* 0x20 */ char pad_20[0x3];
    /* 0x23 */ s8 sp23;                             /* inferred */
    /* 0x24 */ char pad_24[0x2];                    /* maybe part of sp23[3]? */
    /* 0x26 */ u16 sp26;                            /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80BA9110 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80BA9160 {
    /* 0x000 */ char pad_0[0x40];
    /* 0x040 */ s32 *sp40;                          /* inferred */
    /* 0x044 */ s32 *sp44;                          /* inferred */
    /* 0x048 */ void *sp48;                         /* inferred */
    /* 0x04C */ char pad_4C[0x4];
    /* 0x050 */ s32 sp50;                           /* inferred */
    /* 0x054 */ s32 sp54;                           /* inferred */
    /* 0x058 */ f32 sp58;                           /* inferred */
    /* 0x05C */ f32 sp5C;                           /* inferred */
    /* 0x060 */ f32 sp60;                           /* inferred */
    /* 0x064 */ ? sp64;                             /* inferred */
    /* 0x064 */ char pad_64[0xC];
    /* 0x070 */ ? sp70;                             /* inferred */
    /* 0x070 */ char pad_70[0xC];
    /* 0x07C */ ? sp7C;                             /* inferred */
    /* 0x07C */ char pad_7C[0x424];
};                                                  /* size = 0x4A0 */

struct _mips2c_stack_func_80BA93AC {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80BA9480 {
    /* 0x00 */ char pad_0[0x34];
    /* 0x34 */ SkelAnime *sp34;                     /* inferred */
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80BA9758 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80BA9848 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80BA98EC {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80BA9AB8 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80BA9B24 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80BA9B80 {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ u8 sp20;                             /* inferred */
    /* 0x21 */ char pad_21[0xF];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80BA9CD4 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ SkelAnime *sp24;                     /* inferred */
    /* 0x28 */ char pad_28[0x4];
    /* 0x2C */ s16 sp2C;                            /* inferred */
    /* 0x2E */ s16 sp2E;                            /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80BA9E00 {};              /* size 0x0 */

struct _mips2c_stack_func_80BA9E10 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80BA9E48 {};              /* size 0x0 */

struct _mips2c_stack_func_80BA9FB0 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ void *sp24;                          /* inferred */
    /* 0x28 */ char pad_28[0x8];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80BAA198 {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ ? sp18;                              /* inferred */
    /* 0x18 */ char pad_18[0x10];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80BAA20C {};              /* size 0x0 */

s32 func_80BA8820(EnBaba *arg0, GlobalContext *arg1); /* static */
void func_80BA886C(Actor *arg0, GlobalContext *arg1, GlobalContext *, EnBaba *); /* static */
void func_80BA8C4C(GlobalContext *arg0, s32 arg1, GlobalContext *, EnBaba *); /* static */
void func_80BA8C90(EnBaba *arg0, GlobalContext *arg1); /* static */
s32 func_80BA8D2C(Actor *arg0, f32 arg1);           /* static */
void func_80BA8DF4(EnBaba *arg0, GlobalContext *arg1); /* static */
s32 func_80BA8F88(void *arg0, GlobalContext *arg1, void *arg2); /* static */
s32 func_80BA9110(u8 *arg2, GlobalContext *, u8 *); /* static */
? func_80BA9160(Actor *arg0, GlobalContext *arg1, GlobalContext *); /* static */
void func_80BA93AC(Actor *arg0, GlobalContext *arg1); /* static */
