void func_80B0F5E0(EnGb2 *arg0, GlobalContext *arg1); /* static */
s32 func_80B0F660(EnGb2 *arg0, GlobalContext *arg1); /* static */
void func_80B0F6DC(EnGb2 *arg0);                    /* static */
void func_80B0F728(EnGb2 *arg0, GlobalContext *);   /* static */
u16 func_80B0F7FC(EnGb2 *arg0);                     /* static */
u16 func_80B0F8F8(EnGb2 *arg0);                     /* static */
u16 func_80B0F97C(EnGb2 *arg0);                     /* static */
void func_80B0FA04(EnGb2 *arg0);                    /* static */
s32 func_80B0FA48(EnGb2 *arg0, GlobalContext *arg1); /* static */
u16 func_80B0FB24(EnGb2 *arg0);                     /* static */
void func_80B0FBF0(Actor *arg0, GlobalContext *arg1); /* static */
void func_80B0FD8C(Actor *arg0, GlobalContext *arg1, EnGb2 *); /* static */
void func_80B0FE18(GlobalContext *arg0);            /* static */
void func_80B0FE7C(GlobalContext *arg0);            /* static */
void func_80B110F8(EnGb2 *this, GlobalContext *globalCtx); /* static */
s32 func_80B1179C(GlobalContext *arg0, s32 arg1, Gfx **arg2, Vec3f *arg3, Vec3s *arg5, Actor *actor, Gfx **gfx); /* static */
void func_80B117FC(GlobalContext *arg0, s32 arg1, Gfx **arg2, Vec3s *arg3, Actor *arg4, Gfx **gfx); /* static */
extern AnimationHeader D_0600049C;
extern FlexSkeletonHeader D_06007230;
static ? D_80B119B0;                                /* unable to generate initializer */
static ? D_80B11A00;                                /* unable to generate initializer */
static ColliderCylinderInitType1 D_80B11A40 = {
    {0xA, 0, 0, 0x39, 1},
    {0, {0, 0, 0}, {0, 0, 0}, 0, 0, 1},
    {0x28, 0x4B, 0, {0, 0, 0}},
};
static s32 D_80B11A6C = {
    0x42F00000,
    0,
    0x44480000,
    0xC2F00000,
    0,
    0x443B8000,
    0x42700000,
    0,
    0x443B8000,
    0xC2700000,
    0,
    0x44480000,
};
static ? D_80B11A9C;                                /* unable to generate initializer */
static ? D_80B11AB4;                                /* unable to generate initializer */
static InitChainEntry D_80B11AC4;                   /* unable to generate initializer */
static ? D_80B11ACC;                                /* unable to generate initializer */

typedef struct EnGb2 {
    /* 0x0000 */ Actor actor;
    /* 0x0144 */ SkelAnime unk144;                  /* inferred */
    /* 0x0188 */ Vec3s unk188;                      /* inferred */
    /* 0x018E */ char pad18E[0x42];                 /* maybe part of unk188[12]? */
    /* 0x01D0 */ Vec3s unk1D0;                      /* inferred */
    /* 0x01D6 */ char pad1D6[0x42];                 /* maybe part of unk1D0[12]? */
    /* 0x0218 */ void (*actionFunc)(EnGb2 *, GlobalContext *);
    /* 0x021C */ ColliderCylinder unk21C;           /* inferred */
    /* 0x0268 */ void *unk268;                      /* inferred */
    /* 0x026C */ u16 unk26C;                        /* inferred */
    /* 0x026E */ u16 unk26E;                        /* inferred */
    /* 0x0270 */ Vec3s unk270;                      /* inferred */
    /* 0x0276 */ Vec3s unk276;                      /* inferred */
    /* 0x027C */ s16 unk27C;                        /* inferred */
    /* 0x027E */ s16 unk27E;                        /* inferred */
    /* 0x0280 */ s16 unk280;                        /* inferred */
    /* 0x0282 */ s16 unk282;                        /* inferred */
    /* 0x0284 */ s16 unk284;                        /* inferred */
    /* 0x0286 */ s16 unk286;                        /* inferred */
    /* 0x0288 */ s16 unk288;                        /* inferred */
    /* 0x028A */ u8 unk28A;                         /* inferred */
    /* 0x028B */ char pad28B[0x1];                  /* maybe part of unk28A[2]? */
    /* 0x028C */ s32 unk28C;                        /* inferred */
    /* 0x0290 */ s16 unk290;                        /* inferred */
    /* 0x0292 */ char pad292[0x2];                  /* maybe part of unk290[2]? */
} EnGb2;                                            /* size 0x294 */

void func_80B0F5E0(EnGb2 *arg0, GlobalContext *arg1) {
    CollisionCheckContext *sp1C;
    Collider *sp18;
    Collider *temp_a2;
    CollisionCheckContext *temp_a1;

    temp_a2 = arg0 + 0x21C;
    arg0->unk21C.dim.pos.x = (s16) (s32) arg0->actor.world.pos.x;
    arg0->unk21C.dim.pos.y = (s16) (s32) arg0->actor.world.pos.y;
    arg0->unk21C.dim.pos.z = (s16) (s32) arg0->actor.world.pos.z;
    sp18 = temp_a2;
    temp_a1 = arg1 + 0x18884;
    sp1C = temp_a1;
    CollisionCheck_SetAC(arg1, temp_a1, temp_a2);
    CollisionCheck_SetOC(arg1, temp_a1, temp_a2);
}

s32 func_80B0F660(EnGb2 *arg0, GlobalContext *arg1) {
    Actor *temp_v0;
    Actor *temp_v1;
    Actor *phi_s0;

    phi_s0 = NULL;
loop_1:
    temp_v0 = func_ActorCategoryIterateById(arg1, phi_s0, 4, 0x1DE);
    if (temp_v0 != 0) {
        if (temp_v0 != arg0) {
