typedef struct EnGb2 {
    /* 0x000 */ Actor actor;
    /* 0x144 */ SkelAnime unk_144;                  /* inferred */
    /* 0x188 */ Vec3s unk_188;                      /* inferred */
    /* 0x18E */ char pad_18E[0x42];                 /* maybe part of unk_188[12]? */
    /* 0x1D0 */ Vec3s unk_1D0;                      /* inferred */
    /* 0x1D6 */ char pad_1D6[0x42];                 /* maybe part of unk_1D0[12]? */
    /* 0x218 */ void (*actionFunc)(EnGb2 *, GlobalContext *);
    /* 0x21C */ ColliderCylinder unk_21C;           /* inferred */
    /* 0x268 */ s32 unk_268;                        /* inferred */
    /* 0x26C */ u16 unk_26C;                        /* inferred */
    /* 0x26E */ u16 unk_26E;                        /* inferred */
    /* 0x270 */ Vec3s unk_270;                      /* inferred */
    /* 0x276 */ Vec3s unk_276;                      /* inferred */
    /* 0x27C */ s16 unk_27C;                        /* inferred */
    /* 0x27E */ s16 unk_27E;                        /* inferred */
    /* 0x280 */ s16 unk_280;                        /* inferred */
    /* 0x282 */ s16 unk_282;                        /* inferred */
    /* 0x284 */ char pad_284[0x2];
    /* 0x286 */ s16 unk_286;                        /* inferred */
    /* 0x288 */ s16 unk_288;                        /* inferred */
    /* 0x28A */ u8 unk_28A;                         /* inferred */
    /* 0x28B */ char pad_28B[0x1];
    /* 0x28C */ s32 unk_28C;                        /* inferred */
    /* 0x290 */ s16 unk_290;                        /* inferred */
    /* 0x292 */ char pad_292[0x2];
} EnGb2;                                            /* size = 0x294 */

struct _mips2c_stack_EnGb2_Destroy {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnGb2_Draw {
    /* 0x00 */ char pad_0[0x38];
};                                                  /* size = 0x38 */

struct _mips2c_stack_EnGb2_Init {
    /* 0x00 */ char pad_0[0x30];
    /* 0x30 */ ColliderCylinder *sp30;              /* inferred */
    /* 0x34 */ char pad_34[0xC];
};                                                  /* size = 0x40 */

struct _mips2c_stack_EnGb2_Update {
    /* 0x00 */ char pad_0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80B0F5E0 {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ Collider *sp18;                      /* inferred */
    /* 0x1C */ CollisionCheckContext *sp1C;         /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80B0F660 {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80B0F6DC {};              /* size 0x0 */

struct _mips2c_stack_func_80B0F728 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B0F7FC {};              /* size 0x0 */

struct _mips2c_stack_func_80B0F8F8 {};              /* size 0x0 */

struct _mips2c_stack_func_80B0F97C {};              /* size 0x0 */

struct _mips2c_stack_func_80B0FA04 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B0FA48 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B0FB24 {};              /* size 0x0 */

struct _mips2c_stack_func_80B0FBF0 {
    /* 0x00 */ char pad_0[0x68];
    /* 0x68 */ ? sp68;                              /* inferred */
    /* 0x68 */ char pad_68[0x10];
    /* 0x78 */ ? sp78;                              /* inferred */
    /* 0x78 */ char pad_78[0x18];
    /* 0x90 */ ? sp90;                              /* inferred */
    /* 0x90 */ char pad_90[0x30];
};                                                  /* size = 0xC0 */

struct _mips2c_stack_func_80B0FD8C {
    /* 0x00 */ char pad_0[0x38];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80B0FE18 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B0FE7C {};              /* size 0x0 */

struct _mips2c_stack_func_80B0FEBC {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B0FFA8 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80B10240 {
    /* 0x00 */ char pad_0[0x40];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80B10344 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B10584 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B10634 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80B10868 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B10924 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ s32 sp24;                            /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80B109DC {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80B10A48 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80B10B5C {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80B10DAC {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80B10E98 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80B11048 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B110F8 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80B111AC {};              /* size 0x0 */

struct _mips2c_stack_func_80B11268 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80B11344 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B1179C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B117FC {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ ? sp18;                              /* inferred */
    /* 0x18 */ char pad_18[0x10];
};                                                  /* size = 0x28 */

void func_80B0F5E0(EnGb2 *arg0, GlobalContext *arg1); /* static */
s32 func_80B0F660(EnGb2 *arg0, GlobalContext *arg1); /* static */
void func_80B0F6DC(EnGb2 *arg0);                    /* static */
void func_80B0F728(EnGb2 *arg0, GlobalContext *);   /* static */
u16 func_80B0F7FC(EnGb2 *arg0);                     /* static */
u16 func_80B0F8F8(EnGb2 *arg0);                     /* static */
u16 func_80B0F97C(EnGb2 *arg0);                     /* static */
void func_80B0FA04(EnGb2 *arg0);                    /* static */
s32 func_80B0FA48(EnGb2 *arg0, GlobalContext *arg1); /* static */
u16 func_80B0FB24(EnGb2 *arg0);                     /* static */
void func_80B0FBF0(Actor *arg0, GlobalContext *arg1); /* static */
void func_80B0FD8C(Actor *arg0, GlobalContext *arg1, EnGb2 *); /* static */
void func_80B0FE18(GlobalContext *arg0);            /* static */
