struct _mips2c_stack_EnDai_Destroy {};              /* size 0x0 */

struct _mips2c_stack_EnDai_Draw {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnDai_Init {
    /* 0x00 */ char pad0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_EnDai_Update {
    /* 0x00 */ char pad0[0x2C];
    /* 0x2C */ Actor *sp2C;                         /* inferred */
    /* 0x30 */ char pad30[0x8];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80B3DFF0 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B3E168 {
    /* 0x00 */ char pad0[0x74];
    /* 0x74 */ s32 sp74;                            /* inferred */
    /* 0x78 */ char pad78[0x8];
};                                                  /* size = 0x80 */

struct _mips2c_stack_func_80B3E460 {};              /* size 0x0 */

struct _mips2c_stack_func_80B3E5B4 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B3E5DC {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B3E69C {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B3E7C8 {
    /* 0x00 */ char pad0[0x1C];
    /* 0x1C */ s32 sp1C;                            /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80B3E834 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B3E8BC {};              /* size 0x0 */

struct _mips2c_stack_func_80B3E96C {
    /* 0x00 */ char pad0[0x50];
    /* 0x50 */ ?32 sp50;                            /* inferred */
    /* 0x54 */ ?32 sp54;                            /* inferred */
    /* 0x58 */ f32 sp58;                            /* inferred */
    /* 0x5C */ f32 sp5C;                            /* inferred */
    /* 0x60 */ f32 sp60;                            /* inferred */
    /* 0x64 */ f32 sp64;                            /* inferred */
    /* 0x68 */ ?32 sp68;                            /* inferred */
    /* 0x6C */ f32 sp6C;                            /* inferred */
    /* 0x70 */ ?32 sp70;                            /* inferred */
    /* 0x74 */ ? sp74;                              /* inferred */
    /* 0x74 */ char pad74[0xC];
};                                                  /* size = 0x80 */

struct _mips2c_stack_func_80B3EC10 {};              /* size 0x0 */

struct _mips2c_stack_func_80B3EC84 {
    /* 0x00 */ char pad0[0x38];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80B3ED88 {
    /* 0x00 */ char pad0[0x38];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80B3EE8C {
    /* 0x00 */ char pad0[0x1E];
    /* 0x1E */ s16 sp1E;                            /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80B3EEDC {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80B3EF90 {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80B3F00C {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B3F044 {
    /* 0x00 */ char pad0[0x20];
    /* 0x20 */ Actor *sp20;                         /* inferred */
    /* 0x24 */ char pad24[0x4];
    /* 0x28 */ s32 sp28;                            /* inferred */
    /* 0x2C */ u32 sp2C;                            /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80B3F598 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B3F614 {
    /* 0x00 */ char pad0[0x24];
    /* 0x24 */ ? sp24;                              /* inferred */
    /* 0x24 */ char pad24[0x40];
    /* 0x64 */ ? sp64;                              /* inferred */
    /* 0x64 */ char pad64[0x2];
    /* 0x66 */ s16 sp66;                            /* inferred */
    /* 0x68 */ char pad68[0x8];
};                                                  /* size = 0x70 */

struct _mips2c_stack_func_80B3F6EC {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B3F78C {
    /* 0x00 */ char pad0[0x40];
    /* 0x40 */ Gfx *sp40;                           /* inferred */
    /* 0x44 */ Gfx *sp44;                           /* inferred */
    /* 0x48 */ char pad48[0x10];
};                                                  /* size = 0x58 */

struct _mips2c_stack_func_80B3F920 {
    /* 0x00 */ char pad0[0x44];
    /* 0x44 */ Gfx *sp44;                           /* inferred */
    /* 0x48 */ Gfx *sp48;                           /* inferred */
    /* 0x4C */ char pad4C[0x10];                    /* maybe part of sp48[5]? */
    /* 0x5C */ Gfx *sp5C;                           /* inferred */
    /* 0x60 */ Gfx *sp60;                           /* inferred */
    /* 0x64 */ char pad64[0xC];
};                                                  /* size = 0x70 */

u8 *func_80B3DFF0(u8 *arg0, s32 arg1, s32 arg2, s32 arg3, ?32 arg4, s32 arg7, ?32 argA, f32 argB, s32 argC, s32, f32, f32, s32); /* static */
void func_80B3E168(void *arg0, GraphicsContext **arg1); /* static */
s32 func_80B3E460(EnDai *arg0);                     /* static */
? func_80B3E5B4(GraphicsContext **arg0, GlobalContext *); /* static */
s32 func_80B3E5DC(Actor *arg0, s32 arg1, GlobalContext *); /* static */
s32 func_80B3E69C(EnDai *arg0, GlobalContext *arg1); /* static */
s32 func_80B3E7C8(Actor *arg0, GlobalContext *arg1); /* static */
void func_80B3E834(EnDai *arg0);                    /* static */
s16 func_80B3E8BC(Actor *arg0, u8 arg1);            /* static */
? func_80B3E96C(Actor *arg0, GlobalContext *arg1);  /* static */
void func_80B3EC10(f32 arg0, f32 arg1, f32 arg2, f32 arg3, f32 arg4, f32 arg5, f32 arg6, f32 arg7, f32 arg8, void *arg9, void *); /* static */
