typedef struct GameAllocNode {
    /* 0x00 */ GameAllocNode *next;
    /* 0x04 */ GameAllocNode *prev;
    /* 0x08 */ u32 size;
    /* 0x0C */ u16 unk_C;                           /* inferred */
    /* 0x0E */ s16 unk_E;                           /* inferred */
} GameAllocNode;                                    /* size = 0x10 */

typedef struct GameState {
    /* 0x00 */ GraphicsContext *gfxCtx;
    /* 0x04 */ void (*main)(GameState *);
    /* 0x08 */ void (*destroy)(GameState *);
    /* 0x0C */ void (*nextGameStateInit)(GameState *);
    /* 0x10 */ u32 nextGameStateSize;
    /* 0x14 */ Input input[4];
    /* 0x74 */ TwoHeadArena heap;
    /* 0x84 */ GameAlloc alloc;
    /* 0x98 */ s16 unk_98;                          /* inferred */
    /* 0x9A */ s16 unk_9A;                          /* inferred */
    /* 0x9B */ u8 running;                          /* overlap */
    /* 0x9C */ u32 frames;
    /* 0xA0 */ s16 unk_A0;                          /* inferred */
    /* 0xA2 */ u8 framerateDivisor;
    /* 0xA3 */ char pad_A3[0x1];
} GameState;                                        /* size = 0xA4 */

typedef struct GraphicsContext {
    /* 0x000 */ Gfx *polyOpaBuffer;
    /* 0x004 */ Gfx *polyXluBuffer;
    /* 0x008 */ char pad_8[0x8];                    /* maybe part of polyXluBuffer[3]? */
    /* 0x010 */ Gfx *overlayBuffer;
    /* 0x014 */ char pad_14[0x44];                  /* maybe part of overlayBuffer[18]? */
    /* 0x058 */ OSMesgQueue *unk58;
    /* 0x05C */ OSMesgQueue unk5C;
    /* 0x074 */ char pad_74[0x9C];                  /* maybe part of unk5C[7]? */
    /* 0x110 */ ? unk_110;                          /* inferred */
    /* 0x110 */ char pad_110[0x90];
    /* 0x1A0 */ Gfx *unk1A0;
    /* 0x1A4 */ TwoHeadGfxArena unk1A4;
    /* 0x1B4 */ Gfx *unk1B4;
    /* 0x1B8 */ TwoHeadGfxArena unk1B8;
    /* 0x1C8 */ char pad_1C8[0x38];                 /* maybe part of unk1B8[4]? */
    /* 0x200 */ ? unk_200;                          /* inferred */
    /* 0x200 */ char pad_200[0x40];
    /* 0x240 */ s16 unk_240;                        /* inferred */
    /* 0x242 */ s16 unk_242;                        /* inferred */
    /* 0x244 */ char pad_244[0xC];                  /* maybe part of unk_242[7]? */
    /* 0x250 */ s16 unk_250;                        /* inferred */
    /* 0x252 */ s16 unk_252;                        /* inferred */
    /* 0x254 */ char pad_254[0xC];                  /* maybe part of unk_252[7]? */
    /* 0x260 */ s16 unk_260;                        /* inferred */
    /* 0x262 */ s16 unk_262;                        /* inferred */
    /* 0x264 */ char pad_264[0xC];                  /* maybe part of unk_262[7]? */
    /* 0x270 */ s16 unk_270;                        /* inferred */
    /* 0x272 */ s16 unk_272;                        /* inferred */
    /* 0x274 */ OSViMode *unk274;
    /* 0x278 */ void *zbuffer;
    /* 0x27C */ char pad_27C[0x4];
    /* 0x280 */ s16 unk_280;                        /* inferred */
    /* 0x282 */ s16 unk_282;                        /* inferred */
    /* 0x284 */ char pad_284[0xC];                  /* maybe part of unk_282[7]? */
    /* 0x290 */ s16 unk_290;                        /* inferred */
    /* 0x292 */ s16 unk_292;                        /* inferred */
    /* 0x294 */ char pad_294[0x4];                  /* maybe part of unk_292[3]? */
    /* 0x298 */ TwoHeadGfxArena overlay;
    /* 0x2A8 */ TwoHeadGfxArena polyOpa;
    /* 0x2B8 */ TwoHeadGfxArena polyXlu;
    /* 0x2C8 */ s32 displaylistCounter;
    /* 0x2CC */ void *framebuffer;
    /* 0x2D0 */ s32 pad2D0;
    /* 0x2D4 */ u32 viConfigFeatures;
    /* 0x2D8 */ char pad_2D8[0x3];
    /* 0x2DB */ u8 framebufferCounter;
    /* 0x2DC */ char pad_2DC[0x8];                  /* maybe part of framebufferCounter[9]? */
    /* 0x2E4 */ f32 viConfigXScale;
    /* 0x2E8 */ f32 viConfigYScale;
    /* 0x2EC */ char pad_2EC[0x4];
} GraphicsContext;                                  /* size = 0x2F0 */

struct _mips2c_stack_FileChoose_Destroy {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_FileChoose_Init {
    /* 0x00 */ char pad_0[0x28];
    /* 0x28 */ TwoHeadArena *sp28;                  /* inferred */
    /* 0x2C */ u32 sp2C;                            /* inferred */
    /* 0x30 */ u8 *sp30;                            /* inferred */
    /* 0x34 */ u32 sp34;                            /* inferred */
    /* 0x38 */ char pad_38[0x8];
};                                                  /* size = 0x40 */

struct _mips2c_stack_FileChoose_Main {
    /* 0x00 */ char pad_0[0x28];
    /* 0x28 */ void *sp28;                          /* inferred */
    /* 0x2C */ char pad_2C[0x70];                   /* maybe part of sp28[29]? */
    /* 0x9C */ GraphicsContext *sp9C;               /* inferred */
    /* 0xA0 */ char pad_A0[0x10];
};                                                  /* size = 0xB0 */

struct _mips2c_stack_FileChoose_RenderView {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ View *sp18;                          /* inferred */
    /* 0x1C */ f32 sp1C;                            /* inferred */
    /* 0x20 */ f32 sp20;                            /* inferred */
    /* 0x24 */ f32 sp24;                            /* inferred */
    /* 0x28 */ f32 sp28;                            /* inferred */
    /* 0x2C */ f32 sp2C;                            /* inferred */
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ void **sp34;                         /* inferred */
    /* 0x38 */ void **sp38;                         /* inferred */
    /* 0x3C */ f32 sp3C;                            /* inferred */
};                                                  /* size = 0x40 */

struct _mips2c_stack_FileChoose_UpdateAndDrawSkybox {
    /* 0x00 */ char pad_0[0x3C];
    /* 0x3C */ f32 sp3C;                            /* inferred */
    /* 0x40 */ char pad_40[0x10];                   /* maybe part of sp3C[5]? */
    /* 0x50 */ f32 sp50;                            /* inferred */
    /* 0x54 */ char pad_54[0x4];
    /* 0x58 */ f32 sp58;                            /* inferred */
    /* 0x5C */ char pad_5C[0x4];
};                                                  /* size = 0x60 */

struct _mips2c_stack_FileChoose_nop8080BC4C {};     /* size 0x0 */

struct _mips2c_stack_FileChoose_nop8080bc44 {};     /* size 0x0 */

struct _mips2c_stack_func_80804010 {};              /* size 0x0 */

struct _mips2c_stack_func_808041A0 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ void *sp1C;                          /* inferred */
    /* 0x20 */ char pad_20[0x10];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80804654 {};              /* size 0x0 */

struct _mips2c_stack_func_808047D8 {};              /* size 0x0 */

struct _mips2c_stack_func_8080489C {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ void *sp1C;                          /* inferred */
    /* 0x20 */ char pad_20[0x10];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80804DAC {};              /* size 0x0 */

struct _mips2c_stack_func_80804E74 {};              /* size 0x0 */

struct _mips2c_stack_func_80804F98 {
    /* 0x00 */ char pad_0[0x8];
    /* 0x08 */ s32 sp8;                             /* inferred */
    /* 0x0C */ s32 spC;                             /* inferred */
    /* 0x10 */ s32 sp10;                            /* inferred */
    /* 0x14 */ s32 sp14;                            /* inferred */
    /* 0x18 */ s32 sp18;                            /* inferred */
    /* 0x1C */ s32 sp1C;                            /* inferred */
    /* 0x20 */ s32 sp20;                            /* inferred */
    /* 0x24 */ s32 sp24;                            /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_8080525C {};              /* size 0x0 */

struct _mips2c_stack_func_808052B0 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ s32 sp1C;                            /* inferred */
    /* 0x20 */ SramContext *sp20;                   /* inferred */
    /* 0x24 */ char pad_24[0x14];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_808054A4 {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ SramContext *sp18;                   /* inferred */
    /* 0x1C */ char pad_1C[0xC];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_808055D0 {
    /* 0x00 */ char pad_0[0x4];
    /* 0x04 */ s32 sp4;                             /* inferred */
    /* 0x08 */ s32 sp8;                             /* inferred */
    /* 0x0C */ s32 spC;                             /* inferred */
    /* 0x10 */ s32 sp10;                            /* inferred */
    /* 0x14 */ s32 sp14;                            /* inferred */
    /* 0x18 */ s32 sp18;                            /* inferred */
    /* 0x1C */ s32 sp1C;                            /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_808058A4 {};              /* size 0x0 */

struct _mips2c_stack_func_80805918 {};              /* size 0x0 */

struct _mips2c_stack_func_80805A58 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ void *sp1C;                          /* inferred */
    /* 0x20 */ char pad_20[0x8];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80805B30 {};              /* size 0x0 */

struct _mips2c_stack_func_80805C1C {
    /* 0x00 */ char pad_0[0x8];
    /* 0x08 */ s32 sp8;                             /* inferred */
    /* 0x0C */ s32 spC;                             /* inferred */
    /* 0x10 */ s32 sp10;                            /* inferred */
    /* 0x14 */ s32 sp14;                            /* inferred */
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80806014 {};              /* size 0x0 */

struct _mips2c_stack_func_80806148 {};              /* size 0x0 */

struct _mips2c_stack_func_80806310 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ void *sp1C;                          /* inferred */
    /* 0x20 */ char pad_20[0x10];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_808067E0 {
    /* 0x00 */ char pad_0[0x4];
    /* 0x04 */ s32 sp4;                             /* inferred */
    /* 0x08 */ s32 sp8;                             /* inferred */
    /* 0x0C */ s32 spC;                             /* inferred */
    /* 0x10 */ s32 sp10;                            /* inferred */
    /* 0x14 */ char pad_14[0x4];
    /* 0x18 */ s32 sp18;                            /* inferred */
    /* 0x1C */ char pad_1C[0x1C];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80806BC8 {};              /* size 0x0 */

struct _mips2c_stack_func_80806CA0 {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ void *sp20;                          /* inferred */
    /* 0x24 */ SramContext *sp24;                   /* inferred */
    /* 0x28 */ char pad_28[0x10];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80806E84 {};              /* size 0x0 */

struct _mips2c_stack_func_80806F30 {
    /* 0x00 */ char pad_0[0x8];
    /* 0x08 */ s32 sp8;                             /* inferred */
    /* 0x0C */ s32 spC;                             /* inferred */
    /* 0x10 */ s32 sp10;                            /* inferred */
    /* 0x14 */ s32 sp14;                            /* inferred */
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_808071E4 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80807390 {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ SramContext *sp18;                   /* inferred */
    /* 0x1C */ char pad_1C[0xC];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_8080742C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_808074B4 {
    /* 0x00 */ char pad_0[0x4];
    /* 0x04 */ s32 sp4;                             /* inferred */
    /* 0x08 */ s32 sp8;                             /* inferred */
    /* 0x0C */ s32 spC;                             /* inferred */
};                                                  /* size = 0x10 */

struct _mips2c_stack_func_808077AC {};              /* size 0x0 */

struct _mips2c_stack_func_80807940 {};              /* size 0x0 */

struct _mips2c_stack_func_80807A78 {};              /* size 0x0 */

struct _mips2c_stack_func_80807C58 {
    /* 0x00 */ char pad_0[0x8];
    /* 0x08 */ s32 sp8;                             /* inferred */
    /* 0x0C */ s32 spC;                             /* inferred */
    /* 0x10 */ s32 sp10;                            /* inferred */
    /* 0x14 */ s32 sp14;                            /* inferred */
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80808214 {
    /* 0x000 */ char pad_0[0x28];
    /* 0x028 */ void *sp28;                         /* inferred */
    /* 0x02C */ char pad_2C[0x8];                   /* maybe part of sp28[3]? */
    /* 0x034 */ void *sp34;                         /* inferred */
    /* 0x038 */ char pad_38[0xD0];                  /* maybe part of sp34[53]? */
    /* 0x108 */ s16 sp108;                          /* inferred */
    /* 0x10A */ char pad_10A[0xE];
};                                                  /* size = 0x118 */

struct _mips2c_stack_func_80808D30 {
    /* 0x00 */ char pad_0[0x40];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80808F1C {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ GraphicsContext **sp20;              /* inferred */
    /* 0x24 */ GraphicsContext **sp24;              /* inferred */
    /* 0x28 */ GraphicsContext **sp28;              /* inferred */
    /* 0x2C */ char pad_2C[0x90];                   /* maybe part of sp28[37]? */
    /* 0xBC */ GraphicsContext *spBC;               /* inferred */
    /* 0xC0 */ char pad_C0[0x2];
    /* 0xC2 */ u16 spC2;                            /* inferred */
    /* 0xC4 */ char pad_C4[0x14];
};                                                  /* size = 0xD8 */

struct _mips2c_stack_func_80809DF0 {};              /* size 0x0 */

struct _mips2c_stack_func_80809EA0 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ void *sp1C;                          /* inferred */
    /* 0x20 */ char pad_20[0x8];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_8080A3CC {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ SramContext *sp1C;                   /* inferred */
    /* 0x20 */ char pad_20[0x8];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_8080A418 {};              /* size 0x0 */

struct _mips2c_stack_func_8080A4A0 {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ SramContext *sp18;                   /* inferred */
    /* 0x1C */ char pad_1C[0xC];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_8080A6BC {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ SramContext *sp1C;                   /* inferred */
    /* 0x20 */ char pad_20[0x8];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_8080A708 {
    /* 0x000 */ char pad_0[0x2C];
    /* 0x02C */ void *sp2C;                         /* inferred */
    /* 0x030 */ char pad_30[0x134];                 /* maybe part of sp2C[78]? */
    /* 0x164 */ Gfx *sp164;                         /* inferred */
    /* 0x168 */ char pad_168[0x8];                  /* maybe part of sp164[3]? */
    /* 0x170 */ Gfx *sp170;                         /* inferred */
    /* 0x174 */ char pad_174[0x8];                  /* maybe part of sp170[3]? */
    /* 0x17C */ Gfx *sp17C;                         /* inferred */
    /* 0x180 */ char pad_180[0x2C];                 /* maybe part of sp17C[12]? */
    /* 0x1AC */ GraphicsContext *sp1AC;             /* inferred */
    /* 0x1B0 */ char pad_1B0[0x10];
};                                                  /* size = 0x1C0 */

struct _mips2c_stack_func_8080BBFC {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8080BC20 {};              /* size 0x0 */

struct _mips2c_stack_func_8080BC58 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8080BDAC {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8080BE60 {};              /* size 0x0 */

struct _mips2c_stack_func_8080C040 {
    /* 0x00 */ char pad_0[0x8];
    /* 0x08 */ s32 sp8;                             /* inferred */
    /* 0x0C */ s32 spC;                             /* inferred */
    /* 0x10 */ s32 sp10;                            /* inferred */
    /* 0x14 */ s32 sp14;                            /* inferred */
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8080C228 {};              /* size 0x0 */

struct _mips2c_stack_func_8080C29C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8080C324 {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ s32 sp18;                            /* inferred */
    /* 0x1C */ char pad_1C[0x4];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_8080C3A8 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ void *sp1C;                          /* inferred */
    /* 0x20 */ char pad_20[0x18];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_8080D164 {};              /* size 0x0 */

struct _mips2c_stack_func_8080D170 {};              /* size 0x0 */

struct _mips2c_stack_func_8080D1BC {};              /* size 0x0 */

struct _mips2c_stack_func_8080D220 {};              /* size 0x0 */

struct _mips2c_stack_func_8080D284 {};              /* size 0x0 */

struct _mips2c_stack_func_8080D2EC {};              /* size 0x0 */

struct _mips2c_stack_func_8080D3D0 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8080D40C {
    /* 0x00 */ char pad_0[0x8];
    /* 0x08 */ s32 sp8;                             /* inferred */
    /* 0x0C */ s32 spC;                             /* inferred */
    /* 0x10 */ s32 sp10;                            /* inferred */
    /* 0x14 */ s32 sp14;                            /* inferred */
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8080D6D4 {
    /* 0x00 */ char pad_0[0x50];
    /* 0x50 */ void *sp50;                          /* inferred */
    /* 0x54 */ char pad_54[0x44];                   /* maybe part of sp50[18]? */
    /* 0x98 */ s32 sp98;                            /* inferred */
    /* 0x9C */ s32 sp9C;                            /* inferred */
    /* 0xA0 */ char pad_A0[0x4];
    /* 0xA4 */ u16 spA4;                            /* inferred */
    /* 0xA6 */ u16 spA6;                            /* inferred */
    /* 0xA8 */ u16 spA8;                            /* inferred */
    /* 0xAA */ char pad_AA[0x2];
    /* 0xAC */ s16 spAC;                            /* inferred */
    /* 0xAE */ char pad_AE[0xA];
};                                                  /* size = 0xB8 */

struct _mips2c_stack_func_8080F25C {
    /* 0x000 */ char pad_0[0x3C];
    /* 0x03C */ void *sp3C;                         /* inferred */
    /* 0x040 */ void *sp40;                         /* inferred */
    /* 0x044 */ void *sp44;                         /* inferred */
    /* 0x048 */ void *sp48;                         /* inferred */
    /* 0x04C */ void *sp4C;                         /* inferred */
    /* 0x050 */ u16 *sp50;                          /* inferred */
    /* 0x054 */ s32 sp54;                           /* inferred */
    /* 0x058 */ char pad_58[0x19F];                 /* maybe part of sp54[104]? */
    /* 0x1F7 */ u8 sp1F7;                           /* inferred */
    /* 0x1F8 */ u16 sp1F8;                          /* inferred */
    /* 0x1FA */ u16 sp1FA;                          /* inferred */
    /* 0x1FC */ u16 sp1FC;                          /* inferred */
    /* 0x1FE */ char pad_1FE[0x2];
    /* 0x200 */ s16 sp200;                          /* inferred */
    /* 0x202 */ s16 sp202;                          /* inferred */
    /* 0x204 */ s16 sp204;                          /* inferred */
    /* 0x206 */ s16 sp206;                          /* inferred */
    /* 0x208 */ s16 sp208;                          /* inferred */
    /* 0x20A */ s16 sp20A;                          /* inferred */
    /* 0x20C */ s16 sp20C;                          /* inferred */
    /* 0x20E */ char pad_20E[0x8];                  /* maybe part of sp20C[5]? */
    /* 0x216 */ s16 sp216;                          /* inferred */
    /* 0x218 */ char pad_218[0x8];
};                                                  /* size = 0x220 */

struct _mips2c_stack_func_808108DC {
    /* 0x000 */ char pad_0[0x40];
    /* 0x040 */ void *sp40;                         /* inferred */
    /* 0x044 */ char pad_44[0x22C];                 /* maybe part of sp40[140]? */
    /* 0x270 */ GraphicsContext *sp270;             /* inferred */
    /* 0x274 */ char pad_274[0xC];
};                                                  /* size = 0x280 */

struct _mips2c_stack_func_80811CB8 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ GraphicsContext **sp24;              /* inferred */
    /* 0x28 */ ? *sp28;                             /* inferred */
    /* 0x2C */ ? *sp2C;                             /* inferred */
    /* 0x30 */ ? *sp30;                             /* inferred */
    /* 0x34 */ char pad_34[0x20];                   /* maybe part of sp30[9]? */
    /* 0x54 */ Gfx *sp54;                           /* inferred */
    /* 0x58 */ char pad_58[0x2C];                   /* maybe part of sp54[12]? */
    /* 0x84 */ Gfx *sp84;                           /* inferred */
    /* 0x88 */ char pad_88[0x2C];                   /* maybe part of sp84[12]? */
    /* 0xB4 */ Gfx *spB4;                           /* inferred */
    /* 0xB8 */ char pad_B8[0x18];                   /* maybe part of spB4[7]? */
    /* 0xD0 */ GraphicsContext *spD0;               /* inferred */
    /* 0xD4 */ char pad_D4[0x4];
};                                                  /* size = 0xD8 */

struct _mips2c_stack_func_80812460 {
    /* 0x00 */ char pad_0[0x4];
    /* 0x04 */ s32 sp4;                             /* inferred */
    /* 0x08 */ s32 sp8;                             /* inferred */
    /* 0x0C */ s32 spC;                             /* inferred */
};                                                  /* size = 0x10 */

struct _mips2c_stack_func_80812668 {};              /* size 0x0 */

struct _mips2c_stack_func_80812760 {};              /* size 0x0 */

struct _mips2c_stack_func_80812840 {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ void *sp20;                          /* inferred */
    /* 0x24 */ char pad_24[0xC];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80812980 {};              /* size 0x0 */

struct _mips2c_stack_func_80812A6C {
    /* 0x00 */ char pad_0[0x4];
    /* 0x04 */ s32 sp4;                             /* inferred */
    /* 0x08 */ s32 sp8;                             /* inferred */
    /* 0x0C */ s32 spC;                             /* inferred */
    /* 0x10 */ s32 sp10;                            /* inferred */
    /* 0x14 */ s32 sp14;                            /* inferred */
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80812D44 {};              /* size 0x0 */

struct _mips2c_stack_func_80812D94 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80812E94 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80812ED0 {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ GraphicsContext **sp20;              /* inferred */
    /* 0x24 */ char pad_24[0x1C];                   /* maybe part of sp20[8]? */
    /* 0x40 */ Gfx *sp40;                           /* inferred */
    /* 0x44 */ char pad_44[0x1C];
};                                                  /* size = 0x60 */

struct _mips2c_stack_func_80813908 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ SramContext *sp24;                   /* inferred */
    /* 0x28 */ char pad_28[0x38];
};                                                  /* size = 0x60 */

? ShrinkWindow_Init();                              /* extern */
? func_80143668(void *, void *, ?, u8, f32, f32, f32); /* extern */
? func_80144E78(void *);                            /* extern */
? func_80146628(void *, SramContext *, SaveContext *, void *); /* extern */
? func_80146AA0(GraphicsContext **, GraphicsContext **); /* extern */
? func_80146DF8(SramContext *);                     /* extern */
? func_80147008(SramContext *, s32, s32, void *);   /* extern */
? func_801A3238(?, ?, ?, ?, s32);                   /* extern */
? func_801A3D98(s8);                                /* extern */
? func_801A4058(?);                                 /* extern */
void FileChoose_RenderView(GraphicsContext **arg0, void **arg1, void **arg2, f32 arg3, f32); /* static */
void FileChoose_UpdateAndDrawSkybox(void **arg0);   /* static */
