? func_800BC848(Boss04 *, GlobalContext *, ?, ?);   /* extern */
? func_8016566C(?);                                 /* extern */
? func_80165690();                                  /* extern */
? func_80169940(GlobalContext *, s16, f32);         /* extern */
void func_809EC040(s32 arg0, void *arg1, Vec3f *arg2); /* static */
void func_809EC544(Boss04 *arg0);                   /* static */
void func_809ECD00(Boss04 *arg0, GlobalContext *arg1); /* static */
void func_809ECEF4(Boss04 *arg0);                   /* static */
void func_809ED224(Boss04 *arg0);                   /* static */
void func_809ED45C(Actor *arg0, GlobalContext *arg1, GlobalContext *); /* static */
void func_809ED50C(Boss04 *arg0);                   /* static */
s32 func_809EDCCC(GlobalContext *arg0, s32 arg1, Gfx **arg2, Vec3f *arg3, Vec3s *arg4, Actor *arg5); /* static */
void func_809EDECC(GlobalContext *arg0, s32 arg1, Gfx **arg2, Vec3s *arg3, Actor *arg4); /* static */
extern AnimationHeader D_0600004C;
extern ? D_06004510;
extern ? D_06004550;
extern FlexSkeletonHeader D_060045E8;
static DamageTable D_809EE150 = {
    {
        0xF1,
        0xF1,
        0,
        0xF2,
        0xF1,
        0xF2,
        0,
        0xF1,
        0xF2,
        0xF2,
        0xF2,
        0x22,
        0x32,
        0x42,
        0xF2,
        0xF1,
        0xF1,
        0xF1,
        0xF1,
        0,
        0xF0,
        0xF0,
        0xF2,
        0xF2,
        0xF2,
        0,
        0,
        0,
        0,
        0,
        0,
        0xF1,
    },
};
static ColliderJntSphElementInit D_809EE190 = {
    {3, {0xF7CFFFFF, 0, 8}, {0xF7CFFFFF, 0, 0}, 1, 1, 1},
    {0, {{0, 0, 0}, 0x32}, 0x64},
};
static ColliderJntSphInit D_809EE1B4 = {{3, 0x11, 9, 9, 0x10, 0}, 1, &D_809EE190};
static ColliderJntSphElementInit D_809EE1C4 = {
    {3, {0xF7CFFFFF, 0, 8}, {0xF7CFFFFF, 0, 0}, 1, 1, 1},
    {0, {{0, 0, 0}, 0x46}, 0x64},
};
static ColliderJntSphInit D_809EE1E8 = {{9, 0x11, 9, 9, 0x10, 0}, 1, &D_809EE1C4};
static ? D_809EE1F8;                                /* unable to generate initializer */
static ? D_809EE204;                                /* unable to generate initializer */
static ? D_809EE210;                                /* unable to generate initializer */
static ? D_809EE21C;                                /* unable to generate initializer */
static Vec3f D_809EE228 = {0.0f, -200.0f, 0.0f};
static Vec3f D_809EE234 = {0.0f, 720.0f, 0.0f};
static u8 D_809EE4D0;

typedef struct Boss04 {
    /* 0x0000 */ Actor actor;
    /* 0x0144 */ SkelAnime unk144;                  /* inferred */
    /* 0x0188 */ Vec3s unk188;                      /* inferred */
    /* 0x018E */ char pad18E[0x30];                 /* maybe part of unk188[9]? */
    /* 0x01BE */ Vec3s unk1BE;                      /* inferred */
    /* 0x01C4 */ char pad1C4[0x30];                 /* maybe part of unk1BE[9]? */
    /* 0x01F4 */ s16 unk1F4;                        /* inferred */
    /* 0x01F6 */ s8 unk1F6;                         /* inferred */
    /* 0x01F7 */ u8 unk1F7;                         /* inferred */
    /* 0x01F8 */ s16 unk1F8;                        /* inferred */
    /* 0x01FA */ s16 unk1FA;                        /* inferred */
    /* 0x01FC */ char pad1FC[0x2];                  /* maybe part of unk1FA[2]? */
    /* 0x01FE */ s16 unk1FE;                        /* inferred */
    /* 0x0200 */ s16 unk200;                        /* inferred */
    /* 0x0202 */ char pad202[0x2];                  /* maybe part of unk200[2]? */
    /* 0x0204 */ void (*actionFunc)(Boss04 *, GlobalContext *);
    /* 0x0208 */ ColliderJntSph unk208;             /* inferred */
    /* 0x0228 */ ColliderJntSphElement unk228;      /* inferred */
    /* 0x0268 */ ColliderJntSph unk268;             /* inferred */
    /* 0x0288 */ ColliderJntSphElement unk288;      /* inferred */
    /* 0x02C8 */ s16 unk2C8;                        /* inferred */
    /* 0x02CA */ char pad2CA[0x2];                  /* maybe part of unk2C8[2]? */
    /* 0x02CC */ f32 unk2CC;                        /* inferred */
    /* 0x02D0 */ f32 unk2D0;                        /* inferred */
    /* 0x02D4 */ s16 unk2D4;                        /* inferred */
    /* 0x02D6 */ s16 unk2D6;                        /* inferred */
    /* 0x02D8 */ s16 unk2D8;                        /* inferred */
    /* 0x02DA */ s16 unk2DA;                        /* inferred */
    /* 0x02DC */ s16 unk2DC;                        /* inferred */
    /* 0x02DE */ s16 unk2DE;                        /* inferred */
    /* 0x02E0 */ s16 unk2E0;                        /* inferred */
    /* 0x02E2 */ s16 unk2E2;                        /* inferred */
    /* 0x02E4 */ char pad2E4[0x3D8];                /* maybe part of unk2E2[493]? */
    /* 0x06BC */ f32 unk6BC;                        /* inferred */
    /* 0x06C0 */ char pad6C0[0x4];                  /* maybe part of unk6BC[2]? */
    /* 0x06C4 */ f32 unk6C4;                        /* inferred */
    /* 0x06C8 */ Vec3f unk6C8;                      /* inferred */
    /* 0x06D4 */ f32 unk6D4;                        /* inferred */
    /* 0x06D8 */ f32 unk6D8;                        /* inferred */
    /* 0x06DC */ f32 unk6DC;                        /* inferred */
    /* 0x06E0 */ f32 unk6E0;                        /* inferred */
    /* 0x06E4 */ f32 unk6E4;                        /* inferred */
    /* 0x06E8 */ f32 unk6E8;                        /* inferred */
    /* 0x06EC */ char pad6EC[0x4];                  /* maybe part of unk6E8[2]? */
    /* 0x06F0 */ f32 unk6F0;                        /* inferred */
    /* 0x06F4 */ s16 unk6F4;                        /* inferred */
    /* 0x06F6 */ s16 unk6F6;                        /* inferred */
    /* 0x06F8 */ f32 unk6F8;                        /* inferred */
    /* 0x06FC */ f32 unk6FC;                        /* inferred */
    /* 0x0700 */ f32 unk700;                        /* inferred */
    /* 0x0704 */ u32 unk704;                        /* inferred */
    /* 0x0708 */ s16 unk708;                        /* inferred */
    /* 0x070A */ s16 unk70A;                        /* inferred */
    /* 0x070C */ Vec3f unk70C;                      /* inferred */
    /* 0x0718 */ Vec3f unk718;                      /* inferred */
    /* 0x0724 */ char pad724[0x4];
    /* 0x0728 */ f32 unk728;                        /* inferred */
    /* 0x072C */ char pad72C[0x10];                 /* maybe part of unk728[5]? */
    /* 0x073C */ f32 unk73C;                        /* inferred */
    /* 0x0740 */ char pad740[0x4];                  /* maybe part of unk73C[2]? */
    /* 0x0744 */ f32 unk744;                        /* inferred */
    /* 0x0748 */ s16 unk748;                        /* inferred */
    /* 0x074A */ u8 unk74A;                         /* inferred */
    /* 0x074B */ char pad74B[0x1];                  /* maybe part of unk74A[2]? */
} Boss04;                                           /* size 0x74C */

void func_809EC040(s32 arg0, void *arg1, Vec3f *arg2) {
    s32 temp_v0;
    void *temp_v1;

    temp_v0 = arg0 << 6;
    (arg1->unk1C + temp_v0)->unk30 = (s16) (s32) arg2->x;
    (arg1->unk1C + temp_v0)->unk32 = (s16) (s32) arg2->y;
    (arg1->unk1C + temp_v0)->unk34 = (s16) (s32) arg2->z;
    temp_v1 = arg1->unk1C + temp_v0;
    temp_v1->unk36 = (s16) (s32) (temp_v1->unk38 * (f32) temp_v1->unk2E);
}

void Boss04_Init(Actor *thisx, GlobalContext *globalCtx) {
    Boss04 *this = (Boss04 *) thisx;
    CollisionPoly *spC0;
    Vec3f spB4;
    f32 spB0;
    f32 spAC;
    f32 spA8;
    u32 spA4;
    Vec3f sp90;
    ? *temp_s0;
    ActorContext *temp_s5;
    f32 *temp_s2;
    f32 temp_f0;
    f32 temp_f0_2;
    f32 temp_f12;
    f32 temp_f14;
    f32 temp_f24;
    f32 temp_f2;
    s32 temp_s2_2;
    ? *phi_s0;
    s16 phi_s0_2;
