typedef struct Boss04 {
    /* 0x000 */ Actor actor;
    /* 0x144 */ SkelAnime unk_144;                  /* inferred */
    /* 0x188 */ Vec3s unk_188;                      /* inferred */
    /* 0x18E */ char pad_18E[0x30];                 /* maybe part of unk_188[9]? */
    /* 0x1BE */ Vec3s unk_1BE;                      /* inferred */
    /* 0x1C4 */ char pad_1C4[0x30];                 /* maybe part of unk_1BE[9]? */
    /* 0x1F4 */ s16 unk_1F4;                        /* inferred */
    /* 0x1F6 */ s8 unk_1F6;                         /* inferred */
    /* 0x1F7 */ u8 unk_1F7;                         /* inferred */
    /* 0x1F8 */ s16 unk_1F8;                        /* inferred */
    /* 0x1FA */ s16 unk_1FA;                        /* inferred */
    /* 0x1FC */ char pad_1FC[0x2];
    /* 0x1FE */ s16 unk_1FE;                        /* inferred */
    /* 0x200 */ s16 unk_200;                        /* inferred */
    /* 0x202 */ char pad_202[0x2];
    /* 0x204 */ void (*actionFunc)(Boss04 *, GlobalContext *);
    /* 0x208 */ ColliderJntSph unk_208;             /* inferred */
    /* 0x228 */ ColliderJntSphElement unk_228;      /* inferred */
    /* 0x268 */ ColliderJntSph unk_268;             /* inferred */
    /* 0x288 */ ColliderJntSphElement unk_288;      /* inferred */
    /* 0x2C8 */ s16 unk_2C8;                        /* inferred */
    /* 0x2CA */ char pad_2CA[0x2];
    /* 0x2CC */ f32 unk_2CC;                        /* inferred */
    /* 0x2D0 */ f32 unk_2D0;                        /* inferred */
    /* 0x2D4 */ s16 unk_2D4;                        /* inferred */
    /* 0x2D6 */ s16 unk_2D6;                        /* inferred */
    /* 0x2D8 */ s16 unk_2D8;                        /* inferred */
    /* 0x2DA */ s16 unk_2DA;                        /* inferred */
    /* 0x2DC */ char pad_2DC[0x4];                  /* maybe part of unk_2DA[3]? */
    /* 0x2E0 */ s16 unk_2E0;                        /* inferred */
    /* 0x2E2 */ s16 unk_2E2;                        /* inferred */
    /* 0x2E4 */ char pad_2E4[0x3D8];                /* maybe part of unk_2E2[493]? */
    /* 0x6BC */ f32 unk_6BC;                        /* inferred */
    /* 0x6C0 */ char pad_6C0[0x4];
    /* 0x6C4 */ f32 unk_6C4;                        /* inferred */
    /* 0x6C8 */ Vec3f unk_6C8;                      /* inferred */
    /* 0x6D4 */ f32 unk_6D4;                        /* inferred */
    /* 0x6D8 */ f32 unk_6D8;                        /* inferred */
    /* 0x6DC */ f32 unk_6DC;                        /* inferred */
    /* 0x6E0 */ f32 unk_6E0;                        /* inferred */
    /* 0x6E4 */ f32 unk_6E4;                        /* inferred */
    /* 0x6E8 */ f32 unk_6E8;                        /* inferred */
    /* 0x6EC */ char pad_6EC[0x4];
    /* 0x6F0 */ f32 unk_6F0;                        /* inferred */
    /* 0x6F4 */ s16 unk_6F4;                        /* inferred */
    /* 0x6F6 */ s16 unk_6F6;                        /* inferred */
    /* 0x6F8 */ f32 unk_6F8;                        /* inferred */
    /* 0x6FC */ f32 unk_6FC;                        /* inferred */
    /* 0x700 */ f32 unk_700;                        /* inferred */
    /* 0x704 */ u32 unk_704;                        /* inferred */
    /* 0x708 */ s16 unk_708;                        /* inferred */
    /* 0x70A */ s16 unk_70A;                        /* inferred */
    /* 0x70C */ Vec3f unk_70C;                      /* inferred */
    /* 0x718 */ Vec3f unk_718;                      /* inferred */
    /* 0x724 */ char pad_724[0x4];
    /* 0x728 */ f32 unk_728;                        /* inferred */
    /* 0x72C */ char pad_72C[0x10];                 /* maybe part of unk_728[5]? */
    /* 0x73C */ f32 unk_73C;                        /* inferred */
    /* 0x740 */ char pad_740[0x4];
    /* 0x744 */ f32 unk_744;                        /* inferred */
    /* 0x748 */ s16 unk_748;                        /* inferred */
    /* 0x74A */ u8 unk_74A;                         /* inferred */
    /* 0x74B */ char pad_74B[0x1];
} Boss04;                                           /* size = 0x74C */

struct _mips2c_stack_Boss04_Destroy {};             /* size 0x0 */

struct _mips2c_stack_Boss04_Draw {
    /* 0x00 */ char pad_0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_Boss04_Init {
    /* 0x00 */ char pad_0[0x90];
    /* 0x90 */ f32 sp90;                            /* inferred */
    /* 0x94 */ char pad_94[0x4];
    /* 0x98 */ f32 sp98;                            /* inferred */
    /* 0x9C */ char pad_9C[0x8];                    /* maybe part of sp98[3]? */
    /* 0xA4 */ u32 spA4;                            /* inferred */
    /* 0xA8 */ f32 spA8;                            /* inferred */
    /* 0xAC */ f32 spAC;                            /* inferred */
    /* 0xB0 */ f32 spB0;                            /* inferred */
    /* 0xB4 */ f32 spB4;                            /* inferred */
    /* 0xB8 */ char pad_B8[0x4];
    /* 0xBC */ f32 spBC;                            /* inferred */
    /* 0xC0 */ CollisionPoly *spC0;                 /* inferred */
    /* 0xC4 */ char pad_C4[0xC];
};                                                  /* size = 0xD0 */

struct _mips2c_stack_Boss04_Update {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ ColliderJntSph *sp2C;                /* inferred */
    /* 0x30 */ CollisionCheckContext *sp30;         /* inferred */
    /* 0x34 */ char pad_34[0x14];
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_809EC040 {};              /* size 0x0 */

struct _mips2c_stack_func_809EC544 {};              /* size 0x0 */

struct _mips2c_stack_func_809EC568 {
    /* 0x00 */ char pad_0[0x40];
    /* 0x40 */ f32 *sp40;                           /* inferred */
    /* 0x44 */ Vec3f *sp44;                         /* inferred */
    /* 0x48 */ Vec3f *sp48;                         /* inferred */
    /* 0x4C */ char pad_4C[0x4];
    /* 0x50 */ ? sp50;                              /* inferred */
    /* 0x50 */ char pad_50[0x4];
    /* 0x54 */ f32 sp54;                            /* inferred */
    /* 0x58 */ char pad_58[0x4];
    /* 0x5C */ Camera *sp5C;                        /* inferred */
    /* 0x60 */ Actor *sp60;                         /* inferred */
    /* 0x64 */ char pad_64[0x10];                   /* maybe part of sp60[5]? */
    /* 0x74 */ Actor *sp74;                         /* inferred */
};                                                  /* size = 0x78 */

struct _mips2c_stack_func_809ECD00 {};              /* size 0x0 */

struct _mips2c_stack_func_809ECD18 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ Actor *sp24;                         /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_809ECEF4 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809ECF58 {
    /* 0x00 */ char pad_0[0x3C];
    /* 0x3C */ f32 sp3C;                            /* inferred */
    /* 0x40 */ f32 sp40;                            /* inferred */
    /* 0x44 */ f32 sp44;                            /* inferred */
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_809ED224 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809ED2A0 {
    /* 0x00 */ char pad_0[0x38];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_809ED45C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809ED50C {
    /* 0x00 */ char pad_0[0x48];
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_809EDCCC {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809EDECC {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ ? sp18;                              /* inferred */
    /* 0x18 */ char pad_18[0x10];
};                                                  /* size = 0x28 */

? func_800BC848(Boss04 *, GlobalContext *, ?, ?);   /* extern */
? func_8016566C(?);                                 /* extern */
? func_80165690();                                  /* extern */
? func_80169940(GlobalContext *, s16, f32);         /* extern */
void func_809EC040(s32 arg0, void *arg1, ? *arg2);  /* static */
void func_809EC544(Boss04 *arg0);                   /* static */
void func_809ECD00(Boss04 *arg0, GlobalContext *arg1); /* static */
void func_809ECEF4(Boss04 *arg0);                   /* static */
void func_809ED224(Boss04 *arg0);                   /* static */
void func_809ED45C(Actor *arg0, GlobalContext *arg1, GlobalContext *); /* static */
void func_809ED50C(Boss04 *arg0);                   /* static */
s32 func_809EDCCC(GlobalContext *arg0, s32 arg1, Gfx **arg2, Vec3f *arg3, Vec3s *arg4, Actor *arg5); /* static */
