void func_80A61A18(EnBal *arg0, EnBal *);           /* static */
void func_80A61A44(EnBal *arg0);                    /* static */
s32 func_80A61A6C(GlobalContext *arg0, Actor *arg1); /* static */
void func_80A61ADC(EnBal *arg0);                    /* static */
void func_80A61B5C(EnBal *arg0, GlobalContext *arg1); /* static */
void func_80A61C9C(Actor *arg0);                    /* static */
void func_80A61CE4(Actor *arg0, GlobalContext *arg1); /* static */
void func_80A61DF8(Actor *arg0);                    /* static */
void func_80A61E5C(Actor *arg0, GlobalContext *arg1); /* static */
void func_80A62128(Actor *arg0);                    /* static */
void func_80A621C4(Actor *arg0, GlobalContext *arg1); /* static */
void func_80A62260(Actor *arg0);                    /* static */
void func_80A622A0(EnBal *arg0, ? arg1);            /* static */
void func_80A623CC(EnBal *arg0);                    /* static */
void func_80A624DC(Actor *arg0, GlobalContext *arg1); /* static */
void func_80A62818(Actor *arg0);                    /* static */
void func_80A62830(EnBal *arg0, GlobalContext *arg1); /* static */
void func_80A629C4(EnBal *arg0);                    /* static */
void func_80A62AC4();                               /* static */
s32 func_80A62B30(SkelAnime *, ActorAnimationEntry *); /* static */
void func_80A62B78(EnBal *arg0, GlobalContext *arg1); /* static */
void func_80A62CF0(Actor *arg0, GlobalContext *arg1); /* static */

void func_80A63B94(GlobalContext *arg0, s32 arg1, Gfx **arg2, Vec3s *arg3, Actor *arg4); /* static */
extern AnimationHeaderCommon D_060005FC;
extern ? D_06000C78;
extern FlexSkeletonHeader D_0600A6D0;
extern AnimationHeader D_0600B604;
extern ? D_0600CB78;
extern ? D_0600D530;
static DamageTable D_80A63CE0 = {
    {
        0,
        0,
        0,
        0,
        0xE1,
        0xE1,
        0xF1,
        0xF1,
        1,
        1,
        1,
        0x22,
        0x32,
        0x42,
        0xF1,
        0,
        0xE1,
        2,
        0,
        0,
        0,
        0,
        0xF1,
        0xF1,
        0xF1,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
    },
};
static CollisionCheckInfoInit2 D_80A63D00 = {1, 0, 0, 0, 0xFF};
static ColliderJntSphElementInit D_80A63D0C = {
    {0, {0xF7CFFFFF, 0, 0}, {0xF7CFFFFF, 0, 0}, 0, 1, 1},
    {6, {{0x960, 0, 0}, 0x32}, 0x64},
};
static ColliderJntSphInit D_80A63D30 = {{0xA, 0x11, 9, 0x39, 0x10, 0}, 1, &D_80A63D0C};
static ? D_80A63D40;                                /* unable to generate initializer */
static ActorAnimationEntry D_80A63D58 = {
    {(AnimationHeader *)0x60005FC, 1.0f, 0.0f, 0.0f, 0, -8.0f},
    {(AnimationHeader *)0x6000840, 1.5f, 0.0f, 0.0f, 0, -8.0f},
    {(AnimationHeader *)0x6000840, 1.5f, 0.0f, 0.0f, 2, -4.0f},
    {(AnimationHeader *)0x600A7DC, 1.0f, 0.0f, 0.0f, 2, -4.0f},
    {(AnimationHeader *)0x600B1E8, 1.0f, 0.0f, 0.0f, 0, -8.0f},
    {(AnimationHeader *)0x600B604, 1.0f, 0.0f, 0.0f, 0, -8.0f},
    {(AnimationHeader *)0x600C498, 1.0f, 0.0f, 0.0f, 2, -8.0f},
    {(AnimationHeader *)0x600C8D8, 1.0f, 0.0f, 0.0f, 0, -8.0f},
    {(AnimationHeader *)0x600C8D8, 1.0f, 0.0f, 0.0f, 2, -8.0f},
    {(AnimationHeader *)0x600C498, 1.0f, 23.0f, 0.0f, 2, -8.0f},
    {(AnimationHeader *)0x600D530, 1.0f, 0.0f, 0.0f, 0, -8.0f},
    {(AnimationHeader *)0x6000C78, 1.0f, 0.0f, 0.0f, 0, -2.0f},
    {(AnimationHeader *)0x600CB78, 1.0f, 0.0f, 0.0f, 0, -2.0f},
    {(AnimationHeader *)0x6001804, 1.0f, 0.0f, 0.0f, 0, -2.0f},
};
static ? D_80A63EA8;                                /* unable to generate initializer */
static Vec3f D_80A63EB4;                            /* type too large by 8; unable to generate initializer */
static f32 D_80A63EB8 = 0.0f;
static f32 D_80A63EBC = 0.0f;
static Vec3f D_80A63EC0;                            /* type too large by 8; unable to generate initializer */
static f32 D_80A63EC4 = 0.0f;
static Color_RGBA8 D_80A63ECC = {0xFF, 0xFF, 0xFF, 0xFF};
static Color_RGBA8 D_80A63ED0 = {0x64, 0xC8, 0, 0xFF};
static Vec3f D_80A63ED4;                            /* type too large by 8; unable to generate initializer */
static f32 D_80A63ED8 = 0.0f;
static f32 D_80A63EDC = 0.0f;
static Vec3f D_80A63EE0 = {0.0f, 0.0f, 0.0f};
static Color_RGBA8 D_80A63EEC = {0xFF, 0xFF, 0xFF, 0xFF};
static Color_RGBA8 D_80A63EF0 = {0xC6, 0xC6, 0xC6, 0xFF};
static s32 D_80A63EF4 = 0;
static Vec3f D_80A63EF8 = {1000.0f, 0.0f, 0.0f};
static ? D_80A63F04;                                /* unable to generate initializer */

typedef struct EnBal {
    /* 0x0000 */ Actor actor;
    /* 0x0144 */ s32 (*unk144)(GlobalContext *, Actor *); /* inferred */
    /* 0x0148 */ SkelAnime unk148;                  /* inferred */
    /* 0x018C */ void (*actionFunc)(EnBal *, GlobalContext *);
    /* 0x0190 */ SkelAnime unk190;                  /* inferred */
    /* 0x01D4 */ char pad1D4[0x1C];
    /* 0x01F0 */ f32 unk1F0;                        /* inferred */
    /* 0x01F4 */ f32 unk1F4;                        /* inferred */
    /* 0x01F8 */ f32 unk1F8;                        /* inferred */
    /* 0x01FC */ s32 unk1FC;                        /* inferred */
    /* 0x0200 */ Vec3s unk200;                      /* inferred */
    /* 0x0206 */ char pad206[0xC0];                 /* maybe part of unk200[33]? */
    /* 0x02C6 */ Vec3s unk2C6;                      /* inferred */
    /* 0x02CC */ char pad2CC[0xCC];                 /* maybe part of unk2C6[35]? */
    /* 0x0398 */ s16 unk398;                        /* inferred */
    /* 0x039A */ s16 unk39A;                        /* inferred */
    /* 0x039C */ s16 unk39C;                        /* inferred */
    /* 0x039E */ s16 unk39E;                        /* inferred */
    /* 0x03A0 */ s16 unk3A0;                        /* inferred */
    /* 0x03A2 */ char pad3A2[0x2];                  /* maybe part of unk3A0[2]? */
    /* 0x03A4 */ s16 unk3A4;                        /* inferred */
    /* 0x03A6 */ s16 unk3A6;                        /* inferred */
    /* 0x03A8 */ s16 unk3A8;                        /* inferred */
    /* 0x03AA */ char pad3AA[0x4];                  /* maybe part of unk3A8[3]? */
    /* 0x03AE */ s16 unk3AE;                        /* inferred */
    /* 0x03B0 */ s16 unk3B0;                        /* inferred */
    /* 0x03B2 */ s8 unk3B2;                         /* inferred */
    /* 0x03B3 */ char pad3B3[0x1];                  /* maybe part of unk3B2[2]? */
} EnBal;                                            /* size 0x3B4 */

typedef struct {
    /* 0x0000 */ View view;
    /* 0x0168 */ Font font;
    /* 0x11EF4 */ s8 unk_11EF4[16];
    /* 0x11F04 */ u16 unk11F04;
    /* 0x11F06 */ char pad11F06[0x4];               /* maybe part of unk11F04[3]? */
    /* 0x11F0A */ u8 unk11F0A;
    /* 0x11F0B */ char pad11F0B[0x5];               /* maybe part of unk11F0A[6]? */
    /* 0x11F10 */ s32 unk11F10;
    /* 0x11F14 */ char pad11F14[0xE];
    /* 0x11F22 */ u8 unk11F22;
    /* 0x11F23 */ char pad11F23[0xFD];              /* maybe part of unk11F22[254]? */
    /* 0x12020 */ u8 unk12020;
    /* 0x12021 */ u8 choiceIndex;
    /* 0x12022 */ char pad12022[0x1];               /* maybe part of choiceIndex[2]? */
    /* 0x12023 */ s8 unk12023;
    /* 0x12024 */ char pad12024[0x6];               /* maybe part of unk12023[7]? */
    /* 0x1202A */ u16 unk1202A;
    /* 0x1202C */ char pad1202C[0x2];               /* maybe part of unk1202A[2]? */
    /* 0x1202E */ u16 unk1202E;
    /* 0x12030 */ char pad12030[0x14];              /* maybe part of unk1202E[11]? */
    /* 0x12044 */ s16 unk12044;
    /* 0x12046 */ char pad12046[0x24];              /* maybe part of unk12044[19]? */
    /* 0x1206A */ s16 unk1206A;
    /* 0x1206C */ s32 unk1206C;
    /* 0x12070 */ s32 unk12070;                     /* inferred */
    /* 0x12074 */ char pad12074[0x4];               /* maybe part of unk12070[2]? */
    /* 0x12078 */ s32 bankRupeesSelected;
    /* 0x1207C */ s32 bankRupees;
    /* 0x12080 */ char pad12080[0x31];
    /* 0x120B1 */ u8 unk120B1;
    /* 0x120B2 */ char pad120B2[0x2E];              /* maybe part of unk120B1[47]? */
} MessageContext;                                   /* size 0x120E0 */

void EnBal_Init(Actor *thisx, GlobalContext *globalCtx) {
    EnBal *this = (EnBal *) thisx;
    f32 sp34;
    SkelAnime *sp30;
    SkelAnime *temp_a1;
    SkelAnime *temp_a1_2;

    sp34 = (f32) SkelAnime_GetFrameCount(&D_060005FC);
    this->actor.targetMode = 1;
    this->unk3AE = this->actor.params & 0xFF;
    this->actor.uncullZoneForward = 3000.0f;
    Actor_SetScale(&this->actor, 0.02f);
    temp_a1 = &this->unk148;
    sp30 = temp_a1;
    SkelAnime_InitSV(globalCtx, temp_a1, &D_0600A6D0, (AnimationHeader *) &D_060005FC, &this->unk200, &this->unk2C6, 0x21);
    if (gSaveContext.magicAcquired != 0) {
        SkelAnime_ChangeAnim(sp30, &D_0600B604, 1.0f, 0.0f, sp34, (u8) 0, -10.0f);
    }
    ActorShape_Init(&this->actor.shape, 0.0f, func_800B3FC0, 0.0f);
    this->unk39E = 0;
    this->unk3A0 = 0;
    this->unk3A4 = 0;
