typedef struct BgDyYoseizo {
    /* 0x0000 */ Actor actor;
    /* 0x0144 */ void (*actionFunc)(BgDyYoseizo *, GlobalContext *);
    /* 0x0148 */ SkelAnime unk_148;                 /* inferred */
    /* 0x018C */ Vec3s unk_18C;                     /* inferred */
    /* 0x0192 */ char pad_192[0xA2];                /* maybe part of unk_18C[28]? */
    /* 0x0234 */ Vec3s unk_234;                     /* inferred */
    /* 0x023A */ char pad_23A[0xAE];                /* maybe part of unk_234[30]? */
    /* 0x02E8 */ Actor *unk_2E8;                    /* inferred */
    /* 0x02EC */ f32 unk_2EC;                       /* inferred */
    /* 0x02F0 */ f32 unk_2F0;                       /* inferred */
    /* 0x02F4 */ f32 unk_2F4;                       /* inferred */
    /* 0x02F8 */ s16 unk_2F8;                       /* inferred */
    /* 0x02FA */ s16 unk_2FA;                       /* inferred */
    /* 0x02FC */ s16 unk_2FC;                       /* inferred */
    /* 0x02FE */ s16 unk_2FE;                       /* inferred */
    /* 0x0300 */ s16 unk_300;                       /* inferred */
    /* 0x0302 */ u16 unk_302;                       /* inferred */
    /* 0x0304 */ char pad_304[0x3200];              /* maybe part of unk_302[6401]? */
} BgDyYoseizo;                                      /* size = 0x3504 */

struct _mips2c_stack_BgDyYoseizo_Destroy {};        /* size 0x0 */

struct _mips2c_stack_BgDyYoseizo_Init {
    /* 0x00 */ char pad_0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_BgDyYoseizo_Update {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A0A96C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A0A9E4 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A0AA40 {
    /* 0x00 */ char pad_0[0xAC];
    /* 0xAC */ u8 spAC;                             /* inferred */
    /* 0xAD */ u8 spAD;                             /* inferred */
    /* 0xAE */ u8 spAE;                             /* inferred */
    /* 0xAF */ char pad_AF[0x1];
    /* 0xB0 */ u8 spB0;                             /* inferred */
    /* 0xB1 */ u8 spB1;                             /* inferred */
    /* 0xB2 */ u8 spB2;                             /* inferred */
    /* 0xB3 */ char pad_B3[0x1];
    /* 0xB4 */ f32 spB4;                            /* inferred */
    /* 0xB8 */ f32 spB8;                            /* inferred */
    /* 0xBC */ f32 spBC;                            /* inferred */
    /* 0xC0 */ f32 spC0;                            /* inferred */
    /* 0xC4 */ f32 spC4;                            /* inferred */
    /* 0xC8 */ f32 spC8;                            /* inferred */
    /* 0xCC */ f32 spCC;                            /* inferred */
    /* 0xD0 */ f32 spD0;                            /* inferred */
    /* 0xD4 */ f32 spD4;                            /* inferred */
};                                                  /* size = 0xD8 */

struct _mips2c_stack_func_80A0AD50 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ f32 sp24;                            /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80A0AE1C {
    /* 0x00 */ char pad_0[0x44];
    /* 0x44 */ f32 sp44;                            /* inferred */
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_80A0AFDC {
    /* 0x00 */ char pad_0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80A0B078 {
    /* 0x00 */ char pad_0[0x34];
    /* 0x34 */ SkelAnime *sp34;                     /* inferred */
    /* 0x38 */ char pad_38[0x8];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80A0B184 {
    /* 0x00 */ char pad_0[0x34];
    /* 0x34 */ SkelAnime *sp34;                     /* inferred */
    /* 0x38 */ char pad_38[0x8];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80A0B290 {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ SkelAnime *sp2C;                     /* inferred */
    /* 0x30 */ char pad_30[0x8];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80A0B35C {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80A0B500 {
    /* 0x00 */ char pad_0[0x40];
    /* 0x40 */ SkelAnime *sp40;                     /* inferred */
    /* 0x44 */ char pad_44[0x10];                   /* maybe part of sp40[5]? */
    /* 0x54 */ Actor *sp54;                         /* inferred */
};                                                  /* size = 0x58 */

struct _mips2c_stack_func_80A0B5F0 {
    /* 0x00 */ char pad_0[0x34];
    /* 0x34 */ SkelAnime *sp34;                     /* inferred */
    /* 0x38 */ char pad_38[0x8];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80A0B75C {
    /* 0x00 */ char pad_0[0x34];
    /* 0x34 */ SkelAnime *sp34;                     /* inferred */
    /* 0x38 */ char pad_38[0x8];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80A0B834 {
    /* 0x00 */ char pad_0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80A0B8CC {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ SkelAnime *sp24;                     /* inferred */
    /* 0x28 */ char pad_28[0x4];
    /* 0x2C */ Actor *sp2C;                         /* inferred */
    /* 0x30 */ char pad_30[0x6];                    /* maybe part of sp2C[2]? */
    /* 0x36 */ u16 sp36;                            /* inferred */
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80A0BB08 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ SkelAnime *sp24;                     /* inferred */
    /* 0x28 */ char pad_28[0x8];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80A0BCD8 {};              /* size 0x0 */

struct _mips2c_stack_func_80A0BD40 {
    /* 0x00 */ char pad_0[0x34];
    /* 0x34 */ Gfx *sp34;                           /* inferred */
    /* 0x38 */ char pad_38[0x4];
    /* 0x3C */ GraphicsContext *sp3C;               /* inferred */
    /* 0x40 */ u32 sp40;                            /* inferred */
    /* 0x44 */ char pad_44[0x4];
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_80A0BE60 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ void *sp1C;                          /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80A0BF70 {
    /* 0x00 */ char pad_0[0x7C];
    /* 0x7C */ f32 sp7C;                            /* inferred */
    /* 0x80 */ char pad_80[0x10];                   /* maybe part of sp7C[5]? */
    /* 0x90 */ f32 sp90;                            /* inferred */
    /* 0x94 */ f32 sp94;                            /* inferred */
    /* 0x98 */ f32 sp98;                            /* inferred */
    /* 0x9C */ f32 sp9C;                            /* inferred */
    /* 0xA0 */ f32 spA0;                            /* inferred */
    /* 0xA4 */ f32 spA4;                            /* inferred */
    /* 0xA8 */ char pad_A8[0x8];
};                                                  /* size = 0xB0 */

struct _mips2c_stack_func_80A0C270 {
    /* 0x00 */ char pad_0[0x50];
};                                                  /* size = 0x50 */

? Parameter_AddMagic(GlobalContext *, s16, SaveContext *); /* extern */
void func_80A0A96C(BgDyYoseizo *arg0);              /* static */
void func_80A0A9E4(BgDyYoseizo *arg0, GlobalContext *arg1); /* static */
void func_80A0AA40(Actor *arg0, s16 arg1, s32 arg2); /* static */
void func_80A0AD50(Actor *arg0);                    /* static */
void func_80A0AFDC(Actor *arg0);                    /* static */
void func_80A0B834(Actor *arg0);                    /* static */
s32 func_80A0BCD8(GlobalContext *arg0, s32 arg1, Gfx **arg2, Vec3f *arg3, Vec3s *arg4, Actor *arg5); /* static */
void func_80A0BD40(Actor *this, GlobalContext *globalCtx); /* static */
void func_80A0BE60(Actor *arg0, f32 *arg1, f32 *arg2, f32 *arg3, u8 *arg4, u8 *arg5, f32 arg6, s32 arg7, s32 arg8); /* static */
void func_80A0BF70(BgDyYoseizo *arg0, GlobalContext *arg1); /* static */
