typedef struct EnWaterEffect {
    /* 0x000 */ Actor actor;
    /* 0x144 */ ? unk144;                           /* inferred */
    /* 0x144 */ char pad144[0xC80];
    /* 0xDC4 */ s16 unkDC4;                         /* inferred */
    /* 0xDC6 */ s16 unkDC6;                         /* inferred */
    /* 0xDC8 */ char padDC8[0x10];                  /* maybe part of unkDC6[9]? */
    /* 0xDD8 */ f32 unkDD8;                         /* inferred */
    /* 0xDDC */ char padDDC[0x8];                   /* maybe part of unkDD8[3]? */
    /* 0xDE4 */ f32 unkDE4;                         /* inferred */
    /* 0xDE8 */ char padDE8[0x8];                   /* maybe part of unkDE4[3]? */
    /* 0xDF0 */ f32 unkDF0;                         /* inferred */
    /* 0xDF4 */ char padDF4[0x18];                  /* maybe part of unkDF0[7]? */
    /* 0xE0C */ f32 unkE0C;                         /* inferred */
    /* 0xE10 */ f32 unkE10;                         /* inferred */
    /* 0xE14 */ f32 unkE14;                         /* inferred */
    /* 0xE18 */ char padE18[0x4];
    /* 0xE1C */ f32 unkE1C;                         /* inferred */
    /* 0xE20 */ f32 unkE20;                         /* inferred */
    /* 0xE24 */ f32 unkE24;                         /* inferred */
    /* 0xE28 */ char padE28[0x4];
    /* 0xE2C */ f32 unkE2C;                         /* inferred */
    /* 0xE30 */ f32 unkE30;                         /* inferred */
    /* 0xE34 */ f32 unkE34;                         /* inferred */
    /* 0xE38 */ f32 unkE38;                         /* inferred */
} EnWaterEffect;                                    /* size = 0xE3C */

struct _mips2c_stack_EnWaterEffect_Destroy {};      /* size 0x0 */

struct _mips2c_stack_EnWaterEffect_Draw {
    /* 0x00 */ char pad0[0x54];
    /* 0x54 */ ? *sp54;                             /* inferred */
    /* 0x58 */ char pad58[0x58];
};                                                  /* size = 0xB0 */

struct _mips2c_stack_EnWaterEffect_Init {
    /* 0x00 */ char pad0[0x3C];
    /* 0x3C */ ActorContext *sp3C;                  /* inferred */
    /* 0x40 */ char pad40[0x8];
};                                                  /* size = 0x48 */

struct _mips2c_stack_EnWaterEffect_Update {
    /* 0x00 */ char pad0[0x88];
    /* 0x88 */ f32 sp88;                            /* inferred */
    /* 0x8C */ f32 sp8C;                            /* inferred */
    /* 0x90 */ f32 sp90;                            /* inferred */
    /* 0x94 */ char pad94[0x4];
    /* 0x98 */ ? sp98;                              /* inferred */
    /* 0x98 */ char pad98[0x4];
    /* 0x9C */ f32 sp9C;                            /* inferred */
    /* 0xA0 */ char padA0[0x4];
    /* 0xA4 */ ? spA4;                              /* inferred */
    /* 0xA4 */ char padA4[0x4];
    /* 0xA8 */ f32 spA8;                            /* inferred */
    /* 0xAC */ char padAC[0x10];                    /* maybe part of spA8[5]? */
    /* 0xBC */ Actor *spBC;                         /* inferred */
    /* 0xC0 */ char padC0[0x8];
};                                                  /* size = 0xC8 */

struct _mips2c_stack_func_80A587A0 {
    /* 0x00 */ char pad0[0x18];
    /* 0x18 */ void *sp18;                          /* inferred */
    /* 0x1C */ char pad1C[0x4];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80A58908 {
    /* 0x00 */ char pad0[0x2C];
    /* 0x2C */ ? sp2C;                              /* inferred */
    /* 0x2C */ char pad2C[0xC];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80A599E8 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80A59C04 {
    /* 0x00 */ char pad0[0x64];
    /* 0x64 */ CollisionContext *sp64;              /* inferred */
    /* 0x68 */ char pad68[0xC];                     /* maybe part of sp64[4]? */
    /* 0x74 */ f32 sp74;                            /* inferred */
    /* 0x78 */ f32 sp78;                            /* inferred */
    /* 0x7C */ f32 sp7C;                            /* inferred */
    /* 0x80 */ char pad80[0x8];                     /* maybe part of sp7C[3]? */
    /* 0x88 */ ? sp88;                              /* inferred */
    /* 0x88 */ char pad88[0x8];
    /* 0x90 */ ? sp90;                              /* inferred */
    /* 0x90 */ char pad90[0x4];
    /* 0x94 */ f32 sp94;                            /* inferred */
    /* 0x98 */ char pad98[0x18];
};                                                  /* size = 0xB0 */

struct _mips2c_stack_func_80A5A184 {
    /* 0x00 */ char pad0[0x60];
};                                                  /* size = 0x60 */

struct _mips2c_stack_func_80A5A534 {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80A5A6B8 {
    /* 0x00 */ char pad0[0x30];
    /* 0x30 */ ? *sp30;                             /* inferred */
    /* 0x34 */ ? *sp34;                             /* inferred */
    /* 0x38 */ char pad38[0x8];                     /* maybe part of sp34[3]? */
    /* 0x40 */ Gfx *sp40;                           /* inferred */
    /* 0x44 */ char pad44[0xC];                     /* maybe part of sp40[4]? */
    /* 0x50 */ Gfx *sp50;                           /* inferred */
    /* 0x54 */ char pad54[0x8];                     /* maybe part of sp50[3]? */
    /* 0x5C */ Gfx *sp5C;                           /* inferred */
    /* 0x60 */ char pad60[0x8];                     /* maybe part of sp5C[3]? */
    /* 0x68 */ Gfx *sp68;                           /* inferred */
    /* 0x6C */ char pad6C[0x8];                     /* maybe part of sp68[3]? */
    /* 0x74 */ Gfx *sp74;                           /* inferred */
    /* 0x78 */ char pad78[0x8];                     /* maybe part of sp74[3]? */
    /* 0x80 */ Gfx *sp80;                           /* inferred */
    /* 0x84 */ char pad84[0x1C];
};                                                  /* size = 0xA0 */

f32 func_800C3FA0(CollisionContext *, ? *, ? *);    /* extern */
void func_80A587A0(EnWaterEffect *arg0, f32 *arg1, u8 arg2); /* static */
void func_80A58908(EnWaterEffect *arg0, Vec3f *arg1, ? *arg2, u8 arg3); /* static */
void func_80A599E8(Actor *arg0, f32 *arg1, u8 arg2); /* static */
void func_80A59C04(Actor *this, GlobalContext *globalCtx); /* static */
void func_80A5A184(Actor *this, GlobalContext *globalCtx); /* static */
void func_80A5A534(Actor *this, GlobalContext *globalCtx); /* static */
void func_80A5A6B8(Actor *this, GlobalContext *globalCtx); /* static */
extern ? D_06000420;
extern ? D_06000730;
extern ? D_06000A48;
extern ? D_06000CD8;
extern void D_06000DE0;
extern void D_06000E0C;
extern void D_06000E40;
extern void D_06000E58;
extern ? D_06004260;
extern ? D_060042B0;
extern ? D_060042F8;
extern ? D_06004340;
extern ? D_060043E8;
