? func_800F0590(GlobalContext *, PosRot *, ?, ?);   /* extern */
void func_80AD6F34(EnKame *arg0);                   /* static */
void func_80AD6F9C(Actor *arg0);                    /* static */
void func_80AD7018(Actor *arg0, GlobalContext *arg1); /* static */
void func_80AD70A0(EnKame *arg0);                   /* static */
void func_80AD71B4(EnKame *arg0, EnKame *);         /* static */
void func_80AD73A8(EnKame *arg0);                   /* static */
void func_80AD7568(Actor *arg0);                    /* static */
void func_80AD75A8(Actor *arg0, GlobalContext *arg1); /* static */
void func_80AD76CC(EnKame *arg0);                   /* static */
void func_80AD792C(EnKame *arg0);                   /* static */
void func_80AD7B18(EnKame *arg0);                   /* static */
void func_80AD7C54(Actor *arg0);                    /* static */
void func_80AD7DA4(EnKame *arg0, EnKame *);         /* static */
void func_80AD7EC0(EnKame *arg0, EnKame *);         /* static */
void func_80AD7FA4(Actor *arg0);                    /* static */
void func_80AD8060(Actor *arg0);                    /* static */
void func_80AD8148(EnKame *arg0, GlobalContext *arg1); /* static */
void func_80AD8364(EnKame *arg0);                   /* static */
void func_80AD84C0(Actor *arg0, GlobalContext *arg1); /* static */
s32 func_80AD8A48(GlobalContext *arg0, s32 arg1, Gfx **arg2, Vec3f *arg3, Vec3s *arg5, Actor *actor); /* static */
void func_80AD8AF8(GlobalContext *arg0, s32 arg1, Gfx **arg2, Vec3s *arg3, Actor *arg4); /* static */
s32 func_80AD8CEC(GlobalContext *arg0, s32 arg1, Gfx **arg2, Vec3f *arg3, Vec3s *arg5, Actor *actor); /* static */
void func_80AD8D64(Actor *arg0, GlobalContext *arg1); /* static */
extern AnimationHeaderCommon D_060008B4;
extern AnimationHeader D_06000AF4;
extern AnimationHeader D_06000B30;
extern FlexSkeletonHeader D_06001A50;
extern AnimationHeader D_06001C68;
extern AnimationHeader D_06002510;
extern AnimationHeader D_060027D8;
extern AnimationHeader D_06002F88;
extern AnimationHeader D_060031DC;
extern AnimationHeader D_060035EC;
extern AnimationHeader D_060039C0;
extern AnimationHeader D_06004210;
extern FlexSkeletonHeader D_06007C70;
extern AnimationHeader D_0600823C;
static ColliderCylinderInit D_80AD8DE0 = {
    {0xC, 0x10, 0xD, 0x39, 0x10, 1},
    {0, {0xF7CFFFFF, 0, 4}, {0xF7CF7FFF, 0, 0}, 1, 5, 1},
    {0x23, 0x28, 0, {0, 0, 0}},
};
static CollisionCheckInfoInit D_80AD8E0C = {3, 0xF, 0x1E, 0x50};
static DamageTable D_80AD8E14 = {
    {
        0x10,
        1,
        1,
        0xF1,
        1,
        1,
        0,
        0xD0,
        1,
        1,
        0xF0,
        0x22,
        0x32,
        0x42,
        1,
        0x10,
        1,
        0xE2,
        0x10,
        0x50,
        0,
        0,
        1,
        1,
        1,
        0,
        0,
        0,
        0,
        0,
        0,
        0xF1,
    },
};
static void *D_80AD8E34 = {(void *)0x60055A0, (void *)0x60057A0, (void *)0x60059A0, (void *)0x60057A0};
static InitChainEntry D_80AD8E44;                   /* unable to generate initializer */
static s32 D_80AD8E50 = 0;
static Color_RGBA8 D_80AD8E54 = {0xFA, 0xFA, 0xFA, 0xFF};
static Color_RGBA8 D_80AD8E58 = {0xB4, 0xB4, 0xB4, 0xFF};
static Vec3f D_80AD8E5C = {0.0f, 0.75f, 0.0f};
static Vec3f D_80AD8E68 = {
    {1500.0f, 0.0f, -2000.0f},
    {1500.0f, 0.0f, 2000.0f},
    {1500.0f, 2000.0f, 0.0f},
    {1500.0f, -2000.0f, 0.0f},
    {2500.0f, 0.0f, 0.0f},
};
static ? D_80AD8EA4;                                /* unable to generate initializer */
static ? D_80AD8EA5;                                /* unable to generate initializer */

typedef struct EnKame {
    /* 0x0000 */ Actor actor;
    /* 0x0144 */ SkelAnime unk144;                  /* inferred */
    /* 0x0188 */ Vec3s unk188;                      /* inferred */
    /* 0x018E */ char pad18E[0x48];                 /* maybe part of unk188[13]? */
    /* 0x01D6 */ Vec3s unk1D6;                      /* inferred */
    /* 0x01DC */ char pad1DC[0x48];                 /* maybe part of unk1D6[13]? */
    /* 0x0224 */ SkelAnime unk224;                  /* inferred */
    /* 0x0268 */ Vec3s unk268;                      /* inferred */
    /* 0x026E */ char pad26E[0x12];                 /* maybe part of unk268[4]? */
    /* 0x0280 */ Vec3s unk280;                      /* inferred */
    /* 0x0286 */ char pad286[0x12];                 /* maybe part of unk280[4]? */
    /* 0x0298 */ void (*actionFunc)(EnKame *, GlobalContext *);
    /* 0x029C */ u8 unk29C;                         /* inferred */
    /* 0x029D */ u8 unk29D;                         /* inferred */
    /* 0x029E */ s16 unk29E;                        /* inferred */
    /* 0x02A0 */ s16 unk2A0;                        /* inferred */
    /* 0x02A2 */ s16 unk2A2;                        /* inferred */
    /* 0x02A4 */ s16 unk2A4;                        /* inferred */
    /* 0x02A6 */ s16 unk2A6;                        /* inferred */
    /* 0x02A8 */ f32 unk2A8;                        /* inferred */
    /* 0x02AC */ f32 unk2AC;                        /* inferred */
    /* 0x02B0 */ f32 unk2B0;                        /* inferred */
    /* 0x02B4 */ f32 unk2B4;                        /* inferred */
    /* 0x02B8 */ f32 unk2B8;                        /* inferred */
    /* 0x02BC */ f32 unk2BC;                        /* inferred */
    /* 0x02C0 */ f32 unk2C0;                        /* inferred */
    /* 0x02C4 */ f32 unk2C4;                        /* inferred */
    /* 0x02C8 */ Vec3f unk2C8;                      /* inferred */
    /* 0x02D4 */ char pad2D4[0x6C];                 /* maybe part of unk2C8[10]? */
    /* 0x0340 */ ColliderCylinder unk340;           /* inferred */
} EnKame;                                           /* size 0x38C */

void EnKame_Init(Actor *thisx, GlobalContext *globalCtx) {
    EnKame *this = (EnKame *) thisx;
    void **temp_s0;
    void **phi_s0;

    Actor_ProcessInitChain(&this->actor, &D_80AD8E44);
    SkelAnime_InitSV(globalCtx, &this->unk144, &D_06007C70, &D_06004210, &this->unk188, &this->unk1D6, 0xD);
    SkelAnime_InitSV(globalCtx, &this->unk224, &D_06001A50, &D_06000B30, &this->unk268, &this->unk280, 4);
    ActorShape_Init(&this->actor.shape, 0.0f, func_800B3FC0, 55.0f);
    Collider_InitAndSetCylinder(globalCtx, &this->unk340, &this->actor, &D_80AD8DE0);
    CollisionCheck_SetInfo(&this->actor.colChkInfo, &D_80AD8E14, &D_80AD8E0C);
    phi_s0 = &D_80AD8E34;
    if (D_80AD8E50 == 0) {
        do {
            temp_s0 = phi_s0 + 4;
            temp_s0->unk-4 = Lib_SegmentedToVirtual(*phi_s0);
            phi_s0 = temp_s0;
