typedef struct ObjSpinyroll {
    /* 0x000 */ Actor actor;
    /* 0x144 */ s32 unk_144;                        /* inferred */
    /* 0x148 */ char pad_148[0x14];                 /* maybe part of unk_144[6]? */
    /* 0x15C */ ColliderTris unk_15C;               /* inferred */
    /* 0x17C */ ColliderTrisElement unk_17C;        /* inferred */
    /* 0x1D8 */ char pad_1D8[0x2C4];                /* maybe part of unk_17C[8]? */
    /* 0x49C */ s32 unk_49C;                        /* inferred */
    /* 0x4A0 */ void (*actionFunc)(ObjSpinyroll *, GlobalContext *);
    /* 0x4A4 */ f32 unk_4A4;                        /* inferred */
    /* 0x4A8 */ char pad_4A8[0x4];
    /* 0x4AC */ ColliderTris unk_4AC;               /* inferred */
    /* 0x4CC */ char pad_4CC[0x4];
    /* 0x4D0 */ f32 unk_4D0;                        /* inferred */
    /* 0x4D4 */ char pad_4D4[0x6];                  /* maybe part of unk_4D0[2]? */
    /* 0x4DA */ s16 unk_4DA;                        /* inferred */
    /* 0x4DC */ char pad_4DC[0x2];
    /* 0x4DE */ s16 unk_4DE;                        /* inferred */
    /* 0x4E0 */ s16 unk_4E0;                        /* inferred */
    /* 0x4E2 */ char pad_4E2[0x2];
} ObjSpinyroll;                                     /* size = 0x4E4 */

struct _mips2c_stack_ObjSpinyroll_Destroy {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_ObjSpinyroll_Draw {
    /* 0x00 */ char pad_0[0x84];
    /* 0x84 */ s16 sp84;                            /* inferred */
    /* 0x86 */ s16 sp86;                            /* inferred */
    /* 0x88 */ s16 sp88;                            /* inferred */
    /* 0x8A */ char pad_8A[0x26];
};                                                  /* size = 0xB0 */

struct _mips2c_stack_ObjSpinyroll_Init {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ ColliderTris *sp2C;                  /* inferred */
    /* 0x30 */ Vec3s *sp30;                         /* inferred */
    /* 0x34 */ void *sp34;                          /* inferred */
    /* 0x38 */ char pad_38[0xC];                    /* maybe part of sp34[4]? */
    /* 0x44 */ f32 sp44;                            /* inferred */
    /* 0x48 */ char pad_48[0x8];
};                                                  /* size = 0x50 */

struct _mips2c_stack_ObjSpinyroll_Update {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ ColliderTris *sp20;                  /* inferred */
    /* 0x24 */ CollisionCheckContext *sp24;         /* inferred */
    /* 0x28 */ char pad_28[0x8];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80A1DA50 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ ? sp1C;                              /* inferred */
    /* 0x1C */ char pad_1C[0xC];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80A1DAAC {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ f32 sp1C;                            /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80A1DB2C {
    /* 0x00 */ char pad_0[0x58];
    /* 0x58 */ ColliderTris *sp58;                  /* inferred */
    /* 0x5C */ char pad_5C[0x14];                   /* maybe part of sp58[6]? */
    /* 0x70 */ f32 sp70;                            /* inferred */
    /* 0x74 */ f32 sp74;                            /* inferred */
    /* 0x78 */ f32 sp78;                            /* inferred */
    /* 0x7C */ ? sp7C;                              /* inferred */
    /* 0x7C */ char pad_7C[0xC];
    /* 0x88 */ ? sp88;                              /* inferred */
    /* 0x88 */ char pad_88[0xC];
    /* 0x94 */ ? sp94;                              /* inferred */
    /* 0x94 */ char pad_94[0xC];
    /* 0xA0 */ ? spA0;                              /* inferred */
    /* 0xA0 */ char pad_A0[0x10];
};                                                  /* size = 0xB0 */

struct _mips2c_stack_func_80A1DC5C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A1DCCC {};              /* size 0x0 */

struct _mips2c_stack_func_80A1DD18 {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ Vec3f *sp20;                         /* inferred */
    /* 0x24 */ char pad_24[0x4];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80A1DE10 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A1DE58 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A1DE84 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A1DEB8 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ ? sp24;                              /* inferred */
    /* 0x24 */ char pad_24[0xC];
    /* 0x30 */ s32 sp30;                            /* inferred */
    /* 0x34 */ char pad_34[0x4];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80A1DFA0 {};              /* size 0x0 */

struct _mips2c_stack_func_80A1E074 {
    /* 0x00 */ char pad_0[0x90];
    /* 0x90 */ f32 *sp90;                           /* inferred */
    /* 0x94 */ void *sp94;                          /* inferred */
    /* 0x98 */ s32 sp98;                            /* inferred */
    /* 0x9C */ char pad_9C[0x14];                   /* maybe part of sp98[6]? */
    /* 0xB0 */ ? spB0;                              /* inferred */
    /* 0xB0 */ char pad_B0[0xC];
    /* 0xBC */ f32 spBC;                            /* inferred */
    /* 0xC0 */ f32 spC0;                            /* inferred */
    /* 0xC4 */ f32 spC4;                            /* inferred */
    /* 0xC8 */ f32 spC8;                            /* inferred */
    /* 0xCC */ f32 spCC;                            /* inferred */
    /* 0xD0 */ f32 spD0;                            /* inferred */
    /* 0xD4 */ char pad_D4[0x4];
    /* 0xD8 */ s32 spD8;                            /* inferred */
    /* 0xDC */ char pad_DC[0x4];
    /* 0xE0 */ void *spE0;                          /* inferred */
    /* 0xE4 */ char pad_E4[0x4];
};                                                  /* size = 0xE8 */

struct _mips2c_stack_func_80A1E2D8 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ f32 sp1C;                            /* inferred */
    /* 0x20 */ char pad_20[0x4];
    /* 0x24 */ f32 sp24;                            /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80A1E334 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80A1E394 {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80A1E3D8 {
    /* 0x00 */ char pad_0[0x7C];
    /* 0x7C */ f32 *sp7C;                           /* inferred */
    /* 0x80 */ char pad_80[0x4];
    /* 0x84 */ s32 sp84;                            /* inferred */
    /* 0x88 */ char pad_88[0xC];                    /* maybe part of sp84[4]? */
    /* 0x94 */ f32 sp94;                            /* inferred */
    /* 0x98 */ f32 sp98;                            /* inferred */
    /* 0x9C */ f32 sp9C;                            /* inferred */
    /* 0xA0 */ f32 spA0;                            /* inferred */
    /* 0xA4 */ f32 spA4;                            /* inferred */
    /* 0xA8 */ f32 spA8;                            /* inferred */
    /* 0xAC */ f32 spAC;                            /* inferred */
    /* 0xB0 */ f32 spB0;                            /* inferred */
    /* 0xB4 */ f32 spB4;                            /* inferred */
    /* 0xB8 */ char pad_B8[0x4];
    /* 0xBC */ s32 spBC;                            /* inferred */
    /* 0xC0 */ void (*spC0)(CollisionContext *, f32 *, CollisionPoly **, s32 *, f32 *, Actor *); /* inferred */
    /* 0xC4 */ char pad_C4[0x4];
    /* 0xC8 */ void *spC8;                          /* inferred */
    /* 0xCC */ char pad_CC[0x4];
};                                                  /* size = 0xD0 */

struct _mips2c_stack_func_80A1E648 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ f32 sp1C;                            /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80A1E694 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A1E6D4 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A1E9C4 {};              /* size 0x0 */

struct _mips2c_stack_func_80A1E9E0 {};              /* size 0x0 */

struct _mips2c_stack_func_80A1EA10 {};              /* size 0x0 */

struct _mips2c_stack_func_80A1EA4C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A1EAAC {};              /* size 0x0 */

struct _mips2c_stack_func_80A1EAE0 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A1EB40 {};              /* size 0x0 */

struct _mips2c_stack_func_80A1EB54 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ s32 sp24;                            /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80A1EC24 {};              /* size 0x0 */

struct _mips2c_stack_func_80A1EC38 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ s32 sp24;                            /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80A1ECC0 {};              /* size 0x0 */

struct _mips2c_stack_func_80A1ECD4 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ s32 sp24;                            /* inferred */
};                                                  /* size = 0x28 */

? func_800C4F84(CollisionPoly **, ?, CollisionContext *, f32 *, s32 *); /* extern */
s32 func_800C56E0(s32, f32 *, f32 *, ? *, void *, s32, s32, s32, s32, void *, Actor *, f32); /* extern */
void func_80A1DA50(GlobalContext *arg0, Actor *arg1, Vec3f *arg2, Vec3f *arg3); /* static */
void func_80A1DAAC(Vec3f *arg0, f32 *arg1, s16 arg2); /* static */
void func_80A1DB2C(ObjSpinyroll *arg0);             /* static */
void func_80A1DC5C(ObjSpinyroll *arg0);             /* static */
void func_80A1DCCC(ObjSpinyroll *arg0);             /* static */
void func_80A1DD18(ObjSpinyroll *arg0);             /* static */
void func_80A1DE10(void *arg0);                     /* static */
void func_80A1DE58(ObjSpinyroll *arg0);             /* static */
void func_80A1DE84(ObjSpinyroll *arg0);             /* static */
