typedef struct Boss07 {
    /* 0x0000 */ Actor actor;
    /* 0x0144 */ void (*actionFunc)(Boss07 *, GlobalContext *);
    /* 0x0148 */ u8 unk_148;                        /* inferred */
    /* 0x0149 */ u8 unk_149;                        /* inferred */
    /* 0x014A */ s8 unk_14A;                        /* inferred */
    /* 0x014B */ char pad_14B[0x1];
    /* 0x014C */ s16 unk_14C;                       /* inferred */
    /* 0x014E */ u8 unk_14E;                        /* inferred */
    /* 0x014F */ u8 unk_14F;                        /* inferred */
    /* 0x0150 */ s16 unk_150;                       /* inferred */
    /* 0x0152 */ s16 unk_152;                       /* inferred */
    /* 0x0154 */ s16 unk_154;                       /* inferred */
    /* 0x0156 */ s16 unk_156;                       /* inferred */
    /* 0x0158 */ s16 unk_158;                       /* inferred */
    /* 0x015A */ s16 unk_15A;                       /* inferred */
    /* 0x015C */ s16 unk_15C;                       /* inferred */
    /* 0x015E */ s16 unk_15E;                       /* inferred */
    /* 0x0160 */ s16 unk_160;                       /* inferred */
    /* 0x0162 */ char pad_162[0x2];
    /* 0x0164 */ f32 unk_164;                       /* inferred */
    /* 0x0168 */ f32 unk_168;                       /* inferred */
    /* 0x016C */ f32 unk_16C;                       /* inferred */
    /* 0x0170 */ f32 unk_170;                       /* inferred */
    /* 0x0174 */ u8 unk_174;                        /* inferred */
    /* 0x0175 */ char pad_175[0x7];                 /* maybe part of unk_174[8]? */
    /* 0x017C */ f32 unk_17C;                       /* inferred */
    /* 0x0180 */ s16 unk_180;                       /* inferred */
    /* 0x0182 */ char pad_182[0x2];
    /* 0x0184 */ f32 unk_184;                       /* inferred */
    /* 0x0188 */ f32 unk_188;                       /* inferred */
    /* 0x018C */ f32 unk_18C;                       /* inferred */
    /* 0x0190 */ SkelAnime unk_190;                 /* inferred */
    /* 0x01D4 */ f32 unk_1D4;                       /* inferred */
    /* 0x01D8 */ s32 unk_1D8;                       /* inferred */
    /* 0x01DC */ Vec3s unk_1DC;                     /* inferred */
    /* 0x01E2 */ char pad_1E2[0xA2];                /* maybe part of unk_1DC[28]? */
    /* 0x0284 */ Vec3s unk_284;                     /* inferred */
    /* 0x028A */ char pad_28A[0xA2];                /* maybe part of unk_284[28]? */
    /* 0x032C */ f32 unk_32C;                       /* inferred */
    /* 0x0330 */ f32 unk_330;                       /* inferred */
    /* 0x0334 */ Vec3f unk_334;                     /* inferred */
    /* 0x0340 */ char pad_340[0xC];
    /* 0x034C */ f32 unk_34C;                       /* inferred */
    /* 0x0350 */ f32 unk_350;                       /* inferred */
    /* 0x0354 */ f32 unk_354;                       /* inferred */
    /* 0x0358 */ char pad_358[0x90];                /* maybe part of unk_354[37]? */
    /* 0x03E8 */ ColliderJntSph unk_3E8;            /* inferred */
    /* 0x0408 */ ColliderJntSphElement unk_408;     /* inferred */
    /* 0x0448 */ char pad_448[0x280];               /* maybe part of unk_408[11]? */
    /* 0x06C8 */ ColliderJntSph unk_6C8;            /* inferred */
    /* 0x06E8 */ ColliderJntSphElement unk_6E8;     /* inferred */
    /* 0x0728 */ ColliderCylinder unk_728;          /* inferred */
    /* 0x0774 */ u8 unk_774;                        /* inferred */
    /* 0x0775 */ char pad_775[0x3];                 /* maybe part of unk_774[4]? */
    /* 0x0778 */ s32 unk_778;                       /* inferred */
    /* 0x077C */ f32 unk_77C;                       /* inferred */
    /* 0x0780 */ s32 unk_780;                       /* inferred */
    /* 0x0784 */ s32 unk_784;                       /* inferred */
    /* 0x0788 */ ? unk_788;                         /* inferred */
    /* 0x0788 */ char pad_788[0x8];
    /* 0x0790 */ f32 unk_790;                       /* inferred */
    /* 0x0794 */ f32 unk_794;                       /* inferred */
    /* 0x0798 */ GlobalContext *unk_798;            /* inferred */
    /* 0x079C */ Boss07 *unk_79C;                   /* inferred */
    /* 0x07A0 */ ? unk_7A0;                         /* inferred */
    /* 0x07A0 */ char pad_7A0[0xC];
    /* 0x07AC */ ? unk_7AC;                         /* inferred */
    /* 0x07AC */ char pad_7AC[0x258];
    /* 0x0A04 */ ? unk_A04;                         /* inferred */
    /* 0x0A04 */ char pad_A04[0x258];
    /* 0x0C5C */ f32 unk_C5C;                       /* inferred */
    /* 0x0C60 */ char pad_C60[0x31C];               /* maybe part of unk_C5C[200]? */
    /* 0x0F7C */ s16 unk_F7C;                       /* inferred */
    /* 0x0F7E */ s16 unk_F7E;                       /* inferred */
    /* 0x0F80 */ f32 unk_F80;                       /* inferred */
    /* 0x0F84 */ f32 unk_F84;                       /* inferred */
    /* 0x0F88 */ f32 unk_F88;                       /* inferred */
    /* 0x0F8C */ char pad_F8C[0x8];                 /* maybe part of unk_F88[3]? */
    /* 0x0F94 */ ? unk_F94;                         /* inferred */
    /* 0x0F94 */ char pad_F94[0x8];
    /* 0x0F9C */ f32 unk_F9C;                       /* inferred */
    /* 0x0FA0 */ f32 unk_FA0;                       /* inferred */
    /* 0x0FA4 */ GlobalContext *unk_FA4;            /* inferred */
    /* 0x0FA8 */ Boss07 *unk_FA8;                   /* inferred */
    /* 0x0FAC */ ? unk_FAC;                         /* inferred */
    /* 0x0FAC */ char pad_FAC[0xC];
    /* 0x0FB8 */ ? unk_FB8;                         /* inferred */
    /* 0x0FB8 */ char pad_FB8[0x258];
    /* 0x1210 */ ? unk_1210;                        /* inferred */
    /* 0x1210 */ char pad_1210[0x258];
    /* 0x1468 */ f32 unk_1468;                      /* inferred */
    /* 0x146C */ char pad_146C[0x334];              /* maybe part of unk_1468[206]? */
    /* 0x17A0 */ f32 unk_17A0;                      /* inferred */
    /* 0x17A4 */ f32 unk_17A4;                      /* inferred */
    /* 0x17A8 */ f32 unk_17A8;                      /* inferred */
    /* 0x17AC */ f32 unk_17AC;                      /* inferred */
    /* 0x17B0 */ f32 unk_17B0;                      /* inferred */
    /* 0x17B4 */ f32 unk_17B4;                      /* inferred */
    /* 0x17B8 */ f32 unk_17B8;                      /* inferred */
    /* 0x17BC */ f32 unk_17BC;                      /* inferred */
    /* 0x17C0 */ f32 unk_17C0;                      /* inferred */
    /* 0x17C4 */ f32 unk_17C4;                      /* inferred */
    /* 0x17C8 */ f32 unk_17C8;                      /* inferred */
    /* 0x17CC */ f32 unk_17CC;                      /* inferred */
    /* 0x17D0 */ f32 unk_17D0;                      /* inferred */
    /* 0x17D4 */ f32 unk_17D4;                      /* inferred */
    /* 0x17D8 */ s16 unk_17D8;                      /* inferred */
    /* 0x17DA */ s16 unk_17DA;                      /* inferred */
    /* 0x17DC */ s16 unk_17DC;                      /* inferred */
    /* 0x17DE */ char pad_17DE[0x2];
    /* 0x17E0 */ f32 unk_17E0;                      /* inferred */
    /* 0x17E4 */ f32 unk_17E4;                      /* inferred */
    /* 0x17E8 */ f32 unk_17E8;                      /* inferred */
    /* 0x17EC */ f32 unk_17EC;                      /* inferred */
    /* 0x17F0 */ f32 unk_17F0;                      /* inferred */
    /* 0x17F4 */ f32 unk_17F4;                      /* inferred */
    /* 0x17F8 */ f32 unk_17F8;                      /* inferred */
    /* 0x17FC */ f32 unk_17FC;                      /* inferred */
    /* 0x1800 */ f32 unk_1800;                      /* inferred */
    /* 0x1804 */ u8 unk_1804;                       /* inferred */
    /* 0x1805 */ char pad_1805[0x3];                /* maybe part of unk_1804[4]? */
    /* 0x1808 */ s8 unk_1808;                       /* inferred */
    /* 0x1809 */ char pad_1809[0x3];                /* maybe part of unk_1808[4]? */
    /* 0x180C */ f32 unk_180C;                      /* inferred */
    /* 0x1810 */ f32 unk_1810;                      /* inferred */
    /* 0x1814 */ f32 unk_1814;                      /* inferred */
    /* 0x1818 */ f32 unk_1818;                      /* inferred */
    /* 0x181C */ s16 unk_181C;                      /* inferred */
    /* 0x181E */ char pad_181E[0x2];
    /* 0x1820 */ ColliderCylinder unk_1820;         /* inferred */
    /* 0x186C */ char pad_186C[0x4];
    /* 0x1870 */ f32 unk_1870;                      /* inferred */
    /* 0x1874 */ s8 unk_1874;                       /* inferred */
    /* 0x1875 */ char pad_1875[0xF];                /* maybe part of unk_1874[16]? */
    /* 0x1884 */ s32 unk_1884;                      /* inferred */
    /* 0x1888 */ u8 unk_1888;                       /* inferred */
    /* 0x1889 */ char pad_1889[0x3];                /* maybe part of unk_1888[4]? */
    /* 0x188C */ f32 unk_188C;                      /* inferred */
    /* 0x1890 */ f32 unk_1890;                      /* inferred */
    /* 0x1894 */ f32 unk_1894;                      /* inferred */
    /* 0x1898 */ f32 unk_1898;                      /* inferred */
    /* 0x189C */ f32 unk_189C;                      /* inferred */
    /* 0x18A0 */ f32 unk_18A0;                      /* inferred */
    /* 0x18A4 */ f32 unk_18A4;                      /* inferred */
    /* 0x18A8 */ Vec3f unk_18A8;                    /* inferred */
    /* 0x18B4 */ Vec3f unk_18B4;                    /* inferred */
    /* 0x18C0 */ f32 unk_18C0;                      /* inferred */
    /* 0x18C4 */ s16 unk_18C4;                      /* inferred */
    /* 0x18C6 */ s16 unk_18C6;                      /* inferred */
    /* 0x18C8 */ s16 unk_18C8;                      /* inferred */
    /* 0x18CA */ char pad_18CA[0x2];
    /* 0x18CC */ f32 unk_18CC;                      /* inferred */
    /* 0x18D0 */ f32 unk_18D0;                      /* inferred */
    /* 0x18D4 */ s16 unk_18D4;                      /* inferred */
    /* 0x18D6 */ s16 unk_18D6;                      /* inferred */
    /* 0x18D8 */ s16 unk_18D8;                      /* inferred */
    /* 0x18DA */ u8 unk_18DA;                       /* inferred */
    /* 0x18DB */ u8 unk_18DB;                       /* inferred */
    /* 0x18DC */ s32 unk_18DC;                      /* inferred */
    /* 0x18E0 */ f32 unk_18E0;                      /* inferred */
    /* 0x18E4 */ s32 unk_18E4;                      /* inferred */
    /* 0x18E8 */ f32 unk_18E8;                      /* inferred */
    /* 0x18EC */ s8 unk_18EC;                       /* inferred */
    /* 0x18ED */ char pad_18ED[0x3];                /* maybe part of unk_18EC[4]? */
    /* 0x18F0 */ ColliderQuad unk_18F0;             /* inferred */
    /* 0x1970 */ ColliderQuad unk_1970;             /* inferred */
    /* 0x19F0 */ char pad_19F0[0x9150];             /* maybe part of unk_1970[291]? */
    /* 0xAB40 */ s16 unk_AB40;                      /* inferred */
    /* 0xAB42 */ char pad_AB42[0x2];
    /* 0xAB44 */ f32 unk_AB44;                      /* inferred */
    /* 0xAB48 */ u8 unk_AB48;                       /* inferred */
    /* 0xAB49 */ char pad_AB49[0x3];                /* maybe part of unk_AB48[4]? */
    /* 0xAB4C */ f32 unk_AB4C;                      /* inferred */
    /* 0xAB50 */ f32 unk_AB50;                      /* inferred */
    /* 0xAB54 */ char pad_AB54[0x74];               /* maybe part of unk_AB50[30]? */
    /* 0xABC8 */ u32 unk_ABC8;                      /* inferred */
    /* 0xABCC */ s32 unk_ABCC;                      /* inferred */
    /* 0xABD0 */ s16 unk_ABD0;                      /* inferred */
    /* 0xABD2 */ s16 unk_ABD2;                      /* inferred */
    /* 0xABD4 */ Vec3f unk_ABD4;                    /* inferred */
    /* 0xABE0 */ Vec3f unk_ABE0;                    /* inferred */
    /* 0xABEC */ f32 unk_ABEC;                      /* inferred */
    /* 0xABF0 */ f32 unk_ABF0;                      /* inferred */
    /* 0xABF4 */ f32 unk_ABF4;                      /* inferred */
    /* 0xABF8 */ f32 unk_ABF8;                      /* inferred */
    /* 0xABFC */ f32 unk_ABFC;                      /* inferred */
    /* 0xAC00 */ f32 unk_AC00;                      /* inferred */
    /* 0xAC04 */ f32 unk_AC04;                      /* inferred */
    /* 0xAC08 */ f32 unk_AC08;                      /* inferred */
    /* 0xAC0C */ f32 unk_AC0C;                      /* inferred */
    /* 0xAC10 */ char pad_AC10[0x4];
    /* 0xAC14 */ f32 unk_AC14;                      /* inferred */
    /* 0xAC18 */ char pad_AC18[0x8];                /* maybe part of unk_AC14[3]? */
} Boss07;                                           /* size = 0xAC20 */

struct _mips2c_stack_Boss07_Destroy {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_Boss07_Draw {
    /* 0x00 */ char pad_0[0x4C];
    /* 0x4C */ ? *sp4C;                             /* inferred */
    /* 0x50 */ ? *sp50;                             /* inferred */
    /* 0x54 */ Gfx *sp54;                           /* inferred */
    /* 0x58 */ f32 sp58;                            /* inferred */
    /* 0x5C */ f32 sp5C;                            /* inferred */
    /* 0x60 */ f32 sp60;                            /* inferred */
    /* 0x64 */ char pad_64[0x4];
    /* 0x68 */ GraphicsContext *sp68;               /* inferred */
    /* 0x6C */ char pad_6C[0xC];
};                                                  /* size = 0x78 */

struct _mips2c_stack_Boss07_Init {
    /* 0x00 */ char pad_0[0x44];
    /* 0x44 */ ActorContext *sp44;                  /* inferred */
    /* 0x48 */ s16 *sp48;                           /* inferred */
    /* 0x4C */ char pad_4C[0xC];
};                                                  /* size = 0x58 */

struct _mips2c_stack_Boss07_Update {
    /* 0x00 */ char pad_0[0x28];
    /* 0x28 */ CollisionCheckContext *sp28;         /* inferred */
    /* 0x2C */ void (*sp2C)(Boss07 *, GlobalContext *); /* inferred */
    /* 0x30 */ char pad_30[0x14];                   /* maybe part of sp2C[6]? */
    /* 0x44 */ s32 sp44;                            /* inferred */
    /* 0x48 */ s32 sp48;                            /* inferred */
    /* 0x4C */ s32 sp4C;                            /* inferred */
    /* 0x50 */ char pad_50[0x4];
    /* 0x54 */ s32 sp54;                            /* inferred */
    /* 0x58 */ s32 sp58;                            /* inferred */
    /* 0x5C */ s32 sp5C;                            /* inferred */
    /* 0x60 */ s32 sp60;                            /* inferred */
    /* 0x64 */ s32 sp64;                            /* inferred */
    /* 0x68 */ s32 sp68;                            /* inferred */
    /* 0x6C */ s32 sp6C;                            /* inferred */
    /* 0x70 */ s32 sp70;                            /* inferred */
    /* 0x74 */ s32 sp74;                            /* inferred */
    /* 0x78 */ Actor *sp78;                         /* inferred */
    /* 0x7C */ char pad_7C[0x4];
    /* 0x80 */ Boss07 *sp80;                        /* inferred */
    /* 0x84 */ char pad_84[0x4];
};                                                  /* size = 0x88 */

struct _mips2c_stack_func_809F4980 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809F49A0 {};              /* size 0x0 */

struct _mips2c_stack_func_809F49C0 {};              /* size 0x0 */

struct _mips2c_stack_func_809F4AE8 {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ void *sp18;                          /* inferred */
    /* 0x1C */ char pad_1C[0x4];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_809F4BB0 {};              /* size 0x0 */

struct _mips2c_stack_func_809F4C40 {};              /* size 0x0 */

struct _mips2c_stack_func_809F4CBC {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809F4D10 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809F4D54 {
    /* 0x00 */ char pad_0[0x98];
    /* 0x98 */ f32 sp98;                            /* inferred */
    /* 0x9C */ f32 sp9C;                            /* inferred */
    /* 0xA0 */ f32 spA0;                            /* inferred */
    /* 0xA4 */ f32 spA4;                            /* inferred */
    /* 0xA8 */ f32 spA8;                            /* inferred */
    /* 0xAC */ f32 spAC;                            /* inferred */
    /* 0xB0 */ f32 spB0;                            /* inferred */
    /* 0xB4 */ f32 spB4;                            /* inferred */
    /* 0xB8 */ f32 spB8;                            /* inferred */
    /* 0xBC */ char pad_BC[0x4];
};                                                  /* size = 0xC0 */

struct _mips2c_stack_func_809F4FAC {};              /* size 0x0 */

struct _mips2c_stack_func_809F4FF8 {
    /* 0x00 */ char pad_0[0x98];
    /* 0x98 */ f32 sp98;                            /* inferred */
    /* 0x9C */ f32 sp9C;                            /* inferred */
    /* 0xA0 */ f32 spA0;                            /* inferred */
    /* 0xA4 */ f32 spA4;                            /* inferred */
    /* 0xA8 */ f32 spA8;                            /* inferred */
    /* 0xAC */ f32 spAC;                            /* inferred */
    /* 0xB0 */ f32 spB0;                            /* inferred */
    /* 0xB4 */ f32 spB4;                            /* inferred */
    /* 0xB8 */ f32 spB8;                            /* inferred */
    /* 0xBC */ char pad_BC[0x4];
};                                                  /* size = 0xC0 */

struct _mips2c_stack_func_809F51E8 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ void *sp24;                          /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_809F52CC {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_809F536C {
    /* 0x00 */ char pad_0[0x50];
    /* 0x50 */ f32 sp50;                            /* inferred */
    /* 0x54 */ f32 sp54;                            /* inferred */
    /* 0x58 */ f32 sp58;                            /* inferred */
    /* 0x5C */ char pad_5C[0x14];
};                                                  /* size = 0x70 */

struct _mips2c_stack_func_809F5494 {
    /* 0x00 */ char pad_0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_809F5E14 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809F5E88 {
    /* 0x00 */ char pad_0[0x38];
    /* 0x38 */ Vec3f *sp38;                         /* inferred */
    /* 0x3C */ char pad_3C[0x4];
    /* 0x40 */ SkelAnime *sp40;                     /* inferred */
    /* 0x44 */ char pad_44[0x4];
    /* 0x48 */ Camera *sp48;                        /* inferred */
    /* 0x4C */ char pad_4C[0xC];
};                                                  /* size = 0x58 */

struct _mips2c_stack_func_809F64F4 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_809F65F4 {
    /* 0x00 */ char pad_0[0x44];
    /* 0x44 */ f32 *sp44;                           /* inferred */
    /* 0x48 */ void *sp48;                          /* inferred */
    /* 0x4C */ char pad_4C[0x10];                   /* maybe part of sp48[5]? */
    /* 0x5C */ f32 sp5C;                            /* inferred */
    /* 0x60 */ f32 sp60;                            /* inferred */
    /* 0x64 */ f32 sp64;                            /* inferred */
    /* 0x68 */ f32 sp68;                            /* inferred */
    /* 0x6C */ f32 sp6C;                            /* inferred */
    /* 0x70 */ f32 sp70;                            /* inferred */
    /* 0x74 */ f32 sp74;                            /* inferred */
    /* 0x78 */ ? sp78;                              /* inferred */
    /* 0x78 */ char pad_78[0xC];
    /* 0x84 */ ? sp84;                              /* inferred */
    /* 0x84 */ char pad_84[0x10];
    /* 0x94 */ f32 sp94;                            /* inferred */
    /* 0x98 */ f32 sp98;                            /* inferred */
    /* 0x9C */ char pad_9C[0x4];
    /* 0xA0 */ f32 spA0;                            /* inferred */
    /* 0xA4 */ f32 spA4;                            /* inferred */
    /* 0xA8 */ f32 spA8;                            /* inferred */
    /* 0xAC */ f32 spAC;                            /* inferred */
    /* 0xB0 */ f32 spB0;                            /* inferred */
    /* 0xB4 */ f32 spB4;                            /* inferred */
    /* 0xB8 */ f32 spB8;                            /* inferred */
    /* 0xBC */ f32 spBC;                            /* inferred */
    /* 0xC0 */ s32 spC0;                            /* inferred */
    /* 0xC4 */ char pad_C4[0x4];
};                                                  /* size = 0xC8 */

struct _mips2c_stack_func_809F7400 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809F748C {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ Actor *sp24;                         /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_809F7688 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809F76D0 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809F77A8 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_809F783C {
    /* 0x00 */ char pad_0[0x30];
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ char pad_34[0x4];
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ char pad_3C[0xC];
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_809F7968 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_809F7AB4 {
    /* 0x00 */ char pad_0[0x22];
    /* 0x22 */ s16 sp22;                            /* inferred */
    /* 0x24 */ char pad_24[0xC];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_809F7BC4 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_809F7D2C {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_809F805C {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ SkelAnime *sp24;                     /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_809F8658 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809F86B8 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_809F87C8 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ SkelAnime *sp24;                     /* inferred */
    /* 0x28 */ Actor *sp28;                         /* inferred */
    /* 0x2C */ u32 sp2C;                            /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_809F8908 {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ SkelAnime *sp2C;                     /* inferred */
    /* 0x30 */ u32 sp30;                            /* inferred */
    /* 0x34 */ char pad_34[0x8];                    /* maybe part of sp30[3]? */
    /* 0x3C */ Actor *sp3C;                         /* inferred */
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_809F8AB0 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809F8B1C {
    /* 0x00 */ char pad_0[0x3C];
    /* 0x3C */ SkelAnime *sp3C;                     /* inferred */
    /* 0x40 */ char pad_40[0x8];
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_809F8D04 {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ SkelAnime *sp20;                     /* inferred */
    /* 0x24 */ char pad_24[0x4];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_809F8DEC {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809F8E68 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809F8EC8 {
    /* 0x00 */ char pad_0[0x38];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_809F91D4 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ SkelAnime *sp24;                     /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_809F9280 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ void (*sp24)(Actor *, GlobalContext *); /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_809F93DC {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ SkelAnime *sp24;                     /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_809F94AC {
    /* 0x00 */ char pad_0[0x68];
    /* 0x68 */ f32 sp68;                            /* inferred */
    /* 0x6C */ char pad_6C[0x10];                   /* maybe part of sp68[5]? */
    /* 0x7C */ f32 sp7C;                            /* inferred */
    /* 0x80 */ f32 sp80;                            /* inferred */
    /* 0x84 */ f32 sp84;                            /* inferred */
    /* 0x88 */ char pad_88[0x10];                   /* maybe part of sp84[5]? */
    /* 0x98 */ u32 sp98;                            /* inferred */
    /* 0x9C */ char pad_9C[0x4];
};                                                  /* size = 0xA0 */

struct _mips2c_stack_func_809F99C4 {
    /* 0x00 */ char pad_0[0x38];
    /* 0x38 */ void *sp38;                          /* inferred */
    /* 0x3C */ char pad_3C[0xC];
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_809F9CEC {
    /* 0x00 */ char pad_0[0x80];
    /* 0x80 */ f32 sp80;                            /* inferred */
    /* 0x84 */ f32 sp84;                            /* inferred */
    /* 0x88 */ f32 sp88;                            /* inferred */
    /* 0x8C */ f32 sp8C;                            /* inferred */
    /* 0x90 */ f32 sp90;                            /* inferred */
    /* 0x94 */ f32 sp94;                            /* inferred */
};                                                  /* size = 0x98 */

struct _mips2c_stack_func_809F9E94 {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_809FAA44 {
    /* 0x00 */ char pad_0[0x7C];
    /* 0x7C */ f32 sp7C;                            /* inferred */
    /* 0x80 */ f32 sp80;                            /* inferred */
    /* 0x84 */ f32 sp84;                            /* inferred */
    /* 0x88 */ f32 sp88;                            /* inferred */
    /* 0x8C */ f32 sp8C;                            /* inferred */
    /* 0x90 */ f32 sp90;                            /* inferred */
    /* 0x94 */ f32 sp94;                            /* inferred */
    /* 0x98 */ f32 sp98;                            /* inferred */
    /* 0x9C */ f32 sp9C;                            /* inferred */
    /* 0xA0 */ f32 spA0;                            /* inferred */
    /* 0xA4 */ f32 spA4;                            /* inferred */
    /* 0xA8 */ f32 spA8;                            /* inferred */
    /* 0xAC */ f32 spAC;                            /* inferred */
    /* 0xB0 */ f32 spB0;                            /* inferred */
    /* 0xB4 */ f32 spB4;                            /* inferred */
    /* 0xB8 */ ? spB8;                              /* inferred */
    /* 0xB8 */ char pad_B8[0x8];
    /* 0xC0 */ f32 spC0;                            /* inferred */
    /* 0xC4 */ char pad_C4[0x24];
};                                                  /* size = 0xE8 */

struct _mips2c_stack_func_809FB114 {
    /* 0x00 */ char pad_0[0x74];
    /* 0x74 */ ? *sp74;                             /* inferred */
    /* 0x78 */ ? *sp78;                             /* inferred */
    /* 0x7C */ char pad_7C[0x14];
};                                                  /* size = 0x90 */

struct _mips2c_stack_func_809FB504 {};              /* size 0x0 */

struct _mips2c_stack_func_809FB55C {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ s8 *sp18;                            /* inferred */
    /* 0x1C */ ? sp1C;                              /* inferred */
    /* 0x1C */ char pad_1C[0x40];
    /* 0x5C */ ? sp5C;                              /* inferred */
    /* 0x5C */ char pad_5C[0xF];
    /* 0x6B */ s8 sp6B;                             /* inferred */
    /* 0x6C */ char pad_6C[0x4];
};                                                  /* size = 0x70 */

struct _mips2c_stack_func_809FB728 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809FB7D4 {
    /* 0x00 */ char pad_0[0x60];
};                                                  /* size = 0x60 */

struct _mips2c_stack_func_809FBB9C {
    /* 0x00 */ char pad_0[0x58];
    /* 0x58 */ void *sp58;                          /* inferred */
    /* 0x5C */ char pad_5C[0x44];
};                                                  /* size = 0xA0 */

struct _mips2c_stack_func_809FBF94 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ void *sp24;                          /* inferred */
    /* 0x28 */ char pad_28[0xC];                    /* maybe part of sp24[4]? */
    /* 0x34 */ Gfx *sp34;                           /* inferred */
    /* 0x38 */ char pad_38[0x14];                   /* maybe part of sp34[6]? */
    /* 0x4C */ Player *sp4C;                        /* inferred */
    /* 0x50 */ f32 sp50;                            /* inferred */
    /* 0x54 */ f32 sp54;                            /* inferred */
    /* 0x58 */ char pad_58[0x8];
};                                                  /* size = 0x60 */

struct _mips2c_stack_func_809FC4C0 {
    /* 0x00 */ char pad_0[0x60];
    /* 0x60 */ u8 *sp60;                            /* inferred */
    /* 0x64 */ char pad_64[0x4];
    /* 0x68 */ f32 sp68;                            /* inferred */
    /* 0x6C */ f32 sp6C;                            /* inferred */
    /* 0x70 */ char pad_70[0x4];
    /* 0x74 */ f32 sp74;                            /* inferred */
    /* 0x78 */ f32 sp78;                            /* inferred */
    /* 0x7C */ f32 sp7C;                            /* inferred */
    /* 0x80 */ char pad_80[0x10];                   /* maybe part of sp7C[5]? */
    /* 0x90 */ s32 sp90;                            /* inferred */
    /* 0x94 */ char pad_94[0x14];
};                                                  /* size = 0xA8 */

struct _mips2c_stack_func_809FC8B0 {
    /* 0x00 */ char pad_0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_809FC960 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ Gfx *sp1C;                           /* inferred */
    /* 0x20 */ char pad_20[0x10];                   /* maybe part of sp1C[5]? */
    /* 0x30 */ GraphicsContext *sp30;               /* inferred */
    /* 0x34 */ char pad_34[0xC];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_809FCBC8 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_809FCC70 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809FCCCC {
    /* 0x00 */ char pad_0[0x34];
    /* 0x34 */ f32 *sp34;                           /* inferred */
    /* 0x38 */ Vec3f *sp38;                         /* inferred */
    /* 0x3C */ Vec3f *sp3C;                         /* inferred */
    /* 0x40 */ s32 sp40;                            /* inferred */
    /* 0x44 */ f32 *sp44;                           /* inferred */
    /* 0x48 */ char pad_48[0x4];
    /* 0x4C */ SkelAnime *sp4C;                     /* inferred */
    /* 0x50 */ char pad_50[0x4];
    /* 0x54 */ Camera *sp54;                        /* inferred */
    /* 0x58 */ f32 sp58;                            /* inferred */
    /* 0x5C */ char pad_5C[0x4];
};                                                  /* size = 0x60 */

struct _mips2c_stack_func_809FD5F8 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_809FD710 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ Actor *sp24;                         /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_809FD818 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809FD89C {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ SkelAnime *sp24;                     /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_809FD984 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_809FDAB0 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ SkelAnime *sp24;                     /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_809FDB2C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809FDBA0 {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ u32 sp2C;                            /* inferred */
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ f32 sp34;                            /* inferred */
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_809FDEDC {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809FDF54 {
    /* 0x00 */ char pad_0[0x3C];
    /* 0x3C */ SkelAnime *sp3C;                     /* inferred */
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_809FE068 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809FE0E4 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ SkelAnime *sp24;                     /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_809FE2D4 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809FE348 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_809FE4B0 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809FE524 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_809FE6B0 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_809FE734 {
    /* 0x00 */ char pad_0[0x3C];
    /* 0x3C */ Vec3f *sp3C;                         /* inferred */
    /* 0x40 */ SkelAnime *sp40;                     /* inferred */
    /* 0x44 */ char pad_44[0x7];                    /* maybe part of sp40[2]? */
    /* 0x4B */ u8 sp4B;                             /* inferred */
    /* 0x4C */ Actor *sp4C;                         /* inferred */
};                                                  /* size = 0x50 */

struct _mips2c_stack_func_809FEE70 {
    /* 0x00 */ char pad_0[0x38];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_809FF0E4 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809FF12C {
    /* 0x00 */ char pad_0[0x44];
    /* 0x44 */ Collider *sp44;                      /* inferred */
    /* 0x48 */ CollisionCheckContext *sp48;         /* inferred */
    /* 0x4C */ char pad_4C[0x14];
};                                                  /* size = 0x60 */

struct _mips2c_stack_func_809FF5CC {
    /* 0x00 */ char pad_0[0x34];
    /* 0x34 */ Actor *sp34;                         /* inferred */
    /* 0x38 */ char pad_38[0x8];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_809FF678 {};              /* size 0x0 */

struct _mips2c_stack_func_809FF6B0 {
    /* 0x00 */ char pad_0[0x28];
    /* 0x28 */ ? sp28;                              /* inferred */
    /* 0x28 */ char pad_28[0x10];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_809FF810 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809FF900 {
    /* 0x00 */ char pad_0[0x38];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_809FFA04 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809FFA80 {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ Actor *sp20;                         /* inferred */
    /* 0x24 */ char pad_24[0x4];
    /* 0x28 */ f32 sp28;                            /* inferred */
    /* 0x2C */ f32 sp2C;                            /* inferred */
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ s16 sp34;                            /* inferred */
    /* 0x36 */ s16 sp36;                            /* inferred */
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_809FFE64 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809FFEAC {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ Actor *sp20;                         /* inferred */
    /* 0x24 */ f32 sp24;                            /* inferred */
    /* 0x28 */ f32 sp28;                            /* inferred */
    /* 0x2C */ f32 sp2C;                            /* inferred */
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ s16 sp34;                            /* inferred */
    /* 0x36 */ s16 sp36;                            /* inferred */
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80A0021C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A00274 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80A00484 {};              /* size 0x0 */

struct _mips2c_stack_func_80A00554 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80A006D0 {};              /* size 0x0 */

struct _mips2c_stack_func_80A006F4 {};              /* size 0x0 */

struct _mips2c_stack_func_80A00720 {
    /* 0x000 */ char pad_0[0x88];
    /* 0x088 */ f32 sp88;                           /* inferred */
    /* 0x08C */ Vec3f *sp8C;                        /* inferred */
    /* 0x090 */ CollisionContext *sp90;             /* inferred */
    /* 0x094 */ char pad_94[0x10];                  /* maybe part of sp90[5]? */
    /* 0x0A4 */ f32 spA4;                           /* inferred */
    /* 0x0A8 */ f32 spA8;                           /* inferred */
    /* 0x0AC */ f32 spAC;                           /* inferred */
    /* 0x0B0 */ f32 spB0;                           /* inferred */
    /* 0x0B4 */ f32 spB4;                           /* inferred */
    /* 0x0B8 */ f32 spB8;                           /* inferred */
    /* 0x0BC */ f32 spBC;                           /* inferred */
    /* 0x0C0 */ f32 spC0;                           /* inferred */
    /* 0x0C4 */ f32 spC4;                           /* inferred */
    /* 0x0C8 */ f32 spC8;                           /* inferred */
    /* 0x0CC */ f32 spCC;                           /* inferred */
    /* 0x0D0 */ f32 spD0;                           /* inferred */
    /* 0x0D4 */ f32 spD4;                           /* inferred */
    /* 0x0D8 */ f32 spD8;                           /* inferred */
    /* 0x0DC */ f32 spDC;                           /* inferred */
    /* 0x0E0 */ f32 spE0;                           /* inferred */
    /* 0x0E4 */ f32 spE4;                           /* inferred */
    /* 0x0E8 */ f32 spE8;                           /* inferred */
    /* 0x0EC */ char pad_EC[0x4];
    /* 0x0F0 */ f32 spF0;                           /* inferred */
    /* 0x0F4 */ f32 spF4;                           /* inferred */
    /* 0x0F8 */ f32 spF8;                           /* inferred */
    /* 0x0FC */ f32 spFC;                           /* inferred */
    /* 0x100 */ f32 sp100;                          /* inferred */
    /* 0x104 */ f32 sp104;                          /* inferred */
    /* 0x108 */ f32 sp108;                          /* inferred */
    /* 0x10C */ f32 sp10C;                          /* inferred */
    /* 0x110 */ f32 sp110;                          /* inferred */
    /* 0x114 */ char pad_114[0x4];
    /* 0x118 */ s16 sp118;                          /* inferred */
    /* 0x11A */ s16 sp11A;                          /* inferred */
    /* 0x11C */ char pad_11C[0x4];                  /* maybe part of sp11A[3]? */
    /* 0x120 */ f32 sp120;                          /* inferred */
    /* 0x124 */ f32 sp124;                          /* inferred */
    /* 0x128 */ f32 sp128;                          /* inferred */
    /* 0x12C */ f32 sp12C;                          /* inferred */
    /* 0x130 */ f32 sp130;                          /* inferred */
    /* 0x134 */ f32 sp134;                          /* inferred */
    /* 0x138 */ f32 sp138;                          /* inferred */
    /* 0x13C */ f32 sp13C;                          /* inferred */
    /* 0x140 */ f32 sp140;                          /* inferred */
    /* 0x144 */ u32 sp144;                          /* inferred */
    /* 0x148 */ char pad_148[0x3];
    /* 0x14B */ u8 sp14B;                           /* inferred */
    /* 0x14C */ f32 sp14C;                          /* inferred */
    /* 0x150 */ f32 sp150;                          /* inferred */
    /* 0x154 */ f32 sp154;                          /* inferred */
    /* 0x158 */ CollisionPoly *sp158;               /* inferred */
    /* 0x15C */ char pad_15C[0x4];
    /* 0x160 */ f32 sp160;                          /* inferred */
    /* 0x164 */ f32 sp164;                          /* inferred */
    /* 0x168 */ f32 sp168;                          /* inferred */
    /* 0x16C */ f32 sp16C;                          /* inferred */
    /* 0x170 */ f32 sp170;                          /* inferred */
    /* 0x174 */ f32 sp174;                          /* inferred */
    /* 0x178 */ s16 sp178;                          /* inferred */
    /* 0x17A */ char pad_17A[0x6];                  /* maybe part of sp178[4]? */
    /* 0x180 */ f32 sp180;                          /* inferred */
    /* 0x184 */ char pad_184[0xC];
};                                                  /* size = 0x190 */

struct _mips2c_stack_func_80A016E4 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A01750 {
    /* 0x00 */ char pad_0[0x40];
    /* 0x40 */ Vec3f *sp40;                         /* inferred */
    /* 0x44 */ char pad_44[0xC];                    /* maybe part of sp40[4]? */
    /* 0x50 */ f32 sp50;                            /* inferred */
    /* 0x54 */ f32 sp54;                            /* inferred */
    /* 0x58 */ f32 sp58;                            /* inferred */
    /* 0x5C */ Camera *sp5C;                        /* inferred */
    /* 0x60 */ f32 sp60;                            /* inferred */
    /* 0x64 */ f32 sp64;                            /* inferred */
    /* 0x68 */ f32 sp68;                            /* inferred */
    /* 0x6C */ ? sp6C;                              /* inferred */
    /* 0x6C */ char pad_6C[0xC];
    /* 0x78 */ ? sp78;                              /* inferred */
    /* 0x78 */ char pad_78[0xC];
    /* 0x84 */ s32 sp84;                            /* inferred */
    /* 0x88 */ Actor *sp88;                         /* inferred */
    /* 0x8C */ f32 sp8C;                            /* inferred */
};                                                  /* size = 0x90 */

struct _mips2c_stack_func_80A025AC {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A0264C {
    /* 0x00 */ char pad_0[0x3C];
    /* 0x3C */ Vec3f *sp3C;                         /* inferred */
    /* 0x40 */ f32 *sp40;                           /* inferred */
    /* 0x44 */ Vec3f *sp44;                         /* inferred */
    /* 0x48 */ f32 *sp48;                           /* inferred */
    /* 0x4C */ void *sp4C;                          /* inferred */
    /* 0x50 */ char pad_50[0x4];
    /* 0x54 */ ? sp54;                              /* inferred */
    /* 0x54 */ char pad_54[0x4];
    /* 0x58 */ f32 sp58;                            /* inferred */
    /* 0x5C */ char pad_5C[0x4];
    /* 0x60 */ f32 sp60;                            /* inferred */
    /* 0x64 */ f32 sp64;                            /* inferred */
    /* 0x68 */ f32 sp68;                            /* inferred */
    /* 0x6C */ Actor *sp6C;                         /* inferred */
};                                                  /* size = 0x70 */

struct _mips2c_stack_func_80A02B30 {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ void *sp20;                          /* inferred */
    /* 0x24 */ char pad_24[0x3];
    /* 0x27 */ u8 sp27;                             /* inferred */
    /* 0x28 */ char pad_28[0x8];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80A02C54 {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ ColliderQuad *sp2C;                  /* inferred */
    /* 0x30 */ ColliderQuad *sp30;                  /* inferred */
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ char pad_38[0x8];                    /* maybe part of sp34[3]? */
    /* 0x40 */ f32 sp40;                            /* inferred */
    /* 0x44 */ f32 sp44;                            /* inferred */
    /* 0x48 */ f32 sp48;                            /* inferred */
    /* 0x4C */ f32 sp4C;                            /* inferred */
    /* 0x50 */ f32 sp50;                            /* inferred */
    /* 0x54 */ f32 sp54;                            /* inferred */
    /* 0x58 */ f32 sp58;                            /* inferred */
    /* 0x5C */ f32 sp5C;                            /* inferred */
    /* 0x60 */ f32 sp60;                            /* inferred */
    /* 0x64 */ f32 sp64;                            /* inferred */
    /* 0x68 */ f32 sp68;                            /* inferred */
    /* 0x6C */ f32 sp6C;                            /* inferred */
    /* 0x70 */ f32 sp70;                            /* inferred */
    /* 0x74 */ f32 sp74;                            /* inferred */
    /* 0x78 */ ? sp78;                              /* inferred */
    /* 0x78 */ char pad_78[0xC];
    /* 0x84 */ ? sp84;                              /* inferred */
    /* 0x84 */ char pad_84[0xC];
    /* 0x90 */ ? sp90;                              /* inferred */
    /* 0x90 */ char pad_90[0xC];
    /* 0x9C */ ? sp9C;                              /* inferred */
    /* 0x9C */ char pad_9C[0xC];
    /* 0xA8 */ Actor *spA8;                         /* inferred */
    /* 0xAC */ char pad_AC[0xC];
};                                                  /* size = 0xB8 */

struct _mips2c_stack_func_80A03238 {
    /* 0x00 */ char pad_0[0x7C];
    /* 0x7C */ f32 *sp7C;                           /* inferred */
    /* 0x80 */ f32 sp80;                            /* inferred */
    /* 0x84 */ f32 sp84;                            /* inferred */
    /* 0x88 */ f32 sp88;                            /* inferred */
    /* 0x8C */ f32 sp8C;                            /* inferred */
    /* 0x90 */ f32 sp90;                            /* inferred */
    /* 0x94 */ f32 sp94;                            /* inferred */
    /* 0x98 */ f32 sp98;                            /* inferred */
    /* 0x9C */ f32 sp9C;                            /* inferred */
    /* 0xA0 */ f32 spA0;                            /* inferred */
    /* 0xA4 */ char pad_A4[0x24];
};                                                  /* size = 0xC8 */

struct _mips2c_stack_func_80A036C4 {
    /* 0x00 */ char pad_0[0x68];
};                                                  /* size = 0x68 */

struct _mips2c_stack_func_80A03868 {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ ? *sp2C;                             /* inferred */
    /* 0x30 */ MtxF *sp30;                          /* inferred */
    /* 0x34 */ s32 *sp34;                           /* inferred */
    /* 0x38 */ ? *sp38;                             /* inferred */
    /* 0x3C */ char pad_3C[0x10];                   /* maybe part of sp38[5]? */
    /* 0x4C */ Gfx *sp4C;                           /* inferred */
    /* 0x50 */ f32 sp50;                            /* inferred */
    /* 0x54 */ f32 sp54;                            /* inferred */
    /* 0x58 */ f32 sp58;                            /* inferred */
    /* 0x5C */ char pad_5C[0x4];
    /* 0x60 */ Gfx *sp60;                           /* inferred */
    /* 0x64 */ char pad_64[0x8];                    /* maybe part of sp60[3]? */
    /* 0x6C */ Gfx *sp6C;                           /* inferred */
    /* 0x70 */ char pad_70[0x8];                    /* maybe part of sp6C[3]? */
    /* 0x78 */ Gfx *sp78;                           /* inferred */
    /* 0x7C */ char pad_7C[0x8];                    /* maybe part of sp78[3]? */
    /* 0x84 */ Gfx *sp84;                           /* inferred */
    /* 0x88 */ char pad_88[0x4];
    /* 0x8C */ Gfx *sp8C;                           /* inferred */
    /* 0x90 */ char pad_90[0xC];                    /* maybe part of sp8C[4]? */
    /* 0x9C */ Gfx *sp9C;                           /* inferred */
    /* 0xA0 */ char pad_A0[0x18];
};                                                  /* size = 0xB8 */

struct _mips2c_stack_func_80A03F18 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A03F5C {
    /* 0x00 */ char pad_0[0x90];
    /* 0x90 */ ? sp90;                              /* inferred */
    /* 0x90 */ char pad_90[0xC];
    /* 0x9C */ f32 sp9C;                            /* inferred */
    /* 0xA0 */ f32 spA0;                            /* inferred */
    /* 0xA4 */ f32 spA4;                            /* inferred */
    /* 0xA8 */ f32 spA8;                            /* inferred */
    /* 0xAC */ f32 spAC;                            /* inferred */
    /* 0xB0 */ f32 spB0;                            /* inferred */
    /* 0xB4 */ char pad_B4[0x24];
};                                                  /* size = 0xD8 */

struct _mips2c_stack_func_80A0434C {
    /* 0x00 */ char pad_0[0x38];
    /* 0x38 */ ColliderCylinder *sp38;              /* inferred */
    /* 0x3C */ ActorContext *sp3C;                  /* inferred */
    /* 0x40 */ Actor *sp40;                         /* inferred */
    /* 0x44 */ char pad_44[0xC];                    /* maybe part of sp40[4]? */
    /* 0x50 */ f32 sp50;                            /* inferred */
    /* 0x54 */ f32 sp54;                            /* inferred */
    /* 0x58 */ f32 sp58;                            /* inferred */
    /* 0x5C */ char pad_5C[0x4];
};                                                  /* size = 0x60 */

struct _mips2c_stack_func_80A045A8 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80A04768 {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ f32 sp2C;                            /* inferred */
    /* 0x30 */ char pad_30[0x4];
    /* 0x34 */ f32 sp34;                            /* inferred */
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80A04878 {};              /* size 0x0 */

struct _mips2c_stack_func_80A04890 {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ Vec3s *sp20;                         /* inferred */
    /* 0x24 */ char pad_24[0x8];                    /* maybe part of sp20[3]? */
    /* 0x2C */ Actor *sp2C;                         /* inferred */
    /* 0x30 */ s16 sp30;                            /* inferred */
    /* 0x32 */ s16 sp32;                            /* inferred */
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ f32 sp3C;                            /* inferred */
    /* 0x40 */ f32 sp40;                            /* inferred */
    /* 0x44 */ char pad_44[0x8];                    /* maybe part of sp40[3]? */
    /* 0x4C */ f32 sp4C;                            /* inferred */
    /* 0x50 */ f32 sp50;                            /* inferred */
    /* 0x54 */ f32 sp54;                            /* inferred */
};                                                  /* size = 0x58 */

struct _mips2c_stack_func_80A04DE0 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80A04E5C {
    /* 0x00 */ char pad_0[0x3C];
    /* 0x3C */ CollisionCheckContext *sp3C;         /* inferred */
    /* 0x40 */ ColliderCylinder *sp40;              /* inferred */
    /* 0x44 */ char pad_44[0x4];
    /* 0x48 */ f32 sp48;                            /* inferred */
    /* 0x4C */ f32 sp4C;                            /* inferred */
    /* 0x50 */ f32 sp50;                            /* inferred */
    /* 0x54 */ f32 sp54;                            /* inferred */
    /* 0x58 */ f32 sp58;                            /* inferred */
    /* 0x5C */ f32 sp5C;                            /* inferred */
    /* 0x60 */ f32 sp60;                            /* inferred */
    /* 0x64 */ f32 sp64;                            /* inferred */
    /* 0x68 */ f32 sp68;                            /* inferred */
    /* 0x6C */ char pad_6C[0x4];
    /* 0x70 */ f32 sp70;                            /* inferred */
    /* 0x74 */ f32 sp74;                            /* inferred */
    /* 0x78 */ f32 sp78;                            /* inferred */
    /* 0x7C */ s16 sp7C;                            /* inferred */
    /* 0x7E */ s16 sp7E;                            /* inferred */
};                                                  /* size = 0x80 */

struct _mips2c_stack_func_80A055E0 {};              /* size 0x0 */

struct _mips2c_stack_func_80A05608 {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ CollisionCheckContext *sp20;         /* inferred */
    /* 0x24 */ ColliderCylinder *sp24;              /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80A05694 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A057A0 {
    /* 0x00 */ char pad_0[0x30];
    /* 0x30 */ Gfx *sp30;                           /* inferred */
    /* 0x34 */ char pad_34[0x1C];                   /* maybe part of sp30[8]? */
    /* 0x50 */ Gfx *sp50;                           /* inferred */
    /* 0x54 */ char pad_54[0xC];                    /* maybe part of sp50[4]? */
    /* 0x60 */ f32 sp60;                            /* inferred */
    /* 0x64 */ f32 sp64;                            /* inferred */
    /* 0x68 */ char pad_68[0x8];
};                                                  /* size = 0x70 */

struct _mips2c_stack_func_80A05AF8 {};              /* size 0x0 */

struct _mips2c_stack_func_80A05B50 {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80A05C88 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A05DDC {
    /* 0x00 */ char pad_0[0x38];
    /* 0x38 */ PosRot *sp38;                        /* inferred */
    /* 0x3C */ void *sp3C;                          /* inferred */
    /* 0x40 */ char pad_40[0x8];                    /* maybe part of sp3C[3]? */
    /* 0x48 */ f32 sp48;                            /* inferred */
    /* 0x4C */ f32 sp4C;                            /* inferred */
};                                                  /* size = 0x50 */

struct _mips2c_stack_func_80A06500 {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ void *sp18;                          /* inferred */
    /* 0x1C */ char pad_1C[0x4];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80A06990 {
    /* 0x00 */ char pad_0[0x38];
    /* 0x38 */ s32 sp38;                            /* inferred */
    /* 0x3C */ u32 sp3C;                            /* inferred */
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80A06C64 {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ ColliderCylinder *sp20;              /* inferred */
    /* 0x24 */ CollisionCheckContext *sp24;         /* inferred */
    /* 0x28 */ char pad_28[0x8];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80A06E24 {
    /* 0x00 */ char pad_0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80A06F48 {
    /* 0x00 */ char pad_0[0x28];
    /* 0x28 */ ActorContext *sp28;                  /* inferred */
    /* 0x2C */ char pad_2C[0x1C];
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_80A07604 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A07638 {};              /* size 0x0 */

struct _mips2c_stack_func_80A07740 {
    /* 0x00 */ char pad_0[0x68];
};                                                  /* size = 0x68 */

? EffectSsKFire_Spawn(GlobalContext *, f32 *, Vec3f *, f32 *, s32, s32); /* extern */
? func_800AEF44(void *);                            /* extern */
s32 func_8012405C(GlobalContext *);                 /* extern */
? func_8016566C(s16, Boss07 *);                     /* extern */
? func_80165690();                                  /* extern */
? func_8019FE1C(Vec3f *, ?, ?);                     /* extern */
? func_8019FE74(? *, ?, ?);                         /* extern */
? func_801A479C(Vec3f *, ?, ?);                     /* extern */
void func_809F4980(Actor *arg0, s16, GlobalContext *); /* static */
void func_809F49A0(s32 arg0, s32 arg1, s32 arg2);   /* static */
f32 func_809F49C0();                                /* static */
void func_809F4AE8(GlobalContext *arg0, f32 *arg1, f32 *arg2, f32 *arg3, f32 arg4); /* static */
