s32 func_8012405C(GlobalContext *);                 /* extern */
void func_80A4B0C8(EnWizFire *arg0, GlobalContext *arg1); /* static */
void func_80A4B33C(EnWizFire *arg0, GlobalContext *arg1); /* static */
void func_80A4BAB4(Actor *this, GlobalContext *globalCtx); /* static */
void func_80A4BC74(EnWizFire *arg0, Vec3f *arg1, f32 *arg2); /* static */
void func_80A4BDDC(EnWizFire *arg0, GlobalContext *arg1); /* static */
void func_80A4BF78(EnWizFire *arg0, GlobalContext *arg1); /* static */
extern ? D_06000E70;
extern ? D_06000FD8;
extern ? D_06002630;
extern ? D_06002B40;
extern ? D_06003120;
extern ? D_06003640;
extern ? D_06003FC0;
extern ? D_06005190;
extern ? D_06005750;
static s32 D_80A4C1C0 = 0;
static ColliderCylinderInit D_80A4C1E4 = {
    {0xA, 0x11, 9, 0, 0x10, 1},
    {0, {0xF7CFFFFF, 9, 0x10}, {0x1001202, 0, 0}, 1, 1, 0},
    {0, 0, 0, {0, 0, 0}},
};
static ? D_80A4C210;                                /* unable to generate initializer */
static ? D_80A4C21C;                                /* unable to generate initializer */
static ? D_80A4C228;                                /* unable to generate initializer */
static ? D_80A4C234;                                /* unable to generate initializer */
static Color_RGBA8 D_80A4C24C = {0xFA, 0xFA, 0xFA, 0xFF};
static Color_RGBA8 D_80A4C250 = {0xB4, 0xB4, 0xB4, 0xFF};

typedef struct EnWizFire {
    /* 0x0000 */ Actor actor;
    /* 0x0144 */ void (*actionFunc)(EnWizFire *, GlobalContext *);
    /* 0x0148 */ u8 unk148;                         /* inferred */
    /* 0x0149 */ char pad149[0x3];                  /* maybe part of unk148[4]? */
    /* 0x014C */ f32 unk14C;                        /* inferred */
    /* 0x0150 */ f32 unk150;                        /* inferred */
    /* 0x0154 */ f32 unk154;                        /* inferred */
    /* 0x0158 */ f32 unk158;                        /* inferred */
    /* 0x015C */ f32 unk15C;                        /* inferred */
    /* 0x0160 */ s16 unk160;                        /* inferred */
    /* 0x0162 */ s16 unk162;                        /* inferred */
    /* 0x0164 */ u8 unk164;                         /* inferred */
    /* 0x0165 */ char pad165[0x1];                  /* maybe part of unk164[2]? */
    /* 0x0166 */ s16 unk166;                        /* inferred */
    /* 0x0168 */ s16 unk168;                        /* inferred */
    /* 0x016A */ s16 unk16A;                        /* inferred */
    /* 0x016C */ s16 unk16C;                        /* inferred */
    /* 0x016E */ s16 unk16E;                        /* inferred */
    /* 0x0170 */ s16 unk170;                        /* inferred */
    /* 0x0172 */ s16 unk172;                        /* inferred */
    /* 0x0174 */ s8 unk174;                         /* inferred */
    /* 0x0175 */ char pad175[0x3];                  /* maybe part of unk174[4]? */
    /* 0x0178 */ f32 unk178;                        /* inferred */
    /* 0x017C */ f32 unk17C;                        /* inferred */
    /* 0x0180 */ f32 unk180;                        /* inferred */
    /* 0x0184 */ f32 unk184;                        /* inferred */
    /* 0x0188 */ f32 unk188;                        /* inferred */
    /* 0x018C */ f32 unk18C;                        /* inferred */
    /* 0x0190 */ char pad190[0x60];                 /* maybe part of unk18C[25]? */
    /* 0x01F0 */ f32 unk1F0;                        /* inferred */
    /* 0x01F4 */ f32 unk1F4;                        /* inferred */
    /* 0x01F8 */ f32 unk1F8;                        /* inferred */
    /* 0x01FC */ f32 unk1FC;                        /* inferred */
    /* 0x0200 */ f32 unk200;                        /* inferred */
    /* 0x0204 */ f32 unk204;                        /* inferred */
    /* 0x0208 */ ColliderCylinder unk208;           /* inferred */
    /* 0x0254 */ char pad254[0x28A0];
} EnWizFire;                                        /* size 0x2AF4 */

void EnWizFire_Init(Actor *thisx, GlobalContext *globalCtx) {
    EnWizFire *this = (EnWizFire *) thisx;
    s16 temp_v0;

    Collider_InitAndSetCylinder(globalCtx, &this->unk208, &this->actor, &D_80A4C1E4);
    this->actor.targetMode = 3;
    this->unk172 = 0xA;
    this->actor.flags &= -2;
    this->unk1FC = 255.0f;
    this->unk162 = this->actor.params;
    if (func_8012405C(globalCtx) == 0) {
        this->unk208.info.toucher.dmgFlags = 0x20000000;
    }
    temp_v0 = this->unk162;
    switch (temp_v0) {
    case 4:
        this->unk162 = 0;
        this->unk166 = 1;
        this->unk208.info.toucher.damage = 8;
        this->unk208.info.toucher.effect = 2;
        this->unk208.info.bumper.dmgFlags = 0x1000A02;
        // fallthrough
    case 0:
        if (this->unk162 == 4) {
            this->unk162 = 0;
            this->unk208.info.toucher.damage = 8;
        }
