typedef struct EnWizFire {
    /* 0x0000 */ Actor actor;
    /* 0x0144 */ void (*actionFunc)(EnWizFire *, GlobalContext *);
    /* 0x0148 */ u8 unk_148;                        /* inferred */
    /* 0x0149 */ char pad_149[0x3];                 /* maybe part of unk_148[4]? */
    /* 0x014C */ f32 unk_14C;                       /* inferred */
    /* 0x0150 */ f32 unk_150;                       /* inferred */
    /* 0x0154 */ f32 unk_154;                       /* inferred */
    /* 0x0158 */ f32 unk_158;                       /* inferred */
    /* 0x015C */ f32 unk_15C;                       /* inferred */
    /* 0x0160 */ s16 unk_160;                       /* inferred */
    /* 0x0162 */ s16 unk_162;                       /* inferred */
    /* 0x0164 */ u8 unk_164;                        /* inferred */
    /* 0x0165 */ char pad_165[0x1];
    /* 0x0166 */ s16 unk_166;                       /* inferred */
    /* 0x0168 */ s16 unk_168;                       /* inferred */
    /* 0x016A */ s16 unk_16A;                       /* inferred */
    /* 0x016C */ s16 unk_16C;                       /* inferred */
    /* 0x016E */ s16 unk_16E;                       /* inferred */
    /* 0x0170 */ s16 unk_170;                       /* inferred */
    /* 0x0172 */ s16 unk_172;                       /* inferred */
    /* 0x0174 */ s8 unk_174;                        /* inferred */
    /* 0x0175 */ char pad_175[0x3];                 /* maybe part of unk_174[4]? */
    /* 0x0178 */ f32 unk_178;                       /* inferred */
    /* 0x017C */ f32 unk_17C;                       /* inferred */
    /* 0x0180 */ f32 unk_180;                       /* inferred */
    /* 0x0184 */ f32 unk_184;                       /* inferred */
    /* 0x0188 */ f32 unk_188;                       /* inferred */
    /* 0x018C */ f32 unk_18C;                       /* inferred */
    /* 0x0190 */ char pad_190[0x60];                /* maybe part of unk_18C[25]? */
    /* 0x01F0 */ f32 unk_1F0;                       /* inferred */
    /* 0x01F4 */ f32 unk_1F4;                       /* inferred */
    /* 0x01F8 */ f32 unk_1F8;                       /* inferred */
    /* 0x01FC */ f32 unk_1FC;                       /* inferred */
    /* 0x0200 */ f32 unk_200;                       /* inferred */
    /* 0x0204 */ f32 unk_204;                       /* inferred */
    /* 0x0208 */ ColliderCylinder unk_208;          /* inferred */
    /* 0x0254 */ char pad_254[0x28A0];              /* maybe part of unk_208[137]? */
} EnWizFire;                                        /* size = 0x2AF4 */

struct _mips2c_stack_EnWizFire_Destroy {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnWizFire_Draw {
    /* 0x00 */ char pad_0[0x58];
    /* 0x58 */ EnWizFire *sp58;                     /* inferred */
    /* 0x5C */ char pad_5C[0x4];
};                                                  /* size = 0x60 */

struct _mips2c_stack_EnWizFire_Init {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_EnWizFire_Update {
    /* 0x00 */ char pad_0[0x44];
    /* 0x44 */ s32 sp44;                            /* inferred */
    /* 0x48 */ char pad_48[0xC];                    /* maybe part of sp44[4]? */
    /* 0x54 */ f32 sp54;                            /* inferred */
    /* 0x58 */ f32 sp58;                            /* inferred */
    /* 0x5C */ f32 sp5C;                            /* inferred */
    /* 0x60 */ f32 sp60;                            /* inferred */
    /* 0x64 */ f32 sp64;                            /* inferred */
    /* 0x68 */ f32 sp68;                            /* inferred */
    /* 0x6C */ f32 sp6C;                            /* inferred */
    /* 0x70 */ f32 sp70;                            /* inferred */
    /* 0x74 */ f32 sp74;                            /* inferred */
    /* 0x78 */ f32 sp78;                            /* inferred */
    /* 0x7C */ char pad_7C[0x10];                   /* maybe part of sp78[5]? */
    /* 0x8C */ Actor *sp8C;                         /* inferred */
    /* 0x90 */ char pad_90[0x8];
};                                                  /* size = 0x98 */

struct _mips2c_stack_func_80A4984C {
    /* 0x00 */ char pad_0[0x44];
    /* 0x44 */ ? sp44;                              /* inferred */
    /* 0x44 */ char pad_44[0x8];
    /* 0x4C */ f32 sp4C;                            /* inferred */
};                                                  /* size = 0x50 */

struct _mips2c_stack_func_80A49A44 {
    /* 0x00 */ char pad_0[0x40];
    /* 0x40 */ ActorContext *sp40;                  /* inferred */
    /* 0x44 */ char pad_44[0x10];                   /* maybe part of sp40[5]? */
    /* 0x54 */ ? sp54;                              /* inferred */
    /* 0x54 */ char pad_54[0x8];
    /* 0x5C */ f32 sp5C;                            /* inferred */
};                                                  /* size = 0x60 */

struct _mips2c_stack_func_80A49F38 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80A49FD8 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80A4A11C {
    /* 0x00 */ char pad_0[0x34];
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ char pad_38[0x4];
    /* 0x3C */ f32 sp3C;                            /* inferred */
    /* 0x40 */ f32 sp40;                            /* inferred */
    /* 0x44 */ f32 sp44;                            /* inferred */
    /* 0x48 */ f32 sp48;                            /* inferred */
    /* 0x4C */ char pad_4C[0x4];
};                                                  /* size = 0x50 */

struct _mips2c_stack_func_80A4A608 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A4B0C8 {
    /* 0x00 */ char pad_0[0x40];
    /* 0x40 */ Gfx *sp40;                           /* inferred */
    /* 0x44 */ Gfx *sp44;                           /* inferred */
    /* 0x48 */ char pad_48[0x18];                   /* maybe part of sp44[7]? */
    /* 0x60 */ Gfx *sp60;                           /* inferred */
    /* 0x64 */ char pad_64[0xC];
};                                                  /* size = 0x70 */

struct _mips2c_stack_func_80A4B33C {
    /* 0x00 */ char pad_0[0x40];
    /* 0x40 */ MtxF *sp40;                          /* inferred */
    /* 0x44 */ char pad_44[0x4];
    /* 0x48 */ Gfx *sp48;                           /* inferred */
    /* 0x4C */ char pad_4C[0xC];                    /* maybe part of sp48[4]? */
    /* 0x58 */ Gfx *sp58;                           /* inferred */
    /* 0x5C */ char pad_5C[0x4];
    /* 0x60 */ Gfx *sp60;                           /* inferred */
    /* 0x64 */ char pad_64[0xC];                    /* maybe part of sp60[4]? */
    /* 0x70 */ Gfx *sp70;                           /* inferred */
    /* 0x74 */ char pad_74[0x10];                   /* maybe part of sp70[5]? */
    /* 0x84 */ Gfx *sp84;                           /* inferred */
    /* 0x88 */ Gfx *sp88;                           /* inferred */
    /* 0x8C */ char pad_8C[0xC];
};                                                  /* size = 0x98 */

struct _mips2c_stack_func_80A4BAB4 {
    /* 0x00 */ char pad_0[0x44];
    /* 0x44 */ Gfx *sp44;                           /* inferred */
    /* 0x48 */ char pad_48[0x10];
};                                                  /* size = 0x58 */

struct _mips2c_stack_func_80A4BC74 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80A4BDDC {};              /* size 0x0 */

struct _mips2c_stack_func_80A4BF78 {
    /* 0x00 */ char pad_0[0x68];
};                                                  /* size = 0x68 */

s32 func_8012405C(GlobalContext *);                 /* extern */
void func_80A4B0C8(EnWizFire *arg0, GlobalContext *arg1); /* static */
void func_80A4B33C(EnWizFire *arg0, GlobalContext *arg1); /* static */
void func_80A4BAB4(Actor *this, GlobalContext *globalCtx); /* static */
void func_80A4BC74(EnWizFire *arg0, f32 *arg1, f32 *arg2); /* static */
void func_80A4BDDC(EnWizFire *arg0, GlobalContext *arg1); /* static */
void func_80A4BF78(EnWizFire *arg0, GlobalContext *arg1); /* static */
extern ? D_06000E70;
extern ? D_06000FD8;
extern ? D_06002630;
extern ? D_06002B40;
extern ? D_06003120;
extern ? D_06003640;
extern ? D_06003FC0;
extern ? D_06005190;
extern ? D_06005750;
static s32 D_80A4C1C0 = 0;
static ColliderCylinderInit D_80A4C1E4 = {
    {0xA, 0x11, 9, 0, 0x10, 1},
    {0, {0xF7CFFFFF, 9, 0x10}, {0x1001202, 0, 0}, 1, 1, 0},
    {0, 0, 0, {0, 0, 0}},
};
