typedef struct EnKarebaba {
    /* 0x000 */ Actor actor;
    /* 0x144 */ SkelAnime unk144;                   /* inferred */
    /* 0x188 */ void (*actionFunc)(EnKarebaba *, GlobalContext *);
    /* 0x18C */ Vec3s unk18C;                       /* inferred */
    /* 0x192 */ char pad192[0x2A];                  /* maybe part of unk18C[8]? */
    /* 0x1BC */ Vec3s unk1BC;                       /* inferred */
    /* 0x1C2 */ char pad1C2[0x2A];                  /* maybe part of unk1BC[8]? */
    /* 0x1EC */ u8 unk1EC;                          /* inferred */
    /* 0x1ED */ char pad1ED[0x1];
    /* 0x1EE */ s16 unk1EE;                         /* inferred */
    /* 0x1F0 */ f32 unk1F0;                         /* inferred */
    /* 0x1F4 */ f32 unk1F4;                         /* inferred */
    /* 0x1F8 */ f32 unk1F8;                         /* inferred */
    /* 0x1FC */ Vec3f unk1FC;                       /* inferred */
    /* 0x208 */ Vec3f unk208;                       /* inferred */
    /* 0x214 */ char pad214[0xC];
    /* 0x220 */ Vec3f unk220;                       /* inferred */
    /* 0x22C */ CollisionPoly *unk22C;              /* inferred */
    /* 0x230 */ ColliderCylinder unk230;            /* inferred */
    /* 0x27C */ ColliderCylinder unk27C;            /* inferred */
} EnKarebaba;                                       /* size = 0x2C8 */

struct _mips2c_stack_EnKarebaba_Destroy {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnKarebaba_Draw {
    /* 0x00 */ char pad0[0x50];
    /* 0x50 */ Vec3f *sp50;                         /* inferred */
    /* 0x54 */ char pad54[0x4];
    /* 0x58 */ void *sp58;                          /* inferred */
    /* 0x5C */ char pad5C[0x30];                    /* maybe part of sp58[13]? */
    /* 0x8C */ f32 sp8C;                            /* inferred */
    /* 0x90 */ char pad90[0x4];
    /* 0x94 */ s32 sp94;                            /* inferred */
    /* 0x98 */ char pad98[0x8];
};                                                  /* size = 0xA0 */

struct _mips2c_stack_EnKarebaba_Init {
    /* 0x00 */ char pad0[0x30];
    /* 0x30 */ ColliderCylinder *sp30;              /* inferred */
    /* 0x34 */ char pad34[0x4];
};                                                  /* size = 0x38 */

struct _mips2c_stack_EnKarebaba_Update {
    /* 0x00 */ char pad0[0x2C];
    /* 0x2C */ void (*sp2C)(EnKarebaba *, GlobalContext *); /* inferred */
    /* 0x30 */ CollisionCheckContext *sp30;         /* inferred */
    /* 0x34 */ char pad34[0xC];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_808F1374 {
    /* 0x00 */ char pad0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_808F13FC {
    /* 0x00 */ char pad0[0x38];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_808F152C {};              /* size 0x0 */

struct _mips2c_stack_func_808F155C {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_808F15B0 {
    /* 0x00 */ char pad0[0x1C];
    /* 0x1C */ f32 sp1C;                            /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_808F1648 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_808F169C {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_808F16FC {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_808F1778 {
    /* 0x00 */ char pad0[0x38];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_808F1878 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_808F190C {
    /* 0x00 */ char pad0[0x20];
    /* 0x20 */ SkelAnime *sp20;                     /* inferred */
    /* 0x24 */ Actor *sp24;                         /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_808F1A3C {};              /* size 0x0 */

struct _mips2c_stack_func_808F1A58 {
    /* 0x00 */ char pad0[0x20];
    /* 0x20 */ SkelAnime *sp20;                     /* inferred */
    /* 0x24 */ char pad24[0x4];
    /* 0x28 */ f32 sp28;                            /* inferred */
    /* 0x2C */ char pad2C[0x4];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_808F1BF8 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_808F1C84 {
    /* 0x00 */ char pad0[0x68];
    /* 0x68 */ f32 sp68;                            /* inferred */
    /* 0x6C */ char pad6C[0xC];                     /* maybe part of sp68[4]? */
    /* 0x78 */ f32 sp78;                            /* inferred */
    /* 0x7C */ f32 sp7C;                            /* inferred */
    /* 0x80 */ f32 sp80;                            /* inferred */
    /* 0x84 */ char pad84[0x4];
};                                                  /* size = 0x88 */

struct _mips2c_stack_func_808F1FAC {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_808F200C {
    /* 0x00 */ char pad0[0x38];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_808F20FC {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_808F21A4 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_808F220C {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_808F228C {
    /* 0x00 */ char pad0[0x38];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_808F238C {
    /* 0x00 */ char pad0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_808F241C {
    /* 0x00 */ char pad0[0x1C];
    /* 0x1C */ f32 sp1C;                            /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_808F24F8 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_808F254C {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_808F280C {
    /* 0x00 */ char pad0[0x30];
    /* 0x30 */ Gfx *sp30;                           /* inferred */
    /* 0x34 */ char pad34[0xC];                     /* maybe part of sp30[4]? */
    /* 0x40 */ ? sp40;                              /* inferred */
    /* 0x40 */ char pad40[0x40];
};                                                  /* size = 0x80 */

? func_800AE2A0(GlobalContext *, ? *, ?, ?);        /* extern */
? func_800B8B84(EnKarebaba *, GlobalContext *, ?);  /* extern */
void func_808F1374(Actor *arg0, GlobalContext *arg1); /* static */
void func_808F13FC(EnKarebaba *arg0, GlobalContext *arg1); /* static */
void func_808F152C(EnKarebaba *arg0);               /* static */
void func_808F155C(EnKarebaba *arg0);               /* static */
void func_808F1648(EnKarebaba *arg0);               /* static */
void func_808F16FC(Actor *arg0);                    /* static */
void func_808F1878(EnKarebaba *arg0);               /* static */
void func_808F1A3C(EnKarebaba *arg0);               /* static */
void func_808F1BF8(EnKarebaba *arg0);               /* static */
void func_808F1FAC(EnKarebaba *arg0);               /* static */
void func_808F20FC(EnKarebaba *arg0, GlobalContext *arg1); /* static */
