typedef struct Actor {
    /* 0x000 */ s16 id;
    /* 0x002 */ u8 category;
    /* 0x003 */ s8 room;
    /* 0x004 */ u32 flags;
    /* 0x008 */ PosRot home;
    /* 0x01C */ s16 params;
    /* 0x01E */ s8 objBankIndex;
    /* 0x01F */ s8 targetMode;
    /* 0x020 */ s16 unk20;
    /* 0x022 */ char pad_22[0x2];
    /* 0x024 */ PosRot world;
    /* 0x038 */ s8 cutscene;
    /* 0x039 */ s8 unk39;
    /* 0x03A */ char pad_3A[0x2];                   /* maybe part of unk39[3]? */
    /* 0x03C */ PosRot focus;
    /* 0x050 */ u16 sfx;
    /* 0x052 */ u8 unk_52;                          /* inferred */
    /* 0x053 */ s8 unk_53;                          /* inferred */
    /* 0x054 */ f32 targetArrowOffset;
    /* 0x058 */ Vec3f scale;
    /* 0x064 */ Vec3f velocity;
    /* 0x070 */ f32 speedXZ;
    /* 0x074 */ f32 gravity;
    /* 0x078 */ f32 minVelocityY;
    /* 0x07C */ CollisionPoly *wallPoly;
    /* 0x080 */ CollisionPoly *floorPoly;
    /* 0x084 */ u8 wallBgId;
    /* 0x085 */ u8 floorBgId;
    /* 0x086 */ s16 wallYaw;
    /* 0x088 */ f32 floorHeight;
    /* 0x08C */ f32 yDistToWater;
    /* 0x090 */ u16 bgCheckFlags;
    /* 0x092 */ s16 yawTowardsPlayer;
    /* 0x094 */ f32 xyzDistToPlayerSq;
    /* 0x098 */ f32 xzDistToPlayer;
    /* 0x09C */ f32 yDistToPlayer;
    /* 0x0A0 */ CollisionCheckInfo colChkInfo;
    /* 0x0BC */ ActorShape shape;
    /* 0x0EC */ Vec3f projectedPos;
    /* 0x0F8 */ f32 projectedW;
    /* 0x0FC */ f32 uncullZoneForward;
    /* 0x100 */ f32 uncullZoneScale;
    /* 0x104 */ f32 uncullZoneDownward;
    /* 0x108 */ Vec3f prevPos;
    /* 0x114 */ u8 isTargeted;
    /* 0x115 */ u8 targetPriority;
    /* 0x116 */ u16 textId;
    /* 0x118 */ u16 freezeTimer;
    /* 0x11A */ u16 colorFilterParams;
    /* 0x11C */ u8 colorFilterTimer;
    /* 0x11D */ u8 isDrawn;
    /* 0x11E */ u8 dropFlag;
    /* 0x11F */ u8 hintId;
    /* 0x120 */ Actor *parent;
    /* 0x124 */ Actor *child;
    /* 0x128 */ Actor *prev;
    /* 0x12C */ Actor *next;
    /* 0x130 */ void (*init)(Actor *, GlobalContext *);
    /* 0x134 */ void (*destroy)(Actor *, GlobalContext *);
    /* 0x138 */ void (*update)(Actor *, GlobalContext *);
    /* 0x13C */ void (*draw)(Actor *, GlobalContext *);
    /* 0x140 */ ActorOverlay *overlayEntry;
} Actor;                                            /* size = 0x144 */

typedef struct {
    /* 0x00 */ Vec3s rot;
    /* 0x06 */ s16 face;
    /* 0x08 */ f32 yOffset;
    /* 0x0C */ void (*shadowDraw)(Actor *, Lights *, GlobalContext *);
    /* 0x10 */ f32 shadowScale;
    /* 0x14 */ u8 shadowAlpha;
    /* 0x15 */ u8 feetFloorFlags;
    /* 0x16 */ s16 unk_16;                          /* inferred */
    /* 0x18 */ Vec3f feetPos[2];
} ActorShape;                                       /* size = 0x30 */

typedef struct EnGs {
    /* 0x000 */ Actor actor;
    /* 0x144 */ ColliderCylinder unk_144;           /* inferred */
    /* 0x190 */ void (*unk_190)(Actor *, GlobalContext *); /* inferred */
    /* 0x194 */ s8 unk_194;                         /* inferred */
    /* 0x195 */ s8 unk_195;                         /* inferred */
    /* 0x196 */ s8 unk_196;                         /* inferred */
    /* 0x197 */ char pad_197[0x1];
    /* 0x198 */ s16 unk_198;                        /* inferred */
    /* 0x19A */ s16 unk_19A;                        /* inferred */
    /* 0x19C */ char pad_19C[0x2];
    /* 0x19E */ s16 unk_19E;                        /* inferred */
    /* 0x1A0 */ s16 unk_1A0;                        /* inferred */
    /* 0x1A2 */ s16 unk_1A2;                        /* inferred */
    /* 0x1A4 */ s16 unk_1A4;                        /* inferred */
    /* 0x1A6 */ s16 unk_1A6;                        /* inferred */
    /* 0x1A8 */ s16 unk_1A8;                        /* inferred */
    /* 0x1AA */ char pad_1AA[0x6];                  /* maybe part of unk_1A8[4]? */
    /* 0x1B0 */ Vec3f unk_1B0;                      /* inferred */
    /* 0x1BC */ Vec3f unk_1BC;                      /* inferred */
    /* 0x1C8 */ char pad_1C8[0x2C];                 /* maybe part of unk_1BC[4]? */
    /* 0x1F4 */ u8 unk_1F4;                         /* inferred */
    /* 0x1F5 */ u8 unk_1F5;                         /* inferred */
    /* 0x1F6 */ u8 unk_1F6;                         /* inferred */
    /* 0x1F7 */ Color_RGB8 unk_1F7;                 /* inferred */
    /* 0x1FA */ Color_RGB8 unk_1FA;                 /* inferred */
    /* 0x1FD */ char pad_1FD[0x3];
    /* 0x200 */ f32 unk_200;                        /* inferred */
    /* 0x204 */ s32 unk_204;                        /* inferred */
    /* 0x208 */ s32 unk_208;                        /* inferred */
    /* 0x20C */ char pad_20C[0x6];                  /* maybe part of unk_208[2]? */
    /* 0x212 */ s16 unk_212;                        /* inferred */
    /* 0x214 */ char pad_214[0x2];
    /* 0x216 */ s16 unk_216;                        /* inferred */
    /* 0x218 */ s16 unk_218;                        /* inferred */
    /* 0x21A */ char pad_21A[0x2];
    /* 0x21C */ s16 unk_21C;                        /* inferred */
    /* 0x21E */ s16 unk_21E;                        /* inferred */
} EnGs;                                             /* size = 0x220 */

struct _mips2c_stack_EnGs_Destroy {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnGs_Draw {
    /* 0x00 */ char pad_0[0x40];
    /* 0x40 */ Gfx *sp40;                           /* inferred */
    /* 0x44 */ char pad_44[0x8];                    /* maybe part of sp40[3]? */
    /* 0x4C */ u32 sp4C;                            /* inferred */
    /* 0x50 */ char pad_50[0x8];
};                                                  /* size = 0x58 */

struct _mips2c_stack_EnGs_Init {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ Color_RGB8 *sp24;                    /* inferred */
    /* 0x28 */ char pad_28[0x8];
};                                                  /* size = 0x30 */

struct _mips2c_stack_EnGs_Update {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ Color_RGB8 *sp20;                    /* inferred */
    /* 0x24 */ Color_RGB8 *sp24;                    /* inferred */
    /* 0x28 */ u8 *sp28;                            /* inferred */
    /* 0x2C */ s16 sp2C;                            /* inferred */
    /* 0x2E */ s16 sp2E;                            /* inferred */
    /* 0x30 */ char pad_30[0x8];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80997A90 {};              /* size 0x0 */

struct _mips2c_stack_func_80997AFC {};              /* size 0x0 */

struct _mips2c_stack_func_80997D14 {};              /* size 0x0 */

struct _mips2c_stack_func_80997D38 {
    /* 0x00 */ char pad_0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80997DEC {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80997E4C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80997FF0 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80998040 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8099807C {
    /* 0x00 */ char pad_0[0x38];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80998300 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80998334 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ f32 sp24;                            /* inferred */
    /* 0x28 */ char pad_28[0x4];
    /* 0x2C */ f32 sp2C;                            /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_809984F4 {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_809985B8 {
    /* 0x00 */ char pad_0[0x38];
    /* 0x38 */ ? sp38;                              /* inferred */
    /* 0x38 */ char pad_38[0x10];
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_80998704 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8099874C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809989B4 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_809989F4 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80998A48 {
    /* 0x00 */ char pad_0[0x3C];
    /* 0x3C */ Actor *sp3C;                         /* inferred */
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80998BBC {
    /* 0x00 */ char pad_0[0x34];
    /* 0x34 */ Actor *sp34;                         /* inferred */
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80998D44 {
    /* 0x00 */ char pad_0[0x3C];
    /* 0x3C */ Actor *sp3C;                         /* inferred */
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80998F9C {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ CollisionCheckInfo *sp2C;            /* inferred */
    /* 0x30 */ char pad_30[0xA];                    /* maybe part of sp2C[3]? */
    /* 0x3A */ s16 sp3A;                            /* inferred */
    /* 0x3C */ char pad_3C[0x4];                    /* maybe part of sp3A[3]? */
    /* 0x40 */ f32 sp40;                            /* inferred */
    /* 0x44 */ f32 sp44;                            /* inferred */
    /* 0x48 */ f32 sp48;                            /* inferred */
    /* 0x4C */ Actor *sp4C;                         /* inferred */
};                                                  /* size = 0x50 */

struct _mips2c_stack_func_80999584 {};              /* size 0x0 */

struct _mips2c_stack_func_809995A4 {
    /* 0x00 */ char pad_0[0x54];
    /* 0x54 */ f32 sp54;                            /* inferred */
    /* 0x58 */ f32 sp58;                            /* inferred */
    /* 0x5C */ f32 sp5C;                            /* inferred */
    /* 0x60 */ f32 sp60;                            /* inferred */
    /* 0x64 */ f32 sp64;                            /* inferred */
    /* 0x68 */ f32 sp68;                            /* inferred */
    /* 0x6C */ f32 sp6C;                            /* inferred */
    /* 0x70 */ f32 sp70;                            /* inferred */
    /* 0x74 */ f32 sp74;                            /* inferred */
    /* 0x78 */ char pad_78[0x4];
    /* 0x7C */ Actor *sp7C;                         /* inferred */
};                                                  /* size = 0x80 */

struct _mips2c_stack_func_80999A8C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80999AC0 {};              /* size 0x0 */

struct _mips2c_stack_func_80999B34 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80999BC8 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ Actor *sp24;                         /* inferred */
    /* 0x28 */ CollisionCheckContext *sp28;         /* inferred */
    /* 0x2C */ char pad_2C[0xC];
};                                                  /* size = 0x38 */

? EffectSsBomb2_SpawnLayered(GlobalContext *, f32 *, ? *, ? *, s32, s32); /* extern */
s32 func_800B8718(EnGs *, GlobalContext *);         /* extern */
? func_800B874C(void *, s32, ?, ?);                 /* extern */
? func_800BC848(EnGs *, GlobalContext *, s16, s16); /* extern */
? func_8013E8F8(void *, s32, f32, f32, s32, s32, s32); /* extern */
? func_80165658(s16, s16);                          /* extern */
? func_8016566C(s16, s16);                          /* extern */
? func_80165690();                                  /* extern */
? func_801A5080(?);                                 /* extern */
s32 func_801A5100();                                /* extern */
s8 func_80997A90(s16 arg0, s16 arg1);               /* static */
void func_80997AFC(s8 arg0, Color_RGB8 *arg1, Color_RGB8 *); /* static */
