typedef struct GameAllocNode {
    /* 0x00 */ GameAllocNode *next;
    /* 0x04 */ GameAllocNode *prev;
    /* 0x08 */ u32 size;
    /* 0x0C */ MtxF unk_C;                          /* inferred */
} GameAllocNode;                                    /* size = 0x10 */

typedef struct ObjectKankyo {
    /* 0x0000 */ Actor actor;
    /* 0x0144 */ f32 unk_144;                       /* inferred */
    /* 0x0148 */ f32 unk_148;                       /* inferred */
    /* 0x014C */ f32 unk_14C;                       /* inferred */
    /* 0x0150 */ f32 unk_150;                       /* inferred */
    /* 0x0154 */ f32 unk_154;                       /* inferred */
    /* 0x0158 */ char pad_158[0x14];                /* maybe part of unk_154[6]? */
    /* 0x016C */ f32 unk_16C;                       /* inferred */
    /* 0x0170 */ char pad_170[0x4];
    /* 0x0174 */ f32 unk_174;                       /* inferred */
    /* 0x0178 */ char pad_178[0x14];                /* maybe part of unk_174[6]? */
    /* 0x018C */ f32 unk_18C;                       /* inferred */
    /* 0x0190 */ f32 unk_190;                       /* inferred */
    /* 0x0194 */ char pad_194[0xFB8];               /* maybe part of unk_190[1007]? */
    /* 0x114C */ u16 unk_114C;                      /* inferred */
    /* 0x114E */ char pad_114E[0x2];
    /* 0x1150 */ void (*actionFunc)(ObjectKankyo *, GlobalContext *);
} ObjectKankyo;                                     /* size = 0x1154 */

struct _mips2c_stack_ObjectKankyo_Destroy {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_ObjectKankyo_Draw {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_ObjectKankyo_Init {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_ObjectKankyo_SetupAction {};   /* size 0x0 */

struct _mips2c_stack_ObjectKankyo_Update {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_808DBE8C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_808DBEB0 {
    /* 0x00 */ char pad_0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_808DBFB0 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_808DC038 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_808DC18C {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ f32 sp1C;                            /* inferred */
    /* 0x20 */ char pad_20[0x10];                   /* maybe part of sp1C[5]? */
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ char pad_3C[0x1C];
};                                                  /* size = 0x58 */

struct _mips2c_stack_func_808DC454 {
    /* 0x00 */ char pad_0[0x60];
    /* 0x60 */ f32 sp60;                            /* inferred */
    /* 0x64 */ char pad_64[0x24];                   /* maybe part of sp60[10]? */
    /* 0x88 */ f32 sp88;                            /* inferred */
    /* 0x8C */ f32 sp8C;                            /* inferred */
    /* 0x90 */ f32 sp90;                            /* inferred */
    /* 0x94 */ char pad_94[0x28];                   /* maybe part of sp90[11]? */
    /* 0xBC */ f32 spBC;                            /* inferred */
    /* 0xC0 */ f32 spC0;                            /* inferred */
    /* 0xC4 */ f32 spC4;                            /* inferred */
    /* 0xC8 */ f32 spC8;                            /* inferred */
    /* 0xCC */ f32 spCC;                            /* inferred */
    /* 0xD0 */ f32 spD0;                            /* inferred */
    /* 0xD4 */ char pad_D4[0xC];
};                                                  /* size = 0xE0 */

struct _mips2c_stack_func_808DCB7C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_808DCBF8 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_808DCDB4 {
    /* 0x00 */ char pad_0[0x64];
    /* 0x64 */ f32 sp64;                            /* inferred */
    /* 0x68 */ char pad_68[0x24];                   /* maybe part of sp64[10]? */
    /* 0x8C */ f32 sp8C;                            /* inferred */
    /* 0x90 */ char pad_90[0xC];                    /* maybe part of sp8C[4]? */
    /* 0x9C */ f32 sp9C;                            /* inferred */
    /* 0xA0 */ f32 spA0;                            /* inferred */
    /* 0xA4 */ f32 spA4;                            /* inferred */
    /* 0xA8 */ f32 spA8;                            /* inferred */
    /* 0xAC */ f32 spAC;                            /* inferred */
    /* 0xB0 */ char pad_B0[0x10];
};                                                  /* size = 0xC0 */

struct _mips2c_stack_func_808DD3C8 {
    /* 0x00 */ char pad_0[0x68];
    /* 0x68 */ s32 sp68;                            /* inferred */
    /* 0x6C */ char pad_6C[0x48];                   /* maybe part of sp68[19]? */
    /* 0xB4 */ u8 spB4;                             /* inferred */
    /* 0xB5 */ char pad_B5[0x3];                    /* maybe part of spB4[4]? */
    /* 0xB8 */ f32 spB8;                            /* inferred */
    /* 0xBC */ f32 spBC;                            /* inferred */
    /* 0xC0 */ char pad_C0[0x4];
    /* 0xC4 */ f32 spC4;                            /* inferred */
    /* 0xC8 */ f32 spC8;                            /* inferred */
    /* 0xCC */ f32 spCC;                            /* inferred */
    /* 0xD0 */ char pad_D0[0x8];
};                                                  /* size = 0xD8 */

struct _mips2c_stack_func_808DD970 {
    /* 0x00 */ char pad_0[0x9C];
    /* 0x9C */ void *sp9C;                          /* inferred */
    /* 0xA0 */ char pad_A0[0x10];                   /* maybe part of sp9C[5]? */
    /* 0xB0 */ f32 spB0;                            /* inferred */
    /* 0xB4 */ f32 spB4;                            /* inferred */
    /* 0xB8 */ char pad_B8[0x4];
    /* 0xBC */ f32 spBC;                            /* inferred */
    /* 0xC0 */ f32 spC0;                            /* inferred */
    /* 0xC4 */ f32 spC4;                            /* inferred */
    /* 0xC8 */ char pad_C8[0x8];
};                                                  /* size = 0xD0 */

struct _mips2c_stack_func_808DDE74 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_808DDE9C {
    /* 0x00 */ char pad_0[0x74];
    /* 0x74 */ void *sp74;                          /* inferred */
    /* 0x78 */ char pad_78[0x8];
};                                                  /* size = 0x80 */

f32 func_800E031C(s32, void *);                     /* extern */
void func_808DBE8C(ObjectKankyo *arg0);             /* static */
void func_808DBEB0(ObjectKankyo *arg0, void *arg1); /* static */
void func_808DBFB0(ObjectKankyo *arg0, ? arg1);     /* static */
void func_808DC038(ObjectKankyo *arg0, ? arg1);     /* static */
void func_808DC18C(ObjectKankyo *this, GlobalContext *globalCtx); /* static */
void func_808DC454(void *arg0, void *arg1);         /* static */
void func_808DCDB4(ObjectKankyo *this, GlobalContext *globalCtx); /* static */
void func_808DD3C8(void *arg0, GameState *arg1);    /* static */
void func_808DD970(void *arg0, GlobalContext *arg1); /* static */
f32 func_808DDE74();                                /* static */
void func_808DDE9C(void *arg0, void *arg1);         /* static */
extern ? D_01000000;
extern ? D_040706E0;
extern s8 D_801F4E30;
