typedef struct EnZog {
    /* 0x000 */ Actor actor;
    /* 0x144 */ ColliderCylinder unk144;            /* inferred */
    /* 0x190 */ SkelAnime unk190;                   /* inferred */
    /* 0x1D4 */ Vec3s unk1D4;                       /* inferred */
    /* 0x1DA */ char pad1DA[0x84];                  /* maybe part of unk1D4[23]? */
    /* 0x25E */ Vec3s unk25E;                       /* inferred */
    /* 0x264 */ char pad264[0x84];                  /* maybe part of unk25E[23]? */
    /* 0x2E8 */ void *unk2E8;                       /* inferred */
    /* 0x2EC */ s32 unk2EC;                         /* inferred */
    /* 0x2F0 */ Vec3f unk2F0;                       /* inferred */
    /* 0x2FC */ s16 unk2FC;                         /* inferred */
    /* 0x2FE */ s16 unk2FE;                         /* inferred */
    /* 0x300 */ s16 unk300;                         /* inferred */
    /* 0x302 */ s16 unk302;                         /* inferred */
    /* 0x304 */ s16 unk304;                         /* inferred */
    /* 0x306 */ s16 unk306;                         /* inferred */
    /* 0x308 */ s16 unk308;                         /* inferred */
    /* 0x30A */ u16 unk30A;                         /* inferred */
    /* 0x30C */ char pad30C[0xE];                   /* maybe part of unk30A[8]? */
    /* 0x31A */ s16 unk31A;                         /* inferred */
    /* 0x31C */ s16 unk31C;                         /* inferred */
    /* 0x31E */ s16 unk31E;                         /* inferred */
    /* 0x320 */ s16 unk320;                         /* inferred */
    /* 0x322 */ s16 unk322;                         /* inferred */
    /* 0x324 */ s16 unk324;                         /* inferred */
    /* 0x326 */ char pad326[0x2];
    /* 0x328 */ void (*actionFunc)(EnZog *, GlobalContext *);
} EnZog;                                            /* size = 0x32C */

struct _mips2c_stack_EnZog_Destroy {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnZog_Draw {
    /* 0x00 */ char pad0[0x38];
};                                                  /* size = 0x38 */

struct _mips2c_stack_EnZog_Init {
    /* 0x00 */ char pad0[0x4C];
    /* 0x4C */ EnZog *sp4C;                         /* inferred */
    /* 0x50 */ SkelAnime *sp50;                     /* inferred */
    /* 0x54 */ s32 sp54;                            /* inferred */
    /* 0x58 */ char pad58[0x4];
    /* 0x5C */ s32 sp5C;                            /* inferred */
    /* 0x60 */ char pad60[0x8];
};                                                  /* size = 0x68 */

struct _mips2c_stack_EnZog_Update {
    /* 0x00 */ char pad0[0x2C];
    /* 0x2C */ ColliderCylinder *sp2C;              /* inferred */
    /* 0x30 */ char pad30[0x8];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80B93310 {
    /* 0x00 */ char pad0[0x28];
    /* 0x28 */ Vec3f *sp28;                         /* inferred */
    /* 0x2C */ f32 sp2C;                            /* inferred */
    /* 0x30 */ char pad30[0x4];
    /* 0x34 */ ? sp34;                              /* inferred */
    /* 0x34 */ char pad34[0x4];
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ char pad3C[0x4];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80B93468 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B939C0 {
    /* 0x00 */ char pad0[0x28];
    /* 0x28 */ AnimationHeaderCommon **sp28;        /* inferred */
    /* 0x2C */ char pad2C[0x4];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80B93A48 {
    /* 0x00 */ char pad0[0x18];
    /* 0x18 */ SkelAnime *sp18;                     /* inferred */
    /* 0x1C */ char pad1C[0x4];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80B93B44 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B93BA8 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B93BE0 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80B93D2C {
    /* 0x00 */ char pad0[0x28];
    /* 0x28 */ ? sp28;                              /* inferred */
    /* 0x28 */ char pad28[0x4];
    /* 0x2C */ f32 sp2C;                            /* inferred */
    /* 0x30 */ char pad30[0x8];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80B93DE8 {
    /* 0x00 */ char pad0[0x2C];
    /* 0x2C */ f32 sp2C;                            /* inferred */
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ f32 sp34;                            /* inferred */
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80B93EA0 {
    /* 0x00 */ char pad0[0x34];
    /* 0x34 */ SkelAnime *sp34;                     /* inferred */
    /* 0x38 */ char pad38[0x6];                     /* maybe part of sp34[2]? */
    /* 0x3E */ u16 sp3E;                            /* inferred */
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80B943A0 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B943C0 {};              /* size 0x0 */

struct _mips2c_stack_func_80B943EC {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B94470 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80B9451C {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80B9461C {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B946B4 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B946FC {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80B948A8 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80B94A00 {
    /* 0x00 */ char pad0[0x2C];
    /* 0x2C */ SkelAnime *sp2C;                     /* inferred */
    /* 0x30 */ ? sp30;                              /* inferred */
    /* 0x30 */ char pad30[0x4];
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ char pad38[0x8];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80B94C5C {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B94D0C {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80B94E34 {
    /* 0x00 */ char pad0[0x38];
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ f32 sp3C;                            /* inferred */
    /* 0x40 */ f32 sp40;                            /* inferred */
    /* 0x44 */ WaterBox *sp44;                      /* inferred */
    /* 0x48 */ Actor *sp48;                         /* inferred */
    /* 0x4C */ char pad4C[0x4];
};                                                  /* size = 0x50 */

struct _mips2c_stack_func_80B95128 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80B95240 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B954C4 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B95598 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

void func_80B93310(Actor *arg0, Lights *arg1, GlobalContext *arg2); /* static */
void func_80B93468(EnZog *arg0, GlobalContext *arg1); /* static */
void func_80B939C0(Actor *arg0, s16 arg1, u8 arg2); /* static */
void func_80B93A48(EnZog *arg0, GlobalContext *arg1, EnZog *); /* static */
void func_80B93B44(EnZog *arg0, s16);               /* static */
void func_80B93BA8(EnZog *arg0, s16 arg1);          /* static */
s32 func_80B93BE0(EnZog *arg0, GlobalContext *arg1); /* static */
void func_80B93D2C(EnZog *arg0, GlobalContext *arg1); /* static */
void func_80B93DE8(PosRot *arg0, GlobalContext *arg1, s32 arg2); /* static */
s32 func_80B93EA0(Actor *arg0, GlobalContext *arg1); /* static */
void func_80B943EC(Actor *arg0, GlobalContext *arg1); /* static */
void func_80B954C4(void **arg0, s32 arg1, Gfx **arg2, Vec3s *arg3, Actor *arg4); /* static */
