typedef struct BgDblueWaterfall {
    /* 0x000 */ Actor actor;
    /* 0x144 */ ColliderCylinder unk144;            /* inferred */
    /* 0x190 */ void *unk190;                       /* inferred */
    /* 0x194 */ void (*actionFunc)(BgDblueWaterfall *, GlobalContext *);
    /* 0x198 */ f32 unk198;                         /* inferred */
    /* 0x19C */ s16 unk19C;                         /* inferred */
    /* 0x19E */ u8 unk19E;                          /* inferred */
    /* 0x19F */ u8 unk19F;                          /* inferred */
    /* 0x1A0 */ u8 unk1A0;                          /* inferred */
    /* 0x1A1 */ char pad1A1[0x2];                   /* maybe part of unk1A0[3]? */
    /* 0x1A3 */ s8 unk1A3;                          /* inferred */
    /* 0x1A4 */ s16 unk1A4;                         /* inferred */
    /* 0x1A6 */ char pad1A6[0x6];                   /* maybe part of unk1A4[4]? */
} BgDblueWaterfall;                                 /* size = 0x1AC */

struct _mips2c_stack_BgDblueWaterfall_Destroy {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_BgDblueWaterfall_Draw {
    /* 0x00 */ char pad0[0x18];
    /* 0x18 */ Gfx *sp18;                           /* inferred */
    /* 0x1C */ char pad1C[0x1C];                    /* maybe part of sp18[8]? */
    /* 0x38 */ s32 sp38;                            /* inferred */
    /* 0x3C */ Gfx *sp3C;                           /* inferred */
    /* 0x40 */ char pad40[0x4];
    /* 0x44 */ GraphicsContext *sp44;               /* inferred */
    /* 0x48 */ char pad48[0x8];
};                                                  /* size = 0x50 */

struct _mips2c_stack_BgDblueWaterfall_Init {
    /* 0x00 */ char pad0[0x24];
    /* 0x24 */ ColliderCylinder *sp24;              /* inferred */
    /* 0x28 */ char pad28[0x8];
};                                                  /* size = 0x30 */

struct _mips2c_stack_BgDblueWaterfall_Update {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B83C80 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B83D04 {
    /* 0x00 */ char pad0[0x18];
    /* 0x18 */ s32 sp18;                            /* inferred */
    /* 0x1C */ char pad1C[0x4];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80B83D58 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B83D94 {
    /* 0x00 */ char pad0[0x1C];
    /* 0x1C */ s32 sp1C;                            /* inferred */
    /* 0x20 */ s32 sp20;                            /* inferred */
    /* 0x24 */ char pad24[0x4];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80B83E1C {
    /* 0x00 */ char pad0[0x1C];
    /* 0x1C */ s32 sp1C;                            /* inferred */
    /* 0x20 */ s32 sp20;                            /* inferred */
    /* 0x24 */ char pad24[0x4];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80B83EA4 {
    /* 0x00 */ char pad0[0x98];
    /* 0x98 */ f32 sp98;                            /* inferred */
    /* 0x9C */ f32 sp9C;                            /* inferred */
    /* 0xA0 */ f32 spA0;                            /* inferred */
    /* 0xA4 */ f32 spA4;                            /* inferred */
    /* 0xA8 */ char padA8[0x4];
    /* 0xAC */ f32 spAC;                            /* inferred */
    /* 0xB0 */ f32 spB0;                            /* inferred */
    /* 0xB4 */ f32 spB4;                            /* inferred */
    /* 0xB8 */ f32 spB8;                            /* inferred */
    /* 0xBC */ f32 spBC;                            /* inferred */
    /* 0xC0 */ f32 spC0;                            /* inferred */
    /* 0xC4 */ f32 spC4;                            /* inferred */
    /* 0xC8 */ f32 spC8;                            /* inferred */
    /* 0xCC */ f32 spCC;                            /* inferred */
    /* 0xD0 */ f32 spD0;                            /* inferred */
    /* 0xD4 */ f32 spD4;                            /* inferred */
    /* 0xD8 */ f32 spD8;                            /* inferred */
    /* 0xDC */ f32 spDC;                            /* inferred */
    /* 0xE0 */ char padE0[0x8];
};                                                  /* size = 0xE8 */

struct _mips2c_stack_func_80B841A0 {
    /* 0x00 */ char pad0[0x94];
    /* 0x94 */ f32 sp94;                            /* inferred */
    /* 0x98 */ f32 sp98;                            /* inferred */
    /* 0x9C */ f32 sp9C;                            /* inferred */
};                                                  /* size = 0xA0 */

struct _mips2c_stack_func_80B84348 {
    /* 0x00 */ char pad0[0x70];
    /* 0x70 */ f32 sp70;                            /* inferred */
    /* 0x74 */ char pad74[0xC];                     /* maybe part of sp70[4]? */
    /* 0x80 */ f32 sp80;                            /* inferred */
    /* 0x84 */ f32 sp84;                            /* inferred */
    /* 0x88 */ f32 sp88;                            /* inferred */
    /* 0x8C */ f32 sp8C;                            /* inferred */
    /* 0x90 */ f32 sp90;                            /* inferred */
    /* 0x94 */ f32 sp94;                            /* inferred */
    /* 0x98 */ f32 sp98;                            /* inferred */
    /* 0x9C */ f32 sp9C;                            /* inferred */
    /* 0xA0 */ f32 spA0;                            /* inferred */
    /* 0xA4 */ char padA4[0xC];                     /* maybe part of spA0[4]? */
    /* 0xB0 */ f32 spB0;                            /* inferred */
    /* 0xB4 */ char padB4[0x4];
    /* 0xB8 */ f32 spB8;                            /* inferred */
    /* 0xBC */ char padBC[0x4];
};                                                  /* size = 0xC0 */

struct _mips2c_stack_func_80B84568 {
    /* 0x00 */ char pad0[0x2C];
    /* 0x2C */ CollisionContext *sp2C;              /* inferred */
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ s32 sp38;                            /* inferred */
    /* 0x3C */ WaterBox *sp3C;                      /* inferred */
    /* 0x40 */ CollisionPoly *sp40;                 /* inferred */
    /* 0x44 */ char pad44[0x4];
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_80B84610 {
    /* 0x00 */ char pad0[0x34];
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ char pad38[0x4];
    /* 0x3C */ f32 sp3C;                            /* inferred */
    /* 0x40 */ char pad40[0x8];
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_80B8484C {
    /* 0x00 */ char pad0[0x1C];
    /* 0x1C */ s32 sp1C;                            /* inferred */
    /* 0x20 */ char pad20[0x8];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80B84928 {
    /* 0x00 */ char pad0[0x20];
    /* 0x20 */ ColliderCylinder *sp20;              /* inferred */
    /* 0x24 */ CollisionCheckContext *sp24;         /* inferred */
    /* 0x28 */ s32 sp28;                            /* inferred */
    /* 0x2C */ s32 sp2C;                            /* inferred */
    /* 0x30 */ s32 sp30;                            /* inferred */
    /* 0x34 */ char pad34[0x4];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80B84AD4 {};              /* size 0x0 */

struct _mips2c_stack_func_80B84AEC {
    /* 0x00 */ char pad0[0x20];
    /* 0x20 */ s32 sp20;                            /* inferred */
    /* 0x24 */ char pad24[0x4];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80B84B9C {};              /* size 0x0 */

struct _mips2c_stack_func_80B84BCC {
    /* 0x00 */ char pad0[0x38];
    /* 0x38 */ s32 sp38;                            /* inferred */
    /* 0x3C */ char pad3C[0x4];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80B84EF0 {};              /* size 0x0 */

struct _mips2c_stack_func_80B84F20 {
    /* 0x00 */ char pad0[0x38];
};                                                  /* size = 0x38 */

s32 func_80B83C80(Vec3f *arg0, f32 *arg1, BgDblueWaterfall *); /* static */
s32 func_80B83D04(GlobalContext *arg0, GlobalContext *arg1); /* static */
s32 func_80B83D58(BgDblueWaterfall *arg0, GlobalContext *arg1); /* static */
void func_80B83D94(BgDblueWaterfall *arg0, GlobalContext *arg1, s32); /* static */
void func_80B83E1C(BgDblueWaterfall *arg0, GlobalContext *arg1, s32); /* static */
void func_80B83EA4(BgDblueWaterfall *arg0, GlobalContext *arg1, s32); /* static */
void func_80B841A0(Actor *arg0, GlobalContext *arg1, s32); /* static */
void func_80B84348(BgDblueWaterfall *arg0, GlobalContext *arg1, f32 arg2, f32 arg3, f32 arg4, f32 arg5, f32 arg6, f32 arg7, s32 arg8); /* static */
void func_80B84568(Actor *arg0, GlobalContext *arg1); /* static */
void func_80B84610(BgDblueWaterfall *arg0, GlobalContext *arg1, s32); /* static */
