? func_801A7328(s32, ?);                            /* extern */
void func_80B2C910(Vec3f *arg0, GraphicsContext **arg1, GraphicsContext *); /* static */
void func_80B2C9B8(EnPoh *arg0, GlobalContext *arg1); /* static */
void func_80B2CA4C(EnPoh *arg0);                    /* static */
void func_80B2CB60(EnPoh *arg0);                    /* static */
void func_80B2CD14(EnPoh *arg0);                    /* static */
void func_80B2CEC8(EnPoh *arg0);                    /* static */
void func_80B2CFF8(Actor *arg0);                    /* static */
void func_80B2D0E8(EnPoh *arg0);                    /* static */
void func_80B2D2C0(EnPoh *arg0);                    /* static */
void func_80B2D5DC(EnPoh *arg0);                    /* static */
void func_80B2D694(EnPoh *arg0);                    /* static */
void func_80B2D76C(Actor *arg0);                    /* static */
void func_80B2D924(Actor *arg0);                    /* static */
void func_80B2DAD0(EnPoh *arg0);                    /* static */
void func_80B2DC50(EnPoh *arg0, GlobalContext *arg1); /* static */
void func_80B2DDF8(void *arg0, s32 arg1);           /* static */
void func_80B2E0B0(EnPoh *arg0);                    /* static */
void func_80B2E1D8(EnPoh *arg0);                    /* static */
void func_80B2E3B0(EnPoh *arg0, GlobalContext *, s32); /* static */
void func_80B2E438(Actor *arg0, GlobalContext *arg1); /* static */
void func_80B2E55C(EnPoh *arg0);                    /* static */
void func_80B2E6C0(EnPoh *arg0);                    /* static */
void func_80B2E8E0(EnPoh *arg0);                    /* static */
s32 func_80B2ED14(GlobalContext *arg0, s32 arg1, Gfx **arg2, Vec3f *arg3, Vec3s *arg5, void **arg6); /* static */
void func_80B2EDD0(GraphicsContext **arg0, s32 arg1, Gfx **arg2, Vec3s *arg3, Actor *arg4, Gfx **arg5); /* static */
void func_80B2F328(EnPoh *arg0);                    /* static */
void func_80B2F37C(Actor *arg0, GraphicsContext **arg1); /* static */
extern AnimationHeader D_060001A8;
extern AnimationHeader D_060004EC;
extern AnimationHeader D_060006E0;
extern AnimationHeader D_06000A60;
extern AnimationHeader D_060011C4;
extern AnimationHeader D_060015B0;
extern ? D_06002608;
extern Gfx D_06002D28;
extern ? D_06003850;
extern SkeletonHeader D_060050D0;
static ColliderCylinderInit D_80B2F680 = {
    {3, 0, 8, 0x39, 0x10, 1},
    {0, {0, 0, 0}, {0xF7CBFFFE, 0, 0}, 0, 5, 1},
    {0x14, 0x28, 0x14, {0, 0, 0}},
};
static ColliderJntSphElementInit D_80B2F6AC = {
    {0, {0xF7CFFFFF, 0, 8}, {0, 0, 0}, 1, 0, 1},
    {0x12, {{0, 0x578, 0}, 0xA}, 0x64},
};
static ColliderJntSphInit D_80B2F6D0 = {{3, 0x11, 9, 0x39, 0x10, 0}, 1, &D_80B2F6AC};
static DamageTable D_80B2F6E0 = {
    {
        0xF0,
        1,
        0,
        1,
        1,
        1,
        0,
        0xE0,
        1,
        1,
        0,
        1,
        1,
        0x42,
        1,
        1,
        1,
        2,
        0x10,
        0,
        0,
        0,
        1,
        1,
        1,
        0,
        0,
        0,
        0,
        0,
        0,
        1,
    },
};
static CollisionCheckInfoInit D_80B2F700 = {3, 0x19, 0x32, 0x32};
static InitChainEntry D_80B2F708;                   /* unable to generate initializer */
static Vec3f D_80B2F710 = {0.0f, 3.0f, 0.0f};
static ? D_80B2F71C;                                /* unable to generate initializer */
static Vec3f D_80B2F734 = {
    {-600.0f, 500.0f, 1700.0f},
    {-600.0f, 500.0f, -1700.0f},
    {1000.0f, 1700.0f, 0.0f},
};

typedef struct EnPoh {
    /* 0x0000 */ Actor actor;
    /* 0x0144 */ SkelAnime unk144;                  /* inferred */
    /* 0x0188 */ void (*actionFunc)(EnPoh *, GlobalContext *);
    /* 0x018C */ u8 unk18C;                         /* inferred */
    /* 0x018D */ u8 unk18D;                         /* inferred */
    /* 0x018E */ s16 unk18E;                        /* inferred */
    /* 0x0190 */ s16 unk190;                        /* inferred */
    /* 0x0192 */ s16 unk192;                        /* inferred */
    /* 0x0194 */ u8 unk194;                         /* inferred */
    /* 0x0195 */ u8 unk195;                         /* inferred */
    /* 0x0196 */ u8 unk196;                         /* inferred */
    /* 0x0197 */ u8 unk197;                         /* inferred */
    /* 0x0198 */ u8 unk198;                         /* inferred */
    /* 0x0199 */ u8 unk199;                         /* inferred */
    /* 0x019A */ u8 unk19A;                         /* inferred */
    /* 0x019B */ s8 unk19B;                         /* inferred */
    /* 0x019C */ Vec3s unk19C;                      /* inferred */
    /* 0x01A2 */ char pad1A2[0x78];                 /* maybe part of unk19C[21]? */
    /* 0x021A */ Vec3s unk21A;                      /* inferred */
    /* 0x0220 */ char pad220[0x78];                 /* maybe part of unk21A[21]? */
    /* 0x0298 */ f32 unk298;                        /* inferred */
    /* 0x029C */ f32 unk29C;                        /* inferred */
    /* 0x02A0 */ Vec3f unk2A0;                      /* inferred */
    /* 0x02AC */ char pad2AC[0x6C];                 /* maybe part of unk2A0[10]? */
    /* 0x0318 */ LightNode *unk318;                 /* inferred */
    /* 0x031C */ LightInfo unk31C;                  /* inferred */
    /* 0x032A */ char pad32A[0x2];
    /* 0x032C */ ColliderCylinder unk32C;           /* inferred */
    /* 0x0378 */ ColliderJntSph unk378;             /* inferred */
    /* 0x0398 */ ColliderJntSphElement unk398;      /* inferred */
    /* 0x03D8 */ MtxF unk3D8;                       /* inferred */
} EnPoh;                                            /* size 0x418 */

void EnPoh_Init(Actor *thisx, GlobalContext *globalCtx) {
    EnPoh *this = (EnPoh *) thisx;
    LightInfo *sp34;
    LightInfo *temp_a2;

    Actor_ProcessInitChain(&this->actor, &D_80B2F708);
    ActorShape_Init(&this->actor.shape, 0.0f, func_800B3FC0, 30.0f);
    Collider_InitAndSetJntSph(globalCtx, &this->unk378, &this->actor, &D_80B2F6D0, &this->unk398);
    this->unk378.elements->dim.worldSphere.radius = 0;
    this->unk378.elements->dim.worldSphere.center.x = (s16) (s32) this->actor.world.pos.x;
    this->unk378.elements->dim.worldSphere.center.y = (s16) (s32) this->actor.world.pos.y;
    this->unk378.elements->dim.worldSphere.center.z = (s16) (s32) this->actor.world.pos.z;
    Collider_InitAndSetCylinder(globalCtx, &this->unk32C, &this->actor, &D_80B2F680);
    CollisionCheck_SetInfo(&this->actor.colChkInfo, &D_80B2F6E0, &D_80B2F700);
