? func_800B31BC(GlobalContext *, Vec3f *, ?, ?, s32, s32); /* extern */
? func_800BC848(Actor *, GlobalContext *, s16, s16, ?); /* extern */
? func_80169940(GlobalContext *, s16, s32);         /* extern */
void func_80A7C990(Actor *arg0, s32 arg1);          /* static */
void func_80A7CA18(Actor *arg0, GlobalContext *arg1, f32 arg2, f32 arg3); /* static */
void func_80A7CBC4(Actor *arg0, GlobalContext *arg1, f32 arg2, f32 arg3, f32 arg4, f32 arg5, f32 arg6, f32 arg7); /* static */
void func_80A7CD08(Actor *arg0);                    /* static */
void func_80A7D140(EnEgol *arg0);                   /* static */
void func_80A7D168(EnEgol *arg0, GlobalContext *arg1); /* static */
void func_80A7D1E4(Actor *arg0);                    /* static */
void func_80A7D240(void *arg0, ? arg1);             /* static */
void func_80A7D27C(Actor *arg0, Actor *, Actor *, GlobalContext *); /* static */
void func_80A7D2C4(Actor *arg0, GlobalContext *arg1); /* static */
void func_80A7D710(Actor *arg0);                    /* static */
void func_80A7D780(Actor *arg0, GlobalContext *arg1); /* static */
void func_80A7DAAC(Actor *arg0);                    /* static */
void func_80A7DAF0(Actor *arg0, GlobalContext *arg1); /* static */
void func_80A7E2E8(Actor *arg0, Actor *);           /* static */
void func_80A7E344(Actor *arg0);                    /* static */
void func_80A7E478(Actor *arg0);                    /* static */
void func_80A7E4B4(Actor *arg0, GlobalContext *arg1); /* static */

void func_80A80750(EnEgol *arg0, GlobalContext *arg1); /* static */
void func_80A80904(EnEgol *arg0, GlobalContext *arg1); /* static */
extern ? D_04023428;
extern ? D_06000040;
extern ? D_06001170;
extern ? D_060013B0;
extern ? D_06001918;
extern ? D_060041F0;
extern void D_060094E4;
extern FlexSkeletonHeader D_06009664;
extern AnimationHeader D_0600EE4C;
static ColliderJntSphElementInit D_80A80C40 = {
    {2, {0xF7CFFFFF, 0, 0}, {0xF7CFFFFF, 0, 0}, 0, 1, 0},
    {0xE, {{0, 0, 0}, 0}, 1},
};
static ColliderJntSphElementInit D_80A80C64 = {
    {
        {2, {0xF7CFFFFF, 4, 0x10}, {0xF7CFFFFF, 0, 0}, 1, 1, 1},
        {6, {{0, 0, 0}, 0}, 1},
    },
    {
        {2, {0xF7CFFFFF, 4, 0x10}, {0xF7CFFFFF, 0, 0}, 1, 1, 1},
        {9, {{0, 0, 0}, 0}, 1},
    },
    {{2, {0xF7CFFFFF, 0, 0}, {0xF7CFFFFF, 0, 0}, 0, 1, 1}, {3, {{0, 0, 0}, 0}, 1}},
    {{2, {0xF7CFFFFF, 0, 0}, {0xF7CFFFFF, 0, 0}, 0, 1, 0}, {4, {{0, 0, 0}, 0}, 1}},
    {{2, {0xF7CFFFFF, 0, 0}, {0xF7CFFFFF, 0, 0}, 0, 1, 0}, {7, {{0, 0, 0}, 0}, 1}},
    {
        {2, {0xF7CFFFFF, 0, 0}, {0xF7CFFFFF, 0, 0}, 0, 1, 1},
        {0x17, {{0, 0, 0}, 0}, 1},
    },
};
static ColliderJntSphInit D_80A80D3C = {{9, 0x11, 9, 0x39, 0x10, 0}, 6, &D_80A80C64};
static ColliderJntSphInit D_80A80D4C = {{0xA, 0x11, 9, 0x39, 0x10, 0}, 1, &D_80A80C40};
static ColliderQuadInit D_80A80D5C = {
    {0xA, 0x11, 0, 0, 0, 3},
    {0, {0xF7CFFFFF, 7, 0x10}, {0, 0, 0}, 0x81, 0, 0},
    {
        {
            {0.0f, 0.0f, 0.0f},
            {0.0f, 0.0f, 0.0f},
            {0.0f, 0.0f, 0.0f},
            {0.0f, 0.0f, 0.0f},
        },
    },
};
static DamageTable D_80A80DAC = {
    {
        0xF0,
        0xF0,
        0,
        0xE2,
        0xE1,
        0xE1,
        0,
        0xE1,
        0xE1,
        0xF0,
        0xF0,
        0xE2,
        0xE2,
        0x42,
        0xE1,
        0xE1,
        0xE1,
        0xE2,
        0xF0,
        0,
        0,
        0xF0,
        0xE1,
        0xE1,
        0xF0,
        0,
        0,
        0,
        0,
        0,
        0,
        0xF1,
    },
};
static ? D_80A80DCC;                                /* unable to generate initializer */
static ? D_80A80DD8;                                /* unable to generate initializer */
static ? D_80A80DE4;                                /* unable to generate initializer */
static ? D_80A80DEA;                                /* unable to generate initializer */
static ? D_80A80E0C;                                /* unable to generate initializer */
static ? D_80A80E48;                                /* unable to generate initializer */
static ? D_80A80E58;                                /* unable to generate initializer */
static ? D_80A80E60;                                /* unable to generate initializer */
static ? D_80A80E6C;                                /* unable to generate initializer */
static ? D_80A80E78;                                /* unable to generate initializer */
static s32 D_80A80EB4 = 0x3CA3D70A;                 /* const */

typedef struct ActorContext {
    /* 0x0000 */ Vec3f unk0;                        /* inferred */
    /* 0x0002 */ u8 unk2;                           /* overlap */
    /* 0x0003 */ u8 unk3;
    /* 0x0004 */ s8 unk4;
    /* 0x0005 */ u8 unk5;
    /* 0x0006 */ char pad6[0x5];                    /* maybe part of unk5[6]? */
    /* 0x000B */ s8 unkB;
    /* 0x000C */ s16 unkC;
    /* 0x000E */ u8 totalLoadedActors;
    /* 0x000F */ u8 undrawnActorCount;
    /* 0x0010 */ ActorListEntry actorList[12];
    /* 0x00A0 */ Actor *undrawnActors[32];
    /* 0x0120 */ TargetContext targetContext;
    /* 0x01B8 */ u32 switchFlags[4];
    /* 0x01C8 */ u32 chestFlags;
    /* 0x01CC */ u32 clearedRooms;
    /* 0x01D0 */ u32 clearedRoomsTemp;
    /* 0x01D4 */ u32 collectibleFlags[4];
    /* 0x01E4 */ TitleCardContext titleCtxt;
    /* 0x01F4 */ u8 unk1F4;
    /* 0x01F5 */ u8 unk1F5;
    /* 0x01F6 */ char pad1F6[0x2];                  /* maybe part of unk1F5[3]? */
    /* 0x01F8 */ f32 unk1F8;
    /* 0x01FC */ Vec3f unk1FC;
    /* 0x0208 */ char pad208[0x48];                 /* maybe part of unk1FC[7]? */
    /* 0x0250 */ void *unk250;
    /* 0x0254 */ u32 unk254[5];
    /* 0x0268 */ u8 unk268;
    /* 0x0269 */ char pad269[0xF];                  /* maybe part of unk268[16]? */
    /* 0x0278 */ u16 unk278;
    /* 0x027A */ char pad27A[0xA];                  /* maybe part of unk278[6]? */
} ActorContext;                                     /* size 0x284 */

typedef struct EnEgol {
    /* 0x0000 */ Actor actor;
    /* 0x0144 */ SkelAnime unk144;                  /* inferred */
    /* 0x0188 */ Vec3s unk188;                      /* inferred */
    /* 0x018E */ char pad18E[0x8A];                 /* maybe part of unk188[24]? */
    /* 0x0218 */ Vec3s unk218;                      /* inferred */
    /* 0x021E */ char pad21E[0x8A];                 /* maybe part of unk218[24]? */
    /* 0x02A8 */ void (*actionFunc)(EnEgol *, GlobalContext *);
    /* 0x02AC */ Path *unk2AC;                      /* inferred */
    /* 0x02B0 */ char pad2B0[0x2];
    /* 0x02B2 */ s16 unk2B2;                        /* inferred */
    /* 0x02B4 */ s16 unk2B4;                        /* inferred */
    /* 0x02B6 */ s16 unk2B6;                        /* inferred */
    /* 0x02B8 */ char pad2B8[0x2];                  /* maybe part of unk2B6[2]? */
    /* 0x02BA */ s16 unk2BA;                        /* inferred */
    /* 0x02BC */ s16 unk2BC;                        /* inferred */
    /* 0x02BE */ char pad2BE[0x2];                  /* maybe part of unk2BC[2]? */
    /* 0x02C0 */ Vec3f unk2C0;                      /* inferred */
    /* 0x02CC */ char pad2CC[0x86];
    /* 0x0352 */ s16 unk352;                        /* inferred */
    /* 0x0354 */ s32 unk354;                        /* inferred */
    /* 0x0358 */ u8 unk358;                         /* inferred */
    /* 0x0359 */ char pad359[0x3];                  /* maybe part of unk358[4]? */
    /* 0x035C */ f32 unk35C;                        /* inferred */
    /* 0x0360 */ f32 unk360;                        /* inferred */
    /* 0x0364 */ f32 unk364;                        /* inferred */
    /* 0x0368 */ char pad368[0x4];                  /* maybe part of unk364[2]? */
    /* 0x036C */ f32 unk36C;                        /* inferred */
    /* 0x0370 */ f32 unk370;                        /* inferred */
    /* 0x0374 */ s16 unk374;                        /* inferred */
    /* 0x0376 */ s16 unk376;                        /* inferred */
    /* 0x0378 */ s16 unk378;                        /* inferred */
    /* 0x037A */ char pad37A[0x6];                  /* maybe part of unk378[4]? */
    /* 0x0380 */ s32 unk380;                        /* inferred */
    /* 0x0384 */ s16 unk384;                        /* inferred */
    /* 0x0386 */ char pad386[0x2];                  /* maybe part of unk384[2]? */
    /* 0x0388 */ s32 unk388;                        /* inferred */
    /* 0x038C */ s32 unk38C;                        /* inferred */
    /* 0x0390 */ char pad390[0xC];                  /* maybe part of unk38C[4]? */
    /* 0x039C */ Vec3f unk39C;                      /* inferred */
    /* 0x03A8 */ Vec3f unk3A8;                      /* inferred */
    /* 0x03B4 */ Vec3f unk3B4;                      /* inferred */
    /* 0x03C0 */ Vec3f unk3C0;                      /* inferred */
    /* 0x03CC */ char pad3CC[0x48];                 /* maybe part of unk3C0[7]? */
    /* 0x0414 */ s16 unk414;                        /* inferred */
    /* 0x0416 */ s16 unk416;                        /* inferred */
    /* 0x0418 */ char pad418[0x2];                  /* maybe part of unk416[2]? */
    /* 0x041A */ s16 unk41A;                        /* inferred */
    /* 0x041C */ s16 unk41C;                        /* inferred */
    /* 0x041E */ char pad41E[0xE];                  /* maybe part of unk41C[8]? */
    /* 0x042C */ s16 unk42C;                        /* inferred */
    /* 0x042E */ char pad42E[0x2];                  /* maybe part of unk42C[2]? */
    /* 0x0430 */ u32 unk430;                        /* inferred */
    /* 0x0434 */ char pad434[0x1770];               /* maybe part of unk430[1501]? */
    /* 0x1BA4 */ ColliderJntSph unk1BA4;            /* inferred */
    /* 0x1BC4 */ ColliderJntSphElement unk1BC4;     /* inferred */
    /* 0x1C04 */ char pad1C04[0x140];               /* maybe part of unk1BC4[6]? */
    /* 0x1D44 */ ColliderJntSph unk1D44;            /* inferred */
    /* 0x1D64 */ ColliderJntSphElement unk1D64;     /* inferred */
    /* 0x1DA4 */ ColliderQuad unk1DA4;              /* inferred */
    /* 0x1E24 */ char pad1E24[0x4C];
} EnEgol;                                           /* size 0x1E70 */

void func_80A7C990(Actor *arg0, s32 arg1) {
    f32 temp_f0;
    s32 temp_v1;

    arg0->unk354 = arg1;
    temp_f0 = (f32) SkelAnime_GetFrameCount(*(&D_80A80E0C + (arg1 * 4)));
    temp_v1 = arg0->unk354;
    arg0->unk35C = temp_f0;
    SkelAnime_ChangeAnim(arg0 + 0x144, *(&D_80A80E0C + (temp_v1 * 4)), 1.0f, 0.0f, temp_f0, (u8) (s32) *(&D_80A80E48 + temp_v1), 0.0f);
}

void func_80A7CA18(Actor *arg0, GlobalContext *arg1, f32 arg2, f32 arg3) {
    Vec3f sp4C;
    void *sp48;
    SkelAnime *sp3C;
    SkelAnime *temp_a0;
    s32 temp_v0;
    void *temp_a2;
    s16 phi_v1;

    temp_a0 = arg0 + 0x144;
    sp3C = temp_a0;
    if ((func_801378B8(temp_a0, arg2) != 0) || (func_801378B8(temp_a0, arg3) != 0)) {
        temp_a2 = arg1->actorCtx.actorList[2].first;
        sp48 = temp_a2;
        Audio_PlayActorSound2(arg0, 0x3A06U);
