typedef struct EnEgol {
    /* 0x0000 */ Actor actor;
    /* 0x0144 */ SkelAnime unk_144;                 /* inferred */
    /* 0x0188 */ Vec3s unk_188;                     /* inferred */
    /* 0x018E */ char pad_18E[0x8A];                /* maybe part of unk_188[24]? */
    /* 0x0218 */ Vec3s unk_218;                     /* inferred */
    /* 0x021E */ char pad_21E[0x8A];                /* maybe part of unk_218[24]? */
    /* 0x02A8 */ void (*actionFunc)(EnEgol *, GlobalContext *);
    /* 0x02AC */ Path *unk_2AC;                     /* inferred */
    /* 0x02B0 */ char pad_2B0[0x2];
    /* 0x02B2 */ s16 unk_2B2;                       /* inferred */
    /* 0x02B4 */ s16 unk_2B4;                       /* inferred */
    /* 0x02B6 */ s16 unk_2B6;                       /* inferred */
    /* 0x02B8 */ char pad_2B8[0x2];
    /* 0x02BA */ s16 unk_2BA;                       /* inferred */
    /* 0x02BC */ s16 unk_2BC;                       /* inferred */
    /* 0x02BE */ char pad_2BE[0x2];
    /* 0x02C0 */ Vec3f unk_2C0;                     /* inferred */
    /* 0x02CC */ char pad_2CC[0x86];                /* maybe part of unk_2C0[12]? */
    /* 0x0352 */ s16 unk_352;                       /* inferred */
    /* 0x0354 */ s32 unk_354;                       /* inferred */
    /* 0x0358 */ u8 unk_358;                        /* inferred */
    /* 0x0359 */ char pad_359[0x7];                 /* maybe part of unk_358[8]? */
    /* 0x0360 */ f32 unk_360;                       /* inferred */
    /* 0x0364 */ f32 unk_364;                       /* inferred */
    /* 0x0368 */ char pad_368[0x4];
    /* 0x036C */ f32 unk_36C;                       /* inferred */
    /* 0x0370 */ f32 unk_370;                       /* inferred */
    /* 0x0374 */ s16 unk_374;                       /* inferred */
    /* 0x0376 */ s16 unk_376;                       /* inferred */
    /* 0x0378 */ s16 unk_378;                       /* inferred */
    /* 0x037A */ char pad_37A[0x6];                 /* maybe part of unk_378[4]? */
    /* 0x0380 */ s32 unk_380;                       /* inferred */
    /* 0x0384 */ s16 unk_384;                       /* inferred */
    /* 0x0386 */ char pad_386[0x2];
    /* 0x0388 */ s32 unk_388;                       /* inferred */
    /* 0x038C */ char pad_38C[0x10];                /* maybe part of unk_388[5]? */
    /* 0x039C */ Vec3f unk_39C;                     /* inferred */
    /* 0x03A8 */ Vec3f unk_3A8;                     /* inferred */
    /* 0x03B4 */ Vec3f unk_3B4;                     /* inferred */
    /* 0x03C0 */ Vec3f unk_3C0;                     /* inferred */
    /* 0x03CC */ char pad_3CC[0x48];                /* maybe part of unk_3C0[7]? */
    /* 0x0414 */ s16 unk_414;                       /* inferred */
    /* 0x0416 */ s16 unk_416;                       /* inferred */
    /* 0x0418 */ char pad_418[0x2];
    /* 0x041A */ s16 unk_41A;                       /* inferred */
    /* 0x041C */ s16 unk_41C;                       /* inferred */
    /* 0x041E */ char pad_41E[0xE];                 /* maybe part of unk_41C[8]? */
    /* 0x042C */ s16 unk_42C;                       /* inferred */
    /* 0x042E */ char pad_42E[0x2];
    /* 0x0430 */ u32 unk_430;                       /* inferred */
    /* 0x0434 */ char pad_434[0x1770];              /* maybe part of unk_430[1501]? */
    /* 0x1BA4 */ ColliderJntSph unk_1BA4;           /* inferred */
    /* 0x1BC4 */ ColliderJntSphElement unk_1BC4;    /* inferred */
    /* 0x1C04 */ char pad_1C04[0x140];              /* maybe part of unk_1BC4[6]? */
    /* 0x1D44 */ ColliderJntSph unk_1D44;           /* inferred */
    /* 0x1D64 */ ColliderJntSphElement unk_1D64;    /* inferred */
    /* 0x1DA4 */ ColliderQuad unk_1DA4;             /* inferred */
    /* 0x1E24 */ char pad_1E24[0x4C];
} EnEgol;                                           /* size = 0x1E70 */

typedef struct {
    /* 0x00 */ Vec3f pos;
    /* 0x0C */ Vec3s rot;
    /* 0x12 */ s16 unk_12;                          /* inferred */
} PosRot;                                           /* size = 0x14 */

struct _mips2c_stack_EnEgol_Destroy {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnEgol_Draw {
    /* 0x00 */ char pad_0[0x50];
    /* 0x50 */ MtxF *sp50;                          /* inferred */
    /* 0x54 */ ? *sp54;                             /* inferred */
    /* 0x58 */ char pad_58[0x60];
};                                                  /* size = 0xB8 */

struct _mips2c_stack_EnEgol_Init {
    /* 0x00 */ char pad_0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_EnEgol_Update {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ Vec3f *sp2C;                         /* inferred */
    /* 0x30 */ Vec3f *sp30;                         /* inferred */
    /* 0x34 */ Vec3f *sp34;                         /* inferred */
    /* 0x38 */ ColliderQuadDim *sp38;               /* inferred */
    /* 0x3C */ Vec3f *sp3C;                         /* inferred */
    /* 0x40 */ PosRot *sp40;                        /* inferred */
    /* 0x44 */ char pad_44[0x14];                   /* maybe part of sp40[6]? */
    /* 0x58 */ Actor *sp58;                         /* inferred */
    /* 0x5C */ char pad_5C[0x4];
};                                                  /* size = 0x60 */

struct _mips2c_stack_func_80A7C990 {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80A7CA18 {
    /* 0x00 */ char pad_0[0x3C];
    /* 0x3C */ SkelAnime *sp3C;                     /* inferred */
    /* 0x40 */ char pad_40[0x8];                    /* maybe part of sp3C[3]? */
    /* 0x48 */ void *sp48;                          /* inferred */
    /* 0x4C */ ? sp4C;                              /* inferred */
    /* 0x4C */ char pad_4C[0x4];
    /* 0x50 */ f32 sp50;                            /* inferred */
    /* 0x54 */ char pad_54[0x4];
};                                                  /* size = 0x58 */

struct _mips2c_stack_func_80A7CBC4 {
    /* 0x00 */ char pad_0[0x48];
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_80A7CD08 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A7D140 {};              /* size 0x0 */

struct _mips2c_stack_func_80A7D168 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A7D1E4 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A7D240 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A7D27C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A7D2C4 {
    /* 0x00 */ char pad_0[0x38];
    /* 0x38 */ SkelAnime *sp38;                     /* inferred */
    /* 0x3C */ char pad_3C[0x1C];                   /* maybe part of sp38[8]? */
    /* 0x58 */ f32 sp58;                            /* inferred */
    /* 0x5C */ f32 sp5C;                            /* inferred */
    /* 0x60 */ char pad_60[0x4];
    /* 0x64 */ void *sp64;                          /* inferred */
    /* 0x68 */ f32 sp68;                            /* inferred */
    /* 0x6C */ char pad_6C[0x2];
    /* 0x6E */ s16 sp6E;                            /* inferred */
};                                                  /* size = 0x70 */

struct _mips2c_stack_func_80A7D710 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80A7D780 {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ Actor *sp2C;                         /* inferred */
    /* 0x30 */ char pad_30[0x10];                   /* maybe part of sp2C[5]? */
    /* 0x40 */ void *sp40;                          /* inferred */
    /* 0x44 */ f32 sp44;                            /* inferred */
    /* 0x48 */ f32 sp48;                            /* inferred */
    /* 0x4C */ char pad_4C[0x14];
};                                                  /* size = 0x60 */

struct _mips2c_stack_func_80A7DAAC {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A7DAF0 {
    /* 0x00 */ char pad_0[0x3C];
    /* 0x3C */ void (**sp3C)(Actor *, Lights *, GlobalContext *); /* inferred */
    /* 0x40 */ Vec3f *sp40;                         /* inferred */
    /* 0x44 */ char pad_44[0x4];
    /* 0x48 */ ActorContext *sp48;                  /* inferred */
    /* 0x4C */ char pad_4C[0x8];                    /* maybe part of sp48[3]? */
    /* 0x54 */ Actor *sp54;                         /* inferred */
    /* 0x58 */ char pad_58[0x10];                   /* maybe part of sp54[5]? */
    /* 0x68 */ f32 sp68;                            /* inferred */
    /* 0x6C */ f32 sp6C;                            /* inferred */
    /* 0x70 */ s16 sp70;                            /* inferred */
    /* 0x72 */ char pad_72[0x2];
    /* 0x74 */ s16 sp74;                            /* inferred */
    /* 0x76 */ char pad_76[0x2];
    /* 0x78 */ u32 sp78;                            /* inferred */
    /* 0x7C */ f32 sp7C;                            /* inferred */
    /* 0x80 */ char pad_80[0x8];                    /* maybe part of sp7C[3]? */
    /* 0x88 */ CollisionPoly *sp88;                 /* inferred */
    /* 0x8C */ char pad_8C[0x4];
    /* 0x90 */ f32 sp90;                            /* inferred */
    /* 0x94 */ f32 sp94;                            /* inferred */
    /* 0x98 */ f32 sp98;                            /* inferred */
    /* 0x9C */ char pad_9C[0x4];
};                                                  /* size = 0xA0 */

struct _mips2c_stack_func_80A7E2E8 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A7E344 {
    /* 0x00 */ char pad_0[0x2E];
    /* 0x2E */ s16 sp2E;                            /* inferred */
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ s32 sp34;                            /* inferred */
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80A7E478 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A7E4B4 {
    /* 0x00 */ char pad_0[0x4C];
    /* 0x4C */ PosRot *sp4C;                        /* inferred */
    /* 0x50 */ char pad_50[0x8];                    /* maybe part of sp4C[3]? */
    /* 0x58 */ f32 sp58;                            /* inferred */
    /* 0x5C */ f32 sp5C;                            /* inferred */
    /* 0x60 */ f32 sp60;                            /* inferred */
    /* 0x64 */ f32 sp64;                            /* inferred */
    /* 0x68 */ char pad_68[0xC];                    /* maybe part of sp64[4]? */
    /* 0x74 */ f32 sp74;                            /* inferred */
};                                                  /* size = 0x78 */

struct _mips2c_stack_func_80A7E7EC {};              /* size 0x0 */

struct _mips2c_stack_func_80A7E820 {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ f32 sp2C;                            /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80A7E924 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A7E970 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A7E9D0 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A7EA28 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A7EA88 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A7EAD8 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A7EB14 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A7EB54 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A7EB90 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A7EBDC {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A7EC84 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80A7ED14 {
    /* 0x00 */ char pad_0[0x90];
    /* 0x90 */ ? sp90;                              /* inferred */
    /* 0x90 */ char pad_90[0x10];
};                                                  /* size = 0xA0 */

struct _mips2c_stack_func_80A7EFB8 {
    /* 0x00 */ char pad_0[0x3C];
    /* 0x3C */ Vec3f *sp3C;                         /* inferred */
    /* 0x40 */ void (**sp40)(Actor *, Lights *, GlobalContext *); /* inferred */
    /* 0x44 */ Vec3f *sp44;                         /* inferred */
    /* 0x48 */ Vec3f *sp48;                         /* inferred */
    /* 0x4C */ Vec3f *sp4C;                         /* inferred */
    /* 0x50 */ void (**sp50)(Actor *, GlobalContext *); /* inferred */
    /* 0x54 */ char pad_54[0x8];                    /* maybe part of sp50[3]? */
    /* 0x5C */ f32 sp5C;                            /* inferred */
    /* 0x60 */ f32 sp60;                            /* inferred */
    /* 0x64 */ f32 sp64;                            /* inferred */
    /* 0x68 */ s32 sp68;                            /* inferred */
    /* 0x6C */ char pad_6C[0x2];
    /* 0x6E */ s16 sp6E;                            /* inferred */
};                                                  /* size = 0x70 */

struct _mips2c_stack_func_80A7F8E8 {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ s32 *sp18;                           /* inferred */
    /* 0x1C */ char pad_1C[0x1C];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80A7FAFC {
    /* 0x00 */ char pad_0[0x3C];
    /* 0x3C */ f32 sp3C;                            /* inferred */
    /* 0x40 */ f32 sp40;                            /* inferred */
    /* 0x44 */ f32 sp44;                            /* inferred */
    /* 0x48 */ ? sp48;                              /* inferred */
    /* 0x48 */ char pad_48[0x8];
    /* 0x50 */ f32 sp50;                            /* inferred */
    /* 0x54 */ ? sp54;                              /* inferred */
    /* 0x54 */ char pad_54[0xC];
    /* 0x60 */ ? sp60;                              /* inferred */
    /* 0x60 */ char pad_60[0x10];
};                                                  /* size = 0x70 */

struct _mips2c_stack_func_80A80508 {
    /* 0x00 */ char pad_0[0x50];
};                                                  /* size = 0x50 */

struct _mips2c_stack_func_80A80750 {};              /* size 0x0 */

struct _mips2c_stack_func_80A80904 {
    /* 0x00 */ char pad_0[0x48];
};                                                  /* size = 0x48 */

? func_800B31BC(GlobalContext *, f32 *, ?, ?, s32, s32); /* extern */
? func_800BC848(Actor *, GlobalContext *, s16, s16, ?); /* extern */
? func_80169940(GlobalContext *, s16, s32);         /* extern */
void func_80A7C990(Actor *arg0, s32 arg1);          /* static */
void func_80A7CA18(Actor *arg0, GlobalContext *arg1, f32 arg2, f32 arg3); /* static */
void func_80A7CBC4(Actor *arg0, GlobalContext *arg1, f32 arg2, f32 arg3, f32 arg4, f32 arg5, f32 arg6, f32 arg7); /* static */
void func_80A7CD08(Actor *arg0);                    /* static */
void func_80A7D140(EnEgol *arg0);                   /* static */
void func_80A7D168(void *arg0, ? arg1);             /* static */
void func_80A7D1E4(Actor *arg0);                    /* static */
void func_80A7D240(void *arg0, ? arg1);             /* static */
void func_80A7D27C(Actor *arg0, Actor *, Actor *, GlobalContext *); /* static */
