CRASHED

typedef struct EnOwl {
    /* 0x000 */ Actor actor;
    /* 0x144 */ ColliderCylinder unk144;            /* inferred */
    /* 0x190 */ SkelAnime unk190;                   /* inferred */
    /* 0x1D4 */ Vec3s unk1D4;                       /* inferred */
    /* 0x1DA */ char pad1DA[0x78];                  /* maybe part of unk1D4[21]? */
    /* 0x252 */ Vec3s unk252;                       /* inferred */
    /* 0x258 */ char pad258[0x78];                  /* maybe part of unk252[21]? */
    /* 0x2D0 */ SkelAnime unk2D0;                   /* inferred */
    /* 0x314 */ Vec3s unk314;                       /* inferred */
    /* 0x31A */ char pad31A[0x5A];                  /* maybe part of unk314[16]? */
    /* 0x374 */ Vec3s unk374;                       /* inferred */
    /* 0x37A */ char pad37A[0x5A];                  /* maybe part of unk374[16]? */
    /* 0x3D4 */ SkelAnime *unk3D4;                  /* inferred */
    /* 0x3D8 */ s16 unk3D8;                         /* inferred */
    /* 0x3DA */ s16 unk3DA;                         /* inferred */
    /* 0x3DC */ s16 unk3DC;                         /* inferred */
    /* 0x3DE */ s16 unk3DE;                         /* inferred */
    /* 0x3E0 */ s16 unk3E0;                         /* inferred */
    /* 0x3E2 */ s16 unk3E2;                         /* inferred */
    /* 0x3E4 */ char pad3E4[0x4];                   /* maybe part of unk3E2[3]? */
    /* 0x3E8 */ u16 unk3E8;                         /* inferred */
    /* 0x3EA */ s16 unk3EA;                         /* inferred */
    /* 0x3EC */ s16 unk3EC;                         /* inferred */
    /* 0x3EE */ char pad3EE[0x2];
    /* 0x3F0 */ f32 unk3F0;                         /* inferred */
    /* 0x3F4 */ void *unk3F4;                       /* inferred */
    /* 0x3F8 */ s32 unk3F8;                         /* inferred */
    /* 0x3FA */ s16 unk3FA;                         /* overlap; inferred */
    /* 0x3FC */ char pad3FC[0x4];                   /* maybe part of unk3FA[3]? */
    /* 0x400 */ s16 unk400;                         /* inferred */
    /* 0x402 */ char pad402[0x4];                   /* maybe part of unk400[3]? */
    /* 0x406 */ s16 unk406;                         /* inferred */
    /* 0x408 */ u8 unk408;                          /* inferred */
    /* 0x409 */ u8 unk409;                          /* inferred */
    /* 0x40A */ u8 unk40A;                          /* inferred */
    /* 0x40B */ u8 unk40B;                          /* inferred */
    /* 0x40C */ u8 unk40C;                          /* inferred */
    /* 0x40D */ u8 unk40D;                          /* inferred */
    /* 0x40E */ char pad40E[0x2];                   /* maybe part of unk40D[3]? */
    /* 0x410 */ void (*actionFunc)(EnOwl *, GlobalContext *);
    /* 0x414 */ void (*unk414)(EnOwl *, GlobalContext *); /* inferred */
} EnOwl;                                            /* size = 0x418 */

struct _mips2c_stack_EnOwl_Destroy {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnOwl_Draw {
    /* 0x00 */ char pad0[0x2C];
    /* 0x2C */ Gfx *sp2C;                           /* inferred */
    /* 0x30 */ char pad30[0x4];
    /* 0x34 */ GraphicsContext *sp34;               /* inferred */
    /* 0x38 */ char pad38[0x8];
};                                                  /* size = 0x40 */

struct _mips2c_stack_EnOwl_Init {
    /* 0x00 */ char pad0[0x34];
    /* 0x34 */ EnOwl *sp34;                         /* inferred */
    /* 0x38 */ void (*sp38)(EnOwl *, GlobalContext *); /* inferred */
    /* 0x3C */ char pad3C[0x1C];
};                                                  /* size = 0x58 */

struct _mips2c_stack_EnOwl_Update {
    /* 0x00 */ char pad0[0x2C];
    /* 0x2C */ ColliderCylinder *sp2C;              /* inferred */
    /* 0x30 */ char pad30[0x6];                     /* maybe part of sp2C[2]? */
    /* 0x36 */ s16 sp36;                            /* inferred */
    /* 0x38 */ char pad38[0x8];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_8095A510 {};              /* size 0x0 */

struct _mips2c_stack_func_8095A920 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_8095A978 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_8095A9FC {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_8095AA70 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_8095AAD0 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8095AB1C {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8095AB4C {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8095ABA8 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8095ABF0 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8095AC50 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_8095ACEC {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8095AD54 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8095AE00 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8095AE60 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8095AEC0 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_8095AF2C {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_8095AFEC {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_8095B06C {};              /* size 0x0 */

struct _mips2c_stack_func_8095B0C8 {
    /* 0x00 */ char pad0[0x18];
    /* 0x18 */ void *sp18;                          /* inferred */
    /* 0x1C */ char pad1C[0x4];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_8095B158 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_8095B1E4 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8095B254 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_8095B2F8 {
    /* 0x00 */ char pad0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_8095B3DC {
    /* 0x00 */ char pad0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_8095B480 {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_8095B574 {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_8095B650 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_8095B6C8 {
    /* 0x00 */ char pad0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_8095B76C {
    /* 0x00 */ char pad0[0x44];
    /* 0x44 */ f32 sp44;                            /* inferred */
    /* 0x48 */ char pad48[0x2];
    /* 0x4A */ s16 sp4A;                            /* inferred */
    /* 0x4C */ char pad4C[0x4];
};                                                  /* size = 0x50 */

struct _mips2c_stack_func_8095B960 {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_8095B9FC {
    /* 0x00 */ char pad0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_8095BA84 {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_8095BE0C {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_8095BF20 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8095BF58 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8095BF78 {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_8095C09C {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_8095C1C8 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_8095C258 {
    /* 0x00 */ char pad0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_8095C328 {
    /* 0x00 */ char pad0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_8095C408 {
    /* 0x00 */ char pad0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_8095C484 {
    /* 0x00 */ char pad0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_8095C510 {};              /* size 0x0 */

struct _mips2c_stack_func_8095C568 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_8095CCF4 {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_8095CE18 {};              /* size 0x0 */

struct _mips2c_stack_func_8095CF44 {
    /* 0x00 */ char pad0[0x18];
    /* 0x18 */ f32 sp18;                            /* inferred */
    /* 0x1C */ f32 sp1C;                            /* inferred */
    /* 0x20 */ f32 sp20;                            /* inferred */
    /* 0x24 */ char pad24[0x4];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_8095D074 {
    /* 0x00 */ char pad0[0x20];
    /* 0x20 */ Gfx *sp20;                           /* inferred */
    /* 0x24 */ char pad24[0xC];                     /* maybe part of sp20[4]? */
    /* 0x30 */ Gfx *sp30;                           /* inferred */
    /* 0x34 */ char pad34[0xC];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_8095D24C {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

f32 func_80122524(EnOwl *, void *, s16, s16 *);     /* extern */
void func_8095A510(EnOwl *arg0, GlobalContext *arg1); /* static */
void func_8095A920(EnOwl *arg0, GlobalContext *arg1, GlobalContext *); /* static */
s32 func_8095A978(Actor *arg0, GlobalContext *arg1, u16 arg2, f32 arg3, f32 arg4); /* static */
? func_8095A9FC(Actor *arg0, GlobalContext *arg1, u16 arg2); /* static */
void func_8095AA70(EnOwl *arg0);                    /* static */
void func_8095AAD0(EnOwl *arg0, GlobalContext *arg1); /* static */
void func_8095AB4C(EnOwl *arg0);                    /* static */
void func_8095ABA8(Actor *arg0);                    /* static */
void func_8095AC50(Actor *arg0, GlobalContext *arg1); /* static */
void func_8095ACEC(EnOwl *arg0, s32);               /* static */
? func_8095B06C(EnOwl *arg0);                       /* static */
