typedef struct EnMag {
    /* 0x00000 */ Actor actor;
    /* 0x00144 */ char pad_144[0x2C];
    /* 0x00170 */ Font unk_170;                     /* inferred */
    /* 0x11EFC */ char pad_11EFC[0x4];
    /* 0x11F00 */ s16 unk_11F00;                    /* inferred */
    /* 0x11F02 */ s16 unk_11F02;                    /* inferred */
    /* 0x11F04 */ s16 unk_11F04;                    /* inferred */
    /* 0x11F06 */ s16 unk_11F06;                    /* inferred */
    /* 0x11F08 */ s16 unk_11F08;                    /* inferred */
    /* 0x11F0A */ s16 unk_11F0A;                    /* inferred */
    /* 0x11F0C */ s16 unk_11F0C;                    /* inferred */
    /* 0x11F0E */ s16 unk_11F0E;                    /* inferred */
    /* 0x11F10 */ s16 unk_11F10;                    /* inferred */
    /* 0x11F12 */ s16 unk_11F12;                    /* inferred */
    /* 0x11F14 */ s16 unk_11F14;                    /* inferred */
    /* 0x11F16 */ s16 unk_11F16;                    /* inferred */
    /* 0x11F18 */ s16 unk_11F18;                    /* inferred */
    /* 0x11F1A */ s16 unk_11F1A;                    /* inferred */
    /* 0x11F1C */ s16 unk_11F1C;                    /* inferred */
    /* 0x11F1E */ s16 unk_11F1E;                    /* inferred */
    /* 0x11F20 */ s16 unk_11F20;                    /* inferred */
    /* 0x11F22 */ s16 unk_11F22;                    /* inferred */
    /* 0x11F24 */ s16 unk_11F24;                    /* inferred */
    /* 0x11F26 */ s16 unk_11F26;                    /* inferred */
    /* 0x11F28 */ s16 unk_11F28;                    /* inferred */
    /* 0x11F2A */ s16 unk_11F2A;                    /* inferred */
    /* 0x11F2C */ s16 unk_11F2C;                    /* inferred */
    /* 0x11F2E */ s16 unk_11F2E;                    /* inferred */
    /* 0x11F30 */ s16 unk_11F30;                    /* inferred */
    /* 0x11F32 */ s16 unk_11F32;                    /* inferred */
    /* 0x11F34 */ s16 unk_11F34;                    /* inferred */
    /* 0x11F36 */ char pad_11F36[0x1E];             /* maybe part of unk_11F34[16]? */
    /* 0x11F54 */ s16 unk_11F54;                    /* inferred */
    /* 0x11F56 */ s16 unk_11F56;                    /* inferred */
    /* 0x11F58 */ s16 unk_11F58;                    /* inferred */
    /* 0x11F5A */ s16 unk_11F5A;                    /* inferred */
    /* 0x11F5C */ s32 unk_11F5C;                    /* inferred */
    /* 0x11F60 */ s32 unk_11F60;                    /* inferred */
    /* 0x11F64 */ s16 unk_11F64;                    /* inferred */
    /* 0x11F66 */ s16 unk_11F66;                    /* inferred */
    /* 0x11F68 */ s16 unk_11F68;                    /* inferred */
    /* 0x11F6A */ s16 unk_11F6A;                    /* inferred */
    /* 0x11F6C */ s16 unk_11F6C;                    /* inferred */
    /* 0x11F6E */ s16 unk_11F6E;                    /* inferred */
    /* 0x11F70 */ s16 unk_11F70;                    /* inferred */
    /* 0x11F72 */ s16 unk_11F72;                    /* inferred */
    /* 0x11F74 */ char pad_11F74[0x4];              /* maybe part of unk_11F72[3]? */
} EnMag;                                            /* size = 0x11F78 */

struct _mips2c_stack_EnMag_Destroy {};              /* size 0x0 */

struct _mips2c_stack_EnMag_Draw {
    /* 0x00 */ char pad_0[0x28];
    /* 0x28 */ GraphicsContext *sp28;               /* inferred */
    /* 0x2C */ Gfx *sp2C;                           /* inferred */
    /* 0x30 */ Gfx *sp30;                           /* inferred */
    /* 0x34 */ char pad_34[0x4];
};                                                  /* size = 0x38 */

struct _mips2c_stack_EnMag_Init {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnMag_Update {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ void *sp1C;                          /* inferred */
    /* 0x20 */ char pad_20[0x18];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_8096B604 {};              /* size 0x0 */

struct _mips2c_stack_func_8096C998 {};              /* size 0x0 */

struct _mips2c_stack_func_8096CBB0 {};              /* size 0x0 */

struct _mips2c_stack_func_8096CDC8 {
    /* 0x00 */ s32 sp0;                             /* inferred */
    /* 0x04 */ char pad_4[0x8];                     /* maybe part of sp0[3]? */
    /* 0x0C */ s32 spC;                             /* inferred */
    /* 0x10 */ char pad_10[0x28];                   /* maybe part of spC[11]? */
    /* 0x38 */ void *sp38;                          /* inferred */
    /* 0x3C */ char pad_3C[0x2C];
};                                                  /* size = 0x68 */

struct _mips2c_stack_func_8096D230 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ s32 sp24;                            /* inferred */
    /* 0x28 */ s32 sp28;                            /* inferred */
    /* 0x2C */ s32 sp2C;                            /* inferred */
    /* 0x30 */ u32 sp30;                            /* inferred */
    /* 0x34 */ char pad_34[0x14];                   /* maybe part of sp30[6]? */
    /* 0x48 */ u32 sp48;                            /* inferred */
    /* 0x4C */ char pad_4C[0x70];                   /* maybe part of sp48[29]? */
    /* 0xBC */ Gfx *spBC;                           /* inferred */
};                                                  /* size = 0xC0 */

struct _mips2c_stack_func_8096D60C {};              /* size 0x0 */

struct _mips2c_stack_func_8096D74C {
    /* 0x000 */ char pad_0[0x74];
    /* 0x074 */ void *sp74;                         /* inferred */
    /* 0x078 */ char pad_78[0x140];                 /* maybe part of sp74[81]? */
    /* 0x1B8 */ s32 sp1B8;                          /* inferred */
    /* 0x1BC */ char pad_1BC[0xC];                  /* maybe part of sp1B8[4]? */
    /* 0x1C8 */ Gfx *sp1C8;                         /* inferred */
    /* 0x1CC */ char pad_1CC[0xC];
};                                                  /* size = 0x1D8 */

? func_801A3F54(?);                                 /* extern */
void func_8096B604(EnMag *arg0, EnMag *);           /* static */
void func_8096C998(Gfx **arg0, ? *arg1, s16 arg2, s16 arg3, s16 arg4, s16 arg5); /* static */
void func_8096CBB0(Gfx **arg0, ? *arg1, s16 arg2, s16 arg3, s16 arg4, s16 arg5); /* static */
void func_8096CDC8(Gfx **arg0, s32 arg1, s32 arg2, s16 arg3, s16 arg4, s16 arg5, s16 arg6, s16 arg7, s16 arg8, u16 arg9, u16 argA, u16 argB, EnMag *argC); /* static */
void func_8096D230(Gfx **arg0, s16 arg1, s16 arg2, u32 arg3, u32 arg4, u32 arg5); /* static */
void func_8096D60C(Gfx **arg0, void *arg1, s32 arg2, s32 arg3); /* static */
void func_8096D74C(EnMag *arg0, GlobalContext *arg1, Gfx **arg2, GraphicsContext *); /* static */
extern ? D_06000000;
extern ? D_06009000;
extern ? D_06009680;
extern ? D_06009D00;
extern ? D_06010F40;
extern ? D_06011740;
