void func_8093ABD0(Actor *arg0, GlobalContext *arg1, ColliderJntSphInit *arg2); /* static */
void func_8093AC6C(Actor *arg0, GlobalContext *arg1, ColliderTrisInit *arg2); /* static */
void func_8093ADA8(Actor *arg0, GlobalContext *arg1); /* static */
void func_8093AE1C(Actor *arg0, GlobalContext *arg1, s8 arg2); /* static */
void func_8093AE74(DynaPolyActor *arg0);            /* static */
void func_8093AE88(Actor *arg0);                    /* static */
void func_8093AEC4(Actor *arg0);                    /* static */
void func_8093AEF0(Actor *arg0);                    /* static */
void func_8093AF1C(DynaPolyActor *arg0, s32 arg1);  /* static */
void func_8093AF54(ObjSwitch *arg0, GlobalContext *arg1); /* static */
void func_8093B648(DynaPolyActor *arg0, GlobalContext *arg1, void (*arg2)(DynaPolyActor *, GlobalContext *, u32), s8 arg3); /* static */
void func_8093B668(Actor *arg0, GlobalContext *arg1); /* static */
void func_8093B6F4(ObjSwitch *arg0);                /* static */
void func_8093B710(DynaPolyActor *arg0, GlobalContext *arg1); /* static */
void func_8093B92C(DynaPolyActor *arg0, GlobalContext *, u32); /* static */
void func_8093B940(Actor *arg0, ? arg1);            /* static */
void func_8093B9C0(ObjSwitch *arg0);                /* static */
void func_8093B9E4(DynaPolyActor *arg0, GlobalContext *arg1); /* static */
void func_8093BB5C(DynaPolyActor *arg0, GlobalContext *, u32); /* static */
void func_8093BB70(Actor *arg0, ? arg1);            /* static */

void func_8093C778(void *arg0, GlobalContext *arg1); /* static */
void func_8093C888(s32 arg0, GlobalContext *arg1);  /* static */
void func_8093C8B8(void *arg0, GraphicsContext **arg1); /* static */
void func_8093C99C(void *arg0, GraphicsContext **arg1); /* static */
void func_8093CA80(void *arg0);                     /* static */
void func_8093CAC4(Actor *arg0, GlobalContext *arg1); /* static */
extern ? D_0501BEE0;
extern ? D_0501BFB8;
extern void D_0501C118;
static void *D_8093CC60 = {
    (void *)0x500AEC0,
    (void *)0x5009EC0,
    (void *)0x500A6C0,
    (void *)0x50096C0,
    (void *)0x500B6C0,
    (void *)0x500BEC0,
    (void *)0x500C6C0,
    (void *)0x500C6C0,
};
static s32 D_8093CC80 = 0;
static ? D_8093CCA4;                                /* unable to generate initializer */
static ? D_8093CCA8;                                /* unable to generate initializer */
static ? D_8093CCAC;                                /* unable to generate initializer */
static ? D_8093CCB0;                                /* unable to generate initializer */
static ? D_8093CCB4;                                /* unable to generate initializer */
static ? D_8093CCB8;                                /* unable to generate initializer */
static ? D_8093CCBC;                                /* unable to generate initializer */
static ? D_8093CCC0;                                /* unable to generate initializer */
static ? D_8093CCD0;                                /* unable to generate initializer */
static ColliderTrisElementInit D_8093CCD4 = {
    {
        {0, {0, 0, 0}, {0x400, 0, 0}, 0, 1, 0},
        {{{-20.0f, 19.0f, -20.0f}, {-20.0f, 19.0f, 20.0f}, {20.0f, 19.0f, 20.0f}}},
    },
    {
        {0, {0, 0, 0}, {0x400, 0, 0}, 0, 1, 0},
        {{{20.0f, 19.0f, 20.0f}, {20.0f, 19.0f, -20.0f}, {-20.0f, 19.0f, -20.0f}}},
    },
};
static ColliderTrisInit D_8093CD4C = {{0xA, 0, 9, 0, 0, 2}, 2, &D_8093CCD4};
static ColliderTrisElementInit D_8093CD5C = {
    {
        {4, {0, 0, 0}, {0x3820, 0, 0}, 0, 1, 0},
        {{{0.0f, 23.0f, 8.5f}, {-23.0f, 0.0f, 8.5f}, {0.0f, -23.0f, 8.5f}}},
    },
    {
        {4, {0, 0, 0}, {0x3820, 0, 0}, 0, 1, 0},
        {{{0.0f, 23.0f, 8.5f}, {0.0f, -23.0f, 8.5f}, {23.0f, 0.0f, 8.5f}}},
    },
};
static ColliderTrisInit D_8093CDD4 = {{0xA, 0, 9, 0, 0, 2}, 2, &D_8093CD5C};
static ColliderJntSphElementInit D_8093CDE4 = {{0, {0, 0, 0}, {0x1CBFFBE, 0, 0}, 0, 1, 1}, {0, {{0, 0x12C, 0}, 0x14}, 0x64}};
static ColliderJntSphInit D_8093CE08 = {{9, 0, 9, 0x39, 0x20, 0}, 1, &D_8093CDE4};
static InitChainEntry D_8093CE18;                   /* unable to generate initializer */
static ? D_8093CE24;                                /* unable to generate initializer */
static ? D_8093CE2C;                                /* unable to generate initializer */
static ? D_8093CE40;                                /* unable to generate initializer */
static ? D_8093CE48;                                /* unable to generate initializer */
static void *D_8093D3B0;

typedef struct ObjSwitch {
    /* 0x0000 */ Actor actor;
    /* 0x0144 */ s32 unk144;                        /* inferred */
    /* 0x0148 */ char pad148[0x10];                 /* maybe part of unk144[5]? */
    /* 0x0158 */ u8 unk158;                         /* inferred */
    /* 0x0159 */ char pad159[0x3];                  /* maybe part of unk158[4]? */
    /* 0x015C */ void (*actionFunc)(ObjSwitch *, GlobalContext *);
    /* 0x0160 */ s16 unk160;                        /* inferred */
    /* 0x0162 */ s16 unk162;                        /* inferred */
    /* 0x0164 */ s8 unk164;                         /* inferred */
    /* 0x0165 */ s8 unk165;                         /* inferred */
    /* 0x0166 */ char pad166[0x6];                  /* maybe part of unk165[7]? */
    /* 0x016C */ u8 unk16C;                         /* inferred */
    /* 0x016D */ u8 unk16D;                         /* inferred */
    /* 0x016E */ u8 unk16E;                         /* inferred */
    /* 0x016F */ u8 unk16F;                         /* inferred */
    /* 0x0170 */ s8 unk170;                         /* inferred */
    /* 0x0171 */ char pad171[0x7];                  /* maybe part of unk170[8]? */
    /* 0x0178 */ Collider unk178;                   /* inferred */
    /* 0x0189 */ u8 unk189;                         /* overlap; inferred */
    /* 0x018A */ char pad18A[0x2];                  /* maybe part of unk189[3]? */
    /* 0x018C */ u8 unk18C;                         /* inferred */
    /* 0x018D */ char pad18D[0xC3];                 /* maybe part of unk18C[196]? */
    /* 0x0250 */ f32 unk250;                        /* inferred */
    /* 0x0254 */ f32 unk254;                        /* inferred */
} ObjSwitch;                                        /* size 0x258 */

void func_8093ABD0(Actor *arg0, GlobalContext *arg1, ColliderJntSphInit *arg2) {
    ColliderJntSph *sp28;
    ColliderJntSph *temp_a1;

    temp_a1 = arg0 + 0x178;
    sp28 = temp_a1;
    Collider_InitJntSph(arg1, temp_a1);
    Collider_SetJntSph(arg1, temp_a1, arg0, arg2, arg0 + 0x198);
    SysMatrix_SetStateRotationAndTranslation(arg0->world.pos.x, arg0->world.pos.y + (arg0->shape.yOffset * arg0->scale.y), arg0->world.pos.z, &arg0->shape.rot);
    Matrix_Scale(arg0->scale.x, arg0->scale.y, arg0->scale.z, 1);
    Collider_UpdateSpheres(0, temp_a1);
}

void func_8093AC6C(Actor *arg0, GlobalContext *arg1, ColliderTrisInit *arg2) {
    ? sp7C;
    Vec3f sp70;
    Vec3f sp64;
    Vec3f sp58;
    ColliderTris *sp54;
    ColliderTris *temp_a1;
    Vec3f *temp_s0;
    s32 temp_s2;
    s32 phi_s2;
    s32 phi_s1;
    Vec3f *phi_s0;

