typedef struct ObjSwitch {
    /* 0x000 */ Actor actor;
    /* 0x144 */ s32 unk_144;                        /* inferred */
    /* 0x148 */ char pad_148[0x14];                 /* maybe part of unk_144[6]? */
    /* 0x15C */ void (*actionFunc)(ObjSwitch *, GlobalContext *);
    /* 0x160 */ s16 unk_160;                        /* inferred */
    /* 0x162 */ s16 unk_162;                        /* inferred */
    /* 0x164 */ char pad_164[0x1];
    /* 0x165 */ s8 unk_165;                         /* inferred */
    /* 0x166 */ char pad_166[0x6];                  /* maybe part of unk_165[7]? */
    /* 0x16C */ u8 unk_16C;                         /* inferred */
    /* 0x16D */ u8 unk_16D;                         /* inferred */
    /* 0x16E */ u8 unk_16E;                         /* inferred */
    /* 0x16F */ u8 unk_16F;                         /* inferred */
    /* 0x170 */ s8 unk_170;                         /* inferred */
    /* 0x171 */ char pad_171[0x7];                  /* maybe part of unk_170[8]? */
    /* 0x178 */ Collider unk_178;                   /* inferred */
    /* 0x189 */ u8 unk_189;                         /* overlap; inferred */
    /* 0x18C */ u8 unk_18C;                         /* overlap; inferred */
    /* 0x190 */ char pad_190[0xC0];                 /* maybe part of unk_18C[193]? */
    /* 0x250 */ f32 unk_250;                        /* inferred */
    /* 0x254 */ f32 unk_254;                        /* inferred */
} ObjSwitch;                                        /* size = 0x258 */

struct _mips2c_stack_ObjSwitch_Destroy {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ s32 sp1C;                            /* inferred */
    /* 0x20 */ char pad_20[0x8];
};                                                  /* size = 0x28 */

struct _mips2c_stack_ObjSwitch_Draw {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_ObjSwitch_Init {
    /* 0x00 */ char pad_0[0x30];
    /* 0x30 */ f32 *sp30;                           /* inferred */
    /* 0x34 */ char pad_34[0x18];                   /* maybe part of sp30[7]? */
    /* 0x4C */ u32 sp4C;                            /* inferred */
    /* 0x50 */ char pad_50[0x8];
};                                                  /* size = 0x58 */

struct _mips2c_stack_ObjSwitch_Update {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ Collider *sp20;                      /* inferred */
    /* 0x24 */ CollisionCheckContext *sp24;         /* inferred */
    /* 0x28 */ char pad_28[0x8];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_8093ABD0 {
    /* 0x00 */ char pad_0[0x28];
    /* 0x28 */ ColliderJntSph *sp28;                /* inferred */
    /* 0x2C */ char pad_2C[0x4];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_8093AC6C {
    /* 0x00 */ char pad_0[0x54];
    /* 0x54 */ ColliderTris *sp54;                  /* inferred */
    /* 0x58 */ ? sp58;                              /* inferred */
    /* 0x58 */ char pad_58[0xC];
    /* 0x64 */ ? sp64;                              /* inferred */
    /* 0x64 */ char pad_64[0xC];
    /* 0x70 */ ? sp70;                              /* inferred */
    /* 0x70 */ char pad_70[0xC];
    /* 0x7C */ ? sp7C;                              /* inferred */
    /* 0x7C */ char pad_7C[0xC];
};                                                  /* size = 0x88 */

struct _mips2c_stack_func_8093ADA8 {
    /* 0x00 */ char pad_0[0x38];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_8093AE1C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8093AE74 {};              /* size 0x0 */

struct _mips2c_stack_func_8093AE88 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8093AEC4 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8093AEF0 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8093AF1C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8093AF54 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ f32 sp24;                            /* inferred */
    /* 0x28 */ void *sp28;                          /* inferred */
    /* 0x2C */ char pad_2C[0x4];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_8093B648 {};              /* size 0x0 */

struct _mips2c_stack_func_8093B668 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_8093B6F4 {};              /* size 0x0 */

struct _mips2c_stack_func_8093B710 {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ s32 sp20;                            /* inferred */
    /* 0x24 */ char pad_24[0x4];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_8093B92C {};              /* size 0x0 */

struct _mips2c_stack_func_8093B940 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_8093B9C0 {};              /* size 0x0 */

struct _mips2c_stack_func_8093B9E4 {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ u32 sp20;                            /* inferred */
    /* 0x24 */ char pad_24[0xC];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_8093BB5C {};              /* size 0x0 */

struct _mips2c_stack_func_8093BB70 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8093BBD0 {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ ? sp20;                              /* inferred */
    /* 0x20 */ char pad_20[0xC];
    /* 0x2C */ ? sp2C;                              /* inferred */
    /* 0x2C */ char pad_2C[0x10];
    /* 0x3C */ void *sp3C;                          /* inferred */
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_8093BCC8 {};              /* size 0x0 */

struct _mips2c_stack_func_8093BCDC {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8093BD34 {};              /* size 0x0 */

struct _mips2c_stack_func_8093BD4C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8093BDAC {};              /* size 0x0 */

struct _mips2c_stack_func_8093BDC0 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8093BE10 {};              /* size 0x0 */

struct _mips2c_stack_func_8093BE2C {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_8093BEF0 {};              /* size 0x0 */

struct _mips2c_stack_func_8093BF04 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8093BF50 {};              /* size 0x0 */

struct _mips2c_stack_func_8093BF70 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_8093C0A4 {};              /* size 0x0 */

struct _mips2c_stack_func_8093C0B8 {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ s32 sp20;                            /* inferred */
    /* 0x24 */ char pad_24[0x4];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_8093C138 {};              /* size 0x0 */

struct _mips2c_stack_func_8093C15C {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_8093C23C {};              /* size 0x0 */

struct _mips2c_stack_func_8093C250 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_8093C2B4 {};              /* size 0x0 */

struct _mips2c_stack_func_8093C2D4 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_8093C3C8 {};              /* size 0x0 */

struct _mips2c_stack_func_8093C3DC {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_8093C460 {};              /* size 0x0 */

struct _mips2c_stack_func_8093C488 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_8093C584 {};              /* size 0x0 */

struct _mips2c_stack_func_8093C598 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8093C778 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ void *sp1C;                          /* inferred */
    /* 0x20 */ char pad_20[0x8];                    /* maybe part of sp1C[3]? */
    /* 0x28 */ GraphicsContext *sp28;               /* inferred */
    /* 0x2C */ void *sp2C;                          /* inferred */
    /* 0x30 */ char pad_30[0x8];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_8093C888 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8093C8B8 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ Gfx *sp1C;                           /* inferred */
    /* 0x20 */ char pad_20[0x4];
    /* 0x24 */ GraphicsContext *sp24;               /* inferred */
    /* 0x28 */ s32 sp28;                            /* inferred */
    /* 0x2C */ char pad_2C[0x4];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_8093C99C {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ Gfx *sp1C;                           /* inferred */
    /* 0x20 */ char pad_20[0x4];
    /* 0x24 */ GraphicsContext *sp24;               /* inferred */
    /* 0x28 */ s32 sp28;                            /* inferred */
    /* 0x2C */ char pad_2C[0x4];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_8093CA80 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8093CAC4 {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ Gfx *sp2C;                           /* inferred */
    /* 0x30 */ char pad_30[0xC];                    /* maybe part of sp2C[4]? */
    /* 0x3C */ Gfx *sp3C;                           /* inferred */
    /* 0x40 */ char pad_40[0x10];
};                                                  /* size = 0x50 */

void func_8093ABD0(Actor *arg0, GlobalContext *arg1, ColliderJntSphInit *arg2); /* static */
void func_8093AC6C(Actor *arg0, GlobalContext *arg1, ColliderTrisInit *arg2); /* static */
void func_8093ADA8(Actor *arg0, GlobalContext *arg1); /* static */
void func_8093AE1C(Actor *arg0, GlobalContext *arg1, s8 arg2); /* static */
void func_8093AE74(DynaPolyActor *arg0);            /* static */
void func_8093AE88(Actor *arg0);                    /* static */
void func_8093AEC4(Actor *arg0);                    /* static */
void func_8093AEF0(Actor *arg0);                    /* static */
void func_8093AF1C(DynaPolyActor *arg0, s32 arg1);  /* static */
void func_8093AF54(ObjSwitch *arg0, GlobalContext *arg1); /* static */
void func_8093B648(DynaPolyActor *arg0, GlobalContext *arg1, void (*arg2)(DynaPolyActor *, GlobalContext *, u32), s8 arg3); /* static */
