typedef struct EnKakasi {
    /* 0x000 */ Actor actor;
    /* 0x144 */ void (*unk144)(GlobalContext *, Actor *); /* inferred */
    /* 0x148 */ void (*actionFunc)(EnKakasi *, GlobalContext *);
    /* 0x14C */ SkelAnime unk14C;                   /* inferred */
    /* 0x190 */ s16 unk190;                         /* inferred */
    /* 0x192 */ s16 unk192;                         /* inferred */
    /* 0x194 */ s16 unk194;                         /* inferred */
    /* 0x196 */ s16 unk196;                         /* inferred */
    /* 0x198 */ char pad198[0x8];                   /* maybe part of unk196[5]? */
    /* 0x1A0 */ s32 unk1A0;                         /* inferred */
    /* 0x1A4 */ s32 unk1A4;                         /* inferred */
    /* 0x1A8 */ s32 unk1A8;                         /* inferred */
    /* 0x1AC */ s16 unk1AC;                         /* inferred */
    /* 0x1AE */ s16 unk1AE;                         /* inferred */
    /* 0x1B0 */ char pad1B0[0x4];                   /* maybe part of unk1AE[3]? */
    /* 0x1B4 */ f32 unk1B4;                         /* inferred */
    /* 0x1B8 */ f32 unk1B8;                         /* inferred */
    /* 0x1BC */ f32 unk1BC;                         /* inferred */
    /* 0x1C0 */ char pad1C0[0x4];
    /* 0x1C4 */ f32 unk1C4;                         /* inferred */
    /* 0x1C8 */ char pad1C8[0x3C];                  /* maybe part of unk1C4[16]? */
    /* 0x204 */ s16 unk204;                         /* inferred */
    /* 0x206 */ char pad206[0x2];
    /* 0x208 */ s16 unk208;                         /* inferred */
    /* 0x20A */ char pad20A[0x2];
    /* 0x20C */ f32 unk20C;                         /* inferred */
    /* 0x210 */ f32 unk210;                         /* inferred */
    /* 0x214 */ Vec3f unk214;                       /* inferred */
    /* 0x220 */ Vec3f unk220;                       /* inferred */
    /* 0x22C */ Vec3f unk22C;                       /* inferred */
    /* 0x238 */ Vec3f unk238;                       /* inferred */
    /* 0x23C */ f32 unk23C;                         /* overlap; inferred */
    /* 0x240 */ f32 unk240;                         /* inferred */
    /* 0x244 */ PosRot unk244;                      /* inferred */
    /* 0x250 */ f32 unk250;                         /* overlap; inferred */
    /* 0x254 */ ColliderCylinder unk254;            /* inferred */
} EnKakasi;                                         /* size = 0x2A0 */

struct _mips2c_stack_EnKakasi_Destroy {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnKakasi_Draw {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_EnKakasi_Init {
    /* 0x00 */ char pad0[0x38];
};                                                  /* size = 0x38 */

struct _mips2c_stack_EnKakasi_Update {
    /* 0x00 */ char pad0[0x28];
    /* 0x28 */ s16 *sp28;                           /* inferred */
    /* 0x2C */ CollisionCheckContext *sp2C;         /* inferred */
    /* 0x30 */ char pad30[0x8];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_8096F800 {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_8096F88C {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_8096F8D8 {
    /* 0x00 */ char pad0[0x24];
    /* 0x24 */ SkelAnime *sp24;                     /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_8096FA18 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_8096FAAC {
    /* 0x00 */ char pad0[0x30];
    /* 0x30 */ f32 *sp30;                           /* inferred */
    /* 0x34 */ f32 *sp34;                           /* inferred */
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_8096FBB8 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_8096FC8C {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8096FCC4 {
    /* 0x00 */ char pad0[0x24];
    /* 0x24 */ Actor *sp24;                         /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_8096FDE8 {};              /* size 0x0 */

struct _mips2c_stack_func_8096FE00 {
    /* 0x00 */ char pad0[0x20];
    /* 0x20 */ s16 sp20;                            /* inferred */
    /* 0x22 */ s16 sp22;                            /* inferred */
    /* 0x24 */ s32 sp24;                            /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80970008 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8097006C {
    /* 0x00 */ char pad0[0x2C];
    /* 0x2C */ s32 sp2C;                            /* inferred */
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ s32 sp34;                            /* inferred */
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_809705E4 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80970658 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80970740 {
    /* 0x00 */ char pad0[0x30];
    /* 0x30 */ Vec3f *sp30;                         /* inferred */
    /* 0x34 */ PosRot *sp34;                        /* inferred */
    /* 0x38 */ Vec3f *sp38;                         /* inferred */
    /* 0x3C */ ? sp3C;                              /* inferred */
    /* 0x3C */ char pad3C[0xC];
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_80970978 {
    /* 0x00 */ char pad0[0x1C];
    /* 0x1C */ f32 sp1C;                            /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80970A10 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80970A9C {
    /* 0x00 */ char pad0[0x2C];
    /* 0x2C */ Vec3f *sp2C;                         /* inferred */
    /* 0x30 */ PosRot *sp30;                        /* inferred */
    /* 0x34 */ ? sp34;                              /* inferred */
    /* 0x34 */ char pad34[0xC];
    /* 0x40 */ f32 sp40;                            /* inferred */
    /* 0x44 */ Actor *sp44;                         /* inferred */
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_80970F20 {
    /* 0x00 */ char pad0[0x24];
    /* 0x24 */ s32 sp24;                            /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80970FF8 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80971064 {
    /* 0x00 */ char pad0[0x34];
    /* 0x34 */ Vec3f *sp34;                         /* inferred */
    /* 0x38 */ char pad38[0x4];
    /* 0x3C */ s16 *sp3C;                           /* inferred */
    /* 0x40 */ char pad40[0x4];
    /* 0x44 */ Actor *sp44;                         /* inferred */
    /* 0x48 */ ? sp48;                              /* inferred */
    /* 0x48 */ char pad48[0xC];
    /* 0x54 */ f32 sp54;                            /* inferred */
};                                                  /* size = 0x58 */

struct _mips2c_stack_func_80971430 {};              /* size 0x0 */

struct _mips2c_stack_func_80971440 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809714BC {
    /* 0x00 */ char pad0[0x38];
    /* 0x38 */ Vec3f *sp38;                         /* inferred */
    /* 0x3C */ char pad3C[0x4];
    /* 0x40 */ f32 sp40;                            /* inferred */
    /* 0x44 */ f32 sp44;                            /* inferred */
    /* 0x48 */ f32 sp48;                            /* inferred */
    /* 0x4C */ ? sp4C;                              /* inferred */
    /* 0x4C */ char pad4C[0xC];
};                                                  /* size = 0x58 */

struct _mips2c_stack_func_80971794 {};              /* size 0x0 */

struct _mips2c_stack_func_809717D0 {};              /* size 0x0 */

struct _mips2c_stack_func_8097185C {
    /* 0x00 */ char pad0[0x20];
    /* 0x20 */ void *sp20;                          /* inferred */
    /* 0x24 */ s32 sp24;                            /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_8097193C {
    /* 0x00 */ char pad0[0x38];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80971A38 {};              /* size 0x0 */

struct _mips2c_stack_func_80971A64 {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80971AD4 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80971CE0 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

s32 func_800B8718(EnKakasi *, GlobalContext *);     /* extern */
? func_800B874C(EnKakasi *, GlobalContext *, ?, ?); /* extern */
? func_8016566C(?);                                 /* extern */
? func_80165690();                                  /* extern */
? func_80169940(GlobalContext *, s16, s32);         /* extern */
void func_8096F800(EnKakasi *arg0, s32 arg1, u8);   /* static */
void func_8096F88C(GlobalContext *arg0, Actor *arg1); /* static */
void func_8096F8D8(Actor *arg0);                    /* static */
void func_8096FA18(EnKakasi *arg0, GlobalContext *arg1); /* static */
void func_8096FAAC(EnKakasi *arg0, GlobalContext *arg1); /* static */
void func_8096FBB8(EnKakasi *arg0, GlobalContext *arg1); /* static */
void func_8096FC8C(EnKakasi *arg0);                 /* static */
void func_8096FDE8(EnKakasi *arg0);                 /* static */
