typedef struct EnBbfall {
    /* 0x000 */ Actor actor;
    /* 0x144 */ SkelAnime unk144;                   /* inferred */
    /* 0x188 */ Vec3s unk188;                       /* inferred */
    /* 0x18E */ char pad18E[0x5A];                  /* maybe part of unk188[16]? */
    /* 0x1E8 */ Vec3s unk1E8;                       /* inferred */
    /* 0x1EE */ char pad1EE[0x5A];                  /* maybe part of unk1E8[16]? */
    /* 0x248 */ void (*actionFunc)(EnBbfall *, GlobalContext *);
    /* 0x24C */ u8 unk24C;                          /* inferred */
    /* 0x24D */ u8 unk24D;                          /* inferred */
    /* 0x24E */ char pad24E[0x1];
    /* 0x24F */ u8 unk24F;                          /* inferred */
    /* 0x250 */ s16 unk250;                         /* inferred */
    /* 0x252 */ char pad252[0x2];
    /* 0x254 */ f32 unk254;                         /* inferred */
    /* 0x258 */ f32 unk258;                         /* inferred */
    /* 0x25C */ f32 unk25C;                         /* inferred */
    /* 0x260 */ f32 unk260;                         /* inferred */
    /* 0x264 */ f32 unk264;                         /* inferred */
    /* 0x268 */ Vec3f unk268;                       /* inferred */
    /* 0x274 */ Vec3f unk274;                       /* inferred */
    /* 0x280 */ char pad280[0x30];                  /* maybe part of unk274[5]? */
    /* 0x2B0 */ Vec3f unk2B0;                       /* inferred */
    /* 0x2BC */ char pad2BC[0x30];                  /* maybe part of unk2B0[5]? */
    /* 0x2EC */ Vec3f unk2EC;                       /* inferred */
    /* 0x2F8 */ char pad2F8[0x8C];                  /* maybe part of unk2EC[12]? */
    /* 0x384 */ ColliderJntSph unk384;              /* inferred */
    /* 0x3A4 */ ColliderJntSphElement unk3A4;       /* inferred */
    /* 0x3E4 */ char pad3E4[0x80];                  /* maybe part of unk3A4[3]? */
} EnBbfall;                                         /* size = 0x464 */

struct _mips2c_stack_EnBbfall_Destroy {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnBbfall_Draw {
    /* 0x00 */ char pad0[0x70];
    /* 0x70 */ void *sp70;                          /* inferred */
    /* 0x74 */ Gfx *sp74;                           /* inferred */
    /* 0x78 */ char pad78[0x48];
};                                                  /* size = 0xC0 */

struct _mips2c_stack_EnBbfall_Init {
    /* 0x00 */ char pad0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_EnBbfall_Update {
    /* 0x00 */ char pad0[0x58];
    /* 0x58 */ s32 sp58;                            /* inferred */
    /* 0x5C */ ? sp5C;                              /* inferred */
    /* 0x5C */ char pad5C[0x14];
};                                                  /* size = 0x70 */

struct _mips2c_stack_func_808BF344 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_808BF3B8 {
    /* 0x00 */ char pad0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_808BF438 {
    /* 0x00 */ char pad0[0x18];
    /* 0x18 */ CollisionContext *sp18;              /* inferred */
    /* 0x1C */ char pad1C[0x4];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_808BF4B4 {
    /* 0x00 */ char pad0[0x1C];
    /* 0x1C */ SkelAnime *sp1C;                     /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_808BF514 {};              /* size 0x0 */

struct _mips2c_stack_func_808BF578 {};              /* size 0x0 */

struct _mips2c_stack_func_808BF5AC {};              /* size 0x0 */

struct _mips2c_stack_func_808BF5E0 {
    /* 0x00 */ char pad0[0x38];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_808BF734 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_808BF7A0 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_808BF830 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_808BF894 {};              /* size 0x0 */

struct _mips2c_stack_func_808BF8DC {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_808BFA18 {};              /* size 0x0 */

struct _mips2c_stack_func_808BFA3C {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_808BFAB4 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_808BFB4C {
    /* 0x00 */ char pad0[0x3C];
    /* 0x3C */ SkelAnime *sp3C;                     /* inferred */
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_808BFCCC {
    /* 0x00 */ char pad0[0x70];
    /* 0x70 */ f32 sp70;                            /* inferred */
    /* 0x74 */ char pad74[0x4];
    /* 0x78 */ f32 sp78;                            /* inferred */
    /* 0x7C */ char pad7C[0x4];
};                                                  /* size = 0x80 */

struct _mips2c_stack_func_808BFE58 {
    /* 0x00 */ char pad0[0x40];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_808BFF8C {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_808C00A0 {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_808C013C {};              /* size 0x0 */

struct _mips2c_stack_func_808C0178 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_808C01E0 {
    /* 0x00 */ char pad0[0x38];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_808C07D4 {};              /* size 0x0 */

struct _mips2c_stack_func_808C080C {
    /* 0x00 */ char pad0[0x20];
    /* 0x20 */ s8 *sp20;                            /* inferred */
    /* 0x24 */ char pad24[0x4];
    /* 0x28 */ Gfx *sp28;                           /* inferred */
    /* 0x2C */ char pad2C[0x4];
    /* 0x30 */ GraphicsContext *sp30;               /* inferred */
    /* 0x34 */ char pad34[0xC];
};                                                  /* size = 0x40 */

void func_808BF344(Actor *arg0);                    /* static */
void func_808BF3B8(Actor *arg0, GlobalContext *arg1); /* static */
s32 func_808BF438(EnBbfall *arg0, GlobalContext *arg1); /* static */
void func_808BF4B4(Actor *arg0, Actor *);           /* static */
void func_808BF514(EnBbfall *arg0);                 /* static */
void func_808BF578(EnBbfall *arg0);                 /* static */
void func_808BF5AC(Actor *arg0);                    /* static */
void func_808BF5E0(EnBbfall *arg0, EnBbfall *);     /* static */
void func_808BF7A0(EnBbfall *arg0);                 /* static */
void func_808BF894(EnBbfall *arg0, EnBbfall *);     /* static */
void func_808BFA18(EnBbfall *arg0);                 /* static */
void func_808BFAB4(Actor *arg0);                    /* static */
void func_808BFCCC(Actor *arg0, GlobalContext *arg1); /* static */
