void func_808BF344(Actor *arg0);                    /* static */
void func_808BF3B8(Actor *arg0, GlobalContext *arg1); /* static */
s32 func_808BF438(EnBbfall *arg0, GlobalContext *arg1); /* static */
void func_808BF4B4(Actor *arg0, Actor *);           /* static */
void func_808BF514(EnBbfall *arg0);                 /* static */
void func_808BF578(EnBbfall *arg0);                 /* static */
void func_808BF5AC(Actor *arg0);                    /* static */
void func_808BF5E0(EnBbfall *arg0, EnBbfall *);     /* static */
void func_808BF7A0(EnBbfall *arg0);                 /* static */
void func_808BF894(EnBbfall *arg0, EnBbfall *);     /* static */
void func_808BFA18(EnBbfall *arg0);                 /* static */
void func_808BFAB4(Actor *arg0);                    /* static */
void func_808BFCCC(Actor *arg0, GlobalContext *arg1); /* static */
void func_808BFF8C(Actor *arg0);                    /* static */
void func_808C013C(Actor *arg0);                    /* static */
void func_808C01E0(Actor *arg0, GlobalContext *arg1); /* static */
s32 func_808C07D4(GlobalContext *arg0, s32 arg1, Gfx **arg2, Vec3f *arg3, Vec3s *arg5, Actor *actor); /* static */
void func_808C080C(GraphicsContext **arg0, s32 arg1, Gfx **arg2, Vec3s *arg3, Actor *arg4); /* static */
extern AnimationHeader D_06000184;
extern AnimationHeader D_06000444;
extern SkeletonHeader D_06001A30;
static ColliderJntSphElementInit D_808C0D30 = {
    {
        {0, {0xF7CFFFFF, 1, 8}, {0xF7CFFFFF, 0, 0}, 9, 5, 1},
        {0, {{0, 0, 0}, 0x14}, 0x64},
    },
    {
        {0, {0xF7CFFFFF, 1, 8}, {0xF7CFFFFF, 0, 0}, 9, 0, 0},
        {0, {{0, 0, 0}, 0x14}, 0x64},
    },
    {
        {0, {0xF7CFFFFF, 1, 8}, {0xF7CFFFFF, 0, 0}, 9, 0, 0},
        {0, {{0, 0, 0}, 0x14}, 0x64},
    },
};
static ColliderJntSphInit D_808C0D9C = {{3, 0x10, 9, 0x39, 0x10, 0}, 3, &D_808C0D30};
static DamageTable D_808C0DAC = {
    {
        0x10,
        1,
        0,
        1,
        1,
        1,
        0,
        0xE0,
        1,
        1,
        1,
        1,
        0x32,
        0x42,
        1,
        1,
        1,
        2,
        0x10,
        0x50,
        0,
        0,
        1,
        1,
        1,
        0,
        0,
        0,
        0,
        0,
        0,
        1,
    },
};
static CollisionCheckInfoInit D_808C0DCC = {2, 0x14, 0x28, 0x32};
static InitChainEntry D_808C0DD4;                   /* unable to generate initializer */
static ? D_808C0DDC;                                /* unable to generate initializer */
static ? D_808C0DEB;                                /* unable to generate initializer */
static Vec3f D_808C0DEC = {1000.0f, -700.0f, 0.0f};

typedef struct EnBbfall {
    /* 0x0000 */ Actor actor;
    /* 0x0144 */ SkelAnime unk144;                  /* inferred */
    /* 0x0188 */ Vec3s unk188;                      /* inferred */
    /* 0x018E */ char pad18E[0x5A];                 /* maybe part of unk188[16]? */
    /* 0x01E8 */ Vec3s unk1E8;                      /* inferred */
    /* 0x01EE */ char pad1EE[0x5A];                 /* maybe part of unk1E8[16]? */
    /* 0x0248 */ void (*actionFunc)(EnBbfall *, GlobalContext *);
    /* 0x024C */ u8 unk24C;                         /* inferred */
    /* 0x024D */ u8 unk24D;                         /* inferred */
    /* 0x024E */ char pad24E[0x1];                  /* maybe part of unk24D[2]? */
    /* 0x024F */ u8 unk24F;                         /* inferred */
    /* 0x0250 */ s16 unk250;                        /* inferred */
    /* 0x0252 */ char pad252[0x2];                  /* maybe part of unk250[2]? */
    /* 0x0254 */ f32 unk254;                        /* inferred */
    /* 0x0258 */ f32 unk258;                        /* inferred */
    /* 0x025C */ f32 unk25C;                        /* inferred */
    /* 0x0260 */ f32 unk260;                        /* inferred */
    /* 0x0264 */ f32 unk264;                        /* inferred */
    /* 0x0268 */ Vec3f unk268;                      /* inferred */
    /* 0x0274 */ Vec3f unk274;                      /* inferred */
    /* 0x0280 */ char pad280[0x30];                 /* maybe part of unk274[5]? */
    /* 0x02B0 */ Vec3f unk2B0;                      /* inferred */
    /* 0x02BC */ char pad2BC[0x28];
    /* 0x02E4 */ f32 unk2E4;                        /* inferred */
    /* 0x02E8 */ char pad2E8[0x4];                  /* maybe part of unk2E4[2]? */
    /* 0x02EC */ Vec3f unk2EC;                      /* inferred */
    /* 0x02F8 */ char pad2F8[0x8C];
    /* 0x0384 */ ColliderJntSph unk384;             /* inferred */
    /* 0x03A4 */ ColliderJntSphElement unk3A4;      /* inferred */
    /* 0x03E4 */ char pad3E4[0x80];                 /* maybe part of unk3A4[3]? */
} EnBbfall;                                         /* size 0x464 */

void EnBbfall_Init(Actor *thisx, GlobalContext *globalCtx) {
    EnBbfall *this = (EnBbfall *) thisx;
    s32 temp_v1;
    void *temp_v0;
    s32 phi_v1;

    Actor_ProcessInitChain(&this->actor, &D_808C0DD4);
    SkelAnime_Init(globalCtx, &this->unk144, &D_06001A30, &D_06000444, &this->unk188, &this->unk1E8, 0x10);
    CollisionCheck_SetInfo(&this->actor.colChkInfo, &D_808C0DAC, &D_808C0DCC);
    Collider_InitAndSetJntSph(globalCtx, &this->unk384, &this->actor, &D_808C0D9C, &this->unk3A4);
    ActorShape_Init(&this->actor.shape, 1500.0f, func_800B3FC0, 35.0f);
    this->unk250 = 0;
    func_808BF5E0(this);
    Actor_SetHeight(&this->actor, 0.0f);
    phi_v1 = 0;
    do {
        temp_v0 = this->unk384.elements + phi_v1;
        temp_v1 = phi_v1 + 0x40;
        temp_v0->unk36 = (s16) temp_v0->unk2E;
        phi_v1 = temp_v1;
