typedef struct EnWdhand {
    /* 0x000 */ Actor actor;
    /* 0x144 */ SkelAnime unk144;                   /* inferred */
    /* 0x188 */ Vec3s unk188;                       /* inferred */
    /* 0x18E */ char pad18E[0x2A];                  /* maybe part of unk188[8]? */
    /* 0x1B8 */ Vec3s unk1B8;                       /* inferred */
    /* 0x1BE */ char pad1BE[0x2A];                  /* maybe part of unk1B8[8]? */
    /* 0x1E8 */ void (*actionFunc)(EnWdhand *, GlobalContext *);
    /* 0x1EC */ s16 unk1EC;                         /* inferred */
    /* 0x1EE */ s16 unk1EE;                         /* inferred */
    /* 0x1F0 */ s16 unk1F0;                         /* inferred */
    /* 0x1F2 */ s16 unk1F2;                         /* inferred */
    /* 0x1F4 */ s16 unk1F4;                         /* inferred */
    /* 0x1F6 */ s16 unk1F6;                         /* inferred */
    /* 0x1F8 */ char pad1F8[0x14];                  /* maybe part of unk1F6[11]? */
    /* 0x20C */ f32 unk20C;                         /* inferred */
    /* 0x210 */ char pad210[0xC];                   /* maybe part of unk20C[4]? */
    /* 0x21C */ MtxF unk21C;                        /* inferred */
    /* 0x25C */ Vec3f unk25C;                       /* inferred */
    /* 0x268 */ Vec3f unk268;                       /* inferred */
    /* 0x274 */ ColliderJntSph unk274;              /* inferred */
    /* 0x294 */ ColliderJntSphElement unk294;       /* inferred */
    /* 0x2D4 */ char pad2D4[0x180];                 /* maybe part of unk294[7]? */
} EnWdhand;                                         /* size = 0x454 */

struct _mips2c_stack_EnWdhand_Destroy {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnWdhand_Draw {
    /* 0x00 */ char pad0[0x80];
    /* 0x80 */ GraphicsContext *sp80;               /* inferred */
    /* 0x84 */ char pad84[0x4];
    /* 0x88 */ s32 sp88;                            /* inferred */
    /* 0x8C */ char pad8C[0x4];
    /* 0x90 */ ? sp90;                              /* inferred */
    /* 0x90 */ char pad90[0x10];
};                                                  /* size = 0xA0 */

struct _mips2c_stack_EnWdhand_Init {
    /* 0x00 */ char pad0[0x4C];
    /* 0x4C */ ? sp4C;                              /* inferred */
    /* 0x4C */ char pad4C[0x4];
    /* 0x50 */ f32 sp50;                            /* inferred */
    /* 0x54 */ f32 sp54;                            /* inferred */
    /* 0x58 */ char pad58[0x8];
};                                                  /* size = 0x60 */

struct _mips2c_stack_EnWdhand_Update {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80AF4608 {};              /* size 0x0 */

struct _mips2c_stack_func_80AF4670 {
    /* 0x00 */ char pad0[0x18];
    /* 0x18 */ ? sp18;                              /* inferred */
    /* 0x18 */ char pad18[0xC];
    /* 0x24 */ ? sp24;                              /* inferred */
    /* 0x24 */ char pad24[0xC];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80AF46F0 {
    /* 0x00 */ char pad0[0x1C];
    /* 0x1C */ void *sp1C;                          /* inferred */
    /* 0x20 */ char pad20[0x4];
    /* 0x24 */ MtxF *sp24;                          /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80AF488C {};              /* size 0x0 */

struct _mips2c_stack_func_80AF48D0 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80AF4964 {
    /* 0x00 */ char pad0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80AF4A88 {
    /* 0x00 */ char pad0[0x4C];
    /* 0x4C */ s16 sp4C;                            /* inferred */
    /* 0x4E */ s16 sp4E;                            /* inferred */
    /* 0x50 */ char pad50[0x4];                     /* maybe part of sp4E[3]? */
    /* 0x54 */ void *sp54;                          /* inferred */
};                                                  /* size = 0x58 */

struct _mips2c_stack_func_80AF4C18 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80AF4C64 {
    /* 0x00 */ char pad0[0x68];
    /* 0x68 */ s16 sp68;                            /* inferred */
    /* 0x6A */ s16 sp6A;                            /* inferred */
    /* 0x6C */ char pad6C[0x8];                     /* maybe part of sp6A[5]? */
    /* 0x74 */ void *sp74;                          /* inferred */
};                                                  /* size = 0x78 */

struct _mips2c_stack_func_80AF4ED0 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80AF4F30 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80AF4F6C {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80AF4FF8 {
    /* 0x00 */ char pad0[0x38];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80AF5130 {
    /* 0x00 */ char pad0[0x2C];
    /* 0x2C */ void *sp2C;                          /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80AF520C {
    /* 0x00 */ char pad0[0x58];
    /* 0x58 */ SkelAnime *sp58;                     /* inferred */
    /* 0x5C */ char pad5C[0xC];                     /* maybe part of sp58[4]? */
    /* 0x68 */ ? sp68;                              /* inferred */
    /* 0x68 */ char pad68[0x14];
    /* 0x7C */ void *sp7C;                          /* inferred */
};                                                  /* size = 0x80 */

struct _mips2c_stack_func_80AF5650 {};              /* size 0x0 */

struct _mips2c_stack_func_80AF56A0 {
    /* 0x00 */ char pad0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80AF5820 {
    /* 0x00 */ char pad0[0x70];
    /* 0x70 */ f32 sp70;                            /* inferred */
    /* 0x74 */ f32 sp74;                            /* inferred */
    /* 0x78 */ f32 sp78;                            /* inferred */
    /* 0x7C */ char pad7C[0x18];                    /* maybe part of sp78[7]? */
    /* 0x94 */ f32 sp94;                            /* inferred */
    /* 0x98 */ f32 sp98;                            /* inferred */
    /* 0x9C */ f32 sp9C;                            /* inferred */
    /* 0xA0 */ f32 spA0;                            /* inferred */
    /* 0xA4 */ f32 spA4;                            /* inferred */
    /* 0xA8 */ f32 spA8;                            /* inferred */
    /* 0xAC */ char padAC[0x4];
};                                                  /* size = 0xB0 */

struct _mips2c_stack_func_80AF5E3C {
    /* 0x00 */ char pad0[0x2C];
    /* 0x2C */ void *sp2C;                          /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80AF5FE4 {
    /* 0x00 */ char pad0[0x24];
    /* 0x24 */ s32 sp24;                            /* inferred */
};                                                  /* size = 0x28 */

? EffectSsDtBubble_SpawnColorProfile(?, f32 *, ? *, ? *, s32, s32, s32, s32); /* extern */
void func_80AF4608(EnWdhand *arg0, ? *arg1);        /* static */
void func_80AF4670(Actor *arg0, void *arg1, s16 *arg2, s16 *arg3); /* static */
void func_80AF46F0(Actor *arg0, s32 arg1, s32 arg2, ? *arg3); /* static */
void func_80AF488C(void *arg0, PosRot *arg1);       /* static */
s16 func_80AF48D0(EnWdhand *arg0, s32 arg1);        /* static */
void func_80AF4964(EnWdhand *arg0);                 /* static */
void func_80AF4A88(EnWdhand *arg0, void *arg1);     /* static */
void func_80AF4C18(EnWdhand *arg0);                 /* static */
void func_80AF4C64(Actor *arg0, void *arg1);        /* static */
void func_80AF4ED0(Actor *arg0);                    /* static */
void func_80AF4F30(Actor *arg0, ? arg1);            /* static */
