struct _mips2c_stack_EnMinislime_AddIceShardEffect {
    /* 0x00 */ char pad_0[0x70];
    /* 0x70 */ s32 sp70;                            /* inferred */
    /* 0x74 */ char pad_74[0x24];
};                                                  /* size = 0x98 */

struct _mips2c_stack_EnMinislime_AddIceSmokeEffect {
    /* 0x00 */ char pad_0[0x28];
    /* 0x28 */ f32 sp28;                            /* inferred */
    /* 0x2C */ f32 sp2C;                            /* inferred */
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ f32 sp3C;                            /* inferred */
};                                                  /* size = 0x40 */

struct _mips2c_stack_EnMinislime_ApplyDamage {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnMinislime_Bounce {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_EnMinislime_BreakFromBigslime {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnMinislime_CheckBackgroundCollision {}; /* size 0x0 */

struct _mips2c_stack_EnMinislime_DefeatIdle {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_EnMinislime_DefeatMelt {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_EnMinislime_Despawn {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnMinislime_Destroy {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnMinislime_Disappear {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnMinislime_Fall {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnMinislime_FireArrowDamage {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnMinislime_GekkoThrow {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnMinislime_GrowAndShrink {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ f32 sp1C;                            /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_EnMinislime_IceArrowDamage {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ f32 sp24;                            /* inferred */
    /* 0x28 */ char pad_28[0x4];
    /* 0x2C */ f32 sp2C;                            /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_EnMinislime_Idle {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ PosRot *sp20;                        /* inferred */
    /* 0x24 */ char pad_24[0xC];
};                                                  /* size = 0x30 */

struct _mips2c_stack_EnMinislime_Init {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_EnMinislime_Knockback {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ f32 sp24;                            /* inferred */
    /* 0x28 */ char pad_28[0x4];
    /* 0x2C */ f32 sp2C;                            /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_EnMinislime_MoveToBigslime {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnMinislime_MoveToGekko {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_EnMinislime_SetupBounce {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnMinislime_SetupBreakFromBigslime {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_EnMinislime_SetupDefeatIdle {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnMinislime_SetupDefeatMelt {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnMinislime_SetupDespawn {};   /* size 0x0 */

struct _mips2c_stack_EnMinislime_SetupDisappear {}; /* size 0x0 */

struct _mips2c_stack_EnMinislime_SetupFall {
    /* 0x00 */ char pad_0[0x22];
    /* 0x22 */ s16 sp22;                            /* inferred */
    /* 0x24 */ char pad_24[0x4];
};                                                  /* size = 0x28 */

struct _mips2c_stack_EnMinislime_SetupFireArrowDamage {}; /* size 0x0 */

struct _mips2c_stack_EnMinislime_SetupGekkoThrow {}; /* size 0x0 */

struct _mips2c_stack_EnMinislime_SetupGrowAndShrink {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnMinislime_SetupIceArrowDamage {}; /* size 0x0 */

struct _mips2c_stack_EnMinislime_SetupIdle {};      /* size 0x0 */

struct _mips2c_stack_EnMinislime_SetupKnockback {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnMinislime_SetupMoveToBigslime {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_EnMinislime_SetupMoveToGekko {}; /* size 0x0 */

struct _mips2c_stack_EnMinislime_Update {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ ColliderCylinder *sp2C;              /* inferred */
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ char pad_3C[0xC];
};                                                  /* size = 0x48 */

void EnMinislime_AddIceShardEffect(Actor *arg0);    /* static */
void EnMinislime_AddIceSmokeEffect(EnMinislime *arg0, GlobalContext *arg1); /* static */
void EnMinislime_ApplyDamage(EnMinislime *arg0);    /* static */
void EnMinislime_CheckBackgroundCollision(EnMinislime *arg0); /* static */
void EnMinislime_SetupDefeatIdle(EnMinislime *arg0); /* static */
void EnMinislime_SetupFireArrowDamage(void *arg0);  /* static */
void EnMinislime_SetupIceArrowDamage(void *arg0);   /* static */
void EnMinislime_SetupKnockback(Actor *arg0);       /* static */
void EnMinislime_SetupMoveToBigslime(Actor *arg0);  /* static */
static ColliderCylinderInit D_809857E0 = {
    {0xA, 0x10, 8, 0x38, 0x10, 1},
    {0, {0xF7CFFFFF, 0, 4}, {0xF7CFFFFF, 0, 0}, 9, 5, 1},
    {0x36, 0x3C, 0xFFE2, {0, 0, 0}},
};
static CollisionCheckInfoInit D_8098580C = {4, 0x28, 0x28, 0x1E};
static DamageTable D_80985814 = {
