typedef struct EnFish2 {
    /* 0x0000 */ Actor actor;
    /* 0x0144 */ SkelAnime unk_144;                 /* inferred */
    /* 0x0188 */ Vec3s unk_188;                     /* inferred */
    /* 0x018E */ char pad_18E[0x8A];                /* maybe part of unk_188[24]? */
    /* 0x0218 */ Vec3s unk_218;                     /* inferred */
    /* 0x021E */ char pad_21E[0x8A];                /* maybe part of unk_218[24]? */
    /* 0x02A8 */ void (*actionFunc)(EnFish2 *, GlobalContext *);
    /* 0x02AC */ char pad_2AC[0x4];
    /* 0x02B0 */ s32 unk_2B0;                       /* inferred */
    /* 0x02B4 */ s16 unk_2B4;                       /* inferred */
    /* 0x02B6 */ s16 unk_2B6;                       /* inferred */
    /* 0x02B8 */ s16 unk_2B8;                       /* inferred */
    /* 0x02BA */ s16 unk_2BA;                       /* inferred */
    /* 0x02BC */ char pad_2BC[0x4];                 /* maybe part of unk_2BA[3]? */
    /* 0x02C0 */ s32 unk_2C0;                       /* inferred */
    /* 0x02C4 */ char pad_2C4[0x6];                 /* maybe part of unk_2C0[2]? */
    /* 0x02CA */ s16 unk_2CA;                       /* inferred */
    /* 0x02CC */ char pad_2CC[0x8];                 /* maybe part of unk_2CA[5]? */
    /* 0x02D4 */ f32 unk_2D4;                       /* inferred */
    /* 0x02D8 */ f32 unk_2D8;                       /* inferred */
    /* 0x02DC */ Vec3f unk_2DC;                     /* inferred */
    /* 0x02E8 */ Vec3f unk_2E8;                     /* inferred */
    /* 0x02F4 */ Vec3f unk_2F4;                     /* inferred */
    /* 0x0300 */ char pad_300[0x24];                /* maybe part of unk_2F4[4]? */
    /* 0x0324 */ Vec3f unk_324;                     /* inferred */
    /* 0x0330 */ f32 unk_330;                       /* inferred */
    /* 0x0334 */ f32 unk_334;                       /* inferred */
    /* 0x0338 */ char pad_338[0x4];
    /* 0x033C */ f32 unk_33C;                       /* inferred */
    /* 0x0340 */ char pad_340[0x4];
    /* 0x0344 */ s32 unk_344;                       /* inferred */
    /* 0x0348 */ s16 unk_348;                       /* inferred */
    /* 0x034A */ s16 unk_34A;                       /* inferred */
    /* 0x034C */ s16 unk_34C;                       /* inferred */
    /* 0x034E */ char pad_34E[0x2];
    /* 0x0350 */ void *unk_350;                     /* inferred */
    /* 0x0354 */ char pad_354[0x4];
    /* 0x0358 */ ColliderJntSph unk_358;            /* inferred */
    /* 0x0378 */ ColliderJntSphElement unk_378;     /* inferred */
    /* 0x03B8 */ char pad_3B8[0x1C60];              /* maybe part of unk_378[114]? */
} EnFish2;                                          /* size = 0x2018 */

struct _mips2c_stack_EnFish2_Destroy {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnFish2_Draw {
    /* 0x00 */ char pad_0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_EnFish2_Init {
    /* 0x00 */ char pad_0[0x38];
};                                                  /* size = 0x38 */

struct _mips2c_stack_EnFish2_Update {
    /* 0x00 */ char pad_0[0x38];
    /* 0x38 */ f32 *sp38;                           /* inferred */
    /* 0x3C */ CollisionContext *sp3C;              /* inferred */
    /* 0x40 */ char pad_40[0x4];
    /* 0x44 */ Vec3s *sp44;                         /* inferred */
    /* 0x48 */ char pad_48[0x4];
    /* 0x4C */ WaterBox *sp4C;                      /* inferred */
    /* 0x50 */ char pad_50[0x4];
    /* 0x54 */ f32 sp54;                            /* inferred */
    /* 0x58 */ char pad_58[0x4];
    /* 0x5C */ f32 sp5C;                            /* inferred */
    /* 0x60 */ f32 sp60;                            /* inferred */
    /* 0x64 */ f32 sp64;                            /* inferred */
    /* 0x68 */ char pad_68[0x4];
    /* 0x6C */ WaterBox *sp6C;                      /* inferred */
    /* 0x70 */ char pad_70[0x8];
};                                                  /* size = 0x78 */

struct _mips2c_stack_func_80B28370 {
    /* 0x00 */ char pad_0[0x34];
    /* 0x34 */ f32 sp34;                            /* inferred */
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80B28478 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B287F4 {
    /* 0x00 */ char pad_0[0x28];
    /* 0x28 */ Vec3f *sp28;                         /* inferred */
    /* 0x2C */ ? sp2C;                              /* inferred */
    /* 0x2C */ char pad_2C[0xC];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80B288E8 {};              /* size 0x0 */

struct _mips2c_stack_func_80B2899C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B289DC {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ WaterBox *sp2C;                      /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80B28B5C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B28C14 {
    /* 0x00 */ char pad_0[0x50];
    /* 0x50 */ WaterBox *sp50;                      /* inferred */
    /* 0x54 */ void *sp54;                          /* inferred */
};                                                  /* size = 0x58 */

struct _mips2c_stack_func_80B29128 {};              /* size 0x0 */

struct _mips2c_stack_func_80B2913C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B29194 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80B29250 {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80B2938C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B293C4 {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ f32 sp2C;                            /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80B2951C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B295A4 {
    /* 0x00 */ char pad_0[0x60];
    /* 0x60 */ f32 sp60;                            /* inferred */
    /* 0x64 */ char pad_64[0x4];
    /* 0x68 */ f32 sp68;                            /* inferred */
    /* 0x6C */ char pad_6C[0xC];
};                                                  /* size = 0x78 */

struct _mips2c_stack_func_80B29778 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B297FC {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ Vec3f *sp2C;                         /* inferred */
    /* 0x30 */ Vec3f *sp30;                         /* inferred */
    /* 0x34 */ char pad_34[0x4];
    /* 0x38 */ s32 sp38;                            /* inferred */
    /* 0x3C */ ? sp3C;                              /* inferred */
    /* 0x3C */ char pad_3C[0x4];
    /* 0x40 */ f32 sp40;                            /* inferred */
    /* 0x44 */ char pad_44[0x4];
    /* 0x48 */ ? sp48;                              /* inferred */
    /* 0x48 */ char pad_48[0x4];
    /* 0x4C */ f32 sp4C;                            /* inferred */
    /* 0x50 */ char pad_50[0x8];
};                                                  /* size = 0x58 */

struct _mips2c_stack_func_80B29E5C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B29EE4 {
    /* 0x00 */ char pad_0[0x28];
    /* 0x28 */ PosRot *sp28;                        /* inferred */
    /* 0x2C */ ? sp2C;                              /* inferred */
    /* 0x2C */ char pad_2C[0xC];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80B2A01C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B2A094 {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ f32 sp2C;                            /* inferred */
    /* 0x30 */ char pad_30[0x4];
    /* 0x34 */ f32 sp34;                            /* inferred */
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80B2A23C {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ PosRot *sp24;                        /* inferred */
    /* 0x28 */ char pad_28[0x4];
    /* 0x2C */ f32 sp2C;                            /* inferred */
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ f32 sp34;                            /* inferred */
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80B2A448 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B2A498 {
    /* 0x00 */ char pad_0[0x6C];
    /* 0x6C */ f32 sp6C;                            /* inferred */
    /* 0x70 */ f32 sp70;                            /* inferred */
    /* 0x74 */ f32 sp74;                            /* inferred */
    /* 0x78 */ WaterBox *sp78;                      /* inferred */
    /* 0x7C */ char pad_7C[0x4];
    /* 0x80 */ f32 sp80;                            /* inferred */
    /* 0x84 */ f32 sp84;                            /* inferred */
    /* 0x88 */ f32 sp88;                            /* inferred */
    /* 0x8C */ f32 sp8C;                            /* inferred */
};                                                  /* size = 0x90 */

struct _mips2c_stack_func_80B2ABF4 {};              /* size 0x0 */

struct _mips2c_stack_func_80B2AC20 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ Gfx *sp1C;                           /* inferred */
    /* 0x20 */ char pad_20[0x4];
    /* 0x24 */ GraphicsContext *sp24;               /* inferred */
    /* 0x28 */ char pad_28[0x8];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80B2ADB0 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80B2AF80 {
    /* 0x00 */ char pad_0[0x7C];
    /* 0x7C */ f32 sp7C;                            /* inferred */
    /* 0x80 */ f32 sp80;                            /* inferred */
    /* 0x84 */ f32 sp84;                            /* inferred */
    /* 0x88 */ char pad_88[0x4];
    /* 0x8C */ f32 sp8C;                            /* inferred */
    /* 0x90 */ WaterBox *sp90;                      /* inferred */
    /* 0x94 */ char pad_94[0x4];
};                                                  /* size = 0x98 */

struct _mips2c_stack_func_80B2B180 {
    /* 0x00 */ char pad_0[0x40];
};                                                  /* size = 0x40 */

s32 func_800C5A64(s32, s32, s32, Actor *);          /* extern */
void func_80B28370(Actor *arg0, s32 arg1);          /* static */
s32 func_80B28478(Actor *arg0);                     /* static */
void func_80B287F4(Actor *arg0, s32 arg1);          /* static */
s32 func_80B288E8(Actor *arg0, f32 arg1, f32 arg2, f32 arg3, s32 arg4); /* static */
s32 func_80B2899C(Actor *arg0, GlobalContext *arg1); /* static */
void func_80B289DC(Actor *arg0, GlobalContext *arg1); /* static */
void func_80B28B5C(EnFish2 *arg0);                  /* static */
void func_80B28C14(Actor *arg0, GlobalContext *arg1); /* static */
void func_80B29128(Actor *arg0);                    /* static */
void func_80B2913C(EnFish2 *arg0, GlobalContext *arg1); /* static */
void func_80B29194(Actor *arg0, s32);               /* static */
void func_80B29250(Actor *arg0, GlobalContext *arg1); /* static */
