s32 func_800C5A64(s32, s32, s32, Actor *);          /* extern */
void func_80B28370(Actor *arg0, s32 arg1);          /* static */
s32 func_80B28478(Actor *arg0);                     /* static */
void func_80B287F4(Actor *arg0, s32 arg1);          /* static */
s32 func_80B288E8(Actor *arg0, f32 arg1, f32 arg2, f32 arg3, s32 arg4); /* static */
s32 func_80B2899C(Actor *arg0, GlobalContext *arg1); /* static */
void func_80B289DC(Actor *arg0, GlobalContext *arg1); /* static */
void func_80B28B5C(EnFish2 *arg0);                  /* static */
void func_80B28C14(Actor *arg0, GlobalContext *arg1); /* static */
void func_80B29128(Actor *arg0);                    /* static */
void func_80B2913C(EnFish2 *arg0, GlobalContext *arg1); /* static */
void func_80B29194(Actor *arg0, s32);               /* static */
void func_80B29250(Actor *arg0, GlobalContext *arg1); /* static */
void func_80B2938C(Actor *arg0);                    /* static */
void func_80B293C4(Actor *arg0, GlobalContext *arg1); /* static */
void func_80B2951C(Actor *arg0);                    /* static */
void func_80B295A4(Actor *arg0, GlobalContext *arg1); /* static */
void func_80B29778(Actor *arg0);                    /* static */
void func_80B297FC(Actor *arg0, GlobalContext *arg1); /* static */
void func_80B29E5C(void *arg0, void *arg1);         /* static */
void func_80B29EE4(Actor *arg0, GlobalContext *arg1); /* static */
void func_80B2A01C(EnFish2 *, GlobalContext *);     /* static */
void func_80B2A094(EnFish2 *, GlobalContext *);     /* static */
void func_80B2A23C(EnFish2 *, GlobalContext *);     /* static */
void func_80B2A448(Actor *arg0);                    /* static */
void func_80B2A498(Actor *arg0, GlobalContext *arg1); /* static */
s32 func_80B2ABF4(GlobalContext *arg0, s32 arg1, Gfx **arg2, Vec3f *arg3, Vec3s *rot, Actor *actor); /* static */
void func_80B2AC20(GraphicsContext **arg0, s32 arg1, u32 *arg2, Vec3s *arg3, Actor *arg4); /* static */
void func_80B2ADB0(Actor *arg0, Vec3f *arg1, s16 arg2); /* static */
void func_80B2AF80(EnFish2 *arg0, GlobalContext *arg1); /* static */
void func_80B2B180(EnFish2 *arg0, GlobalContext *arg1); /* static */
extern AnimationHeader D_060013AC;
extern FlexSkeletonHeader D_06006190;
static s32 D_80B2B2E0 = 0;
static s32 D_80B2B2E4 = 0;
static s32 D_80B2B2E8 = 0;
static s32 D_80B2B2EC = 0;
static s32 D_80B2B2F0 = 0;
static Actor *D_80B2B2F4 = NULL;
static ColliderJntSphElementInit D_80B2B318 = {
    {{2, {0xF7CFFFFF, 0, 0}, {0xF7CFFFFF, 0, 0}, 0, 0, 1}, {1, {{0, 0, 0}, 0}, 1}},
    {
        {2, {0xF7CFFFFF, 0, 0}, {0xF7CFFFFF, 0, 0}, 0, 0, 1},
        {0x11, {{0, 0, 0}, 0}, 1},
    },
};
static ColliderJntSphInit D_80B2B360 = {{0xC, 0, 0, 0x39, 0x10, 0}, 2, &D_80B2B318};
static ? D_80B2B370;                                /* unable to generate initializer */
static f32 D_80B2B380 = {0.019f, 0.033f};
static ? D_80B2B388;                                /* unable to generate initializer */
static ? D_80B2B3A0;                                /* unable to generate initializer */
static ? D_80B2B3A8;                                /* unable to generate initializer */

typedef struct EnFish2 {
    /* 0x0000 */ Actor actor;
    /* 0x0144 */ SkelAnime unk144;                  /* inferred */
    /* 0x0188 */ Vec3s unk188;                      /* inferred */
    /* 0x018E */ char pad18E[0x8A];                 /* maybe part of unk188[24]? */
    /* 0x0218 */ Vec3s unk218;                      /* inferred */
    /* 0x021E */ char pad21E[0x8A];                 /* maybe part of unk218[24]? */
    /* 0x02A8 */ void (*actionFunc)(EnFish2 *, GlobalContext *);
    /* 0x02AC */ char pad2AC[0x4];                  /* maybe part of actionFunc[2]? */
    /* 0x02B0 */ s32 unk2B0;                        /* inferred */
    /* 0x02B4 */ s16 unk2B4;                        /* inferred */
    /* 0x02B6 */ s16 unk2B6;                        /* inferred */
    /* 0x02B8 */ s16 unk2B8;                        /* inferred */
    /* 0x02BA */ s16 unk2BA;                        /* inferred */
    /* 0x02BC */ char pad2BC[0x4];                  /* maybe part of unk2BA[3]? */
    /* 0x02C0 */ s32 unk2C0;                        /* inferred */
    /* 0x02C4 */ s32 unk2C4;                        /* inferred */
    /* 0x02C8 */ s8 unk2C8;                         /* inferred */
    /* 0x02C9 */ char pad2C9[0x1];                  /* maybe part of unk2C8[2]? */
    /* 0x02CA */ s16 unk2CA;                        /* inferred */
    /* 0x02CC */ char pad2CC[0x8];                  /* maybe part of unk2CA[5]? */
    /* 0x02D4 */ f32 unk2D4;                        /* inferred */
    /* 0x02D8 */ f32 unk2D8;                        /* inferred */
    /* 0x02DC */ Vec3f unk2DC;                      /* inferred */
    /* 0x02E8 */ Vec3f unk2E8;                      /* inferred */
    /* 0x02F4 */ Vec3f unk2F4;                      /* inferred */
    /* 0x0300 */ char pad300[0x24];                 /* maybe part of unk2F4[4]? */
    /* 0x0324 */ Vec3f unk324;                      /* inferred */
    /* 0x0330 */ f32 unk330;                        /* inferred */
    /* 0x0334 */ f32 unk334;                        /* inferred */
    /* 0x0338 */ char pad338[0x4];                  /* maybe part of unk334[2]? */
    /* 0x033C */ f32 unk33C;                        /* inferred */
    /* 0x0340 */ char pad340[0x4];                  /* maybe part of unk33C[2]? */
    /* 0x0344 */ s32 unk344;                        /* inferred */
    /* 0x0348 */ s16 unk348;                        /* inferred */
    /* 0x034A */ s16 unk34A;                        /* inferred */
    /* 0x034C */ s16 unk34C;                        /* inferred */
    /* 0x034E */ char pad34E[0x2];                  /* maybe part of unk34C[2]? */
    /* 0x0350 */ void *unk350;                      /* inferred */
    /* 0x0354 */ char pad354[0x4];                  /* maybe part of unk350[2]? */
    /* 0x0358 */ ColliderJntSph unk358;             /* inferred */
    /* 0x0378 */ ColliderJntSphElement unk378;      /* inferred */
    /* 0x03B8 */ char pad3B8[0x1C60];
} EnFish2;                                          /* size 0x2018 */

void func_80B28370(Actor *arg0, s32 arg1) {
    f32 sp34;
    s32 temp_v1;
    f32 phi_f0;
    s32 phi_v1;

    arg0->unk2AC = arg1;
    temp_v1 = arg0->unk2AC;
    arg0->unk2CC = (f32) SkelAnime_GetFrameCount(*(&D_80B2B388 + (arg1 * 4)));
    phi_f0 = 0.0f;
    if (temp_v1 == 3) {
        phi_f0 = (f32) SkelAnime_GetFrameCount(*(&D_80B2B388 + (temp_v1 * 4))) - 21.0f;
    }
    phi_v1 = arg0->unk2AC;
    if (arg0->unk2AC == 2) {
        sp34 = phi_f0;
        arg0->unk2CC = (f32) ((f32) SkelAnime_GetFrameCount(*(&D_80B2B388 + (arg0->unk2AC * 4))) - 21.0f);
        phi_v1 = arg0->unk2AC;
    }
    SkelAnime_ChangeAnim(arg0 + 0x144, *(&D_80B2B388 + (phi_v1 * 4)), 1.0f, phi_f0, arg0->unk2CC, (u8) (s32) *(&D_80B2B3A0 + phi_v1), -10.0f);
}

s32 func_80B28478(Actor *arg0) {
    void *temp_v0;
    void *temp_v0_2;

    if (arg0->unk2C8 == 0) {
