typedef struct EnRr {
    /* 0x000 */ Actor actor;
    /* 0x144 */ void (*actionFunc)(EnRr *, GlobalContext *);
    /* 0x148 */ ColliderCylinder unk148;            /* inferred */
    /* 0x194 */ ColliderCylinder unk194;            /* inferred */
    /* 0x1E0 */ u8 unk1E0;                          /* inferred */
    /* 0x1E1 */ u8 unk1E1;                          /* inferred */
    /* 0x1E2 */ u8 unk1E2;                          /* inferred */
    /* 0x1E3 */ char pad1E3[0x1];
    /* 0x1E4 */ s16 unk1E4;                         /* inferred */
    /* 0x1E6 */ s16 unk1E6;                         /* inferred */
    /* 0x1E8 */ s16 unk1E8;                         /* inferred */
    /* 0x1EA */ s16 unk1EA;                         /* inferred */
    /* 0x1EC */ char pad1EC[0x2];
    /* 0x1EE */ s16 unk1EE;                         /* inferred */
    /* 0x1F0 */ s16 unk1F0;                         /* inferred */
    /* 0x1F2 */ char pad1F2[0x2];
    /* 0x1F4 */ s16 unk1F4;                         /* inferred */
    /* 0x1F6 */ s16 unk1F6;                         /* inferred */
    /* 0x1F8 */ s16 unk1F8;                         /* inferred */
    /* 0x1FA */ s16 unk1FA;                         /* inferred */
    /* 0x1FC */ s16 unk1FC;                         /* inferred */
    /* 0x1FE */ char pad1FE[0x2];
    /* 0x200 */ f32 unk200;                         /* inferred */
    /* 0x204 */ f32 unk204;                         /* inferred */
    /* 0x208 */ f32 unk208;                         /* inferred */
    /* 0x20C */ f32 unk20C;                         /* inferred */
    /* 0x210 */ f32 unk210;                         /* inferred */
    /* 0x214 */ f32 unk214;                         /* inferred */
    /* 0x218 */ f32 unk218;                         /* inferred */
    /* 0x21C */ f32 unk21C;                         /* inferred */
    /* 0x220 */ f32 unk220;                         /* inferred */
    /* 0x224 */ f32 unk224;                         /* inferred */
    /* 0x228 */ f32 unk228;                         /* inferred */
    /* 0x22C */ f32 unk22C;                         /* inferred */
    /* 0x230 */ f32 unk230;                         /* inferred */
    /* 0x234 */ Vec3f unk234;                       /* inferred */
    /* 0x240 */ char pad240[0xE4];                  /* maybe part of unk234[20]? */
    /* 0x324 */ f32 unk324;                         /* inferred */
    /* 0x328 */ f32 unk328;                         /* inferred */
    /* 0x32C */ f32 unk32C;                         /* inferred */
    /* 0x330 */ char pad330[0x4];
    /* 0x334 */ f32 unk334;                         /* inferred */
    /* 0x338 */ char pad338[0x6];                   /* maybe part of unk334[2]? */
    /* 0x33E */ s16 unk33E;                         /* inferred */
    /* 0x340 */ char pad340[0x68];                  /* maybe part of unk33E[53]? */
    /* 0x3A8 */ f32 unk3A8;                         /* inferred */
    /* 0x3AC */ char pad3AC[0x4];
    /* 0x3B0 */ f32 unk3B0;                         /* inferred */
    /* 0x3B4 */ char pad3B4[0x10];                  /* maybe part of unk3B0[5]? */
} EnRr;                                             /* size = 0x3C4 */

struct _mips2c_stack_EnRr_Destroy {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnRr_Draw {
    /* 0x00 */ char pad0[0x80];
    /* 0x80 */ Vec3f *sp80;                         /* inferred */
    /* 0x84 */ char pad84[0x18];                    /* maybe part of sp80[7]? */
    /* 0x9C */ GraphicsContext *sp9C;               /* inferred */
    /* 0xA0 */ char padA0[0x4];
    /* 0xA4 */ f32 spA4;                            /* inferred */
    /* 0xA8 */ f32 spA8;                            /* inferred */
    /* 0xAC */ f32 spAC;                            /* inferred */
    /* 0xB0 */ char padB0[0x18];
};                                                  /* size = 0xC8 */

struct _mips2c_stack_EnRr_Init {
    /* 0x00 */ char pad0[0x24];
    /* 0x24 */ ColliderCylinder *sp24;              /* inferred */
    /* 0x28 */ char pad28[0x8];
};                                                  /* size = 0x30 */

struct _mips2c_stack_EnRr_Update {
    /* 0x00 */ char pad0[0x48];
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_808FA01C {
    /* 0x00 */ char pad0[0x38];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_808FA11C {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_808FA19C {
    /* 0x00 */ char pad0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_808FA238 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_808FA260 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_808FA344 {};              /* size 0x0 */

struct _mips2c_stack_func_808FA3F8 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_808FA4F4 {
    /* 0x00 */ char pad0[0x2C];
    /* 0x2C */ f32 sp2C;                            /* inferred */
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ s32 sp34;                            /* inferred */
    /* 0x38 */ u32 sp38;                            /* inferred */
    /* 0x3C */ char pad3C[0x4];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_808FA6B8 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_808FA7AC {};              /* size 0x0 */

struct _mips2c_stack_func_808FA870 {};              /* size 0x0 */

struct _mips2c_stack_func_808FA910 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_808FA9CC {};              /* size 0x0 */

struct _mips2c_stack_func_808FAA94 {
    /* 0x00 */ char pad0[0x2C];
    /* 0x2C */ void *sp2C;                          /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_808FAC80 {
    /* 0x00 */ char pad0[0x1C];
    /* 0x1C */ void *sp1C;                          /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_808FAD1C {
    /* 0x00 */ char pad0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_808FAE50 {
    /* 0x00 */ char pad0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_808FAF94 {
    /* 0x00 */ char pad0[0x2C];
    /* 0x2C */ Actor *sp2C;                         /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_808FB088 {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_808FB1C0 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_808FB2C0 {
    /* 0x00 */ char pad0[0x24];
    /* 0x24 */ Actor *sp24;                         /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_808FB398 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_808FB42C {
    /* 0x00 */ char pad0[0x74];
    /* 0x74 */ f32 sp74;                            /* inferred */
    /* 0x78 */ f32 sp78;                            /* inferred */
    /* 0x7C */ f32 sp7C;                            /* inferred */
    /* 0x80 */ char pad80[0x10];
};                                                  /* size = 0x90 */

struct _mips2c_stack_func_808FB680 {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_808FB710 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_808FB794 {
    /* 0x00 */ char pad0[0x2C];
    /* 0x2C */ f32 sp2C;                            /* inferred */
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ f32 sp34;                            /* inferred */
};                                                  /* size = 0x38 */

void func_808FA01C(Actor *arg0, GlobalContext *arg1, void *arg2); /* static */
void func_808FA11C(Actor *arg0, GlobalContext *);   /* static */
void func_808FA19C(Actor *arg0, GlobalContext *arg1); /* static */
void func_808FA238(Actor *arg0, f32 arg1);          /* static */
void func_808FA260(Actor *arg0);                    /* static */
void func_808FA344(EnRr *arg0);                     /* static */
void func_808FA3F8(Actor *arg0, void *arg1, Actor *); /* static */
void func_808FA4F4(Actor *arg0, GlobalContext *arg1); /* static */
void func_808FA6B8(Actor *arg0);                    /* static */
void func_808FA7AC(EnRr *arg0);                     /* static */
void func_808FA870(EnRr *arg0);                     /* static */
void func_808FA910(Actor *arg0);                    /* static */
