CRASHED

typedef struct ObjHunsui {
    /* 0x000 */ Actor actor;
    /* 0x144 */ s32 unk_144;                        /* inferred */
    /* 0x148 */ char pad_148[0x14];                 /* maybe part of unk_144[6]? */
    /* 0x15C */ void (*actionFunc)(ObjHunsui *, GlobalContext *);
    /* 0x160 */ s16 unk_160;                        /* inferred */
    /* 0x162 */ char pad_162[0x2];
    /* 0x164 */ s32 unk_164;                        /* inferred */
    /* 0x168 */ s32 unk_168;                        /* inferred */
    /* 0x16C */ s8 unk_16C;                         /* inferred */
    /* 0x16D */ s8 unk_16D;                         /* inferred */
    /* 0x16E */ s8 unk_16E;                         /* inferred */
    /* 0x16F */ char pad_16F[0x1];
    /* 0x170 */ s16 unk_170;                        /* inferred */
    /* 0x172 */ u16 unk_172;                        /* inferred */
    /* 0x174 */ f32 unk_174;                        /* inferred */
    /* 0x178 */ f32 unk_178;                        /* inferred */
    /* 0x17C */ s16 unk_17C;                        /* inferred */
    /* 0x17E */ char pad_17E[0x2];
    /* 0x180 */ s32 unk_180;                        /* inferred */
    /* 0x184 */ s16 unk_184;                        /* inferred */
    /* 0x186 */ s16 unk_186;                        /* inferred */
    /* 0x188 */ s16 unk_188;                        /* inferred */
    /* 0x18A */ s16 unk_18A;                        /* inferred */
    /* 0x18C */ s16 unk_18C;                        /* inferred */
    /* 0x18E */ char pad_18E[0x2];
    /* 0x190 */ f32 unk_190;                        /* inferred */
    /* 0x194 */ f32 unk_194;                        /* inferred */
    /* 0x198 */ f32 unk_198;                        /* inferred */
    /* 0x19C */ char pad_19C[0x1C];                 /* maybe part of unk_198[8]? */
} ObjHunsui;                                        /* size = 0x1B8 */

struct _mips2c_stack_ObjHunsui_Destroy {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_ObjHunsui_Draw {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_ObjHunsui_Init {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_ObjHunsui_Update {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B9C450 {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ s32 sp2C;                            /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80B9C5E8 {
    /* 0x00 */ char pad_0[0x38];
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ char pad_3C[0x2];
    /* 0x3E */ s16 sp3E;                            /* inferred */
    /* 0x40 */ f32 sp40;                            /* inferred */
    /* 0x44 */ f32 sp44;                            /* inferred */
    /* 0x48 */ f32 sp48;                            /* inferred */
    /* 0x4C */ char pad_4C[0xC];
};                                                  /* size = 0x58 */

struct _mips2c_stack_func_80B9CE64 {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ s32 sp2C;                            /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80B9D094 {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80B9D0FC {};              /* size 0x0 */

struct _mips2c_stack_func_80B9D120 {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80B9D288 {};              /* size 0x0 */

struct _mips2c_stack_func_80B9D2BC {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B9D334 {
    /* 0x00 */ char pad_0[0x74];
    /* 0x74 */ ? sp74;                              /* inferred */
    /* 0x74 */ char pad_74[0x4];
    /* 0x78 */ f32 sp78;                            /* inferred */
    /* 0x7C */ char pad_7C[0x4];
};                                                  /* size = 0x80 */

struct _mips2c_stack_func_80B9D4D0 {};              /* size 0x0 */

struct _mips2c_stack_func_80B9D714 {
    /* 0x00 */ char pad_0[0x28];
    /* 0x28 */ f32 sp28;                            /* inferred */
    /* 0x2C */ char pad_2C[0x2];
    /* 0x2E */ s16 sp2E;                            /* inferred */
    /* 0x30 */ Actor *sp30;                         /* inferred */
    /* 0x34 */ char pad_34[0x4];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80B9DA60 {
    /* 0x00 */ char pad_0[0x44];
    /* 0x44 */ Gfx *sp44;                           /* inferred */
    /* 0x48 */ Gfx *sp48;                           /* inferred */
    /* 0x4C */ char pad_4C[0x4];
    /* 0x50 */ GraphicsContext *sp50;               /* inferred */
    /* 0x54 */ char pad_54[0xC];
};                                                  /* size = 0x60 */

s32 func_8013E640(GlobalContext *, ObjHunsui *, ?, ?, s32, s32, ? (*)(s32, ?, void *, ?)); /* extern */
s32 func_80B9C450(GlobalContext *arg0, s32 arg1, s32 arg2, ObjHunsui *); /* static */
void func_80B9C5E8(DynaPolyActor *arg0, GlobalContext *arg1); /* static */
void func_80B9CE64(ObjHunsui *, GlobalContext *);   /* static */
void func_80B9D094(Actor *arg0, GlobalContext *arg1, s16, GlobalContext *); /* static */
void func_80B9D0FC(ObjHunsui *arg0, GlobalContext *arg1); /* static */
void func_80B9D120(Actor *arg0, GlobalContext *arg1); /* static */
? func_80B9D288(s32 arg0, ? arg1, void *arg2, ? arg3); /* static */
void func_80B9D2BC(ObjHunsui *arg0, GlobalContext *arg1); /* static */
void func_80B9D334(ObjHunsui *arg0, GlobalContext *arg1); /* static */
void func_80B9D4D0(ObjHunsui *arg0, GlobalContext *arg1); /* static */
