CRASHED

typedef struct ObjHunsui {
    /* 0x000 */ Actor actor;
    /* 0x144 */ s32 unk144;                         /* inferred */
    /* 0x148 */ char pad148[0x14];                  /* maybe part of unk144[6]? */
    /* 0x15C */ void (*actionFunc)(ObjHunsui *, GlobalContext *);
    /* 0x160 */ s16 unk160;                         /* inferred */
    /* 0x162 */ char pad162[0x2];
    /* 0x164 */ s32 unk164;                         /* inferred */
    /* 0x168 */ s32 unk168;                         /* inferred */
    /* 0x16C */ s8 unk16C;                          /* inferred */
    /* 0x16D */ s8 unk16D;                          /* inferred */
    /* 0x16E */ s8 unk16E;                          /* inferred */
    /* 0x16F */ char pad16F[0x1];
    /* 0x170 */ s16 unk170;                         /* inferred */
    /* 0x172 */ u16 unk172;                         /* inferred */
    /* 0x174 */ f32 unk174;                         /* inferred */
    /* 0x178 */ f32 unk178;                         /* inferred */
    /* 0x17C */ s16 unk17C;                         /* inferred */
    /* 0x17E */ char pad17E[0x2];
    /* 0x180 */ s32 unk180;                         /* inferred */
    /* 0x184 */ s16 unk184;                         /* inferred */
    /* 0x186 */ s16 unk186;                         /* inferred */
    /* 0x188 */ s16 unk188;                         /* inferred */
    /* 0x18A */ s16 unk18A;                         /* inferred */
    /* 0x18C */ s16 unk18C;                         /* inferred */
    /* 0x18E */ char pad18E[0x2];
    /* 0x190 */ f32 unk190;                         /* inferred */
    /* 0x194 */ f32 unk194;                         /* inferred */
    /* 0x198 */ f32 unk198;                         /* inferred */
    /* 0x19C */ char pad19C[0x1C];                  /* maybe part of unk198[8]? */
} ObjHunsui;                                        /* size = 0x1B8 */

struct _mips2c_stack_ObjHunsui_Destroy {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_ObjHunsui_Draw {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_ObjHunsui_Init {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_ObjHunsui_Update {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B9C450 {
    /* 0x00 */ char pad0[0x2C];
    /* 0x2C */ s32 sp2C;                            /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80B9C5E8 {
    /* 0x00 */ char pad0[0x38];
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ char pad3C[0x2];
    /* 0x3E */ s16 sp3E;                            /* inferred */
    /* 0x40 */ f32 sp40;                            /* inferred */
    /* 0x44 */ f32 sp44;                            /* inferred */
    /* 0x48 */ f32 sp48;                            /* inferred */
    /* 0x4C */ char pad4C[0xC];
};                                                  /* size = 0x58 */

struct _mips2c_stack_func_80B9CE64 {
    /* 0x00 */ char pad0[0x2C];
    /* 0x2C */ s32 sp2C;                            /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80B9D094 {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80B9D0FC {};              /* size 0x0 */

struct _mips2c_stack_func_80B9D120 {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80B9D288 {};              /* size 0x0 */

struct _mips2c_stack_func_80B9D2BC {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B9D334 {
    /* 0x00 */ char pad0[0x74];
    /* 0x74 */ ? sp74;                              /* inferred */
    /* 0x74 */ char pad74[0x4];
    /* 0x78 */ f32 sp78;                            /* inferred */
    /* 0x7C */ char pad7C[0x4];
};                                                  /* size = 0x80 */

struct _mips2c_stack_func_80B9D4D0 {};              /* size 0x0 */

struct _mips2c_stack_func_80B9D714 {
    /* 0x00 */ char pad0[0x28];
    /* 0x28 */ f32 sp28;                            /* inferred */
    /* 0x2C */ char pad2C[0x2];
    /* 0x2E */ s16 sp2E;                            /* inferred */
    /* 0x30 */ Actor *sp30;                         /* inferred */
    /* 0x34 */ char pad34[0x4];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80B9DA60 {
    /* 0x00 */ char pad0[0x44];
    /* 0x44 */ Gfx *sp44;                           /* inferred */
    /* 0x48 */ Gfx *sp48;                           /* inferred */
    /* 0x4C */ char pad4C[0x4];
    /* 0x50 */ GraphicsContext *sp50;               /* inferred */
    /* 0x54 */ char pad54[0xC];
};                                                  /* size = 0x60 */

s32 func_8013E640(GlobalContext *, ObjHunsui *, ?, ?, s32, s32, ? (*)(s32, ?, void *, ?)); /* extern */
s32 func_80B9C450(GlobalContext *arg0, s32 arg1, s32 arg2, ObjHunsui *); /* static */
void func_80B9C5E8(DynaPolyActor *arg0, GlobalContext *arg1); /* static */
void func_80B9CE64(ObjHunsui *, GlobalContext *);   /* static */
void func_80B9D094(Actor *arg0, GlobalContext *arg1, s16, GlobalContext *); /* static */
void func_80B9D0FC(ObjHunsui *arg0, GlobalContext *arg1); /* static */
void func_80B9D120(Actor *arg0, GlobalContext *arg1); /* static */
? func_80B9D288(s32 arg0, ? arg1, void *arg2, ? arg3); /* static */
void func_80B9D2BC(ObjHunsui *arg0, GlobalContext *arg1); /* static */
void func_80B9D334(ObjHunsui *arg0, GlobalContext *arg1); /* static */
void func_80B9D4D0(ObjHunsui *arg0, GlobalContext *arg1); /* static */
