? EffectSsBlast_SpawnWhiteCustomScale(GlobalContext *, f32 *, ? *, ? *, s32, s32, s32); /* extern */
void func_80973EFC(EnSsh *arg0, GlobalContext *arg1); /* static */
s32 func_80973F84(GlobalContext *arg0);             /* static */
? func_80974080(EnSsh *arg0, GlobalContext *arg1);  /* static */
void func_80974118(Vec3s *arg0);                    /* static */
void func_80974220(Vec3s *arg0);                    /* static */
void func_8097424C(Actor *arg0, GlobalContext *arg1); /* static */
f32 func_80974374(Actor *arg0, s32 arg1);           /* static */
void func_809744A8(EnSsh *);                        /* static */
void func_809744C8(Actor *arg0);                    /* static */
void func_809744FC(EnSsh *arg0);                    /* static */
void func_80974540(EnSsh *arg0);                    /* static */
void func_80974590(Actor *arg0);                    /* static */
void func_809745BC(Actor *arg0, f32 arg1, f32 arg2); /* static */
? func_80974730(Actor *arg0);                       /* static */
void func_8097480C(void *arg0, ? arg1);             /* static */
void func_809748DC(void *arg0, ? arg1);             /* static */
void func_8097497C(EnSsh *arg0, GlobalContext *);   /* static */
void func_809749B8(EnSsh *arg0, GlobalContext *arg1); /* static */
s32 func_80974A24(EnSsh *arg0, GlobalContext *arg1); /* static */
s32 func_80974B0C(EnSsh *arg0);                     /* static */
s32 func_80974B44(EnSsh *arg0);                     /* static */
void func_80974B84(EnSsh *arg0);                    /* static */
void func_80974CC8(EnSsh *arg0, GlobalContext *arg1); /* static */
? func_80974D3C(Actor *arg0, GlobalContext *arg1);  /* static */
s32 func_80974E44(Actor *arg0);                     /* static */
s32 func_80974EA0(Actor *arg0, GlobalContext *arg1); /* static */
s32 func_80974F78(Actor *arg0, GlobalContext *arg1); /* static */
void func_8097502C(Actor *arg0, GlobalContext *arg1); /* static */
void func_80975070(Actor *arg0, GlobalContext *arg1); /* static */
? func_80975128(Actor *arg0, GlobalContext *arg1, Actor *); /* static */
void func_80975300(Actor *arg0, GlobalContext *arg1); /* static */
void func_8097561C(EnSsh *this, GlobalContext *globalCtx); /* static */
void func_809756D0(Actor *arg0, GlobalContext *arg1); /* static */
void func_80975B6C(EnSsh *arg0);                    /* static */
s32 func_80975DBC(GlobalContext *arg0, s32 arg1, Gfx **arg2, Vec3f *arg3, Vec3s *arg5, Actor *actor); /* static */
void func_80975EB8(void **arg0, s32 arg1, Gfx **arg2, Vec3s *arg3, Actor *arg4); /* static */
extern ? D_060000D8;
extern AnimationHeaderCommon D_06000304;
extern AnimationHeader D_06001494;
extern Gfx D_06005210;
extern Gfx D_06005850;
extern Gfx D_06005F78;
extern SkeletonHeader D_06006470;
static CollisionCheckInfoInit2 D_8097605C = {1, 0, 0, 0, 0xFF};
static ColliderJntSphElementInit D_80976094 = {
    {0, {0xF7CFFFFF, 0, 4}, {0, 0, 0}, 1, 0, 1},
    {1, {{0, 0xFF10, 0}, 0x1C}, 0x64},
};
static ColliderJntSphInit D_809760B8 = {{6, 0x11, 0, 0x39, 0x10, 0}, 1, &D_80976094};
static ? D_809760C8;                                /* unable to generate initializer */
static s32 D_809760D4 = 0xFFFFFF4B;
static s32 D_809760D8 = 0xFFFFFF4B;
static s32 D_809760DC = 0xFFFFFF00;
static s32 D_809760E0 = 0xFFFFFF00;
static ? D_809760E4;                                /* unable to generate initializer */
static ? D_809760F0;                                /* unable to generate initializer */
static ? D_809760FC;                                /* unable to generate initializer */
static ? D_80976114;                                /* unable to generate initializer */
static ? D_80976130;                                /* unable to generate initializer */
static ? D_8097614C;                                /* unable to generate initializer */
static s32 D_80976154 = {0x42200000, 0, 0, 0, 0, 0, 0xC2200000, 0, 0};
static ? D_80976178;                                /* unable to generate initializer */

typedef struct EnSsh {
    /* 0x0000 */ Actor actor;
    /* 0x0144 */ SkelAnime unk144;                  /* inferred */
    /* 0x0188 */ Vec3s unk188;                      /* inferred */
    /* 0x018E */ char pad18E[0xAE];                 /* maybe part of unk188[30]? */
    /* 0x023C */ Vec3s unk23C;                      /* inferred */
    /* 0x0242 */ char pad242[0xAE];                 /* maybe part of unk23C[30]? */
    /* 0x02F0 */ void (*actionFunc)(EnSsh *, GlobalContext *);
    /* 0x02F4 */ ColliderCylinder unk2F4;           /* inferred */
    /* 0x0340 */ char pad340[0x20];
    /* 0x0360 */ s32 unk360;                        /* inferred */
    /* 0x0364 */ char pad364[0x48];                 /* maybe part of unk360[19]? */
    /* 0x03AC */ s32 unk3AC;                        /* inferred */
    /* 0x03B0 */ char pad3B0[0x10C];                /* maybe part of unk3AC[68]? */
    /* 0x04BC */ ColliderJntSph unk4BC;             /* inferred */
    /* 0x04DC */ char pad4DC[0x40];                 /* maybe part of unk4BC[3]? */
    /* 0x051C */ s16 unk51C;                        /* inferred */
    /* 0x051E */ char pad51E[0x2];                  /* maybe part of unk51C[2]? */
    /* 0x0520 */ s16 unk520;                        /* inferred */
    /* 0x0522 */ s16 unk522;                        /* inferred */
    /* 0x0524 */ char pad524[0x4];                  /* maybe part of unk522[3]? */
    /* 0x0528 */ s16 unk528;                        /* inferred */
    /* 0x052A */ s16 unk52A;                        /* inferred */
    /* 0x052C */ s16 unk52C;                        /* inferred */
    /* 0x052E */ s16 unk52E;                        /* inferred */
    /* 0x0530 */ s32 unk530;                        /* inferred */
    /* 0x0534 */ char pad534[0x4];                  /* maybe part of unk530[2]? */
    /* 0x0538 */ f32 unk538;                        /* inferred */
    /* 0x053C */ f32 unk53C;                        /* inferred */
    /* 0x0540 */ f32 unk540;                        /* inferred */
    /* 0x0544 */ f32 unk544;                        /* inferred */
    /* 0x0548 */ char pad548[0x78];                 /* maybe part of unk544[31]? */
    /* 0x05C0 */ s16 unk5C0;                        /* inferred */
    /* 0x05C2 */ u16 unk5C2;                        /* inferred */
    /* 0x05C4 */ s8 unk5C4;                         /* inferred */
    /* 0x05C5 */ char pad5C5[0x1];                  /* maybe part of unk5C4[2]? */
    /* 0x05C6 */ s16 unk5C6;                        /* inferred */
    /* 0x05C8 */ s16 unk5C8;                        /* inferred */
    /* 0x05CA */ char pad5CA[0x2];                  /* maybe part of unk5C8[2]? */
} EnSsh;                                            /* size 0x5CC */

void EnSsh_SetupAction(EnSsh *this, void (*actionFunc)(EnSsh *, GlobalContext *)) {
    EnSsh *self = (EnSsh *) this;
    self->actionFunc = actionFunc;
}

void func_80973EFC(EnSsh *arg0, GlobalContext *arg1) {
    ? sp34;
    f32 sp30;
    f32 sp2C;
    f32 sp28;
    f32 *temp_a1;

    sp34.unk0 = (s32) D_809760C8.unk0;
    temp_a1 = &sp28;
    sp34.unk4 = (s32) D_809760C8.unk4;
    sp34.unk8 = (s32) D_809760C8.unk8;
    sp28 = arg0->actor.world.pos.x;
    sp2C = arg0->actor.floorHeight;
    sp30 = arg0->actor.world.pos.z;
    EffectSsBlast_SpawnWhiteCustomScale(arg1, temp_a1, &sp34, &sp34, 0x64, 0xDC, 8);
}

s32 func_80973F84(GlobalContext *arg0) {
    s32 sp1D4;
    s32 sp1D0;
    s32 sp1CC;
    u8 sp1CB;
    u8 sp1CA;
    u8 sp1C9;
    u8 sp1C8;
    u8 sp1C7;
    u8 sp1C6;
    u8 sp1C5;
    u8 sp1C4;
    u8 sp1C3;
    u8 sp1C2;
