typedef struct EnSsh {
    /* 0x000 */ Actor actor;
    /* 0x144 */ SkelAnime unk_144;                  /* inferred */
    /* 0x188 */ Vec3s unk_188;                      /* inferred */
    /* 0x18E */ char pad_18E[0xAE];                 /* maybe part of unk_188[30]? */
    /* 0x23C */ Vec3s unk_23C;                      /* inferred */
    /* 0x242 */ char pad_242[0xAE];                 /* maybe part of unk_23C[30]? */
    /* 0x2F0 */ void (*actionFunc)(EnSsh *, GlobalContext *);
    /* 0x2F4 */ ColliderCylinder unk_2F4;           /* inferred */
    /* 0x340 */ char pad_340[0x17C];                /* maybe part of unk_2F4[6]? */
    /* 0x4BC */ ColliderJntSph unk_4BC;             /* inferred */
    /* 0x4DC */ char pad_4DC[0x40];                 /* maybe part of unk_4BC[3]? */
    /* 0x51C */ s16 unk_51C;                        /* inferred */
    /* 0x51E */ char pad_51E[0x2];
    /* 0x520 */ s16 unk_520;                        /* inferred */
    /* 0x522 */ char pad_522[0x6];                  /* maybe part of unk_520[4]? */
    /* 0x528 */ s16 unk_528;                        /* inferred */
    /* 0x52A */ s16 unk_52A;                        /* inferred */
    /* 0x52C */ s16 unk_52C;                        /* inferred */
    /* 0x52E */ char pad_52E[0x2];
    /* 0x530 */ s32 unk_530;                        /* inferred */
    /* 0x534 */ char pad_534[0x4];
    /* 0x538 */ f32 unk_538;                        /* inferred */
    /* 0x53C */ char pad_53C[0x86];                 /* maybe part of unk_538[34]? */
    /* 0x5C2 */ u16 unk_5C2;                        /* inferred */
    /* 0x5C4 */ s8 unk_5C4;                         /* inferred */
    /* 0x5C5 */ char pad_5C5[0x1];
    /* 0x5C6 */ s16 unk_5C6;                        /* inferred */
    /* 0x5C8 */ s16 unk_5C8;                        /* inferred */
    /* 0x5CA */ char pad_5CA[0x2];
} EnSsh;                                            /* size = 0x5CC */

typedef struct {
    /* 0x00 */ Vec3f pos;
    /* 0x0C */ Vec3s rot;
    /* 0x12 */ s16 unk_12;                          /* inferred */
} PosRot;                                           /* size = 0x14 */

struct _mips2c_stack_EnSsh_Destroy {
    /* 0x00 */ char pad_0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_EnSsh_Draw {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ GraphicsContext *sp2C;               /* inferred */
    /* 0x30 */ char pad_30[0x8];
};                                                  /* size = 0x38 */

struct _mips2c_stack_EnSsh_Init {
    /* 0x00 */ char pad_0[0x30];
    /* 0x30 */ SkelAnime *sp30;                     /* inferred */
    /* 0x34 */ char pad_34[0x8];                    /* maybe part of sp30[3]? */
    /* 0x3C */ f32 sp3C;                            /* inferred */
};                                                  /* size = 0x40 */

struct _mips2c_stack_EnSsh_SetupAction {};          /* size 0x0 */

struct _mips2c_stack_EnSsh_Update {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80973EFC {
    /* 0x00 */ char pad_0[0x28];
    /* 0x28 */ f32 sp28;                            /* inferred */
    /* 0x2C */ f32 sp2C;                            /* inferred */
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ ? sp34;                              /* inferred */
    /* 0x34 */ char pad_34[0xC];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80973F84 {
    /* 0x000 */ char pad_0[0x20];
    /* 0x020 */ s32 sp20;                           /* inferred */
    /* 0x024 */ char pad_24[0x4];
    /* 0x028 */ s32 sp28;                           /* inferred */
    /* 0x02C */ s32 sp2C;                           /* inferred */
    /* 0x030 */ s32 sp30;                           /* inferred */
    /* 0x034 */ s32 sp34;                           /* inferred */
    /* 0x038 */ ? sp38;                             /* inferred */
    /* 0x038 */ char pad_38[0x184];
    /* 0x1BC */ u8 sp1BC;                           /* inferred */
    /* 0x1BD */ u8 sp1BD;                           /* inferred */
    /* 0x1BE */ u8 sp1BE;                           /* inferred */
    /* 0x1BF */ u8 sp1BF;                           /* inferred */
    /* 0x1C0 */ u8 sp1C0;                           /* inferred */
    /* 0x1C1 */ u8 sp1C1;                           /* inferred */
    /* 0x1C2 */ u8 sp1C2;                           /* inferred */
    /* 0x1C3 */ u8 sp1C3;                           /* inferred */
    /* 0x1C4 */ u8 sp1C4;                           /* inferred */
    /* 0x1C5 */ u8 sp1C5;                           /* inferred */
    /* 0x1C6 */ u8 sp1C6;                           /* inferred */
    /* 0x1C7 */ u8 sp1C7;                           /* inferred */
    /* 0x1C8 */ u8 sp1C8;                           /* inferred */
    /* 0x1C9 */ u8 sp1C9;                           /* inferred */
    /* 0x1CA */ u8 sp1CA;                           /* inferred */
    /* 0x1CB */ u8 sp1CB;                           /* inferred */
    /* 0x1CC */ s32 sp1CC;                          /* inferred */
    /* 0x1D0 */ s32 sp1D0;                          /* inferred */
    /* 0x1D4 */ s32 sp1D4;                          /* inferred */
};                                                  /* size = 0x1D8 */

struct _mips2c_stack_func_80974080 {
    /* 0x00 */ char pad_0[0x3C];
    /* 0x3C */ f32 sp3C;                            /* inferred */
    /* 0x40 */ f32 sp40;                            /* inferred */
    /* 0x44 */ f32 sp44;                            /* inferred */
    /* 0x48 */ u32 sp48;                            /* inferred */
    /* 0x4C */ CollisionPoly *sp4C;                 /* inferred */
};                                                  /* size = 0x50 */

struct _mips2c_stack_func_80974118 {
    /* 0x00 */ char pad_0[0x28];
    /* 0x28 */ ? sp28;                              /* inferred */
    /* 0x28 */ char pad_28[0xC];
    /* 0x34 */ ? sp34;                              /* inferred */
    /* 0x34 */ char pad_34[0xC];
    /* 0x40 */ f32 sp40;                            /* inferred */
    /* 0x44 */ f32 sp44;                            /* inferred */
    /* 0x48 */ f32 sp48;                            /* inferred */
    /* 0x4C */ f32 sp4C;                            /* inferred */
    /* 0x50 */ f32 sp50;                            /* inferred */
    /* 0x54 */ f32 sp54;                            /* inferred */
};                                                  /* size = 0x58 */

struct _mips2c_stack_func_80974220 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8097424C {
    /* 0x00 */ char pad_0[0x50];
    /* 0x50 */ ColliderCylinderInit *sp50;          /* inferred */
    /* 0x54 */ char pad_54[0x14];
};                                                  /* size = 0x68 */

struct _mips2c_stack_func_80974374 {
    /* 0x00 */ char pad_0[0x30];
    /* 0x30 */ AnimationHeaderCommon **sp30;        /* inferred */
    /* 0x34 */ s32 sp34;                            /* inferred */
    /* 0x38 */ char pad_38[0x4];
    /* 0x3C */ f32 sp3C;                            /* inferred */
    /* 0x40 */ ? sp40;                              /* inferred */
    /* 0x40 */ char pad_40[0x8];
    /* 0x48 */ ? sp48;                              /* inferred */
    /* 0x48 */ char pad_48[0x1C];
    /* 0x64 */ ? sp64;                              /* inferred */
    /* 0x64 */ char pad_64[0x1C];
};                                                  /* size = 0x80 */

struct _mips2c_stack_func_809744A8 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809744C8 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809744FC {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80974540 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80974590 {};              /* size 0x0 */

struct _mips2c_stack_func_809745BC {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80974730 {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_8097480C {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_809748DC {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_8097497C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809749B8 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80974A24 {};              /* size 0x0 */

struct _mips2c_stack_func_80974B0C {};              /* size 0x0 */

struct _mips2c_stack_func_80974B44 {};              /* size 0x0 */

struct _mips2c_stack_func_80974B84 {
    /* 0x00 */ char pad_0[0x32];
    /* 0x32 */ s16 sp32;                            /* inferred */
    /* 0x34 */ char pad_34[0x4];                    /* maybe part of sp32[3]? */
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ char pad_3C[0x4];
    /* 0x40 */ f32 sp40;                            /* inferred */
    /* 0x44 */ f32 sp44;                            /* inferred */
    /* 0x48 */ f32 sp48;                            /* inferred */
    /* 0x4C */ f32 sp4C;                            /* inferred */
};                                                  /* size = 0x50 */

struct _mips2c_stack_func_80974CC8 {};              /* size 0x0 */

struct _mips2c_stack_func_80974D3C {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80974E44 {};              /* size 0x0 */

struct _mips2c_stack_func_80974EA0 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80974F78 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_8097502C {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ ColliderCylinder *sp1C;              /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80975070 {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ ColliderCylinder *sp18;              /* inferred */
    /* 0x1C */ char pad_1C[0x4];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80975128 {
    /* 0x00 */ char pad_0[0x70];
    /* 0x70 */ f32 sp70;                            /* inferred */
    /* 0x74 */ f32 sp74;                            /* inferred */
    /* 0x78 */ f32 sp78;                            /* inferred */
    /* 0x7C */ ? sp7C;                              /* inferred */
    /* 0x7C */ char pad_7C[0x24];
};                                                  /* size = 0xA0 */

struct _mips2c_stack_func_80975300 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ Collider *sp24;                      /* inferred */
    /* 0x28 */ CollisionCheckContext *sp28;         /* inferred */
    /* 0x2C */ char pad_2C[0x4];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_809755C0 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8097561C {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_809756D0 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80975720 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_809758B0 {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80975998 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80975A98 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ f32 sp24;                            /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80975B6C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80975C14 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80975DBC {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80975EB8 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

? EffectSsBlast_SpawnWhiteCustomScale(GlobalContext *, f32 *, ? *, ? *, s32, s32, s32); /* extern */
void func_80973EFC(EnSsh *arg0, GlobalContext *arg1); /* static */
s32 func_80973F84(GlobalContext *arg0);             /* static */
? func_80974080(EnSsh *arg0, GlobalContext *arg1);  /* static */
void func_80974118(Vec3s *arg0);                    /* static */
void func_80974220(Vec3s *arg0);                    /* static */
void func_8097424C(Actor *arg0, GlobalContext *arg1); /* static */
f32 func_80974374(Actor *arg0, s32 arg1);           /* static */
void func_809744A8(EnSsh *);                        /* static */
void func_809744C8(Actor *arg0);                    /* static */
void func_809744FC(EnSsh *arg0);                    /* static */
void func_80974540(EnSsh *arg0);                    /* static */
void func_80974590(Actor *arg0);                    /* static */
