typedef struct EnDt {
    /* 0x000 */ Actor actor;
    /* 0x144 */ SkelAnime unk_144;                  /* inferred */
    /* 0x188 */ Vec3s unk_188;                      /* inferred */
    /* 0x18E */ char pad_18E[0x54];                 /* maybe part of unk_188[15]? */
    /* 0x1E2 */ Vec3s unk_1E2;                      /* inferred */
    /* 0x1E8 */ char pad_1E8[0x54];                 /* maybe part of unk_1E2[15]? */
    /* 0x23C */ void (*actionFunc)(EnDt *, GlobalContext *);
    /* 0x240 */ char pad_240[0x4];
    /* 0x244 */ s16 unk_244;                        /* inferred */
    /* 0x246 */ char pad_246[0x2];
    /* 0x248 */ s16 unk_248;                        /* inferred */
    /* 0x24A */ s16 unk_24A;                        /* inferred */
    /* 0x24C */ s16 unk_24C;                        /* inferred */
    /* 0x24E */ char pad_24E[0x6];                  /* maybe part of unk_24C[4]? */
    /* 0x254 */ s16 unk_254;                        /* inferred */
    /* 0x256 */ char pad_256[0x1E];                 /* maybe part of unk_254[16]? */
    /* 0x274 */ Actor *unk_274;                     /* inferred */
    /* 0x278 */ Actor *unk_278;                     /* inferred */
    /* 0x27C */ char pad_27C[0xA];                  /* maybe part of unk_278[3]? */
    /* 0x286 */ s16 unk_286;                        /* inferred */
    /* 0x288 */ char pad_288[0x4];                  /* maybe part of unk_286[3]? */
    /* 0x28C */ s16 unk_28C;                        /* inferred */
    /* 0x28E */ char pad_28E[0x2];
    /* 0x290 */ s32 unk_290;                        /* inferred */
    /* 0x294 */ ColliderCylinder unk_294;           /* inferred */
} EnDt;                                             /* size = 0x2E0 */

struct _mips2c_stack_EnDt_Destroy {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnDt_Draw {
    /* 0x00 */ char pad_0[0x30];
    /* 0x30 */ Gfx *sp30;                           /* inferred */
    /* 0x34 */ Gfx *sp34;                           /* inferred */
    /* 0x38 */ char pad_38[0x8];                    /* maybe part of sp34[3]? */
    /* 0x40 */ s32 sp40;                            /* inferred */
    /* 0x44 */ char pad_44[0x4];
};                                                  /* size = 0x48 */

struct _mips2c_stack_EnDt_Init {
    /* 0x00 */ char pad_0[0x38];
};                                                  /* size = 0x38 */

struct _mips2c_stack_EnDt_Update {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ ColliderCylinder *sp2C;              /* inferred */
    /* 0x30 */ char pad_30[0x8];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80BE9C74 {};              /* size 0x0 */

struct _mips2c_stack_func_80BE9CE8 {
    /* 0x00 */ char pad_0[0x34];
    /* 0x34 */ f32 sp34;                            /* inferred */
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80BE9D9C {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ void *sp18;                          /* inferred */
    /* 0x1C */ char pad_1C[0x4];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80BE9DF8 {};              /* size 0x0 */

struct _mips2c_stack_func_80BE9E94 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80BE9EF8 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80BEA088 {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ void *sp18;                          /* inferred */
    /* 0x1C */ void *sp1C;                          /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80BEA254 {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ void *sp18;                          /* inferred */
    /* 0x1C */ void *sp1C;                          /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80BEA394 {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ Actor *sp20;                         /* inferred */
    /* 0x24 */ void *sp24;                          /* inferred */
    /* 0x28 */ char pad_28[0x8];                    /* maybe part of sp24[3]? */
    /* 0x30 */ s32 sp30;                            /* inferred */
    /* 0x34 */ s32 sp34;                            /* inferred */
    /* 0x38 */ void *sp38;                          /* inferred */
    /* 0x3C */ Actor *sp3C;                         /* inferred */
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80BEA8F0 {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ void *sp20;                          /* inferred */
    /* 0x24 */ char pad_24[0x4];
    /* 0x28 */ s32 sp28;                            /* inferred */
    /* 0x2C */ s32 sp2C;                            /* inferred */
    /* 0x30 */ char pad_30[0x8];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80BEAAF8 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80BEAB44 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80BEABF8 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80BEAC84 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80BEAD2C {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80BEADB8 {};              /* size 0x0 */

struct _mips2c_stack_func_80BEADD4 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80BEB06C {};              /* size 0x0 */

? func_800E0308(Camera *, Actor *);                 /* extern */
? func_801A1FB4(?, s32 *, ?, ?);                    /* extern */
void func_80BE9C74(Actor *arg0);                    /* static */
void func_80BE9CE8(Actor *arg0, s16 arg1, Actor *); /* static */
void func_80BE9D9C(Actor *arg0, Actor *);           /* static */
void func_80BE9DF8(Actor *arg0, Actor *);           /* static */
void func_80BE9E94(EnDt *, GlobalContext *);        /* static */
void func_80BE9EF8(GlobalContext *arg0, GlobalContext *arg1, GlobalContext *); /* static */
void func_80BEA088(Actor *arg0, GlobalContext *arg1); /* static */
void func_80BEA254(Actor *arg0, GlobalContext *arg1, void *, Actor *); /* static */
void func_80BEA394(Actor *arg0, GlobalContext *arg1); /* static */
