struct _mips2c_stack_EnOssan_BeginInteraction {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ s16 sp20;                            /* inferred */
    /* 0x22 */ s16 sp22;                            /* inferred */
    /* 0x24 */ ActorAnimationEntryS *sp24;          /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_EnOssan_Blink {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnOssan_BrowseLeftShelf {
    /* 0x00 */ char pad_0[0x27];
    /* 0x27 */ u8 sp27;                             /* inferred */
    /* 0x28 */ char pad_28[0x7];                    /* maybe part of sp27[8]? */
    /* 0x2F */ u8 sp2F;                             /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_EnOssan_BrowseRightShelf {
    /* 0x00 */ char pad_0[0x27];
    /* 0x27 */ u8 sp27;                             /* inferred */
    /* 0x28 */ char pad_28[0x7];                    /* maybe part of sp27[8]? */
    /* 0x2F */ u8 sp2F;                             /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_EnOssan_BuyItemWithFanfare {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_EnOssan_CanBuy {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_EnOssan_CannotBuy {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnOssan_CheckValidSpawn {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnOssan_ContinueShopping {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_EnOssan_CursorLeft {};         /* size 0x0 */

struct _mips2c_stack_EnOssan_CursorRight {};        /* size 0x0 */

struct _mips2c_stack_EnOssan_CursorUpDown {};       /* size 0x0 */

struct _mips2c_stack_EnOssan_Destroy {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnOssan_DrawCuriosityShopMan {
    /* 0x00 */ char pad_0[0x34];
    /* 0x34 */ Gfx *sp34;                           /* inferred */
    /* 0x38 */ char pad_38[0x4];
    /* 0x3C */ GraphicsContext *sp3C;               /* inferred */
    /* 0x40 */ char pad_40[0x8];
};                                                  /* size = 0x48 */

struct _mips2c_stack_EnOssan_DrawCursor {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ GraphicsContext *sp1C;               /* inferred */
    /* 0x20 */ char pad_20[0x18];
};                                                  /* size = 0x38 */

struct _mips2c_stack_EnOssan_DrawPartTimeWorker {
    /* 0x00 */ char pad_0[0x34];
    /* 0x34 */ Gfx *sp34;                           /* inferred */
    /* 0x38 */ char pad_38[0x4];
    /* 0x3C */ GraphicsContext *sp3C;               /* inferred */
    /* 0x40 */ char pad_40[0x8];
};                                                  /* size = 0x48 */

struct _mips2c_stack_EnOssan_DrawStickDirectionPrompts {
    /* 0x00 */ char pad_0[0x44];
    /* 0x44 */ GraphicsContext *sp44;               /* inferred */
    /* 0x48 */ s32 sp48;                            /* inferred */
    /* 0x4C */ s32 sp4C;                            /* inferred */
};                                                  /* size = 0x50 */

struct _mips2c_stack_EnOssan_DrawTextRec {};        /* size 0x0 */

struct _mips2c_stack_EnOssan_EndInteraction {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ void *sp24;                          /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_EnOssan_FaceShopkeeper {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ Actor *sp2C;                         /* inferred */
    /* 0x30 */ char pad_30[0x8];
};                                                  /* size = 0x38 */

struct _mips2c_stack_EnOssan_FacingShopkeeperDialogResult {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ void *sp20;                          /* inferred */
    /* 0x24 */ ActorAnimationEntryS *sp24;          /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_EnOssan_GetCutscenes {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_EnOssan_GetWelcomeCuriosityShopMan {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ Actor *sp1C;                         /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_EnOssan_GetWelcomePartTimeWorker {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ Actor *sp1C;                         /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_EnOssan_HandleCanBuyItem {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_EnOssan_HasPlayerSelectedItem {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ void *sp24;                          /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_EnOssan_Hello {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ s32 sp24;                            /* inferred */
    /* 0x28 */ Actor *sp28;                         /* inferred */
    /* 0x2C */ char pad_2C[0x7];                    /* maybe part of sp28[2]? */
    /* 0x33 */ u8 sp33;                             /* inferred */
    /* 0x34 */ ActorAnimationEntryS *sp34;          /* inferred */
};                                                  /* size = 0x38 */

struct _mips2c_stack_EnOssan_Idle {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ Actor *sp2C;                         /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_EnOssan_Init {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_EnOssan_InitCuriosityShopMan {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_EnOssan_InitPartTimeWorker {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_EnOssan_InitShop {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ void *sp24;                          /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_EnOssan_ItemPurchased {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ Actor *sp24;                         /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_EnOssan_LookToLeftShelf {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_EnOssan_LookToRightShelf {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_EnOssan_LookToShopkeeperFromShelf {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_EnOssan_OverrideLimbDrawCuriosityShopMan {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnOssan_OverrideLimbDrawPartTimeWorker {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnOssan_PositionSelectedItem {
    /* 0x00 */ f32 sp0;                             /* inferred */
    /* 0x04 */ char pad_4[0x1C];
};                                                  /* size = 0x20 */

struct _mips2c_stack_EnOssan_PostLimbDrawCuriosityShopMan {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ void *sp1C;                          /* inferred */
    /* 0x20 */ char pad_20[0x8];
};                                                  /* size = 0x28 */

struct _mips2c_stack_EnOssan_PostLimbDrawPartTimeWorker {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnOssan_ResetItemPosition {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnOssan_ReturnItemToShelf {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_EnOssan_RotateHead {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_EnOssan_SelectItem {
    /* 0x00 */ char pad_0[0x27];
    /* 0x27 */ u8 sp27;                             /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_EnOssan_SetCursorIndexFromNeutral {}; /* size 0x0 */

struct _mips2c_stack_EnOssan_SetHaveMet {};         /* size 0x0 */

struct _mips2c_stack_EnOssan_SetupAction {};        /* size 0x0 */

struct _mips2c_stack_EnOssan_SetupBuy {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnOssan_SetupBuyItemWithFanfare {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ void *sp2C;                          /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_EnOssan_SetupCannotBuy {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnOssan_SetupItemPurchased {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_EnOssan_SetupLookToShopkeeperFromShelf {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnOssan_SetupStartShopping {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnOssan_SpawnShopItems {
    /* 0x00 */ char pad_0[0x48];
};                                                  /* size = 0x48 */

struct _mips2c_stack_EnOssan_StartShopping {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnOssan_TakeItemOffShelf {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_EnOssan_TalkToShopkeeper {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ ActorAnimationEntryS *sp24;          /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_EnOssan_TestCancelOption {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnOssan_TestEndInteraction {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnOssan_TestItemSelected {};   /* size 0x0 */

struct _mips2c_stack_EnOssan_Update {
    /* 0x00 */ char pad_0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_EnOssan_UpdateCursorAnim {};   /* size 0x0 */

struct _mips2c_stack_EnOssan_UpdateCursorPos {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ s16 sp1C;                            /* inferred */
    /* 0x1E */ s16 sp1E;                            /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_EnOssan_UpdateItemSelectedProperty {}; /* size 0x0 */

struct _mips2c_stack_EnOssan_UpdateJoystickInputState {}; /* size 0x0 */

struct _mips2c_stack_EnOssan_UpdateStickDirectionPromptAnim {}; /* size 0x0 */

struct _mips2c_stack_EnOssan_WaitForBlink {};       /* size 0x0 */

void EnOssan_CheckValidSpawn(Actor *arg0);          /* static */
void EnOssan_ContinueShopping(EnOssan *arg0, GlobalContext *arg1); /* static */
s32 EnOssan_CursorLeft(EnOssan *arg0, u8 arg1, s32 arg2); /* static */
s32 EnOssan_CursorRight(EnOssan *arg0, u8 arg1, s32 arg2); /* static */
void EnOssan_CursorUpDown(EnOssan *arg0);           /* static */
void EnOssan_DrawCursor(GraphicsContext **arg0, EnOssan *arg1, f32 arg2, f32 arg3, f32 arg4, u8 arg5); /* static */
void EnOssan_DrawStickDirectionPrompts(GraphicsContext **arg0, EnOssan *arg1); /* static */
