typedef struct EnDeath {
    /* 0x000 */ Actor actor;
    /* 0x144 */ SkelAnime unk_144;                  /* inferred */
    /* 0x188 */ void (*actionFunc)(EnDeath *, GlobalContext *);
    /* 0x18C */ s8 unk_18C;                         /* inferred */
    /* 0x18D */ char pad_18D[0x1];
    /* 0x18E */ u8 unk_18E;                         /* inferred */
    /* 0x18F */ u8 unk_18F;                         /* inferred */
    /* 0x190 */ s8 unk_190;                         /* inferred */
    /* 0x191 */ u8 unk_191;                         /* inferred */
    /* 0x192 */ s8 unk_192;                         /* inferred */
    /* 0x193 */ char pad_193[0x16];                 /* maybe part of unk_192[23]? */
    /* 0x1A9 */ u8 unk_1A9;                         /* inferred */
    /* 0x1AA */ char pad_1AA[0x38];                 /* maybe part of unk_1A9[57]? */
    /* 0x1E2 */ Vec3s unk_1E2;                      /* inferred */
    /* 0x1E8 */ char pad_1E8[0x7E];                 /* maybe part of unk_1E2[22]? */
    /* 0x266 */ Vec3s unk_266;                      /* inferred */
    /* 0x26C */ char pad_26C[0x82];                 /* maybe part of unk_266[22]? */
    /* 0x2EE */ s16 unk_2EE;                        /* inferred */
    /* 0x2F0 */ char pad_2F0[0x2];
    /* 0x2F2 */ s16 unk_2F2;                        /* inferred */
    /* 0x2F4 */ s16 unk_2F4;                        /* inferred */
    /* 0x2F6 */ char pad_2F6[0x4];                  /* maybe part of unk_2F4[3]? */
    /* 0x2FA */ s16 unk_2FA;                        /* inferred */
    /* 0x2FC */ s16 unk_2FC;                        /* inferred */
    /* 0x2FE */ char pad_2FE[0x2];
    /* 0x300 */ s32 unk_300;                        /* inferred */
    /* 0x304 */ f32 unk_304;                        /* inferred */
    /* 0x308 */ char pad_308[0x4];
    /* 0x30C */ f32 unk_30C;                        /* inferred */
    /* 0x310 */ f32 unk_310;                        /* inferred */
    /* 0x314 */ f32 unk_314;                        /* inferred */
    /* 0x318 */ f32 unk_318;                        /* inferred */
    /* 0x31C */ f32 unk_31C;                        /* inferred */
    /* 0x320 */ char pad_320[0xC];                  /* maybe part of unk_31C[4]? */
    /* 0x32C */ Vec3f unk_32C;                      /* inferred */
    /* 0x338 */ Vec3f unk_338;                      /* inferred */
    /* 0x344 */ Vec3f unk_344;                      /* inferred */
    /* 0x350 */ Vec3f unk_350;                      /* inferred */
    /* 0x35C */ Vec3f unk_35C;                      /* inferred */
    /* 0x368 */ char pad_368[0x9C];                 /* maybe part of unk_35C[14]? */
    /* 0x404 */ ? unk_404;                          /* inferred */
    /* 0x404 */ char pad_404[0x2A0];
    /* 0x6A4 */ SkelAnime unk_6A4;                  /* inferred */
    /* 0x6E4 */ void *unk_6E4;                      /* overlap; inferred */
    /* 0x6E8 */ void *unk_6E8;                      /* inferred */
    /* 0x6EC */ void *unk_6EC;                      /* inferred */
    /* 0x6F0 */ s32 unk_6F0;                        /* inferred */
    /* 0x6F4 */ char pad_6F4[0x40];                 /* maybe part of unk_6F0[17]? */
    /* 0x734 */ void *unk_734;                      /* inferred */
    /* 0x738 */ void *unk_738;                      /* inferred */
    /* 0x73C */ ColliderCylinder unk_73C;           /* inferred */
    /* 0x788 */ ColliderQuad unk_788;               /* inferred */
    /* 0x808 */ ColliderSphere unk_808;             /* inferred */
    /* 0x860 */ ColliderTris unk_860;               /* inferred */
    /* 0x880 */ ColliderTrisElement unk_880;        /* inferred */
    /* 0x8DC */ char pad_8DC[0x5C];
} EnDeath;                                          /* size = 0x938 */

struct _mips2c_stack_EnDeath_Destroy {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_EnDeath_Draw {
    /* 0x00 */ char pad_0[0x34];
    /* 0x34 */ void (*sp34)(EnDeath *, GlobalContext *); /* inferred */
    /* 0x38 */ void (*sp38)(EnDeath *, GlobalContext *); /* inferred */
    /* 0x3C */ char pad_3C[0x8];                    /* maybe part of sp38[3]? */
    /* 0x44 */ GraphicsContext *sp44;               /* inferred */
    /* 0x48 */ char pad_48[0x8];
};                                                  /* size = 0x50 */

struct _mips2c_stack_EnDeath_Init {
    /* 0x00 */ char pad_0[0x60];
};                                                  /* size = 0x60 */

struct _mips2c_stack_EnDeath_Update {
    /* 0x00 */ char pad_0[0x28];
    /* 0x28 */ ColliderTris *sp28;                  /* inferred */
    /* 0x2C */ void (*sp2C)(EnDeath *, GlobalContext *); /* inferred */
    /* 0x30 */ char pad_30[0x10];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_808C5310 {};              /* size 0x0 */

struct _mips2c_stack_func_808C5394 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_808C5428 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ Actor *sp1C;                         /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_808C54F0 {
    /* 0x00 */ char pad_0[0x28];
    /* 0x28 */ f32 sp28;                            /* inferred */
    /* 0x2C */ char pad_2C[0xC];                    /* maybe part of sp28[4]? */
    /* 0x38 */ ColliderTris *sp38;                  /* inferred */
    /* 0x3C */ f32 sp3C;                            /* inferred */
    /* 0x40 */ f32 sp40;                            /* inferred */
    /* 0x44 */ f32 sp44;                            /* inferred */
    /* 0x48 */ f32 sp48;                            /* inferred */
    /* 0x4C */ f32 sp4C;                            /* inferred */
    /* 0x50 */ f32 sp50;                            /* inferred */
    /* 0x54 */ f32 sp54;                            /* inferred */
    /* 0x58 */ f32 sp58;                            /* inferred */
    /* 0x5C */ f32 sp5C;                            /* inferred */
    /* 0x60 */ f32 sp60;                            /* inferred */
    /* 0x64 */ f32 sp64;                            /* inferred */
};                                                  /* size = 0x68 */

struct _mips2c_stack_func_808C566C {};              /* size 0x0 */

struct _mips2c_stack_func_808C571C {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ f32 sp24;                            /* inferred */
    /* 0x28 */ f32 sp28;                            /* inferred */
    /* 0x2C */ f32 sp2C;                            /* inferred */
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ char pad_3C[0x4];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_808C589C {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_808C597C {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ Camera *sp24;                        /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_808C5AB8 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ Vec3f *sp24;                         /* inferred */
    /* 0x28 */ Vec3f *sp28;                         /* inferred */
    /* 0x2C */ Camera *sp2C;                        /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_808C5C0C {
    /* 0x00 */ char pad_0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_808C5CB4 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_808C5D6C {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ f32 sp20;                            /* inferred */
    /* 0x24 */ Camera *sp24;                        /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_808C5E90 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ Vec3f *sp24;                         /* inferred */
    /* 0x28 */ Vec3f *sp28;                         /* inferred */
    /* 0x2C */ Camera *sp2C;                        /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_808C5F58 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ Camera *sp24;                        /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_808C6070 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ Vec3f *sp24;                         /* inferred */
    /* 0x28 */ Vec3f *sp28;                         /* inferred */
    /* 0x2C */ SkelAnime *sp2C;                     /* inferred */
    /* 0x30 */ char pad_30[0x14];                   /* maybe part of sp2C[6]? */
    /* 0x44 */ Camera *sp44;                        /* inferred */
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_808C645C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_808C64DC {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_808C6620 {
    /* 0x00 */ char pad_0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_808C66A8 {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_808C67C8 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_808C682C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_808C68B8 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_808C692C {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ SkelAnime *sp2C;                     /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_808C6A08 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_808C6AB0 {
    /* 0x00 */ char pad_0[0x28];
    /* 0x28 */ SkelAnime *sp28;                     /* inferred */
    /* 0x2C */ char pad_2C[0x4];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_808C6C5C {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_808C6CDC {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_808C6D40 {
    /* 0x00 */ char pad_0[0x30];
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ f32 sp3C;                            /* inferred */
    /* 0x40 */ f32 sp40;                            /* inferred */
    /* 0x44 */ f32 sp44;                            /* inferred */
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_808C6F6C {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ SkelAnime *sp24;                     /* inferred */
    /* 0x28 */ f32 sp28;                            /* inferred */
    /* 0x2C */ Camera *sp2C;                        /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_808C70D8 {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ f32 sp2C;                            /* inferred */
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ f32 sp3C;                            /* inferred */
    /* 0x40 */ f32 sp40;                            /* inferred */
    /* 0x44 */ f32 sp44;                            /* inferred */
    /* 0x48 */ f32 sp48;                            /* inferred */
    /* 0x4C */ char pad_4C[0xC];
};                                                  /* size = 0x58 */

struct _mips2c_stack_func_808C72AC {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ Vec3f *sp20;                         /* inferred */
    /* 0x24 */ char pad_24[0x2];
    /* 0x26 */ s16 sp26;                            /* inferred */
    /* 0x28 */ char pad_28[0x4];                    /* maybe part of sp26[3]? */
    /* 0x2C */ f32 sp2C;                            /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_808C74A4 {};              /* size 0x0 */

struct _mips2c_stack_func_808C74F8 {
    /* 0x00 */ char pad_0[0x7C];
    /* 0x7C */ f32 sp7C;                            /* inferred */
    /* 0x80 */ char pad_80[0x18];
};                                                  /* size = 0x98 */

struct _mips2c_stack_func_808C7800 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_808C7888 {
    /* 0x00 */ char pad_0[0x74];
    /* 0x74 */ f32 sp74;                            /* inferred */
    /* 0x78 */ f32 sp78;                            /* inferred */
    /* 0x7C */ f32 sp7C;                            /* inferred */
};                                                  /* size = 0x80 */

struct _mips2c_stack_func_808C7A30 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_808C7AAC {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_808C7AEC {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_808C7B88 {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_808C7C04 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_808C7C88 {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_808C7CFC {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_808C7D34 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_808C7DB8 {};              /* size 0x0 */

struct _mips2c_stack_func_808C7DCC {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_808C7E24 {
    /* 0x00 */ char pad_0[0x30];
    /* 0x30 */ Vec3f *sp30;                         /* inferred */
    /* 0x34 */ char pad_34[0x4];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_808C7EDC {
    /* 0x00 */ char pad_0[0x38];
    /* 0x38 */ Vec3f *sp38;                         /* inferred */
    /* 0x3C */ char pad_3C[0x4];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_808C84A4 {
    /* 0x00 */ char pad_0[0x58];
    /* 0x58 */ ? *sp58;                             /* inferred */
    /* 0x5C */ ? *sp5C;                             /* inferred */
    /* 0x60 */ char pad_60[0x4];
    /* 0x64 */ u16 *sp64;                           /* inferred */
    /* 0x68 */ char pad_68[0x20];                   /* maybe part of sp64[9]? */
    /* 0x88 */ GraphicsContext *sp88;               /* inferred */
    /* 0x8C */ char pad_8C[0xC];
};                                                  /* size = 0x98 */

struct _mips2c_stack_func_808C8690 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ void (*sp24)(EnDeath *, GlobalContext *); /* inferred */
    /* 0x28 */ char pad_28[0x1C];                   /* maybe part of sp24[8]? */
    /* 0x44 */ GraphicsContext *sp44;               /* inferred */
    /* 0x48 */ char pad_48[0x8];
};                                                  /* size = 0x50 */

struct _mips2c_stack_func_808C882C {
    /* 0x00 */ char pad_0[0x5C];
    /* 0x5C */ void *sp5C;                          /* inferred */
    /* 0x60 */ EnDeath *sp60;                       /* inferred */
    /* 0x64 */ s32 sp64;                            /* inferred */
    /* 0x68 */ void (*sp68)(EnDeath *, GlobalContext *); /* inferred */
    /* 0x6C */ char pad_6C[0x2C];                   /* maybe part of sp68[12]? */
    /* 0x98 */ GraphicsContext *sp98;               /* inferred */
    /* 0x9C */ f32 sp9C;                            /* inferred */
    /* 0xA0 */ f32 spA0;                            /* inferred */
    /* 0xA4 */ f32 spA4;                            /* inferred */
    /* 0xA8 */ char pad_A8[0x20];
};                                                  /* size = 0xC8 */

struct _mips2c_stack_func_808C8D18 {
    /* 0x00 */ char pad_0[0x6C];
    /* 0x6C */ MtxF *sp6C;                          /* inferred */
    /* 0x70 */ Gfx *sp70;                           /* inferred */
    /* 0x74 */ EnDeath *sp74;                       /* inferred */
    /* 0x78 */ char pad_78[0x33];                   /* maybe part of sp74[13]? */
    /* 0xAB */ u8 spAB;                             /* inferred */
    /* 0xAC */ char pad_AC[0x14];                   /* maybe part of spAB[21]? */
    /* 0xC0 */ s32 spC0;                            /* inferred */
    /* 0xC4 */ char pad_C4[0x4];
};                                                  /* size = 0xC8 */

struct _mips2c_stack_func_808C9160 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ GraphicsContext *sp1C;               /* inferred */
    /* 0x20 */ Gfx *sp20;                           /* inferred */
    /* 0x24 */ char pad_24[0x4];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_808C9220 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_808C9340 {
    /* 0x00 */ char pad_0[0x44];
    /* 0x44 */ s32 sp44;                            /* inferred */
    /* 0x48 */ ? sp48;                              /* inferred */
    /* 0x48 */ char pad_48[0xC];
    /* 0x54 */ ? sp54;                              /* inferred */
    /* 0x54 */ char pad_54[0xC];
    /* 0x60 */ ? sp60;                              /* inferred */
    /* 0x60 */ char pad_60[0xC];
    /* 0x6C */ ? sp6C;                              /* inferred */
    /* 0x6C */ char pad_6C[0x14];
};                                                  /* size = 0x80 */

? func_800BE568(Actor *, s32);                      /* extern */
? func_800DFD04(Camera *, ?, ?, ?);                 /* extern */
? func_80169940(GlobalContext *, s16, f32);         /* extern */
? func_801A479C(Vec3f *, ?, ?);                     /* extern */
? func_801A7328(Vec3f *, ?);                        /* extern */
void func_808C5310(GlobalContext *arg0);            /* static */
void func_808C5394(Actor *arg0);                    /* static */
s32 func_808C5428(Actor *arg0, GlobalContext *arg1); /* static */
void func_808C54F0(EnDeath *arg0);                  /* static */
void func_808C566C(EnDeath *arg0);                  /* static */
void func_808C571C(Actor *arg0, GlobalContext *arg1); /* static */
void func_808C597C(EnDeath *arg0, GlobalContext *arg1); /* static */
void func_808C5C0C(EnDeath *arg0);                  /* static */
