? func_800BE568(Actor *, s32);                      /* extern */
? func_800DFD04(Camera *, ?, ?, ?);                 /* extern */
? func_80169940(GlobalContext *, s16, f32);         /* extern */
? func_801A479C(Vec3f *, ?, ?);                     /* extern */
? func_801A7328(Vec3f *, ?);                        /* extern */
void func_808C5310(GlobalContext *arg0);            /* static */
void func_808C5394(Actor *arg0);                    /* static */
s32 func_808C5428(Actor *arg0, GlobalContext *arg1); /* static */
void func_808C54F0(EnDeath *arg0);                  /* static */
void func_808C566C(EnDeath *arg0);                  /* static */
void func_808C571C(Actor *arg0, GlobalContext *arg1); /* static */
void func_808C597C(EnDeath *arg0, GlobalContext *arg1); /* static */
void func_808C5C0C(EnDeath *arg0);                  /* static */
void func_808C5D6C(f32 arg0, EnDeath *arg1, GlobalContext *); /* static */
void func_808C5F58(EnDeath *arg0, GlobalContext *arg1); /* static */
void func_808C645C(EnDeath *arg0);                  /* static */
void func_808C6620(EnDeath *arg0);                  /* static */
void func_808C67C8(EnDeath *arg0);                  /* static */
void func_808C68B8(EnDeath *arg0);                  /* static */
void func_808C6A08(EnDeath *arg0);                  /* static */
void func_808C6C5C(Actor *arg0, s32);               /* static */
void func_808C6D40(Actor *arg0, GlobalContext *arg1); /* static */

extern AnimationHeader D_0600CB2C;
extern void D_0600CB84;
extern void D_0600CBC0;
static ColliderSphereInit D_808C98E0 = {
    {3, 0, 8, 0, 0x10, 4},
    {0, {0xF7CFFFFF, 0, 0}, {0xF7CFFFFF, 0, 0}, 0, 1, 0},
    {1, {{0, 0, 0}, 0x16}, 0x64},
};
static ColliderCylinderInit D_808C990C = {
    {0xA, 0, 0, 0x39, 0x10, 1},
    {0, {0, 0, 0}, {0, 0, 0}, 0, 0, 1},
    {0x23, 0x5A, 0x14, {0, 0, 0}},
};
static ColliderTrisElementInit D_808C9938 = {
    {
        {2, {0xF7CFFFFF, 4, 0x20}, {0xF7CFFFFF, 0, 0}, 1, 1, 0},
        {{{0.0f, 0.0f, 0.0f}, {0.0f, 0.0f, 0.0f}, {0.0f, 0.0f, 0.0f}}},
    },
    {
        {2, {0xF7CFFFFF, 4, 0x20}, {0xF7CFFFFF, 0, 0}, 1, 1, 0},
        {{{0.0f, 0.0f, 0.0f}, {0.0f, 0.0f, 0.0f}, {0.0f, 0.0f, 0.0f}}},
    },
};
static ColliderTrisInit D_808C99B0 = {{9, 0x11, 0xD, 0, 0x10, 2}, 2, &D_808C9938};
static ColliderQuadInit D_808C99C0 = {
    {0xA, 0x10, 0, 0, 0x20, 3},
    {0, {0xF7CFFFFF, 4, 0x20}, {0, 0, 0}, 0x81, 0, 0},
    {
        {
            {0.0f, 0.0f, 0.0f},
            {0.0f, 0.0f, 0.0f},
            {0.0f, 0.0f, 0.0f},
            {0.0f, 0.0f, 0.0f},
        },
    },
};
static DamageTable D_808C9A10 = {
    {
        0,
        1,
        0,
        0xF1,
        1,
        1,
        0,
        1,
        1,
        1,
        0,
        0x21,
        0x31,
        0x42,
        1,
        0,
        1,
        2,
        0,
        0,
        0,
        0,
        1,
        1,
        1,
        0,
        0,
        0,
        0,
        0,
        0,
        0xF1,
    },
};
static CollisionCheckInfoInit2 D_808C9A30 = {0x14, 0x1C, 0x5A, 0x14, 0x64};
static void D_808C9A3C;                             /* unable to generate initializer */
static InitChainEntry D_808C9A60;                   /* unable to generate initializer */
static Vec3f D_808C9A70 = {0.0f, -1.5f, 0.0f};
static Vec3f D_808C9A7C = {0.0f, -0.2f, 0.0f};
static Color_RGBA8 D_808C9A88 = {0, 0, 0, 0};
static Color_RGBA8 D_808C9A8C = {0x28, 0x28, 0x28, 0};
static s16 D_808C9A90 = {
    0x1E,
    0x1E,
    0xA,
    2,
    0xC,
    0x11,
    0x11,
    0x11,
    0x11,
    0x11,
    0x11,
    0x11,
    0xE,
    0xA,
    0xC,
    9,
    9,
    0xC,
    9,
    9,
    0x1E,
    0x1E,
};
static Vec3f D_808C9ABC;                            /* type too large by 8; unable to generate initializer */
static f32 D_808C9AC0 = -1.0f;
static Color_RGBA8 D_808C9AC8 = {0, 0xC8, 0x64, 0};
static Color_RGBA8 D_808C9ACC = {0, 0x64, 0, 0};
static s32 D_808C9AD0 = {
    0x6009F88,
    0x600A088,
    0x600A188,
    0x600A288,
    0x600A388,
    0x600A488,
    0x600A588,
    0x600A688,
    0x600A788,
};
static Vec3f D_808C9AF4 = {-1000.0f, 12000.0f, 0.0f};
static Vec3f D_808C9B00 = {-2000.0f, -2500.0f, 0.0f};
static Vec3f D_808C9B0C = {
    {1000.0f, 2000.0f, 0.0f},
    {1500.0f, 1000.0f, 4000.0f},
    {1500.0f, 1000.0f, -4000.0f},
    {4000.0f, 4000.0f, 2000.0f},
    {4000.0f, 4000.0f, -2000.0f},
};
static ? D_808C9B48;                                /* unable to generate initializer */

typedef struct EnDeath {
    /* 0x0000 */ Actor actor;
    /* 0x0144 */ SkelAnime unk144;                  /* inferred */
    /* 0x0188 */ void (*actionFunc)(EnDeath *, GlobalContext *);
    /* 0x018C */ s8 unk18C;                         /* inferred */
    /* 0x018D */ u8 unk18D;                         /* inferred */
    /* 0x018E */ u8 unk18E;                         /* inferred */
    /* 0x018F */ u8 unk18F;                         /* inferred */
    /* 0x0190 */ s8 unk190;                         /* inferred */
    /* 0x0191 */ u8 unk191;                         /* inferred */
    /* 0x0192 */ u8 unk192;                         /* inferred */
    /* 0x0193 */ char pad193[0x12];                 /* maybe part of unk192[19]? */
    /* 0x01A5 */ s8 unk1A5;                         /* inferred */
    /* 0x01A6 */ char pad1A6[0x3];                  /* maybe part of unk1A5[4]? */
    /* 0x01A9 */ u8 unk1A9;                         /* inferred */
    /* 0x01AA */ s8 unk1AA;                         /* inferred */
    /* 0x01AB */ s8 unk1AB;                         /* inferred */
    /* 0x01AC */ s8 unk1AC;                         /* inferred */
    /* 0x01AD */ char pad1AD[0x35];                 /* maybe part of unk1AC[54]? */
    /* 0x01E2 */ Vec3s unk1E2;                      /* inferred */
    /* 0x01E8 */ char pad1E8[0x7E];                 /* maybe part of unk1E2[22]? */
    /* 0x0266 */ Vec3s unk266;                      /* inferred */
    /* 0x026C */ char pad26C[0x80];
    /* 0x02EC */ s16 unk2EC;                        /* inferred */
    /* 0x02EE */ s16 unk2EE;                        /* inferred */
    /* 0x02F0 */ char pad2F0[0x2];                  /* maybe part of unk2EE[2]? */
    /* 0x02F2 */ s16 unk2F2;                        /* inferred */
    /* 0x02F4 */ s16 unk2F4;                        /* inferred */
    /* 0x02F6 */ s16 unk2F6;                        /* inferred */
    /* 0x02F8 */ char pad2F8[0x2];                  /* maybe part of unk2F6[2]? */
    /* 0x02FA */ s16 unk2FA;                        /* inferred */
    /* 0x02FC */ s16 unk2FC;                        /* inferred */
    /* 0x02FE */ char pad2FE[0x2];                  /* maybe part of unk2FC[2]? */
    /* 0x0300 */ s32 unk300;                        /* inferred */
    /* 0x0304 */ f32 unk304;                        /* inferred */
    /* 0x0308 */ f32 unk308;                        /* inferred */
    /* 0x030C */ f32 unk30C;                        /* inferred */
    /* 0x0310 */ f32 unk310;                        /* inferred */
    /* 0x0314 */ f32 unk314;                        /* inferred */
    /* 0x0318 */ f32 unk318;                        /* inferred */
    /* 0x031C */ f32 unk31C;                        /* inferred */
    /* 0x0320 */ f32 unk320;                        /* inferred */
    /* 0x0324 */ f32 unk324;                        /* inferred */
    /* 0x0328 */ f32 unk328;                        /* inferred */
    /* 0x032C */ Vec3f unk32C;                      /* inferred */
    /* 0x0338 */ Vec3f unk338;                      /* inferred */
    /* 0x0344 */ Vec3f unk344;                      /* inferred */
    /* 0x0350 */ Vec3f unk350;                      /* inferred */
    /* 0x035C */ Vec3f unk35C;                      /* inferred */
    /* 0x0368 */ char pad368[0x9C];                 /* maybe part of unk35C[14]? */
    /* 0x0404 */ ? unk404;                          /* inferred */
    /* 0x0405 */ char pad405[0x29F];
    /* 0x06A4 */ SkelAnime unk6A4;                  /* inferred */
    /* 0x06D8 */ f32 unk6D8;                        /* overlap; inferred */
    /* 0x06DC */ void *unk6DC;                      /* inferred */
    /* 0x06E0 */ void *unk6E0;                      /* inferred */
    /* 0x06E4 */ Actor *unk6E4;                     /* inferred */
    /* 0x06E8 */ Actor *unk6E8;                     /* inferred */
    /* 0x06EC */ Actor *unk6EC;                     /* inferred */
    /* 0x06F0 */ Actor *unk6F0;                     /* inferred */
    /* 0x06F4 */ char pad6F4[0x40];                 /* maybe part of unk6F0[17]? */
    /* 0x0734 */ void *unk734;                      /* inferred */
    /* 0x0738 */ void *unk738;                      /* inferred */
    /* 0x073C */ ColliderCylinder unk73C;           /* inferred */
    /* 0x0788 */ ColliderQuad unk788;               /* inferred */
    /* 0x0808 */ ColliderSphere unk808;             /* inferred */
    /* 0x0860 */ ColliderTris unk860;               /* inferred */
    /* 0x0880 */ ColliderTrisElement unk880;        /* inferred */
    /* 0x08DC */ char pad8DC[0x5C];                 /* maybe part of unk880[2]? */
} EnDeath;                                          /* size 0x938 */

void EnDeath_Init(Actor *thisx, GlobalContext *globalCtx) {
    EnDeath *this = (EnDeath *) thisx;
    Actor *temp_v0;
    f32 *temp_s0;
    s32 temp_s1;
    s32 temp_s1_2;
    f32 phi_f20;
    s32 phi_s3;
    s32 phi_s1;
    EnDeath *phi_s0;
    f32 *phi_s0_2;
    s32 phi_s1_2;

    Actor_ProcessInitChain(&this->actor, &D_808C9A60);
    ActorShape_Init(&this->actor.shape, 5500.0f, func_800B3FC0, 80.0f);
    SkelAnime_InitSV(globalCtx, &this->unk144, &D_0600AD08, &D_06003CAC, &this->unk1E2, &this->unk266, 0x16);
    Collider_InitAndSetSphere(globalCtx, &this->unk808, &this->actor, &D_808C98E0);
    Collider_InitAndSetCylinder(globalCtx, &this->unk73C, &this->actor, &D_808C990C);
    Collider_InitAndSetQuad(globalCtx, &this->unk788, &this->actor, &D_808C99C0);
