typedef struct EnMkk {
    /* 0x000 */ Actor actor;
    /* 0x144 */ void (*actionFunc)(EnMkk *, GlobalContext *);
    /* 0x148 */ u8 unk_148;                         /* inferred */
    /* 0x149 */ u8 unk_149;                         /* inferred */
    /* 0x14A */ u8 unk_14A;                         /* inferred */
    /* 0x14B */ u8 unk_14B;                         /* inferred */
    /* 0x14C */ u8 unk_14C;                         /* inferred */
    /* 0x14D */ char pad_14D[0x1];
    /* 0x14E */ s16 unk_14E;                        /* inferred */
    /* 0x150 */ s16 unk_150;                        /* inferred */
    /* 0x152 */ s16 unk_152;                        /* inferred */
    /* 0x154 */ Vec3f unk_154;                      /* inferred */
    /* 0x160 */ Vec3f unk_160;                      /* inferred */
    /* 0x16C */ f32 unk_16C;                        /* inferred */
    /* 0x170 */ f32 unk_170;                        /* inferred */
    /* 0x174 */ char pad_174[0x4];
    /* 0x178 */ f32 unk_178;                        /* inferred */
    /* 0x17C */ ColliderSphere unk_17C;             /* inferred */
} EnMkk;                                            /* size = 0x1D4 */

struct _mips2c_stack_EnMkk_Destroy {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnMkk_Draw {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ GraphicsContext *sp18;               /* inferred */
    /* 0x1C */ MtxF *sp1C;                          /* inferred */
    /* 0x20 */ char pad_20[0x8];                    /* maybe part of sp1C[3]? */
    /* 0x28 */ Gfx *sp28;                           /* inferred */
    /* 0x2C */ void *sp2C;                          /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_EnMkk_Init {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ PosRot *sp24;                        /* inferred */
    /* 0x28 */ char pad_28[0x4];
    /* 0x2C */ s32 sp2C;                            /* inferred */
    /* 0x30 */ char pad_30[0x8];
};                                                  /* size = 0x38 */

struct _mips2c_stack_EnMkk_Update {
    /* 0x00 */ char pad_0[0x28];
    /* 0x28 */ ColliderSphere *sp28;                /* inferred */
    /* 0x2C */ CollisionCheckContext *sp2C;         /* inferred */
    /* 0x30 */ char pad_30[0x10];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80A4E0CC {};              /* size 0x0 */

struct _mips2c_stack_func_80A4E100 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A4E190 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A4E1F0 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A4E22C {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ f32 sp2C;                            /* inferred */
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ f32 sp34;                            /* inferred */
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80A4E2B8 {};              /* size 0x0 */

struct _mips2c_stack_func_80A4E2E8 {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ s32 sp20;                            /* inferred */
    /* 0x24 */ Actor *sp24;                         /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80A4E58C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A4E60C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A4E67C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A4E72C {
    /* 0x00 */ char pad_0[0x44];
    /* 0x44 */ f32 sp44;                            /* inferred */
    /* 0x48 */ f32 sp48;                            /* inferred */
    /* 0x4C */ f32 sp4C;                            /* inferred */
};                                                  /* size = 0x50 */

struct _mips2c_stack_func_80A4E84C {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ Vec3f *sp24;                         /* inferred */
    /* 0x28 */ Vec3f *sp28;                         /* inferred */
    /* 0x2C */ char pad_2C[0x4];
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ f32 sp3C;                            /* inferred */
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80A4EBBC {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A4EDF0 {};              /* size 0x0 */

struct _mips2c_stack_func_80A4EE48 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A4EEF4 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ Vec3f *sp24;                         /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80A4EF74 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ PosRot *sp24;                        /* inferred */
    /* 0x28 */ char pad_28[0x8];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80A4F16C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A4F4C8 {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ GraphicsContext *sp20;               /* inferred */
    /* 0x24 */ char pad_24[0x4];
    /* 0x28 */ u32 *sp28;                           /* inferred */
    /* 0x2C */ MtxF *sp2C;                          /* inferred */
    /* 0x30 */ char pad_30[0x8];
};                                                  /* size = 0x38 */

? func_800BE568(Actor *, s8 *);                     /* extern */
void func_80A4E0CC(EnMkk *arg0, s32);               /* static */
void func_80A4E190(EnMkk *arg0);                    /* static */
void func_80A4E22C(EnMkk *arg0, GlobalContext *arg1); /* static */
void func_80A4E2B8(void *arg0);                     /* static */
void func_80A4E58C(EnMkk *arg0);                    /* static */
void func_80A4E67C(Actor *arg0);                    /* static */
void func_80A4E84C(EnMkk *arg0);                    /* static */
void func_80A4EBBC(Actor *arg0, GlobalContext *arg1); /* static */
void func_80A4EDF0(EnMkk *arg0, s32);               /* static */
void func_80A4EEF4(EnMkk *arg0);                    /* static */
void func_80A4F16C(Actor *thisx, GlobalContext *globalCtx); /* static */
void func_80A4F4C8(Actor *thisx, GlobalContext *globalCtx); /* static */
