typedef struct ObjTokeidai {
    /* 0x000 */ Actor actor;
    /* 0x144 */ ? *unk_144;                         /* inferred */
    /* 0x148 */ ? *unk_148;                         /* inferred */
    /* 0x14C */ char pad_14C[0x8];                  /* maybe part of unk_148[3]? */
    /* 0x154 */ s16 unk_154;                        /* inferred */
    /* 0x156 */ s16 unk_156;                        /* inferred */
    /* 0x158 */ s32 unk_158;                        /* inferred */
    /* 0x15C */ s16 unk_15C;                        /* inferred */
    /* 0x15E */ s16 unk_15E;                        /* inferred */
    /* 0x160 */ s16 unk_160;                        /* inferred */
    /* 0x162 */ s16 unk_162;                        /* inferred */
    /* 0x164 */ s16 unk_164;                        /* inferred */
    /* 0x166 */ char pad_166[0x6];                  /* maybe part of unk_164[4]? */
    /* 0x16C */ s32 unk_16C;                        /* inferred */
    /* 0x170 */ u16 unk_170;                        /* inferred */
    /* 0x172 */ char pad_172[0x2];
    /* 0x174 */ void (*actionFunc)(ObjTokeidai *, GlobalContext *);
} ObjTokeidai;                                      /* size = 0x178 */

typedef struct {
    /* 0x00 */ Vec3f pos;
    /* 0x0C */ Vec3s rot;
    /* 0x12 */ s16 unk_12;                          /* inferred */
} PosRot;                                           /* size = 0x14 */

struct _mips2c_stack_ObjTokeidai_Destroy {};        /* size 0x0 */

struct _mips2c_stack_ObjTokeidai_Draw {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ Gfx *sp20;                           /* inferred */
    /* 0x24 */ char pad_24[0x4];
    /* 0x28 */ Gfx *sp28;                           /* inferred */
    /* 0x2C */ char pad_2C[0xC];
};                                                  /* size = 0x38 */

struct _mips2c_stack_ObjTokeidai_Init {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_ObjTokeidai_Update {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80AB2790 {};              /* size 0x0 */

struct _mips2c_stack_func_80AB27B4 {};              /* size 0x0 */

struct _mips2c_stack_func_80AB2834 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80AB28C8 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80AB29F8 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80AB2BBC {
    /* 0x00 */ char pad_0[0x38];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80AB3010 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ s32 sp1C;                            /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80AB319C {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80AB3240 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80AB32F0 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80AB3370 {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ f32 sp18;                            /* inferred */
    /* 0x1C */ char pad_1C[0x4];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80AB34CC {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80AB3544 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80AB3598 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80AB363C {};              /* size 0x0 */

struct _mips2c_stack_func_80AB365C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80AB36C4 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80AB3808 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80AB3880 {};              /* size 0x0 */

struct _mips2c_stack_func_80AB38B0 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80AB39BC {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80AB3A7C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80AB3B34 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80AB3BB0 {};              /* size 0x0 */

struct _mips2c_stack_func_80AB3BD8 {};              /* size 0x0 */

struct _mips2c_stack_func_80AB3BE8 {};              /* size 0x0 */

struct _mips2c_stack_func_80AB3C50 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80AB3CCC {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80AB3ED0 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80AB4040 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80AB4080 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80AB4160 {
    /* 0x00 */ char pad_0[0x38];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80AB4394 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ Gfx *sp24;                           /* inferred */
    /* 0x28 */ char pad_28[0x8];                    /* maybe part of sp24[3]? */
    /* 0x30 */ Gfx *sp30;                           /* inferred */
    /* 0x34 */ char pad_34[0x4];
    /* 0x38 */ Gfx *sp38;                           /* inferred */
    /* 0x3C */ char pad_3C[0x4];
    /* 0x40 */ Gfx *sp40;                           /* inferred */
    /* 0x44 */ char pad_44[0xC];
};                                                  /* size = 0x50 */

struct _mips2c_stack_func_80AB4664 {
    /* 0x00 */ char pad_0[0x4C];
    /* 0x4C */ Gfx *sp4C;                           /* inferred */
    /* 0x50 */ char pad_50[0x4];
    /* 0x54 */ Gfx *sp54;                           /* inferred */
    /* 0x58 */ Gfx *sp58;                           /* inferred */
    /* 0x5C */ char pad_5C[0xC];                    /* maybe part of sp58[4]? */
    /* 0x68 */ s32 sp68;                            /* inferred */
    /* 0x6C */ char pad_6C[0x4];
};                                                  /* size = 0x70 */

struct _mips2c_stack_func_80AB4894 {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

? func_801A3F54(?);                                 /* extern */
s32 func_80AB2790(ObjTokeidai *);                   /* static */
void func_80AB27B4(ObjTokeidai *arg0);              /* static */
void func_80AB2834(ObjTokeidai *arg0);              /* static */
void func_80AB28C8(ObjTokeidai *arg0, GlobalContext *arg1, GlobalContext *); /* static */
void func_80AB29F8(ObjTokeidai *arg0, GlobalContext *arg1, GlobalContext *); /* static */
void func_80AB2BBC(ObjTokeidai *arg0, GlobalContext *arg1, GlobalContext *); /* static */
void func_80AB3010(Actor *arg0, s32 arg1);          /* static */
void func_80AB36C4(void *arg0, GlobalContext *arg1); /* static */
void func_80AB3BB0(ObjTokeidai *arg0, GlobalContext *); /* static */
s32 func_80AB3C50(ObjTokeidai *arg1);               /* static */
void func_80AB3CCC(ObjTokeidai *arg0, GlobalContext *arg1); /* static */
