s16 func_800F2178(s16, BgDblueMovebg *, Actor *);   /* extern */
s32 func_8017D668(f32, f32, f32, f32, f32, f32, Vec3f *, ? *, ? *); /* extern */
? func_8019FB0C(Vec3f *, ?, f32, ?);                /* extern */
? func_8019FC20(Vec3f *, ?);                        /* extern */
s32 func_80A29A80(GlobalContext *arg0, s32 arg1, s32 arg2, BgDblueMovebg *); /* static */
void func_80A2A128(BgDblueMovebg *arg0, GlobalContext *arg1); /* static */
void func_80A2A1E0(BgDblueMovebg *, GlobalContext *); /* static */
void func_80A2A32C(BgDblueMovebg *, GlobalContext *); /* static */
void func_80A2A444(BgDblueMovebg *, GlobalContext *); /* static */
void func_80A2A670(BgDblueMovebg *arg0, GlobalContext *arg1); /* static */
void func_80A2A688(Actor *arg0, GlobalContext *arg1); /* static */
void func_80A2A714(BgDblueMovebg *, GlobalContext *); /* static */
void func_80A2A7F8(BgDblueMovebg *, GlobalContext *); /* static */
void func_80A2AAB8(BgDblueMovebg *, GlobalContext *); /* static */
void func_80A2ABD0(BgDblueMovebg *arg0, GlobalContext *arg1); /* static */
void func_80A2AED0(BgDblueMovebg *, GlobalContext *); /* static */
void func_80A2B1A0(BgDblueMovebg *, GlobalContext *); /* static */
void func_80A2B274(Actor *this, GlobalContext *globalCtx); /* static */
void func_80A2B308(Actor *this, GlobalContext *globalCtx); /* static */
extern ? D_06004848;
extern ? D_060052B8;
extern ? D_06008778;
extern ? D_0600A528;
extern ? D_0600CD10;
extern void D_0600CE00;
static ? D_80A2B870;                                /* unable to generate initializer */
static ? D_80A2B8AC;                                /* unable to generate initializer */
static ? D_80A2B8DC;                                /* unable to generate initializer */
static ? D_80A2B90C;                                /* unable to generate initializer */
static ? D_80A2B93C;                                /* unable to generate initializer */
static ? D_80A2B96C;                                /* unable to generate initializer */
static ? D_80A2B974;                                /* unable to generate initializer */
static InitChainEntry D_80A2B978;                   /* unable to generate initializer */
static Vec3f D_80A2B988 = {1785.0f, 0.0f, 220.0f};
static BgDblueMovebg *D_80A2BBF0;
static u8 D_80A2BBF4;
static s8 D_80A2BBF5;

typedef struct BgDblueMovebg {
    /* 0x0000 */ Actor actor;
    /* 0x0144 */ s32 unk144;                        /* inferred */
    /* 0x0148 */ f32 unk148;                        /* inferred */
    /* 0x014C */ char pad14C[0x10];                 /* maybe part of unk148[5]? */
    /* 0x015C */ void (*actionFunc)(BgDblueMovebg *, GlobalContext *);
    /* 0x0160 */ s32 unk160;                        /* inferred */
    /* 0x0164 */ ? *unk164;                         /* inferred */
    /* 0x0168 */ s32 unk168;                        /* inferred */
    /* 0x016C */ void *unk16C;                      /* inferred */
    /* 0x0170 */ s8 unk170;                         /* inferred */
    /* 0x0171 */ s8 unk171;                         /* inferred */
    /* 0x0172 */ u16 unk172;                        /* inferred */
    /* 0x0174 */ u16 unk174;                        /* inferred */
    /* 0x0176 */ char pad176[0x2];                  /* maybe part of unk174[2]? */
    /* 0x0178 */ s32 unk178;                        /* inferred */
    /* 0x017C */ char pad17C[0x2];
    /* 0x017E */ s16 unk17E;                        /* inferred */
    /* 0x0180 */ s16 unk180;                        /* inferred */
    /* 0x0182 */ char pad182[0x2];                  /* maybe part of unk180[2]? */
    /* 0x0184 */ f32 unk184;                        /* inferred */
    /* 0x0188 */ s16 unk188;                        /* inferred */
    /* 0x018A */ s16 unk18A;                        /* inferred */
    /* 0x018C */ s16 unk18C;                        /* inferred */
    /* 0x018E */ s16 unk18E;                        /* inferred */
    /* 0x0190 */ Vec3f unk190;                      /* inferred */
    /* 0x019C */ Vec3f unk19C;                      /* inferred */
    /* 0x01A8 */ Vec3f unk1A8;                      /* inferred */
    /* 0x01B4 */ char pad1B4[0x2];
    /* 0x01B6 */ s16 unk1B6;                        /* inferred */
    /* 0x01B8 */ s16 unk1B8;                        /* inferred */
    /* 0x01BA */ char pad1BA[0x2];                  /* maybe part of unk1B8[2]? */
    /* 0x01BC */ s32 unk1BC;                        /* inferred */
    /* 0x01C0 */ s32 unk1C0;                        /* inferred */
    /* 0x01C4 */ s32 unk1C4;                        /* inferred */
    /* 0x01C8 */ s32 unk1C8;                        /* inferred */
    /* 0x01CC */ s16 unk1CC;                        /* inferred */
    /* 0x01CE */ s16 unk1CE;                        /* inferred */
    /* 0x01D0 */ s16 unk1D0;                        /* inferred */
    /* 0x01D2 */ s16 unk1D2;                        /* inferred */
    /* 0x01D4 */ f32 unk1D4;                        /* inferred */
    /* 0x01D8 */ char pad1D8[0x120];                /* maybe part of unk1D4[73]? */
    /* 0x02F8 */ Actor *unk2F8;                     /* inferred */
    /* 0x02FC */ Actor *unk2FC;                     /* inferred */
    /* 0x0300 */ char pad300[0x70];                 /* maybe part of unk2FC[29]? */
} BgDblueMovebg;                                    /* size 0x370 */

s32 func_80A29A80(GlobalContext *arg0, s32 arg1, s32 arg2) {
    s32 sp2C;
    s32 temp_s0_2;
    u8 temp_s0;
    void *temp_v1;
    s32 phi_s0;
    s32 phi_s1;

    sp2C = 1;
    if (arg2 < 0xE) {
        temp_v1 = (arg2 * 2) + &D_80A2B870;
        temp_s0 = temp_v1->unk0;
        temp_s0_2 = temp_s0 - 1;
        phi_s0 = temp_s0_2;
        if (temp_s0 != 0) {
            phi_s1 = arg1 + temp_s0_2;
loop_3:
            if (((1 << phi_s0) & temp_v1->unk1) != 0) {
                if (Flags_GetSwitch(arg0, phi_s1) == 0) {
                    sp2C = 0;
                } else {
                    goto block_8;
                }
            } else if (Flags_GetSwitch(arg0, phi_s1) != 0) {
                sp2C = 0;
            } else {
block_8:
                phi_s0 += -1;
                phi_s1 += -1;
                if (phi_s0 == 0) {

