typedef struct BgDblueMovebg {
    /* 0x000 */ Actor actor;
    /* 0x144 */ s32 unk_144;                        /* inferred */
    /* 0x148 */ f32 unk_148;                        /* inferred */
    /* 0x14C */ char pad_14C[0x10];                 /* maybe part of unk_148[5]? */
    /* 0x15C */ void (*actionFunc)(BgDblueMovebg *, GlobalContext *);
    /* 0x160 */ s32 unk_160;                        /* inferred */
    /* 0x164 */ ? *unk_164;                         /* inferred */
    /* 0x168 */ u32 unk_168;                        /* inferred */
    /* 0x16C */ void *unk_16C;                      /* inferred */
    /* 0x170 */ s8 unk_170;                         /* inferred */
    /* 0x171 */ s8 unk_171;                         /* inferred */
    /* 0x172 */ u16 unk_172;                        /* inferred */
    /* 0x174 */ u16 unk_174;                        /* inferred */
    /* 0x176 */ char pad_176[0x2];
    /* 0x178 */ s32 unk_178;                        /* inferred */
    /* 0x17C */ char pad_17C[0x2];
    /* 0x17E */ s16 unk_17E;                        /* inferred */
    /* 0x180 */ s16 unk_180;                        /* inferred */
    /* 0x182 */ char pad_182[0x2];
    /* 0x184 */ f32 unk_184;                        /* inferred */
    /* 0x188 */ s16 unk_188;                        /* inferred */
    /* 0x18A */ s16 unk_18A;                        /* inferred */
    /* 0x18C */ s16 unk_18C;                        /* inferred */
    /* 0x18E */ s16 unk_18E;                        /* inferred */
    /* 0x190 */ Vec3f unk_190;                      /* inferred */
    /* 0x19C */ Vec3f unk_19C;                      /* inferred */
    /* 0x1A8 */ Vec3f unk_1A8;                      /* inferred */
    /* 0x1B4 */ char pad_1B4[0x2];
    /* 0x1B6 */ s16 unk_1B6;                        /* inferred */
    /* 0x1B8 */ s16 unk_1B8;                        /* inferred */
    /* 0x1BA */ char pad_1BA[0x2];
    /* 0x1BC */ s32 unk_1BC;                        /* inferred */
    /* 0x1C0 */ s32 unk_1C0;                        /* inferred */
    /* 0x1C4 */ s32 unk_1C4;                        /* inferred */
    /* 0x1C8 */ s32 unk_1C8;                        /* inferred */
    /* 0x1CC */ s16 unk_1CC;                        /* inferred */
    /* 0x1CE */ s16 unk_1CE;                        /* inferred */
    /* 0x1D0 */ s16 unk_1D0;                        /* inferred */
    /* 0x1D2 */ s16 unk_1D2;                        /* inferred */
    /* 0x1D4 */ f32 unk_1D4;                        /* inferred */
    /* 0x1D8 */ char pad_1D8[0x120];                /* maybe part of unk_1D4[73]? */
    /* 0x2F8 */ s32 unk_2F8;                        /* inferred */
    /* 0x2FC */ s32 unk_2FC;                        /* inferred */
    /* 0x300 */ char pad_300[0x70];                 /* maybe part of unk_2FC[29]? */
} BgDblueMovebg;                                    /* size = 0x370 */

struct _mips2c_stack_BgDblueMovebg_Destroy {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_BgDblueMovebg_Draw {
    /* 0x00 */ char pad_0[0x88];
    /* 0x88 */ s32 sp88;                            /* inferred */
    /* 0x8C */ char pad_8C[0x18];                   /* maybe part of sp88[7]? */
    /* 0xA4 */ GraphicsContext *spA4;               /* inferred */
    /* 0xA8 */ char pad_A8[0x38];
};                                                  /* size = 0xE0 */

struct _mips2c_stack_BgDblueMovebg_Init {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ Vec3f *sp24;                         /* inferred */
    /* 0x28 */ PosRot *sp28;                        /* inferred */
    /* 0x2C */ Vec3f *sp2C;                         /* inferred */
    /* 0x30 */ char pad_30[0x10];
};                                                  /* size = 0x40 */

struct _mips2c_stack_BgDblueMovebg_Update {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A29A80 {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ s32 sp2C;                            /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80A2A128 {
    /* 0x00 */ char pad_0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80A2A1E0 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A2A32C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A2A444 {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ s32 sp20;                            /* inferred */
    /* 0x24 */ Actor *sp24;                         /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80A2A670 {};              /* size 0x0 */

struct _mips2c_stack_func_80A2A688 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A2A714 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A2A7F8 {
    /* 0x00 */ char pad_0[0x26];
    /* 0x26 */ s16 sp26;                            /* inferred */
    /* 0x28 */ s32 sp28;                            /* inferred */
    /* 0x2C */ Actor *sp2C;                         /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80A2AAB8 {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ s32 sp18;                            /* inferred */
    /* 0x1C */ Actor *sp1C;                         /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80A2ABD0 {
    /* 0x00 */ char pad_0[0x80];
    /* 0x80 */ s32 sp80;                            /* inferred */
    /* 0x84 */ char pad_84[0x8];                    /* maybe part of sp80[3]? */
    /* 0x8C */ Vec3f *sp8C;                         /* inferred */
    /* 0x90 */ char pad_90[0x4];
    /* 0x94 */ BgDblueMovebg *sp94;                 /* inferred */
    /* 0x98 */ char pad_98[0x14];                   /* maybe part of sp94[6]? */
    /* 0xAC */ ? spAC;                              /* inferred */
    /* 0xAC */ char pad_AC[0x4];
    /* 0xB0 */ f32 spB0;                            /* inferred */
    /* 0xB4 */ char pad_B4[0x4];
};                                                  /* size = 0xB8 */

struct _mips2c_stack_func_80A2AED0 {
    /* 0x00 */ char pad_0[0x3C];
    /* 0x3C */ Vec3f *sp3C;                         /* inferred */
    /* 0x40 */ BgDblueMovebg *sp40;                 /* inferred */
    /* 0x44 */ Vec3f *sp44;                         /* inferred */
    /* 0x48 */ f32 sp48;                            /* inferred */
    /* 0x4C */ char pad_4C[0x4];
    /* 0x50 */ ? sp50;                              /* inferred */
    /* 0x50 */ char pad_50[0x4];
    /* 0x54 */ ? sp54;                              /* inferred */
    /* 0x54 */ char pad_54[0x4];
    /* 0x58 */ f32 sp58;                            /* inferred */
    /* 0x5C */ ? sp5C;                              /* inferred */
    /* 0x5C */ char pad_5C[0xC];
};                                                  /* size = 0x68 */

struct _mips2c_stack_func_80A2B1A0 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A2B274 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A2B308 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ Gfx *sp1C;                           /* inferred */
    /* 0x20 */ char pad_20[0x4];
    /* 0x24 */ GraphicsContext *sp24;               /* inferred */
    /* 0x28 */ char pad_28[0x8];
};                                                  /* size = 0x30 */

s16 func_800F2178(s16, BgDblueMovebg *, Actor *);   /* extern */
s32 func_8017D668(f32, f32, f32, f32, f32, f32, ? *, ? *, ? *); /* extern */
? func_8019FB0C(Vec3f *, ?, f32, ?);                /* extern */
? func_8019FC20(Vec3f *, ?);                        /* extern */
s32 func_80A29A80(GlobalContext *arg0, s32 arg1, s32 arg2, BgDblueMovebg *); /* static */
void func_80A2A128(BgDblueMovebg *arg0, GlobalContext *arg1); /* static */
void func_80A2A1E0(BgDblueMovebg *, GlobalContext *); /* static */
void func_80A2A32C(BgDblueMovebg *, GlobalContext *); /* static */
void func_80A2A444(BgDblueMovebg *, GlobalContext *); /* static */
void func_80A2A670(BgDblueMovebg *arg0, GlobalContext *arg1); /* static */
void func_80A2A688(Actor *arg0, ? arg1);            /* static */
void func_80A2A714(BgDblueMovebg *, GlobalContext *); /* static */
