typedef struct ObjHugebombiwa {
    /* 0x000 */ Actor actor;
    /* 0x144 */ ColliderCylinder unk_144;           /* inferred */
    /* 0x190 */ char pad_190[0x324];                /* maybe part of unk_144[11]? */
    /* 0x4B4 */ void (*actionFunc)(ObjHugebombiwa *, GlobalContext *);
} ObjHugebombiwa;                                   /* size = 0x4B8 */

struct _mips2c_stack_ObjHugebombiwa_Destroy {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_ObjHugebombiwa_Draw {
    /* 0x00 */ char pad_0[0x38];
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ char pad_3C[0x24];
};                                                  /* size = 0x60 */

struct _mips2c_stack_ObjHugebombiwa_Init {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ ColliderCylinder *sp24;              /* inferred */
    /* 0x28 */ char pad_28[0x8];
};                                                  /* size = 0x30 */

struct _mips2c_stack_ObjHugebombiwa_Update {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A53BE0 {
    /* 0x00 */ char pad_0[0xB0];
    /* 0xB0 */ f32 spB0;                            /* inferred */
    /* 0xB4 */ f32 spB4;                            /* inferred */
    /* 0xB8 */ f32 spB8;                            /* inferred */
    /* 0xBC */ f32 spBC;                            /* inferred */
    /* 0xC0 */ f32 spC0;                            /* inferred */
    /* 0xC4 */ f32 spC4;                            /* inferred */
};                                                  /* size = 0xC8 */

struct _mips2c_stack_func_80A53E60 {
    /* 0x00 */ char pad_0[0xD0];
    /* 0xD0 */ f32 spD0;                            /* inferred */
    /* 0xD4 */ f32 spD4;                            /* inferred */
    /* 0xD8 */ f32 spD8;                            /* inferred */
    /* 0xDC */ f32 spDC;                            /* inferred */
    /* 0xE0 */ f32 spE0;                            /* inferred */
    /* 0xE4 */ f32 spE4;                            /* inferred */
};                                                  /* size = 0xE8 */

struct _mips2c_stack_func_80A541F4 {
    /* 0x000 */ char pad_0[0xC4];
    /* 0x0C4 */ f32 spC4;                           /* inferred */
    /* 0x0C8 */ f32 spC8;                           /* inferred */
    /* 0x0CC */ f32 spCC;                           /* inferred */
    /* 0x0D0 */ f32 spD0;                           /* inferred */
    /* 0x0D4 */ f32 spD4;                           /* inferred */
    /* 0x0D8 */ f32 spD8;                           /* inferred */
    /* 0x0DC */ f32 spDC;                           /* inferred */
    /* 0x0E0 */ f32 spE0;                           /* inferred */
    /* 0x0E4 */ f32 spE4;                           /* inferred */
    /* 0x0E8 */ f32 spE8;                           /* inferred */
    /* 0x0EC */ f32 spEC;                           /* inferred */
    /* 0x0F0 */ f32 spF0;                           /* inferred */
    /* 0x0F4 */ f32 spF4;                           /* inferred */
    /* 0x0F8 */ f32 spF8;                           /* inferred */
    /* 0x0FC */ f32 spFC;                           /* inferred */
    /* 0x100 */ char pad_100[0x10];
};                                                  /* size = 0x110 */

struct _mips2c_stack_func_80A54600 {
    /* 0x00 */ char pad_0[0xA0];
    /* 0xA0 */ f32 spA0;                            /* inferred */
    /* 0xA4 */ char pad_A4[0x1C];                   /* maybe part of spA0[8]? */
    /* 0xC0 */ f32 spC0;                            /* inferred */
    /* 0xC4 */ f32 spC4;                            /* inferred */
    /* 0xC8 */ f32 spC8;                            /* inferred */
    /* 0xCC */ f32 spCC;                            /* inferred */
    /* 0xD0 */ f32 spD0;                            /* inferred */
    /* 0xD4 */ f32 spD4;                            /* inferred */
};                                                  /* size = 0xD8 */

struct _mips2c_stack_func_80A54980 {
    /* 0x00 */ char pad_0[0x26];
    /* 0x26 */ s16 sp26;                            /* inferred */
    /* 0x28 */ char pad_28[0x8];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80A54A0C {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ f32 sp20;                            /* inferred */
    /* 0x24 */ f32 sp24;                            /* inferred */
    /* 0x28 */ f32 sp28;                            /* inferred */
    /* 0x2C */ s32 sp2C;                            /* inferred */
    /* 0x30 */ char pad_30[0x8];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80A54BF0 {};              /* size 0x0 */

struct _mips2c_stack_func_80A54C04 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ Collider *sp1C;                      /* inferred */
    /* 0x20 */ CollisionCheckContext *sp20;         /* inferred */
    /* 0x24 */ char pad_24[0x4];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80A54CD8 {};              /* size 0x0 */

struct _mips2c_stack_func_80A54CEC {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ PosRot *sp20;                        /* inferred */
    /* 0x24 */ char pad_24[0x4];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80A54E10 {
    /* 0x00 */ char pad_0[0x84];
    /* 0x84 */ f32 sp84;                            /* inferred */
    /* 0x88 */ f32 sp88;                            /* inferred */
    /* 0x8C */ f32 sp8C;                            /* inferred */
    /* 0x90 */ char pad_90[0x18];
};                                                  /* size = 0xA8 */

struct _mips2c_stack_func_80A55064 {
    /* 0x00 */ char pad_0[0x98];
    /* 0x98 */ s32 sp98;                            /* inferred */
    /* 0x9C */ CollisionPoly *sp9C;                 /* inferred */
    /* 0xA0 */ char pad_A0[0x4];
    /* 0xA4 */ f32 spA4;                            /* inferred */
    /* 0xA8 */ f32 spA8;                            /* inferred */
    /* 0xAC */ f32 spAC;                            /* inferred */
    /* 0xB0 */ char pad_B0[0x8];
};                                                  /* size = 0xB8 */

struct _mips2c_stack_func_80A55310 {
    /* 0x00 */ char pad_0[0x84];
    /* 0x84 */ f32 sp84;                            /* inferred */
    /* 0x88 */ f32 sp88;                            /* inferred */
    /* 0x8C */ f32 sp8C;                            /* inferred */
    /* 0x90 */ char pad_90[0x18];
};                                                  /* size = 0xA8 */

struct _mips2c_stack_func_80A55564 {
    /* 0x00 */ char pad_0[0x98];
    /* 0x98 */ s32 sp98;                            /* inferred */
    /* 0x9C */ CollisionPoly *sp9C;                 /* inferred */
    /* 0xA0 */ char pad_A0[0x4];
    /* 0xA4 */ f32 spA4;                            /* inferred */
    /* 0xA8 */ f32 spA8;                            /* inferred */
    /* 0xAC */ f32 spAC;                            /* inferred */
    /* 0xB0 */ char pad_B0[0x8];
};                                                  /* size = 0xB8 */

struct _mips2c_stack_func_80A55B34 {
    /* 0x00 */ char pad_0[0x5C];
    /* 0x5C */ GraphicsContext *sp5C;               /* inferred */
    /* 0x60 */ char pad_60[0x10];
};                                                  /* size = 0x70 */

void func_80A53BE0(GlobalContext *arg0, PosRot *arg1); /* static */
void func_80A53E60(GlobalContext *arg0, void *arg1, f32 arg2, f32 arg3); /* static */
void func_80A541F4(Actor *arg0, GlobalContext *arg1); /* static */
void func_80A54600(GlobalContext *arg0, void *arg1, f32 arg2, f32 arg3); /* static */
void func_80A54980(Actor *arg0, GlobalContext *arg1, s16 arg2); /* static */
s32 func_80A54A0C(void *arg0, void *);              /* static */
void func_80A54BF0(ObjHugebombiwa *arg0);           /* static */
void func_80A54C04(void *arg0, GlobalContext *arg1); /* static */
void func_80A54CD8(void *arg0);                     /* static */
void func_80A54CEC(Actor *arg0, GlobalContext *arg1); /* static */
void func_80A54E10(Actor *arg0);                    /* static */
void func_80A55064(Actor *arg0, GlobalContext *arg1); /* static */
