CRASHED

typedef struct ActorContext {
    /* 0x000 */ char pad0[0x2];
    /* 0x002 */ u8 unk2;
    /* 0x003 */ u8 unk3;
    /* 0x004 */ s8 unk4;
    /* 0x005 */ u8 unk5;
    /* 0x006 */ char pad6[0x5];                     /* maybe part of unk5[6]? */
    /* 0x00B */ s8 unkB;
    /* 0x00C */ s16 unkC;
    /* 0x00E */ u8 totalLoadedActors;
    /* 0x00F */ u8 undrawnActorCount;
    /* 0x010 */ ActorListEntry actorList[12];
    /* 0x0A0 */ Actor *undrawnActors[32];
    /* 0x120 */ TargetContext targetContext;
    /* 0x1B8 */ u32 switchFlags[4];
    /* 0x1C8 */ u32 chestFlags;
    /* 0x1CC */ u32 clearedRooms;
    /* 0x1D0 */ u32 clearedRoomsTemp;
    /* 0x1D4 */ u32 collectibleFlags[4];
    /* 0x1E4 */ TitleCardContext titleCtxt;
    /* 0x1F4 */ u8 unk1F4;
    /* 0x1F5 */ u8 unk1F5;
    /* 0x1F6 */ char pad1F6[0x2];                   /* maybe part of unk1F5[3]? */
    /* 0x1F8 */ f32 unk1F8;
    /* 0x1FC */ Vec3f unk1FC;
    /* 0x208 */ char pad208[0x48];                  /* maybe part of unk1FC[7]? */
    /* 0x250 */ void *unk250;
    /* 0x254 */ u32 unk254[5];
    /* 0x268 */ u8 unk268;
    /* 0x269 */ char pad269[0x3];                   /* maybe part of unk268[4]? */
    /* 0x26C */ ? unk26C;                           /* inferred */
    /* 0x26C */ char pad26C[0xC];
    /* 0x278 */ u16 unk278;
    /* 0x27A */ char pad27A[0xA];                   /* maybe part of unk278[6]? */
} ActorContext;                                     /* size = 0x284 */

typedef struct BossHakugin {
    /* 0x0000 */ Actor actor;
    /* 0x0144 */ SkelAnime unk144;                  /* inferred */
    /* 0x0188 */ void (*actionFunc)(BossHakugin *, GlobalContext *);
    /* 0x018C */ u8 unk18C;                         /* inferred */
    /* 0x018D */ s8 unk18D;                         /* inferred */
    /* 0x018E */ s8 unk18E;                         /* inferred */
    /* 0x018F */ s8 unk18F;                         /* inferred */
    /* 0x0190 */ u8 unk190;                         /* inferred */
    /* 0x0191 */ char pad191[0x1];
    /* 0x0192 */ u8 unk192;                         /* inferred */
    /* 0x0193 */ u8 unk193;                         /* inferred */
    /* 0x0194 */ char pad194[0x1];
    /* 0x0195 */ u8 unk195;                         /* inferred */
    /* 0x0196 */ u8 unk196;                         /* inferred */
    /* 0x0197 */ char pad197[0x3];                  /* maybe part of unk196[4]? */
    /* 0x019A */ s16 unk19A;                        /* inferred */
    /* 0x019C */ s16 unk19C;                        /* inferred */
    /* 0x019E */ s16 unk19E;                        /* inferred */
    /* 0x01A0 */ s16 unk1A0;                        /* inferred */
    /* 0x01A2 */ s16 unk1A2;                        /* inferred */
    /* 0x01A4 */ s16 unk1A4;                        /* inferred */
    /* 0x01A6 */ s16 unk1A6;                        /* inferred */
    /* 0x01A8 */ char pad1A8[0x4];                  /* maybe part of unk1A6[3]? */
    /* 0x01AC */ s16 unk1AC;                        /* inferred */
    /* 0x01AE */ s16 unk1AE;                        /* inferred */
    /* 0x01B0 */ s32 unk1B0;                        /* inferred */
    /* 0x01B4 */ s32 unk1B4;                        /* inferred */
    /* 0x01B8 */ f32 unk1B8;                        /* inferred */
    /* 0x01BC */ f32 unk1BC;                        /* inferred */
    /* 0x01C0 */ f32 unk1C0;                        /* inferred */
    /* 0x01C4 */ f32 unk1C4;                        /* inferred */
    /* 0x01C8 */ f32 unk1C8;                        /* inferred */
    /* 0x01CC */ char pad1CC[0x8];                  /* maybe part of unk1C8[3]? */
    /* 0x01D4 */ f32 unk1D4;                        /* inferred */
    /* 0x01D8 */ char pad1D8[0x4];
    /* 0x01DC */ f32 unk1DC;                        /* inferred */
    /* 0x01E0 */ f32 unk1E0;                        /* inferred */
    /* 0x01E4 */ f32 unk1E4;                        /* inferred */
    /* 0x01E8 */ Vec3s unk1E8;                      /* inferred */
    /* 0x01EE */ char pad1EE[0xC0];                 /* maybe part of unk1E8[33]? */
    /* 0x02AE */ Vec3s unk2AE;                      /* inferred */
    /* 0x02B4 */ char pad2B4[0xC2];                 /* maybe part of unk2AE[33]? */
    /* 0x0376 */ s16 unk376;                        /* inferred */
    /* 0x0378 */ s16 unk378;                        /* inferred */
    /* 0x037A */ Vec3s unk37A;                      /* inferred */
    /* 0x0380 */ Vec3f unk380;                      /* inferred */
    /* 0x038C */ f32 unk38C;                        /* inferred */
    /* 0x0390 */ f32 unk390;                        /* inferred */
    /* 0x0394 */ f32 unk394;                        /* inferred */
    /* 0x0398 */ Vec3f unk398;                      /* inferred */
    /* 0x03A4 */ char pad3A4[0xA8];                 /* maybe part of unk398[15]? */
    /* 0x044C */ f32 unk44C;                        /* inferred */
    /* 0x0450 */ char pad450[0x4];
    /* 0x0454 */ f32 unk454;                        /* inferred */
    /* 0x0458 */ Vec3f unk458;                      /* inferred */
    /* 0x0464 */ Vec3f unk464;                      /* inferred */
    /* 0x0470 */ LightNode *unk470;                 /* inferred */
    /* 0x0474 */ LightInfo unk474;                  /* inferred */
    /* 0x0482 */ char pad482[0x2];
    /* 0x0484 */ ColliderJntSph unk484;             /* inferred */
    /* 0x04A4 */ ColliderJntSphElement unk4A4;      /* inferred */
    /* 0x04E4 */ char pad4E4[0x480];                /* maybe part of unk4A4[19]? */
    /* 0x0964 */ ColliderCylinder unk964;           /* inferred */
    /* 0x09B0 */ Actor *unk9B0;                     /* inferred */
    /* 0x09B4 */ char pad9B4[0x1C];                 /* maybe part of unk9B0[8]? */
    /* 0x09D0 */ void *unk9D0;                      /* inferred */
    /* 0x09D4 */ void *unk9D4;                      /* inferred */
    /* 0x09D8 */ char pad9D8[0x1C4C];               /* maybe part of unk9D4[1812]? */
    /* 0x2624 */ s16 unk2624;                       /* inferred */
    /* 0x2626 */ char pad2626[0x6];                 /* maybe part of unk2624[4]? */
    /* 0x262C */ ColliderTris unk262C;              /* inferred */
    /* 0x264C */ ColliderTrisElement unk264C;       /* inferred */
    /* 0x26A8 */ char pad26A8[0x108C];              /* maybe part of unk264C[47]? */
    /* 0x3734 */ Vec3f unk3734;                     /* inferred */
    /* 0x3740 */ char pad3740[0x6C];                /* maybe part of unk3734[10]? */
    /* 0x37AC */ f32 unk37AC;                       /* inferred */
    /* 0x37B0 */ f32 unk37B0;                       /* inferred */
    /* 0x37B4 */ f32 unk37B4;                       /* inferred */
    /* 0x37B8 */ ColliderSphere unk37B8;            /* inferred */
} BossHakugin;                                      /* size = 0x3810 */

struct _mips2c_stack_BossHakugin_Destroy {
    /* 0x00 */ char pad0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_BossHakugin_Draw {
    /* 0x00 */ char pad0[0x30];
    /* 0x30 */ MtxF *sp30;                          /* inferred */
    /* 0x34 */ Gfx *sp34;                           /* inferred */
    /* 0x38 */ char pad38[0x8];                     /* maybe part of sp34[3]? */
    /* 0x40 */ GraphicsContext *sp40;               /* inferred */
    /* 0x44 */ char pad44[0xC];
};                                                  /* size = 0x50 */

struct _mips2c_stack_BossHakugin_Init {
    /* 0x00 */ char pad0[0x5C];
    /* 0x5C */ SkelAnime *sp5C;                     /* inferred */
    /* 0x60 */ s32 sp60;                            /* inferred */
    /* 0x64 */ s32 sp64;                            /* inferred */
    /* 0x68 */ char pad68[0x10];
};                                                  /* size = 0x78 */

struct _mips2c_stack_BossHakugin_Update {
    /* 0x00 */ char pad0[0x44];
    /* 0x44 */ PosRot *sp44;                        /* inferred */
    /* 0x48 */ char pad48[0x4];
    /* 0x4C */ u32 sp4C;                            /* inferred */
    /* 0x50 */ f32 sp50;                            /* inferred */
    /* 0x54 */ f32 sp54;                            /* inferred */
    /* 0x58 */ f32 sp58;                            /* inferred */
    /* 0x5C */ ? sp5C;                              /* inferred */
    /* 0x5C */ char pad5C[0xC];
    /* 0x68 */ CollisionPoly *sp68;                 /* inferred */
    /* 0x6C */ Actor *sp6C;                         /* inferred */
    /* 0x70 */ s16 sp70;                            /* inferred */
    /* 0x72 */ char pad72[0x2];
    /* 0x74 */ s16 sp74;                            /* inferred */
    /* 0x76 */ char pad76[0xA];
};                                                  /* size = 0x80 */

struct _mips2c_stack_func_80B0573C {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B057A4 {
    /* 0x00 */ char pad0[0x28];
    /* 0x28 */ ? sp28;                              /* inferred */
    /* 0x28 */ char pad28[0xC];
    /* 0x34 */ ? sp34;                              /* inferred */
    /* 0x34 */ char pad34[0xC];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80B058C0 {};              /* size 0x0 */

struct _mips2c_stack_func_80B05A64 {
    /* 0x00 */ char pad0[0x26];
    /* 0x26 */ s16 sp26;                            /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80B05B04 {
    /* 0x00 */ char pad0[0x2C];
    /* 0x2C */ f32 sp2C;                            /* inferred */
    /* 0x30 */ char pad30[0x4];
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ f32 sp3C;                            /* inferred */
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80B05CBC {};              /* size 0x0 */

struct _mips2c_stack_func_80B05D4C {
    /* 0x00 */ char pad0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80B05EE0 {
    /* 0x00 */ char pad0[0x44];
    /* 0x44 */ ActorContext *sp44;                  /* inferred */
    /* 0x48 */ char pad48[0x4];
    /* 0x4C */ f32 sp4C;                            /* inferred */
    /* 0x50 */ f32 sp50;                            /* inferred */
    /* 0x54 */ f32 sp54;                            /* inferred */
    /* 0x58 */ char pad58[0x4];
    /* 0x5C */ f32 sp5C;                            /* inferred */
    /* 0x60 */ f32 sp60;                            /* inferred */
    /* 0x64 */ f32 sp64;                            /* inferred */
    /* 0x68 */ f32 sp68;                            /* inferred */
    /* 0x6C */ char pad6C[0x4];
};                                                  /* size = 0x70 */

struct _mips2c_stack_func_80B0607C {
    /* 0x00 */ char pad0[0x40];
    /* 0x40 */ CollisionContext *sp40;              /* inferred */
    /* 0x44 */ f32 sp44;                            /* inferred */
    /* 0x48 */ f32 sp48;                            /* inferred */
    /* 0x4C */ f32 sp4C;                            /* inferred */
    /* 0x50 */ f32 sp50;                            /* inferred */
    /* 0x54 */ f32 sp54;                            /* inferred */
    /* 0x58 */ f32 sp58;                            /* inferred */
    /* 0x5C */ f32 sp5C;                            /* inferred */
    /* 0x60 */ f32 sp60;                            /* inferred */
    /* 0x64 */ f32 sp64;                            /* inferred */
    /* 0x68 */ char pad68[0x4];
    /* 0x6C */ f32 sp6C;                            /* inferred */
    /* 0x70 */ f32 sp70;                            /* inferred */
    /* 0x74 */ char pad74[0x4];
    /* 0x78 */ f32 sp78;                            /* inferred */
    /* 0x7C */ char pad7C[0x4];
    /* 0x80 */ s16 sp80;                            /* inferred */
    /* 0x82 */ s16 sp82;                            /* inferred */
    /* 0x84 */ u32 sp84;                            /* inferred */
    /* 0x88 */ CollisionPoly *sp88;                 /* inferred */
    /* 0x8C */ CollisionPoly *sp8C;                 /* inferred */
};                                                  /* size = 0x90 */

struct _mips2c_stack_func_80B06558 {
    /* 0x00 */ char pad0[0x38];
    /* 0x38 */ ? sp38;                              /* inferred */
    /* 0x38 */ char pad38[0xC];
    /* 0x44 */ ? sp44;                              /* inferred */
    /* 0x44 */ char pad44[0xC];
    /* 0x50 */ ? sp50;                              /* inferred */
    /* 0x50 */ char pad50[0xC];
    /* 0x5C */ ? sp5C;                              /* inferred */
    /* 0x5C */ char pad5C[0x4];
};                                                  /* size = 0x60 */

struct _mips2c_stack_func_80B06600 {
    /* 0x00 */ char pad0[0x84];
    /* 0x84 */ u32 sp84;                            /* inferred */
    /* 0x88 */ char pad88[0x4];
    /* 0x8C */ ? sp8C;                              /* inferred */
    /* 0x8C */ char pad8C[0x8];
    /* 0x94 */ f32 sp94;                            /* inferred */
    /* 0x98 */ ? sp98;                              /* inferred */
    /* 0x98 */ char pad98[0x8];
    /* 0xA0 */ f32 spA0;                            /* inferred */
    /* 0xA4 */ ? spA4;                              /* inferred */
    /* 0xA4 */ char padA4[0xC];
    /* 0xB0 */ f32 spB0;                            /* inferred */
    /* 0xB4 */ f32 spB4;                            /* inferred */
    /* 0xB8 */ f32 spB8;                            /* inferred */
    /* 0xBC */ f32 spBC;                            /* inferred */
    /* 0xC0 */ f32 spC0;                            /* inferred */
    /* 0xC4 */ f32 spC4;                            /* inferred */
    /* 0xC8 */ f32 spC8;                            /* inferred */
    /* 0xCC */ f32 spCC;                            /* inferred */
    /* 0xD0 */ f32 spD0;                            /* inferred */
    /* 0xD4 */ CollisionPoly *spD4;                 /* inferred */
    /* 0xD8 */ char padD8[0x8];
};                                                  /* size = 0xE0 */

struct _mips2c_stack_func_80B0696C {
    /* 0x00 */ char pad0[0x24];
    /* 0x24 */ f32 sp24;                            /* inferred */
    /* 0x28 */ f32 sp28;                            /* inferred */
    /* 0x2C */ s16 sp2C;                            /* inferred */
    /* 0x2E */ s16 sp2E;                            /* inferred */
    /* 0x30 */ char pad30[0x8];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80B06B20 {
    /* 0x00 */ char pad0[0x1C];
    /* 0x1C */ void *sp1C;                          /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80B06C08 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B06D38 {
    /* 0x00 */ char pad0[0x38];
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ char pad3C[0x8];                     /* maybe part of sp38[3]? */
    /* 0x44 */ Actor *sp44;                         /* inferred */
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_80B06F48 {
    /* 0x00 */ char pad0[0x78];
    /* 0x78 */ void *sp78;                          /* inferred */
    /* 0x7C */ char pad7C[0x8];                     /* maybe part of sp78[3]? */
    /* 0x84 */ s32 sp84;                            /* inferred */
    /* 0x88 */ char pad88[0xC];                     /* maybe part of sp84[4]? */
    /* 0x94 */ s32 sp94;                            /* inferred */
    /* 0x98 */ char pad98[0x4];
    /* 0x9C */ s32 sp9C;                            /* inferred */
    /* 0xA0 */ f32 spA0;                            /* inferred */
    /* 0xA4 */ f32 spA4;                            /* inferred */
    /* 0xA8 */ f32 spA8;                            /* inferred */
    /* 0xAC */ char padAC[0xC];
};                                                  /* size = 0xB8 */

struct _mips2c_stack_func_80B0728C {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80B07450 {
    /* 0x00 */ char pad0[0x48];
    /* 0x48 */ f32 sp48;                            /* inferred */
    /* 0x4C */ f32 sp4C;                            /* inferred */
    /* 0x50 */ f32 sp50;                            /* inferred */
    /* 0x54 */ f32 sp54;                            /* inferred */
    /* 0x58 */ f32 sp58;                            /* inferred */
    /* 0x5C */ f32 sp5C;                            /* inferred */
};                                                  /* size = 0x60 */

struct _mips2c_stack_func_80B07700 {
    /* 0x00 */ char pad0[0x2C];
    /* 0x2C */ f32 sp2C;                            /* inferred */
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ f32 sp3C;                            /* inferred */
    /* 0x40 */ f32 sp40;                            /* inferred */
    /* 0x44 */ f32 sp44;                            /* inferred */
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_80B0791C {
    /* 0x00 */ char pad0[0x1C];
    /* 0x1C */ f32 sp1C;                            /* inferred */
    /* 0x20 */ char pad20[0x4];
    /* 0x24 */ f32 sp24;                            /* inferred */
    /* 0x28 */ char pad28[0xC];                     /* maybe part of sp24[4]? */
    /* 0x34 */ void *sp34;                          /* inferred */
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80B07B88 {
    /* 0x00 */ char pad0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80B07BFC {
    /* 0x00 */ char pad0[0x38];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80B07DA4 {
    /* 0x00 */ char pad0[0x24];
    /* 0x24 */ Vec3f *sp24;                         /* inferred */
    /* 0x28 */ f32 sp28;                            /* inferred */
    /* 0x2C */ f32 sp2C;                            /* inferred */
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ f32 sp3C;                            /* inferred */
    /* 0x40 */ f32 sp40;                            /* inferred */
    /* 0x44 */ char pad44[0x4];
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_80B07EEC {
    /* 0x00 */ char pad0[0x20];
    /* 0x20 */ f32 sp20;                            /* inferred */
    /* 0x24 */ f32 sp24;                            /* inferred */
    /* 0x28 */ f32 sp28;                            /* inferred */
    /* 0x2C */ char pad2C[0x4];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80B08018 {
    /* 0x00 */ char pad0[0x24];
    /* 0x24 */ f32 *sp24;                           /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80B08124 {};              /* size 0x0 */

struct _mips2c_stack_func_80B0813C {
    /* 0x00 */ char pad0[0x24];
    /* 0x24 */ ColliderCylinder *sp24;              /* inferred */
    /* 0x28 */ CollisionCheckContext *sp28;         /* inferred */
    /* 0x2C */ char pad2C[0x4];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80B0825C {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B082AC {
    /* 0x00 */ char pad0[0x28];
    /* 0x28 */ f32 sp28;                            /* inferred */
    /* 0x2C */ f32 sp2C;                            /* inferred */
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ f32 sp3C;                            /* inferred */
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80B08550 {
    /* 0x00 */ char pad0[0x24];
    /* 0x24 */ void *sp24;                          /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80B0863C {
    /* 0x00 */ char pad0[0x34];
    /* 0x34 */ SkelAnime *sp34;                     /* inferred */
    /* 0x38 */ char pad38[0x8];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80B08848 {
    /* 0x00 */ char pad0[0x30];
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ void *sp3C;                          /* inferred */
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80B08960 {
    /* 0x00 */ char pad0[0x28];
    /* 0x28 */ Vec3f *sp28;                         /* inferred */
    /* 0x2C */ char pad2C[0x8];                     /* maybe part of sp28[3]? */
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ f32 sp3C;                            /* inferred */
    /* 0x40 */ Camera *sp40;                        /* inferred */
    /* 0x44 */ Actor *sp44;                         /* inferred */
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_80B08C1C {
    /* 0x00 */ char pad0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80B08CB8 {
    /* 0x00 */ char pad0[0x28];
    /* 0x28 */ f32 sp28;                            /* inferred */
    /* 0x2C */ char pad2C[0x4];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80B09178 {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80B091D8 {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80B093C0 {
    /* 0x00 */ char pad0[0x24];
    /* 0x24 */ f32 sp24;                            /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80B094E0 {
    /* 0x00 */ char pad0[0x9C];
    /* 0x9C */ ? sp9C;                              /* inferred */
    /* 0x9C */ char pad9C[0x8];
    /* 0xA4 */ f32 spA4;                            /* inferred */
    /* 0xA8 */ f32 spA8;                            /* inferred */
    /* 0xAC */ f32 spAC;                            /* inferred */
    /* 0xB0 */ f32 spB0;                            /* inferred */
    /* 0xB4 */ f32 spB4;                            /* inferred */
    /* 0xB8 */ f32 spB8;                            /* inferred */
    /* 0xBC */ ? spBC;                              /* inferred */
    /* 0xBC */ char padBC[0x4];
};                                                  /* size = 0xC0 */

struct _mips2c_stack_func_80B09840 {
    /* 0x00 */ char pad0[0x1C];
    /* 0x1C */ void *sp1C;                          /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80B098BC {
    /* 0x00 */ char pad0[0x28];
    /* 0x28 */ f32 sp28;                            /* inferred */
    /* 0x2C */ f32 sp2C;                            /* inferred */
    /* 0x30 */ char pad30[0x2];
    /* 0x32 */ s16 sp32;                            /* inferred */
    /* 0x34 */ char pad34[0x4];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80B09A94 {
    /* 0x00 */ char pad0[0x20];
    /* 0x20 */ f32 sp20;                            /* inferred */
    /* 0x24 */ char pad24[0x8];                     /* maybe part of sp20[3]? */
    /* 0x2C */ f32 sp2C;                            /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80B09C78 {
    /* 0x00 */ char pad0[0x1C];
    /* 0x1C */ f32 sp1C;                            /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80B09DFC {};              /* size 0x0 */

struct _mips2c_stack_func_80B09E20 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80B09E84 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B09EDC {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B09F7C {
    /* 0x00 */ char pad0[0x36];
    /* 0x36 */ s16 sp36;                            /* inferred */
    /* 0x38 */ char pad38[0x8];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80B0A2A4 {
    /* 0x00 */ char pad0[0x2C];
    /* 0x2C */ f32 sp2C;                            /* inferred */
    /* 0x30 */ char pad30[0xC];                     /* maybe part of sp2C[4]? */
    /* 0x3C */ f32 sp3C;                            /* inferred */
    /* 0x40 */ f32 sp40;                            /* inferred */
    /* 0x44 */ f32 sp44;                            /* inferred */
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_80B0A5EC {};              /* size 0x0 */

struct _mips2c_stack_func_80B0A638 {
    /* 0x00 */ char pad0[0x24];
    /* 0x24 */ f32 *sp24;                           /* inferred */
    /* 0x28 */ char pad28[0x2];
    /* 0x2A */ s16 sp2A;                            /* inferred */
    /* 0x2C */ char pad2C[0x4];                     /* maybe part of sp2A[3]? */
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ f32 sp3C;                            /* inferred */
    /* 0x40 */ f32 sp40;                            /* inferred */
    /* 0x44 */ f32 sp44;                            /* inferred */
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_80B0A87C {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B0A8C4 {
    /* 0x00 */ char pad0[0x60];
    /* 0x60 */ s32 sp60;                            /* inferred */
    /* 0x64 */ char pad64[0x4];
    /* 0x68 */ f32 sp68;                            /* inferred */
    /* 0x6C */ f32 sp6C;                            /* inferred */
    /* 0x70 */ f32 sp70;                            /* inferred */
    /* 0x74 */ char pad74[0xC];
};                                                  /* size = 0x80 */

struct _mips2c_stack_func_80B0AC30 {
    /* 0x00 */ char pad0[0x2C];
    /* 0x2C */ void *sp2C;                          /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80B0B238 {
    /* 0x00 */ char pad0[0x40];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80B0B34C {
    /* 0x00 */ char pad0[0x40];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80B0B3F4 {};              /* size 0x0 */

struct _mips2c_stack_func_80B0B548 {
    /* 0x00 */ char pad0[0x40];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80B0B660 {
    /* 0x00 */ char pad0[0x44];
    /* 0x44 */ Vec3f *sp44;                         /* inferred */
    /* 0x48 */ Vec3f *sp48;                         /* inferred */
    /* 0x4C */ char pad4C[0xC];                     /* maybe part of sp48[4]? */
    /* 0x58 */ s32 sp58;                            /* inferred */
    /* 0x5C */ u32 sp5C;                            /* inferred */
    /* 0x60 */ Vec3f *sp60;                         /* inferred */
    /* 0x64 */ char pad64[0x8];                     /* maybe part of sp60[3]? */
    /* 0x6C */ Vec3f *sp6C;                         /* inferred */
    /* 0x70 */ ? sp70;                              /* inferred */
    /* 0x70 */ char pad70[0xC];
    /* 0x7C */ f32 sp7C;                            /* inferred */
    /* 0x80 */ f32 sp80;                            /* inferred */
    /* 0x84 */ f32 sp84;                            /* inferred */
    /* 0x88 */ f32 sp88;                            /* inferred */
    /* 0x8C */ f32 sp8C;                            /* inferred */
    /* 0x90 */ f32 sp90;                            /* inferred */
    /* 0x94 */ ? sp94;                              /* inferred */
    /* 0x94 */ char pad94[0xC];
    /* 0xA0 */ CollisionPoly *spA0;                 /* inferred */
    /* 0xA4 */ s32 spA4;                            /* inferred */
};                                                  /* size = 0xA8 */

struct _mips2c_stack_func_80B0C000 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80B0C1BC {
    /* 0x00 */ char pad0[0x20];
    /* 0x20 */ s32 sp20;                            /* inferred */
    /* 0x24 */ s8 *sp24;                            /* inferred */
    /* 0x28 */ char pad28[0x6];                     /* maybe part of sp24[2]? */
    /* 0x2E */ s16 sp2E;                            /* inferred */
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ char pad34[0x7];                     /* maybe part of sp30[2]? */
    /* 0x3B */ s8 sp3B;                             /* inferred */
    /* 0x3C */ char pad3C[0x4];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80B0C398 {
    /* 0x00 */ char pad0[0x40];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80B0C570 {
    /* 0x00 */ char pad0[0x6C];
    /* 0x6C */ BossHakugin *sp6C;                   /* inferred */
    /* 0x70 */ char pad70[0x28];                    /* maybe part of sp6C[11]? */
    /* 0x98 */ s32 sp98;                            /* inferred */
    /* 0x9C */ char pad9C[0x4];
};                                                  /* size = 0xA0 */

struct _mips2c_stack_func_80B0C7B0 {
    /* 0x00 */ char pad0[0x54];
    /* 0x54 */ Vec3s *sp54;                         /* inferred */
    /* 0x58 */ char pad58[0x40];
};                                                  /* size = 0x98 */

struct _mips2c_stack_func_80B0CAF0 {
    /* 0x00 */ char pad0[0x48];
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_80B0CCD8 {
    /* 0x00 */ char pad0[0x50];
    /* 0x50 */ s32 sp50;                            /* inferred */
    /* 0x54 */ char pad54[0x14];
};                                                  /* size = 0x68 */

struct _mips2c_stack_func_80B0CF24 {
    /* 0x00 */ char pad0[0x4C];
    /* 0x4C */ Gfx *sp4C;                           /* inferred */
    /* 0x50 */ Gfx *sp50;                           /* inferred */
    /* 0x54 */ char pad54[0xC];
};                                                  /* size = 0x60 */

struct _mips2c_stack_func_80B0D2B8 {
    /* 0x00 */ char pad0[0x60];
    /* 0x60 */ u8 *sp60;                            /* inferred */
    /* 0x64 */ char pad64[0x4];
    /* 0x68 */ f32 sp68;                            /* inferred */
    /* 0x6C */ f32 sp6C;                            /* inferred */
    /* 0x70 */ char pad70[0x4];
    /* 0x74 */ f32 sp74;                            /* inferred */
    /* 0x78 */ f32 sp78;                            /* inferred */
    /* 0x7C */ f32 sp7C;                            /* inferred */
    /* 0x80 */ char pad80[0x30];
};                                                  /* size = 0xB0 */

struct _mips2c_stack_func_80B0D69C {
    /* 0x00 */ char pad0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80B0D750 {
    /* 0x00 */ char pad0[0x4C];
    /* 0x4C */ Gfx *sp4C;                           /* inferred */
    /* 0x50 */ char pad50[0x10];                    /* maybe part of sp4C[5]? */
    /* 0x60 */ ? sp60;                              /* inferred */
    /* 0x60 */ char pad60[0x40];
    /* 0xA0 */ GraphicsContext *spA0;               /* inferred */
    /* 0xA4 */ char padA4[0xC];
};                                                  /* size = 0xB0 */

struct _mips2c_stack_func_80B0D9CC {
    /* 0x00 */ char pad0[0x68];
    /* 0x68 */ f32 sp68;                            /* inferred */
    /* 0x6C */ char pad6C[0x14];                    /* maybe part of sp68[6]? */
    /* 0x80 */ f32 sp80;                            /* inferred */
    /* 0x84 */ f32 sp84;                            /* inferred */
    /* 0x88 */ char pad88[0x24];                    /* maybe part of sp84[10]? */
    /* 0xAC */ f32 spAC;                            /* inferred */
    /* 0xB0 */ char padB0[0x4];
    /* 0xB4 */ f32 spB4;                            /* inferred */
    /* 0xB8 */ char padB8[0x10];                    /* maybe part of spB4[5]? */
    /* 0xC8 */ f32 spC8;                            /* inferred */
    /* 0xCC */ f32 spCC;                            /* inferred */
    /* 0xD0 */ f32 spD0;                            /* inferred */
    /* 0xD4 */ char padD4[0x4];
};                                                  /* size = 0xD8 */

struct _mips2c_stack_func_80B0DFA8 {};              /* size 0x0 */

struct _mips2c_stack_func_80B0E548 {
    /* 0x00 */ char pad0[0x18];
    /* 0x18 */ Collider *sp18;                      /* inferred */
    /* 0x1C */ CollisionCheckContext *sp1C;         /* inferred */
    /* 0x20 */ char pad20[0x8];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80B0E5A4 {
    /* 0x00 */ char pad0[0x40];
};                                                  /* size = 0x40 */

? EffectSsFhgFlash_SpawnShock(GlobalContext *, BossHakugin *, void *, ?, s32); /* extern */
? func_800BE3D0(BossHakugin *, s16, s16 *);         /* extern */
f32 func_800C3FA0(f32, s32, void *, void *);        /* extern */
f32 func_800C4188(GlobalContext *, CollisionContext *, ? *, ? *, BossHakugin *, f32 *); /* extern */
? func_8016566C(f32, ?);                            /* extern */
? func_80165690(Actor *);                           /* extern */
s32 func_80B0573C(Vec3f *arg0);                     /* static */
void func_80B057A4(Vec3f *arg0, Vec3f *arg1, f32 arg2, Vec3f *); /* static */
void func_80B058C0(BossHakugin *arg0);              /* static */
void func_80B05A64(BossHakugin *arg0, Actor *arg1, s16 arg2, s32 arg3, s16 arg4, s32); /* static */
void func_80B05B04(BossHakugin *arg0, GlobalContext *arg1); /* static */
