typedef struct {
    /* 0x00 */ u16 unk0;
    /* 0x02 */ u16 startFrame;
    /* 0x04 */ u16 endFrame;
    /* 0x06 */ char pad_6[0x4];                     /* maybe part of endFrame[3]? */
    /* 0x0A */ u16 unk_A;                           /* inferred */
    /* 0x0C */ char pad_C[0x24];                    /* maybe part of unk_A[19]? */
} CsCmdActorAction;                                 /* size = 0x30 */

typedef struct DemoSyoten {
    /* 0x000 */ Actor actor;
    /* 0x144 */ ? unk_144;                          /* inferred */
    /* 0x144 */ char pad_144[0x30];
    /* 0x174 */ ? unk_174;                          /* inferred */
    /* 0x174 */ char pad_174[0x132];
    /* 0x2A6 */ ? unk_2A6;                          /* inferred */
    /* 0x2A6 */ char pad_2A6[0x132];
    /* 0x3D8 */ f32 unk_3D8;                        /* inferred */
    /* 0x3DC */ ? *unk_3DC;                         /* inferred */
    /* 0x3E0 */ void *unk_3E0;                      /* inferred */
    /* 0x3E4 */ u16 unk_3E4;                        /* inferred */
    /* 0x3E6 */ s16 unk_3E6;                        /* inferred */
    /* 0x3E8 */ u8 *unk_3E8;                        /* inferred */
    /* 0x3EC */ s32 unk_3EC;                        /* inferred */
    /* 0x3F0 */ u16 unk_3F0;                        /* inferred */
    /* 0x3F2 */ u16 unk_3F2;                        /* inferred */
    /* 0x3F4 */ void (*actionFunc)(DemoSyoten *, GlobalContext *);
} DemoSyoten;                                       /* size = 0x3F8 */

typedef struct {
    /* 0x00 */ Vec3f pos;
    /* 0x0C */ Vec3s rot;
    /* 0x12 */ s16 unk_12;                          /* inferred */
} PosRot;                                           /* size = 0x14 */

struct _mips2c_stack_DemoSyoten_Destroy {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_DemoSyoten_Draw {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ Gfx *sp24;                           /* inferred */
    /* 0x28 */ char pad_28[0x4];
    /* 0x2C */ GraphicsContext *sp2C;               /* inferred */
    /* 0x30 */ char pad_30[0x8];
};                                                  /* size = 0x38 */

struct _mips2c_stack_DemoSyoten_Init {
    /* 0x00 */ char pad_0[0x44];
    /* 0x44 */ ? *sp44;                             /* inferred */
    /* 0x48 */ char pad_48[0x8];
};                                                  /* size = 0x50 */

struct _mips2c_stack_DemoSyoten_Update {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80C16760 {
    /* 0x00 */ char pad_0[0x28];
    /* 0x28 */ Vec3f *sp28;                         /* inferred */
    /* 0x2C */ ? sp2C;                              /* inferred */
    /* 0x2C */ char pad_2C[0xC];
    /* 0x38 */ void *sp38;                          /* inferred */
    /* 0x3C */ char pad_3C[0x4];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80C16818 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ Vec3f *sp24;                         /* inferred */
    /* 0x28 */ ? sp28;                              /* inferred */
    /* 0x28 */ char pad_28[0x18];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80C168D0 {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ f32 sp20;                            /* inferred */
    /* 0x24 */ ? sp24;                              /* inferred */
    /* 0x24 */ char pad_24[0x4];
    /* 0x28 */ f32 sp28;                            /* inferred */
    /* 0x2C */ f32 sp2C;                            /* inferred */
    /* 0x30 */ ? sp30;                              /* inferred */
    /* 0x30 */ char pad_30[0x4];
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ char pad_3C[0xC];
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_80C16974 {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ u8 sp20;                             /* inferred */
    /* 0x21 */ s8 sp21;                             /* inferred */
    /* 0x22 */ s8 sp22;                             /* inferred */
    /* 0x23 */ char pad_23[0x5];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80C16A64 {};              /* size 0x0 */

struct _mips2c_stack_func_80C16A74 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80C16BD4 {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ s32 sp20;                            /* inferred */
    /* 0x24 */ char pad_24[0xC];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80C16DD4 {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ s32 sp20;                            /* inferred */
    /* 0x24 */ char pad_24[0xC];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80C16EAC {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ s32 sp20;                            /* inferred */
    /* 0x24 */ char pad_24[0xC];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80C17008 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80C170F8 {};              /* size 0x0 */

struct _mips2c_stack_func_80C173B4 {
    /* 0x00 */ char pad_0[0x28];
    /* 0x28 */ Gfx *sp28;                           /* inferred */
    /* 0x2C */ char pad_2C[0xC];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80C17468 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ void *sp24;                          /* inferred */
    /* 0x28 */ u8 sp28;                             /* inferred */
    /* 0x29 */ u8 sp29;                             /* inferred */
    /* 0x2A */ u8 sp2A;                             /* inferred */
    /* 0x2B */ char pad_2B[0x1];
    /* 0x2C */ u8 sp2C;                             /* inferred */
    /* 0x2D */ u8 sp2D;                             /* inferred */
    /* 0x2E */ u8 sp2E;                             /* inferred */
    /* 0x2F */ char pad_2F[0x1];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80C17690 {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ Gfx *sp2C;                           /* inferred */
    /* 0x30 */ char pad_30[0x10];
};                                                  /* size = 0x40 */

? func_800FE7A8(? *, u8 *, void *, void **);        /* extern */
? func_80183430(? *, ? *, ? *, ? *, ? *, s32);      /* extern */
? func_8018349C(? *, DemoSyoten *);                 /* extern */
? func_801835EC(? *, ? *);                          /* extern */
? func_80183DE0(? *);                               /* extern */
? func_8018450C(GlobalContext *, Actor *, Gfx *, ? (*)(void **, ?, s32, ?, void *), s32, Actor *); /* extern */
void func_80C16760(DemoSyoten *arg0, GlobalContext *arg1, GlobalContext *); /* static */
s32 func_80C16818(Actor *arg0);                     /* static */
void func_80C168D0(DemoSyoten *arg0, GlobalContext *arg1); /* static */
void func_80C16974(f32 arg0);                       /* static */
void func_80C16A64(DemoSyoten *, GlobalContext *);  /* static */
void func_80C16A74(DemoSyoten *, GlobalContext *);  /* static */
