? func_800AEF44(void *);                            /* extern */
f32 func_800C4188(Color_RGBA8 *, void *, ? *, ? *, Actor *, f32 *); /* extern */
void func_8093E8A0(Actor *arg0);                    /* static */
void func_8093E91C(EnGoroiwa *arg0);                /* static */
void func_8093E938(Actor *arg0);                    /* static */
void func_8093E9B0(Actor *arg0, GlobalContext *arg1); /* static */
void func_8093EAB0(void *arg0, s32 arg1);           /* static */
s32 func_8093EAD4(Vec3f *arg0, Vec3f *arg1);        /* static */
void func_8093EB58(EnGoroiwa *arg0, GlobalContext *arg1); /* static */
f32 func_8093EB74(EnGoroiwa *arg0, GlobalContext *arg1); /* static */
void func_8093EC50(EnGoroiwa *arg0);                /* static */
void func_8093ECD4(void *arg0);                     /* static */
void func_8093ED80(void *arg0);                     /* static */
void func_8093EDB0(Actor *arg0);                    /* static */
void func_8093EDD8(Actor *arg0, GlobalContext *arg1); /* static */
void func_8093EE18(EnGoroiwa *arg0, GlobalContext *arg1); /* static */
void func_8093EE64(EnGoroiwa *arg0, s16 arg1);      /* static */
void func_8093EEBC(EnGoroiwa *arg0);                /* static */
s32 func_8093EEDC(Actor *arg0);                     /* static */
void func_8093EF54(GlobalContext *arg0, void *arg1, Color_RGBA8 *arg2, Color_RGBA8 *arg3, f32 arg4, void *, f32); /* static */
void func_8093F198(GlobalContext *arg0, Vec3f *arg1, f32 arg2); /* static */

void func_80940588(GlobalContext *arg0, Vec3f *arg1, void *arg2, Color_RGBA8 *arg3, Color_RGBA8 *arg4, f32 arg5); /* static */
void func_80940A1C(GlobalContext *arg0, Vec3f *arg1, void *arg2, Color_RGBA8 *arg3, Color_RGBA8 *arg4, f32 arg5); /* static */
void func_80940E38(EnGoroiwa *arg0, GlobalContext *arg1); /* static */
void func_80941060(Actor *arg0, GlobalContext *arg1, s32); /* static */
void func_80941274(Actor *arg0, GlobalContext *arg1); /* static */
s32 func_8094156C(Actor *arg0, GlobalContext *arg1); /* static */
void func_809419D0(EnGoroiwa *arg0);                /* static */
void func_80941A10(Actor *arg0, GlobalContext *arg1); /* static */
void func_80941DB4(Actor *arg0);                    /* static */
void func_80941E28(Actor *arg0, ? arg1);            /* static */
void func_80941EB4(Actor *arg0);                    /* static */
void func_80941F10(EnGoroiwa *arg0);                /* static */
void func_80941F54(Actor *arg0);                    /* static */
void func_80941FA4(Actor *arg0, GlobalContext *arg1); /* static */
void func_80942084(Actor *arg0);                    /* static */
void func_809420F0(Actor *arg0, GlobalContext *arg1); /* static */
void func_809421E0(Actor *arg0);                    /* static */
void func_8094220C(Actor *arg0, GlobalContext *arg1); /* static */
void func_809425CC(Actor *arg0, s16);               /* static */
void func_80942604(Actor *arg0, ? arg1);            /* static */
void func_80942B1C(GlobalContext *arg0, GlobalContext *arg1); /* static */
extern Gfx D_060032E0;
extern Gfx D_060082D0;
static ColliderJntSphElementInit D_80942DC0 = {
    {0, {0x20000000, 0, 4}, {0x1C37BB6, 0, 0}, 0x19, 1, 1},
    {0, {{0, 0, 0}, 0x3A}, 0x64},
};
static ColliderJntSphInit D_80942DE4 = {{9, 0x11, 0xD, 0x39, 0x20, 0}, 1, &D_80942DC0};
static CollisionCheckInfoInit D_80942DF4 = {0, 0xC, 0x3C, 0xFE};
static ? D_80942DFC;                                /* unable to generate initializer */
static ? D_80942E0C;                                /* unable to generate initializer */
static ? D_80942E30;                                /* unable to generate initializer */
static Color_RGBA8 D_80942E38 = {0xFA, 0xFA, 0xFA, 0xFF};
static ? D_80942E3C;                                /* unable to generate initializer */
static Color_RGBA8 D_80942E44 = {0xB4, 0xB4, 0xB4, 0xFF};
static Vec3f D_80942E48 = {0.0f, 0.0f, 0.0f};
static Vec3f D_80942E54 = {0.0f, 0.3f, 0.0f};
static Vec3f D_80942E60 = {0.0f, 1.0f, 0.0f};
static Vec3f D_80942E6C = {0.0f, 0.0f, 1.0f};
static InitChainEntry D_80942E78;                   /* unable to generate initializer */
static void D_80942E8C;                             /* unable to generate initializer */
static ? D_80942E94;                                /* unable to generate initializer */
static ? D_80942E9C;                                /* unable to generate initializer */
static ? D_80942EAC;                                /* unable to generate initializer */
static ? D_80942EB4;                                /* unable to generate initializer */

typedef struct EnGoroiwa {
    /* 0x0000 */ Actor actor;
    /* 0x0144 */ ColliderJntSph unk144;             /* inferred */
    /* 0x0164 */ char pad164[0x40];                 /* maybe part of unk144[3]? */
    /* 0x01A4 */ void (*actionFunc)(EnGoroiwa *, GlobalContext *);
    /* 0x01A8 */ f32 unk1A8;                        /* inferred */
    /* 0x01AC */ char pad1AC[0x8];                  /* maybe part of unk1A8[3]? */
    /* 0x01B4 */ f32 unk1B4;                        /* inferred */
    /* 0x01B8 */ f32 unk1B8;                        /* inferred */
    /* 0x01BC */ f32 unk1BC;                        /* inferred */
    /* 0x01C0 */ f32 unk1C0;                        /* inferred */
    /* 0x01C4 */ f32 unk1C4;                        /* inferred */
    /* 0x01C8 */ s16 unk1C8;                        /* inferred */
    /* 0x01CA */ char pad1CA[0x2];                  /* maybe part of unk1C8[2]? */
    /* 0x01CC */ s16 unk1CC;                        /* inferred */
    /* 0x01CE */ s16 unk1CE;                        /* inferred */
    /* 0x01D0 */ void *unk1D0;                      /* inferred */
    /* 0x01D4 */ s16 unk1D4;                        /* inferred */
    /* 0x01D6 */ s16 unk1D6;                        /* inferred */
    /* 0x01D8 */ s16 unk1D8;                        /* inferred */
    /* 0x01DA */ s16 unk1DA;                        /* inferred */
    /* 0x01DC */ f32 unk1DC;                        /* inferred */
    /* 0x01E0 */ f32 unk1E0;                        /* inferred */
    /* 0x01E4 */ s8 unk1E4;                         /* inferred */
    /* 0x01E5 */ u8 unk1E5;                         /* inferred */
    /* 0x01E6 */ char pad1E6[0x62];                 /* maybe part of unk1E5[99]? */
    /* 0x0248 */ s32 unk248;                        /* inferred */
} EnGoroiwa;                                        /* size 0x24C */

void func_8093E8A0(Actor *arg0) {
    s32 temp_v0;
    f32 phi_f2;

    temp_v0 = ((s32) arg0->params >> 0xC) & 3;
    if (temp_v0 == 0) {
        phi_f2 = 0.1f;
    } else if (temp_v0 == 1) {
        phi_f2 = 0.05f;
    } else {
        phi_f2 = (Rand_ZeroOne() * 0.04f) + 0.04f;
    }
    Actor_SetScale(arg0, phi_f2);
}

void func_8093E91C(EnGoroiwa *arg0) {
    arg0->unk1DC = arg0->actor.scale.x * 595.0f;
}

void func_8093E938(Actor *arg0) {
    void *temp_v0;

    temp_v0 = arg0->unk160 + 0x30;
    temp_v0->unk0 = (s16) (s32) arg0->world.pos.x;
    temp_v0->unk2 = (s16) (s32) (arg0->world.pos.y + arg0->unk1DC);
    temp_v0->unk4 = (s16) (s32) arg0->world.pos.z;
    arg0->unk160->unk36 = (s16) (s32) (arg0->unk1DC - 1.0f);
}

void func_8093E9B0(Actor *arg0, GlobalContext *arg1) {
    s32 sp2C;
    ColliderJntSph *sp28;
    ColliderJntSph *temp_a1;
