typedef struct EnFamos {
    /* 0x000 */ Actor actor;
    /* 0x144 */ SkelAnime unk144;                   /* inferred */
    /* 0x188 */ Vec3s unk188;                       /* inferred */
    /* 0x18E */ char pad18E[0x1E];                  /* maybe part of unk188[6]? */
    /* 0x1AC */ Vec3s unk1AC;                       /* inferred */
    /* 0x1B2 */ char pad1B2[0x1E];                  /* maybe part of unk1AC[6]? */
    /* 0x1D0 */ void (*actionFunc)(EnFamos *, GlobalContext *);
    /* 0x1D4 */ u8 unk1D4;                          /* inferred */
    /* 0x1D5 */ s8 unk1D5;                          /* inferred */
    /* 0x1D6 */ u8 unk1D6;                          /* inferred */
    /* 0x1D7 */ char pad1D7[0x1];
    /* 0x1D8 */ s8 unk1D8;                          /* inferred */
    /* 0x1D9 */ char pad1D9[0x1];
    /* 0x1DA */ s16 unk1DA;                         /* inferred */
    /* 0x1DC */ char pad1DC[0x2];
    /* 0x1DE */ s16 unk1DE;                         /* inferred */
    /* 0x1E0 */ s16 unk1E0;                         /* inferred */
    /* 0x1E2 */ s16 unk1E2;                         /* inferred */
    /* 0x1E4 */ char pad1E4[0x4];                   /* maybe part of unk1E2[3]? */
    /* 0x1E8 */ void *unk1E8;                       /* inferred */
    /* 0x1EC */ f32 unk1EC;                         /* inferred */
    /* 0x1F0 */ f32 unk1F0;                         /* inferred */
    /* 0x1F4 */ char pad1F4[0x18];                  /* maybe part of unk1F0[7]? */
    /* 0x20C */ ColliderCylinder unk20C;            /* inferred */
    /* 0x258 */ ColliderCylinder unk258;            /* inferred */
    /* 0x2A4 */ ColliderJntSph unk2A4;              /* inferred */
    /* 0x2C4 */ ColliderJntSphElement unk2C4;       /* inferred */
    /* 0x304 */ char pad304[0x310];                 /* maybe part of unk2C4[13]? */
} EnFamos;                                          /* size = 0x614 */

struct _mips2c_stack_EnFamos_Destroy {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnFamos_Draw {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_EnFamos_Init {
    /* 0x00 */ char pad0[0x38];
};                                                  /* size = 0x38 */

struct _mips2c_stack_EnFamos_Update {
    /* 0x00 */ char pad0[0x28];
    /* 0x28 */ ColliderCylinder *sp28;              /* inferred */
    /* 0x2C */ CollisionCheckContext *sp2C;         /* inferred */
    /* 0x30 */ s32 sp30;                            /* inferred */
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ char pad38[0x8];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_808ACB58 {
    /* 0x00 */ char pad0[0x60];
};                                                  /* size = 0x60 */

struct _mips2c_stack_func_808ACD2C {
    /* 0x00 */ char pad0[0x60];
};                                                  /* size = 0x60 */

struct _mips2c_stack_func_808ACF1C {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_808ACF98 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_808AD05C {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_808AD170 {};              /* size 0x0 */

struct _mips2c_stack_func_808AD18C {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_808AD1F0 {
    /* 0x00 */ char pad0[0x18];
    /* 0x18 */ Vec3f *sp18;                         /* inferred */
    /* 0x1C */ char pad1C[0x4];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_808AD294 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_808AD31C {
    /* 0x00 */ char pad0[0x1C];
    /* 0x1C */ Vec3f *sp1C;                         /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_808AD378 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_808AD3E8 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_808AD42C {
    /* 0x00 */ char pad0[0x20];
    /* 0x20 */ Vec3f *sp20;                         /* inferred */
    /* 0x24 */ f32 sp24;                            /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_808AD54C {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_808AD5B0 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_808AD66C {};              /* size 0x0 */

struct _mips2c_stack_func_808AD68C {
    /* 0x00 */ char pad0[0x28];
    /* 0x28 */ f32 sp28;                            /* inferred */
    /* 0x2C */ f32 sp2C;                            /* inferred */
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ Actor *sp34;                         /* inferred */
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_808AD7EC {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_808AD840 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_808AD888 {};              /* size 0x0 */

struct _mips2c_stack_func_808AD8B8 {
    /* 0x00 */ char pad0[0x40];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_808ADA74 {
    /* 0x00 */ char pad0[0x24];
    /* 0x24 */ SkelAnime *sp24;                     /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_808ADAE8 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_808ADB4C {};              /* size 0x0 */

struct _mips2c_stack_func_808ADB70 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_808ADC40 {};              /* size 0x0 */

struct _mips2c_stack_func_808ADC64 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_808ADD20 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_808ADDA8 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_808ADE00 {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_808ADE74 {
    /* 0x00 */ char pad0[0x38];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_808ADFA4 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_808ADFF0 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_808AE030 {
    /* 0x00 */ char pad0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_808AE304 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_808AE3A8 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_808AE3FC {
    /* 0x00 */ char pad0[0x40];
    /* 0x40 */ GraphicsContext *sp40;               /* inferred */
    /* 0x44 */ char pad44[0x4];
    /* 0x48 */ void *sp48;                          /* inferred */
    /* 0x4C */ char pad4C[0x4];
};                                                  /* size = 0x50 */

? func_800DFD04(s32, ?, ?, ?);                      /* extern */
void func_808ACB58(Actor *arg0);                    /* static */
void func_808ACD2C(void *arg0);                     /* static */
s32 func_808ACF1C(Actor *arg0, GlobalContext *arg1); /* static */
void func_808ACF98(Actor *arg0);                    /* static */
void func_808AD05C(Actor *arg0);                    /* static */
void func_808AD170(EnFamos *arg0);                  /* static */
void func_808AD18C(Actor *arg0, GlobalContext *arg1); /* static */
void func_808AD1F0(EnFamos *arg0);                  /* static */
void func_808AD294(Actor *arg0, GlobalContext *arg1); /* static */
void func_808AD31C(Actor *arg0);                    /* static */
void func_808AD378(Actor *arg0, GlobalContext *arg1); /* static */
void func_808AD3E8(Actor *arg0);                    /* static */
