typedef struct EnMinideath {
    /* 0x000 */ Actor actor;
    /* 0x144 */ void (*actionFunc)(EnMinideath *, GlobalContext *);
    /* 0x148 */ u8 unk_148;                         /* inferred */
    /* 0x149 */ s8 unk_149;                         /* inferred */
    /* 0x14A */ s16 unk_14A;                        /* inferred */
    /* 0x14C */ s16 unk_14C;                        /* inferred */
    /* 0x14E */ s16 unk_14E;                        /* inferred */
    /* 0x150 */ s16 unk_150;                        /* inferred */
    /* 0x152 */ s16 unk_152;                        /* inferred */
    /* 0x154 */ char pad_154[0x4];                  /* maybe part of unk_152[3]? */
    /* 0x158 */ f32 unk_158;                        /* inferred */
    /* 0x15C */ Actor *unk_15C;                     /* inferred */
    /* 0x160 */ ? unk_160;                          /* inferred */
    /* 0x160 */ char pad_160[0x4];
    /* 0x164 */ Vec3f unk_164;                      /* inferred */
    /* 0x170 */ Vec3f unk_170;                      /* inferred */
    /* 0x17C */ char pad_17C[0x50];                 /* maybe part of unk_170[7]? */
    /* 0x1CC */ ColliderJntSph unk_1CC;             /* inferred */
    /* 0x1EC */ ColliderJntSphElement unk_1EC;      /* inferred */
    /* 0x22C */ char pad_22C[0x80];                 /* maybe part of unk_1EC[3]? */
} EnMinideath;                                      /* size = 0x2AC */

struct _mips2c_stack_EnMinideath_Destroy {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnMinideath_Init {
    /* 0x00 */ char pad_0[0x38];
};                                                  /* size = 0x38 */

struct _mips2c_stack_EnMinideath_Update {
    /* 0x00 */ char pad_0[0x34];
    /* 0x34 */ void (*sp34)(EnMinideath *, GlobalContext *); /* inferred */
    /* 0x38 */ void (*sp38)(EnMinideath *, GlobalContext *); /* inferred */
    /* 0x3C */ char pad_3C[0x8];                    /* maybe part of sp38[3]? */
    /* 0x44 */ s32 sp44;                            /* inferred */
    /* 0x48 */ char pad_48[0x4];
    /* 0x4C */ ColliderJntSphElement *sp4C;         /* inferred */
    /* 0x50 */ char pad_50[0x8];
};                                                  /* size = 0x58 */

struct _mips2c_stack_func_808CA268 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_808CA308 {};              /* size 0x0 */

struct _mips2c_stack_func_808CA34C {
    /* 0x00 */ char pad_0[0x40];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_808CA458 {
    /* 0x00 */ char pad_0[0x60];
};                                                  /* size = 0x60 */

struct _mips2c_stack_func_808CA7D4 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_808CA860 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_808CA8E0 {};              /* size 0x0 */

struct _mips2c_stack_func_808CA8F4 {
    /* 0x00 */ char pad_0[0x32];
    /* 0x32 */ s16 sp32;                            /* inferred */
    /* 0x34 */ s32 sp34;                            /* inferred */
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ f32 sp3C;                            /* inferred */
    /* 0x40 */ f32 sp40;                            /* inferred */
    /* 0x44 */ Actor *sp44;                         /* inferred */
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_808CAAC8 {};              /* size 0x0 */

struct _mips2c_stack_func_808CAAEC {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_808CAB90 {};              /* size 0x0 */

struct _mips2c_stack_func_808CABB0 {
    /* 0x00 */ char pad_0[0x1E];
    /* 0x1E */ s16 sp1E;                            /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_808CAC54 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_808CACD8 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_808CAE00 {};              /* size 0x0 */

struct _mips2c_stack_func_808CAE18 {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ f32 sp20;                            /* inferred */
    /* 0x24 */ char pad_24[0x4];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_808CAF08 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_808CAF68 {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ s32 sp20;                            /* inferred */
    /* 0x24 */ char pad_24[0x2];
    /* 0x26 */ s16 sp26;                            /* inferred */
    /* 0x28 */ char pad_28[0x4];                    /* maybe part of sp26[3]? */
    /* 0x2C */ f32 sp2C;                            /* inferred */
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ f32 sp34;                            /* inferred */
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_808CB07C {};              /* size 0x0 */

struct _mips2c_stack_func_808CB094 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_808CB0C8 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_808CB22C {
    /* 0x00 */ char pad_0[0x32];
    /* 0x32 */ s16 sp32;                            /* inferred */
    /* 0x34 */ ? sp34;                              /* inferred */
    /* 0x34 */ char pad_34[0x4];
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ char pad_3C[0x4];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_808CB418 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_808CB454 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ f32 sp24;                            /* inferred */
    /* 0x28 */ f32 sp28;                            /* inferred */
    /* 0x2C */ f32 sp2C;                            /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_808CB524 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_808CB59C {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_808CB6A8 {};              /* size 0x0 */

struct _mips2c_stack_func_808CB6D4 {
    /* 0x00 */ char pad_0[0x40];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_808CB7B8 {};              /* size 0x0 */

struct _mips2c_stack_func_808CB7CC {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_808CB810 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_808CB8F4 {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

void func_808CA268(Vec3f *arg0, GlobalContext *arg1); /* static */
void func_808CA308(EnMinideath *arg0, u8 arg1, EnMinideath *, s32); /* static */
void func_808CA34C(EnMinideath *arg0);              /* static */
void func_808CA458(EnMinideath *arg0, GlobalContext *arg1); /* static */
void func_808CA7D4(EnMinideath *arg0);              /* static */
void func_808CA8E0(EnMinideath *arg0);              /* static */
void func_808CAAC8(EnMinideath *arg0);              /* static */
void func_808CAB90(EnMinideath *arg0);              /* static */
void func_808CAC54(EnMinideath *arg0);              /* static */
void func_808CAE00(EnMinideath *arg0);              /* static */
void func_808CAF08(EnMinideath *arg0);              /* static */
void func_808CB07C(void *arg0);                     /* static */
void func_808CB0C8(EnMinideath *arg0, void *arg1);  /* static */
