void func_808CA268(Vec3f *arg0, GlobalContext *arg1); /* static */
void func_808CA308(EnMinideath *arg0, u8 arg1, EnMinideath *, s32); /* static */
void func_808CA34C(EnMinideath *arg0);              /* static */
void func_808CA458(EnMinideath *arg0, GlobalContext *arg1); /* static */
void func_808CA7D4(EnMinideath *arg0);              /* static */
void func_808CA8E0(EnMinideath *arg0);              /* static */
void func_808CAAC8(EnMinideath *arg0);              /* static */
void func_808CAB90(EnMinideath *arg0);              /* static */
void func_808CAC54(EnMinideath *arg0);              /* static */
void func_808CAE00(EnMinideath *arg0);              /* static */
void func_808CAF08(EnMinideath *arg0);              /* static */
void func_808CB07C(void *arg0);                     /* static */
void func_808CB0C8(EnMinideath *arg0, void *arg1);  /* static */
void func_808CB418(void *arg0);                     /* static */
void func_808CB524(EnMinideath *arg0);              /* static */
void func_808CB6A8(void *arg0);                     /* static */
void func_808CB7B8(EnMinideath *arg0);              /* static */
void func_808CB810(EnMinideath *arg0, GlobalContext *); /* static */
void func_808CB8F4(EnMinideath *arg0, GlobalContext *arg1); /* static */
static ColliderJntSphElementInit D_808CBF50 = {
    {
        {0, {0xF7CFFFFF, 0, 4}, {0xF7CFFFFF, 0, 0}, 9, 1, 1},
        {1, {{0, 0, 0}, 0xF}, 0x64},
    },
    {
        {0, {0xF7CFFFFF, 0, 4}, {0xF7CFFFFF, 0, 0}, 9, 1, 1},
        {1, {{0, 0, 0}, 0xF}, 0x64},
    },
    {
        {0, {0xF7CFFFFF, 0, 4}, {0xF7CFFFFF, 0, 0}, 9, 1, 1},
        {1, {{0, 0, 0}, 0xF}, 0x64},
    },
};
static ColliderJntSphInit D_808CBFBC = {{0xA, 0x10, 9, 0x38, 0x10, 0}, 3, &D_808CBF50};
static DamageTable D_808CBFCC = {
    {
        0x10,
        1,
        1,
        1,
        1,
        1,
        0,
        1,
        1,
        1,
        0,
        0x21,
        0x31,
        0x42,
        1,
        1,
        1,
        2,
        0x10,
        0x51,
        0,
        0,
        1,
        1,
        1,
        0,
        0,
        0,
        0,
        0,
        0,
        1,
    },
};
static CollisionCheckInfoInit D_808CBFEC = {1, 0xF, 0x1E, 0xA};
static InitChainEntry D_808CBFF4;                   /* unable to generate initializer */
static s32 D_808CC250;
static s32 D_808CC254;
static s32 D_808CC258;
static s32 D_808CC25C;

typedef struct EnMinideath {
    /* 0x0000 */ Actor actor;
    /* 0x0144 */ void (*actionFunc)(EnMinideath *, GlobalContext *);
    /* 0x0148 */ u8 unk148;                         /* inferred */
    /* 0x0149 */ u8 unk149;                         /* inferred */
    /* 0x014A */ s16 unk14A;                        /* inferred */
    /* 0x014C */ s16 unk14C;                        /* inferred */
    /* 0x014E */ s16 unk14E;                        /* inferred */
    /* 0x0150 */ s16 unk150;                        /* inferred */
    /* 0x0152 */ s16 unk152;                        /* inferred */
    /* 0x0154 */ char pad154[0x4];                  /* maybe part of unk152[3]? */
    /* 0x0158 */ f32 unk158;                        /* inferred */
    /* 0x015C */ Actor *unk15C;                     /* inferred */
    /* 0x015E */ s16 unk15E;                        /* overlap; inferred */
    /* 0x0160 */ ? unk160;                          /* inferred */
    /* 0x0161 */ u8 unk161;                         /* inferred */
    /* 0x0162 */ char pad162[0x2];                  /* maybe part of unk161[3]? */
    /* 0x0164 */ Vec3f unk164;                      /* inferred */
    /* 0x0170 */ Vec3f unk170;                      /* inferred */
    /* 0x017C */ char pad17C[0x50];
    /* 0x01CC */ ColliderJntSph unk1CC;             /* inferred */
    /* 0x01EC */ ColliderJntSphElement unk1EC;      /* inferred */
    /* 0x022C */ char pad22C[0x80];                 /* maybe part of unk1EC[3]? */
} EnMinideath;                                      /* size 0x2AC */

void EnMinideath_Init(Actor *thisx, GlobalContext *globalCtx) {
    EnMinideath *this = (EnMinideath *) thisx;
    Actor *temp_v0;
    s16 temp_t5;
    s32 temp_s0;
    s32 temp_v1;
    void *temp_v0_2;
    s32 phi_v1;
    Vec3f *phi_s1;
    Vec3f *phi_s2;
    s32 phi_s0;

    Actor_ProcessInitChain(&this->actor, &D_808CBFF4);
    temp_v0 = this->actor.parent;
    this->unk14C = this->actor.shape.rot.y;
    this->unk158 = this->actor.world.pos.y - this->actor.parent->world.pos.y;
    this->actor.shape.rot.y = temp_v0->shape.rot.y;
    this->actor.flags &= -2;
    this->actor.world.rot.y = temp_v0->shape.rot.y;
    Collider_InitAndSetJntSph(globalCtx, &this->unk1CC, &this->actor, &D_808CBFBC, &this->unk1EC);
    CollisionCheck_SetInfo(&this->actor.colChkInfo, &D_808CBFCC, &D_808CBFEC);
    phi_v1 = 0;
    do {
