typedef struct EnRacedog {
    /* 0x000 */ Actor actor;
    /* 0x144 */ void (*actionFunc)(EnRacedog *, GlobalContext *);
    /* 0x148 */ char pad_148[0x4];
    /* 0x14C */ SkelAnime unk_14C;                  /* inferred */
    /* 0x190 */ ColliderCylinder unk_190;           /* inferred */
    /* 0x1DC */ char pad_1DC[0x4];
    /* 0x1E0 */ Path *unk_1E0;                      /* inferred */
    /* 0x1E4 */ char pad_1E4[0x4];
    /* 0x1E8 */ s32 unk_1E8;                        /* inferred */
    /* 0x1EC */ Vec3s unk_1EC;                      /* inferred */
    /* 0x1F2 */ char pad_1F2[0x48];                 /* maybe part of unk_1EC[13]? */
    /* 0x23A */ Vec3s unk_23A;                      /* inferred */
    /* 0x240 */ char pad_240[0x48];                 /* maybe part of unk_23A[13]? */
    /* 0x288 */ s16 unk_288;                        /* inferred */
    /* 0x28A */ s16 unk_28A;                        /* inferred */
    /* 0x28C */ s16 unk_28C;                        /* inferred */
    /* 0x28E */ char pad_28E[0x2];
    /* 0x290 */ s16 unk_290;                        /* inferred */
    /* 0x292 */ s16 unk_292;                        /* inferred */
    /* 0x294 */ char pad_294[0x4];                  /* maybe part of unk_292[3]? */
    /* 0x298 */ f32 unk_298;                        /* inferred */
    /* 0x29C */ s16 unk_29C;                        /* inferred */
    /* 0x29E */ char pad_29E[0x2];
    /* 0x2A0 */ f32 unk_2A0;                        /* inferred */
    /* 0x2A4 */ f32 unk_2A4;                        /* inferred */
    /* 0x2A8 */ f32 unk_2A8;                        /* inferred */
    /* 0x2AC */ f32 unk_2AC;                        /* inferred */
    /* 0x2B0 */ char pad_2B0[0x8];                  /* maybe part of unk_2AC[3]? */
    /* 0x2B8 */ s32 unk_2B8;                        /* inferred */
    /* 0x2BC */ s32 unk_2BC;                        /* inferred */
    /* 0x2C0 */ s32 unk_2C0;                        /* inferred */
    /* 0x2C4 */ f32 unk_2C4;                        /* inferred */
} EnRacedog;                                        /* size = 0x2C8 */

struct _mips2c_stack_EnRacedog_Destroy {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnRacedog_Draw {
    /* 0x00 */ char pad_0[0x30];
    /* 0x30 */ GraphicsContext *sp30;               /* inferred */
    /* 0x34 */ char pad_34[0x4];
};                                                  /* size = 0x38 */

struct _mips2c_stack_EnRacedog_Init {
    /* 0x00 */ char pad_0[0x30];
    /* 0x30 */ SkelAnime *sp30;                     /* inferred */
    /* 0x34 */ ColliderCylinder *sp34;              /* inferred */
    /* 0x38 */ char pad_38[0x8];
};                                                  /* size = 0x40 */

struct _mips2c_stack_EnRacedog_Update {
    /* 0x00 */ char pad_0[0x28];
    /* 0x28 */ f32 *sp28;                           /* inferred */
    /* 0x2C */ f32 sp2C;                            /* inferred */
    /* 0x30 */ char pad_30[0x10];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80B24630 {
    /* 0x00 */ char pad_0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80B246F4 {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80B2478C {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ f32 sp1C;                            /* inferred */
    /* 0x20 */ f32 sp20;                            /* inferred */
    /* 0x24 */ void *sp24;                          /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80B248B8 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B24C14 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B24CB4 {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ Path *sp2C;                          /* inferred */
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ char pad_34[0x4];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80B24E14 {};              /* size 0x0 */

struct _mips2c_stack_func_80B24F08 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80B251EC {};              /* size 0x0 */

struct _mips2c_stack_func_80B252F8 {};              /* size 0x0 */

struct _mips2c_stack_func_80B2538C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B25448 {};              /* size 0x0 */

struct _mips2c_stack_func_80B25490 {
    /* 0x00 */ char pad_0[0x8];
    /* 0x08 */ f64 sp8;                             /* inferred */
    /* 0x10 */ f64 sp10;                            /* inferred */
    /* 0x18 */ char pad_18[0x4];
    /* 0x1C */ f32 sp1C;                            /* inferred */
    /* 0x20 */ f32 sp20;                            /* inferred */
    /* 0x24 */ f32 sp24;                            /* inferred */
    /* 0x28 */ char pad_28[0x4];
    /* 0x2C */ f32 sp2C;                            /* inferred */
    /* 0x30 */ char pad_30[0x10];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80B255AC {
    /* 0x00 */ char pad_0[0x38];
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ f32 sp3C;                            /* inferred */
    /* 0x40 */ f32 sp40;                            /* inferred */
    /* 0x44 */ char pad_44[0x4];
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_80B256BC {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B2583C {};              /* size 0x0 */

struct _mips2c_stack_func_80B258D8 {
    /* 0x00 */ char pad_0[0x48];
    /* 0x48 */ ? sp48;                              /* inferred */
    /* 0x48 */ char pad_48[0x8];
};                                                  /* size = 0x50 */

struct _mips2c_stack_func_80B25A74 {};              /* size 0x0 */

struct _mips2c_stack_func_80B25A90 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ ? sp1C;                              /* inferred */
    /* 0x1C */ char pad_1C[0x14];
};                                                  /* size = 0x30 */

void func_80B24630(SkelAnime *arg0, ? *arg1, s32 arg2, EnRacedog *); /* static */
void func_80B246F4(Actor *arg0, GlobalContext *arg1); /* static */
s16 func_80B2478C(Path *arg0, s32 arg1, PosRot *arg2, f32 *arg3); /* static */
void func_80B248B8(EnRacedog *arg0, f32 *arg1);     /* static */
void func_80B24E14(EnRacedog *arg0);                /* static */
void func_80B24F08(EnRacedog *arg0);                /* static */
void func_80B251EC(EnRacedog *arg0);                /* static */
void func_80B252F8(EnRacedog *arg0);                /* static */
void func_80B2538C(EnRacedog *arg0);                /* static */
void func_80B25448(EnRacedog *arg0);                /* static */
s32 func_80B25490(EnRacedog *arg0, ? *arg1, EnRacedog *); /* static */
void func_80B255AC(EnRacedog *arg0, GlobalContext *arg1); /* static */
void func_80B256BC(EnRacedog *arg0);                /* static */
