struct _mips2c_stack_EnMaYto_AfterMilkRunChooseNextDialogue {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_EnMaYto_AfterMilkRunDialogueHandler {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_EnMaYto_AfterMilkRunInit {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_EnMaYto_BarnChooseNextDialogue {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_EnMaYto_BarnDialogueHandler {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnMaYto_BarnStartDialogue {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_EnMaYto_BarnWait {
    /* 0x00 */ char pad_0[0x26];
    /* 0x26 */ s16 sp26;                            /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_EnMaYto_BeginWarmFuzzyFeelingCs {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_EnMaYto_ChangeAnim {
    /* 0x00 */ char pad_0[0x28];
    /* 0x28 */ void *sp28;                          /* inferred */
    /* 0x2C */ char pad_2C[0x4];
};                                                  /* size = 0x30 */

struct _mips2c_stack_EnMaYto_CheckValidSpawn {};    /* size 0x0 */

struct _mips2c_stack_EnMaYto_ChooseAction {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnMaYto_DefaultChooseNextDialogue {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_EnMaYto_DefaultDialogueHandler {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_EnMaYto_DefaultHandlePlayerChoice {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_EnMaYto_DefaultStartDialogue {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_EnMaYto_DefaultWait {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ s16 sp2C;                            /* inferred */
    /* 0x2E */ char pad_2E[0x2];
};                                                  /* size = 0x30 */

struct _mips2c_stack_EnMaYto_Destroy {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnMaYto_DinnerChooseNextDialogue {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_EnMaYto_DinnerDialogueHandler {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnMaYto_DinnerHandlePlayerChoice {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_EnMaYto_DinnerStartDialogue {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_EnMaYto_DinnerWait {
    /* 0x00 */ char pad_0[0x26];
    /* 0x26 */ s16 sp26;                            /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_EnMaYto_Draw {
    /* 0x00 */ char pad_0[0x30];
    /* 0x30 */ Gfx *sp30;                           /* inferred */
    /* 0x34 */ Gfx *sp34;                           /* inferred */
    /* 0x38 */ char pad_38[0x4];
    /* 0x3C */ Gfx *sp3C;                           /* inferred */
    /* 0x40 */ char pad_40[0x10];
};                                                  /* size = 0x50 */

struct _mips2c_stack_EnMaYto_HasSpokeToPlayer {};   /* size 0x0 */

struct _mips2c_stack_EnMaYto_HasSpokeToPlayerToday {}; /* size 0x0 */

struct _mips2c_stack_EnMaYto_Init {
    /* 0x00 */ char pad_0[0x30];
    /* 0x30 */ ColliderCylinder *sp30;              /* inferred */
    /* 0x34 */ char pad_34[0xC];
};                                                  /* size = 0x40 */

struct _mips2c_stack_EnMaYto_InitAnimation {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnMaYto_InitFaceExpression {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnMaYto_KeepLookingForRomani {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnMaYto_OverrideLimbDraw {
    /* 0x00 */ char pad_0[0x4];
    /* 0x04 */ s16 sp4;                             /* inferred */
    /* 0x06 */ s16 sp6;                             /* inferred */
    /* 0x08 */ char pad_8[0x8];
};                                                  /* size = 0x10 */

struct _mips2c_stack_EnMaYto_PostLimbDraw {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnMaYto_PostMilkRunEnd {};     /* size 0x0 */

struct _mips2c_stack_EnMaYto_PostMilkRunExplainReward {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_EnMaYto_PostMilkRunGiveReward {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_EnMaYto_PostMilkRunWaitDialogueEnd {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_EnMaYto_SearchRomani {};       /* size 0x0 */

struct _mips2c_stack_EnMaYto_SetFaceExpression {};  /* size 0x0 */

struct _mips2c_stack_EnMaYto_SetRomaniFaceExpression {}; /* size 0x0 */

struct _mips2c_stack_EnMaYto_SetTalkedFlag {};      /* size 0x0 */

struct _mips2c_stack_EnMaYto_SetupAfterMilkRunDialogueHandler {}; /* size 0x0 */

struct _mips2c_stack_EnMaYto_SetupAfterMilkRunInit {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnMaYto_SetupBarnDialogueHandler {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnMaYto_SetupBarnWait {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_EnMaYto_SetupBeginWarmFuzzyFeelingCs {}; /* size 0x0 */

struct _mips2c_stack_EnMaYto_SetupDefaultDialogueHandler {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnMaYto_SetupDefaultWait {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_EnMaYto_SetupDinnerDialogueHandler {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnMaYto_SetupDinnerWait {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_EnMaYto_SetupKeepLookingForRomani {}; /* size 0x0 */

struct _mips2c_stack_EnMaYto_SetupPostMilkRunEnd {}; /* size 0x0 */

struct _mips2c_stack_EnMaYto_SetupPostMilkRunExplainReward {}; /* size 0x0 */

struct _mips2c_stack_EnMaYto_SetupPostMilkRunGiveReward {}; /* size 0x0 */

struct _mips2c_stack_EnMaYto_SetupPostMilkRunWaitDialogueEnd {}; /* size 0x0 */

struct _mips2c_stack_EnMaYto_SetupWarmFuzzyFeelingCs {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnMaYto_TryFindRomani {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnMaYto_Update {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnMaYto_UpdateCollision {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ ColliderCylinder *sp1C;              /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_EnMaYto_UpdateEyes {};         /* size 0x0 */

struct _mips2c_stack_EnMaYto_WarmFuzzyFeelingCs {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ u32 sp24;                            /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80B90C78 {
    /* 0x00 */ char pad_0[0x2A];
    /* 0x2A */ s16 sp2A;                            /* inferred */
    /* 0x2C */ void *sp2C;                          /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80B90E50 {};              /* size 0x0 */

s32 EnMaYto_OverrideLimbDraw(GlobalContext *arg0, s32 arg1, Gfx **arg2, Vec3f *arg3, Vec3s *arg4, Actor *arg5); /* static */
void EnMaYto_PostLimbDraw(GlobalContext *arg0, s32 arg1, Gfx **arg2, Vec3s *arg3, Actor *arg4); /* static */
s32 EnMaYto_SearchRomani(void *arg0, void *arg1);   /* static */
void EnMaYto_UpdateCollision(Actor *arg0, GlobalContext *arg1); /* static */
void func_80B90C78(Actor *arg0, GlobalContext *arg1); /* static */
extern ? D_06001FD0;
extern ? D_06003D54;
extern ? D_06005430;
extern ? D_060070EC;
extern ? D_06007E28;
extern ? D_0600A174;
extern ? D_0600AF7C;
extern FlexSkeletonHeader D_06015C28;
static ColliderCylinderInit D_80B91410 = {
    {0xA, 0, 0, 0x39, 0x20, 1},
    {0, {0, 0, 0}, {0, 0, 0}, 0, 0, 1},
    {0x12, 0x2E, 0, {0, 0, 0}},
};
