void func_80AA5580(SkelAnime *arg0, ? *arg1, s32 arg2, Actor *); /* static */
void func_80AA561C(Actor *arg0, void *arg1);        /* static */
void func_80AA5720(Actor *arg0, void *arg1);        /* static */
void func_80AA575C(Actor *arg0, void *arg1);        /* static */
void func_80AA5890(Actor *arg0, void *arg1);        /* static */
void func_80AA58CC(Actor *arg0, void *arg1);        /* static */
void func_80AA5950(s32 arg0, ? arg1);               /* static */
void func_80AA5960(Actor *arg0, void *arg1);        /* static */
void func_80AA59E4(Actor *arg0, void *arg1);        /* static */
void func_80AA5A6C(Actor *arg0, void *arg1);        /* static */
void func_80AA5AF4(Actor *arg0, void *arg1);        /* static */
void func_80AA5BF8(Actor *arg0, void *arg1);        /* static */
void func_80AA5CD4(Actor *arg0, void *arg1);        /* static */
void func_80AA5D10(Actor *arg0, void *arg1);        /* static */
void func_80AA5D6C(Actor *arg0, void *arg1);        /* static */
void func_80AA5DC8(Actor *arg0, void *arg1);        /* static */
void func_80AA5E2C(Actor *arg0, void *arg1);        /* static */
void func_80AA5EBC(DmChar00 *arg1, GlobalContext *); /* static */
void func_80AA62FC(Actor *arg0, GlobalContext *arg1); /* static */
void func_80AA67F8(DmChar00 *, GlobalContext *);    /* static */
void func_80AA695C(DmChar00 *, GlobalContext *);    /* static */
s32 func_80AA6A6C(GlobalContext *arg0, s32 arg1, Gfx **arg2, Vec3f *arg3, Vec3s *arg5, Actor *actor, Gfx **gfx); /* static */
extern SkeletonHeader D_0402AF58;
static ? D_80AA6FB0;                                /* unable to generate initializer */
static ? D_80AA77A8;                                /* unable to generate initializer */
static ? D_80AA77D8;                                /* unable to generate initializer */
static Vec3f D_80AA7808 = {0.0f, 0.0f, 0.0f};

typedef struct DmChar00 {
    /* 0x0000 */ Actor actor;
    /* 0x0144 */ SkelAnime unk144;                  /* inferred */
    /* 0x0188 */ Vec3s unk188;                      /* inferred */
    /* 0x018E */ char pad18E[0x54];                 /* maybe part of unk188[15]? */
    /* 0x01E2 */ Vec3s unk1E2;                      /* inferred */
    /* 0x01E8 */ char pad1E8[0x54];                 /* maybe part of unk1E2[15]? */
    /* 0x023C */ void (*actionFunc)(DmChar00 *, GlobalContext *);
    /* 0x0240 */ f32 unk240;                        /* inferred */
    /* 0x0244 */ f32 unk244;                        /* inferred */
    /* 0x0248 */ f32 unk248;                        /* inferred */
    /* 0x024C */ f32 unk24C;                        /* inferred */
    /* 0x0250 */ f32 unk250;                        /* inferred */
    /* 0x0254 */ f32 unk254;                        /* inferred */
    /* 0x0258 */ f32 unk258;                        /* inferred */
    /* 0x025C */ s32 unk25C;                        /* inferred */
    /* 0x0260 */ s8 unk260;                         /* inferred */
    /* 0x0261 */ u8 unk261;                         /* inferred */
    /* 0x0262 */ u16 unk262;                        /* inferred */
} DmChar00;                                         /* size 0x264 */

void func_80AA5580(SkelAnime *arg0, ? *arg1, s32 arg2) {
    f32 temp_f0;
    void *temp_s0;
    f32 phi_f2;

    temp_s0 = arg1 + ((arg2 & 0xFFFF) * 0x18);
    temp_f0 = temp_s0->unkC;
    if (temp_f0 < 0.0f) {
        phi_f2 = (f32) SkelAnime_GetFrameCount(temp_s0->unk0);
    } else {
        phi_f2 = temp_f0;
    }
    SkelAnime_ChangeAnim(arg0, (AnimationHeader *) temp_s0->unk0, temp_s0->unk4, temp_s0->unk8, phi_f2, (u8) (s32) temp_s0->unk10, temp_s0->unk14);
}

void func_80AA561C(Actor *arg0, void *arg1) {
    s32 temp_v0;
    s32 temp_v0_2;

    if (arg0->params == 0) {
        temp_v0 = arg1->unk1F34 + 0x14;
        if ((temp_v0 != 0x1F7) && (temp_v0 != 0x39E) && (temp_v0 != 0x3D3) && (temp_v0 != 0x4C6) && (temp_v0 != 0x692)) {
            if (temp_v0 != 0x742) {
                if (temp_v0 != 0x7FB) {
