typedef struct EnZob {
    /* 0x000 */ Actor actor;
    /* 0x144 */ SkelAnime unk144;                   /* inferred */
    /* 0x188 */ Vec3s unk188;                       /* inferred */
    /* 0x18E */ char pad18E[0x8A];                  /* maybe part of unk188[24]? */
    /* 0x218 */ Vec3s unk218;                       /* inferred */
    /* 0x21E */ char pad21E[0x8A];                  /* maybe part of unk218[24]? */
    /* 0x2A8 */ ColliderCylinder unk2A8;            /* inferred */
    /* 0x2F4 */ u16 unk2F4;                         /* inferred */
    /* 0x2F6 */ Vec3s unk2F6;                       /* inferred */
    /* 0x2FC */ Vec3s unk2FC;                       /* inferred */
    /* 0x302 */ s16 unk302;                         /* inferred */
    /* 0x304 */ s16 unk304;                         /* inferred */
    /* 0x306 */ s16 unk306;                         /* inferred */
    /* 0x308 */ char pad308[0x6];                   /* maybe part of unk306[4]? */
    /* 0x30E */ s16 unk30E;                         /* inferred */
    /* 0x310 */ s16 unk310;                         /* inferred */
    /* 0x312 */ s16 unk312;                         /* inferred */
    /* 0x314 */ void (*actionFunc)(EnZob *, GlobalContext *);
} EnZob;                                            /* size = 0x318 */

struct _mips2c_stack_EnZob_Destroy {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnZob_Draw {
    /* 0x00 */ char pad0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_EnZob_Init {
    /* 0x00 */ char pad0[0x40];
};                                                  /* size = 0x40 */

struct _mips2c_stack_EnZob_Update {
    /* 0x00 */ char pad0[0x30];
    /* 0x30 */ ColliderCylinder *sp30;              /* inferred */
    /* 0x34 */ char pad34[0xC];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80B9F7E4 {
    /* 0x00 */ char pad0[0x28];
    /* 0x28 */ AnimationHeaderCommon **sp28;        /* inferred */
    /* 0x2C */ char pad2C[0x4];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80B9F86C {
    /* 0x00 */ char pad0[0x1C];
    /* 0x1C */ SkelAnime *sp1C;                     /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80B9FA3C {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80B9FC0C {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B9FC70 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B9FCA0 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80B9FD24 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80B9FDDC {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B9FE1C {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B9FE5C {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80B9FF20 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B9FF80 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80BA005C {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80BA00BC {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80BA0318 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80BA0374 {
    /* 0x00 */ char pad0[0x24];
    /* 0x24 */ void *sp24;                          /* inferred */
    /* 0x28 */ char pad28[0x4];
    /* 0x2C */ Actor *sp2C;                         /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80BA0610 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80BA06BC {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80BA0728 {
    /* 0x00 */ char pad0[0x28];
    /* 0x28 */ f32 sp28;                            /* inferred */
    /* 0x2C */ f32 sp2C;                            /* inferred */
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ char pad34[0x4];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80BA08E8 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80BA09E0 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80BA0A04 {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80BA0AD8 {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80BA0BB4 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80BA0C14 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80BA0CF4 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80BA0F64 {};              /* size 0x0 */

struct _mips2c_stack_func_80BA0FAC {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

s32 func_800B8718(EnZob *, GlobalContext *);        /* extern */
? func_800B874C(EnZob *, GlobalContext *, ?, ?);    /* extern */
? func_801A1FB4(?, f32 *, ?, ?);                    /* extern */
void func_80B9F7E4(EnZob *arg0, s16 arg1, u8 arg2, EnZob *); /* static */
void func_80B9F86C(EnZob *arg0, EnZob *);           /* static */
void func_80B9FA3C(EnZob *arg0, GlobalContext *arg1); /* static */
void func_80B9FC0C(EnZob *arg0);                    /* static */
void func_80B9FC70(EnZob *arg0, s16 arg1);          /* static */
void func_80B9FCA0(EnZob *arg0, GlobalContext *arg1); /* static */
void func_80B9FE5C(EnZob *this, GlobalContext *globalCtx); /* static */
void func_80B9FF80(EnZob *this, GlobalContext *globalCtx); /* static */
void func_80BA08E8(EnZob *arg0, GlobalContext *arg1); /* static */
