typedef struct EnFz {
    /* 0x000 */ Actor actor;
    /* 0x144 */ ? (*unk144)(EnFz *, GlobalContext *); /* inferred */
    /* 0x148 */ ColliderCylinder unk148;            /* inferred */
    /* 0x194 */ ColliderCylinder unk194;            /* inferred */
    /* 0x1E0 */ ColliderCylinder unk1E0;            /* inferred */
    /* 0x22C */ char pad22C[0x970];                 /* maybe part of unk1E0[32]? */
    /* 0xB9C */ f32 unkB9C;                         /* inferred */
    /* 0xBA0 */ f32 unkBA0;                         /* inferred */
    /* 0xBA4 */ s16 unkBA4;                         /* inferred */
    /* 0xBA6 */ char padBA6[0x2];
    /* 0xBA8 */ f32 unkBA8;                         /* inferred */
    /* 0xBAC */ f32 unkBAC;                         /* inferred */
    /* 0xBB0 */ f32 unkBB0;                         /* inferred */
    /* 0xBB4 */ f32 unkBB4;                         /* inferred */
    /* 0xBB8 */ f32 unkBB8;                         /* inferred */
    /* 0xBBC */ f32 unkBBC;                         /* inferred */
    /* 0xBC0 */ s32 unkBC0;                         /* inferred */
    /* 0xBC4 */ s16 unkBC4;                         /* inferred */
    /* 0xBC6 */ s16 unkBC6;                         /* inferred */
    /* 0xBC8 */ s16 unkBC8;                         /* inferred */
    /* 0xBCA */ s16 unkBCA;                         /* inferred */
    /* 0xBCC */ u8 unkBCC;                          /* inferred */
    /* 0xBCD */ s8 unkBCD;                          /* inferred */
    /* 0xBCE */ u8 unkBCE;                          /* inferred */
    /* 0xBCF */ s8 unkBCF;                          /* inferred */
    /* 0xBD0 */ char padBD0[0x6];                   /* maybe part of unkBCF[7]? */
    /* 0xBD6 */ u8 unkBD6;                          /* inferred */
    /* 0xBD7 */ u8 unkBD7;                          /* inferred */
    /* 0xBD8 */ u8 unkBD8;                          /* inferred */
    /* 0xBD9 */ u8 unkBD9;                          /* inferred */
    /* 0xBDA */ char padBDA[0x2];                   /* maybe part of unkBD9[3]? */
} EnFz;                                             /* size = 0xBDC */

struct _mips2c_stack_EnFz_Destroy {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_EnFz_Draw {
    /* 0x00 */ char pad0[0x4C];
    /* 0x4C */ ? sp4C;                              /* inferred */
    /* 0x4C */ char pad4C[0x4];
    /* 0x50 */ f32 sp50;                            /* inferred */
    /* 0x54 */ char pad54[0x4];
    /* 0x58 */ ? sp58;                              /* inferred */
    /* 0x58 */ char pad58[0x4];
    /* 0x5C */ f32 sp5C;                            /* inferred */
    /* 0x60 */ char pad60[0x2C];                    /* maybe part of sp5C[12]? */
    /* 0x8C */ Gfx *sp8C;                           /* inferred */
    /* 0x90 */ Gfx *sp90;                           /* inferred */
    /* 0x94 */ char pad94[0x4];
    /* 0x98 */ GraphicsContext *sp98;               /* inferred */
    /* 0x9C */ s32 sp9C;                            /* inferred */
    /* 0xA0 */ char padA0[0x8];
};                                                  /* size = 0xA8 */

struct _mips2c_stack_EnFz_Init {
    /* 0x00 */ char pad0[0x20];
    /* 0x20 */ ColliderCylinder *sp20;              /* inferred */
    /* 0x24 */ char pad24[0x4];
};                                                  /* size = 0x28 */

struct _mips2c_stack_EnFz_Update {
    /* 0x00 */ char pad0[0x2C];
    /* 0x2C */ ColliderCylinder *sp2C;              /* inferred */
    /* 0x30 */ ColliderCylinder *sp30;              /* inferred */
    /* 0x34 */ CollisionCheckContext *sp34;         /* inferred */
    /* 0x38 */ char pad38[0x8];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80932784 {
    /* 0x00 */ char pad0[0x38];
    /* 0x38 */ Vec3f *sp38;                         /* inferred */
    /* 0x3C */ CollisionPoly *sp3C;                 /* inferred */
    /* 0x40 */ u32 sp40;                            /* inferred */
    /* 0x44 */ f32 sp44;                            /* inferred */
    /* 0x48 */ f32 sp48;                            /* inferred */
    /* 0x4C */ f32 sp4C;                            /* inferred */
    /* 0x50 */ ? sp50;                              /* inferred */
    /* 0x50 */ char pad50[0xC];
    /* 0x5C */ f32 sp5C;                            /* inferred */
    /* 0x60 */ f32 sp60;                            /* inferred */
    /* 0x64 */ f32 sp64;                            /* inferred */
};                                                  /* size = 0x68 */

struct _mips2c_stack_func_809328A4 {};              /* size 0x0 */

struct _mips2c_stack_func_809328F4 {
    /* 0x00 */ char pad0[0x88];
    /* 0x88 */ s8 sp88;                             /* inferred */
    /* 0x89 */ s8 sp89;                             /* inferred */
    /* 0x8A */ s8 sp8A;                             /* inferred */
    /* 0x8B */ char pad8B[0x1];
    /* 0x8C */ s8 sp8C;                             /* inferred */
    /* 0x8D */ s8 sp8D;                             /* inferred */
    /* 0x8E */ s8 sp8E;                             /* inferred */
    /* 0x8F */ s8 sp8F;                             /* inferred */
    /* 0x90 */ f32 sp90;                            /* inferred */
    /* 0x94 */ f32 sp94;                            /* inferred */
    /* 0x98 */ f32 sp98;                            /* inferred */
    /* 0x9C */ f32 sp9C;                            /* inferred */
    /* 0xA0 */ f32 spA0;                            /* inferred */
    /* 0xA4 */ f32 spA4;                            /* inferred */
    /* 0xA8 */ f32 spA8;                            /* inferred */
    /* 0xAC */ f32 spAC;                            /* inferred */
    /* 0xB0 */ f32 spB0;                            /* inferred */
    /* 0xB4 */ char padB4[0x4];
};                                                  /* size = 0xB8 */

struct _mips2c_stack_func_80932AE8 {};              /* size 0x0 */

struct _mips2c_stack_func_80932AF4 {
    /* 0x00 */ char pad0[0x2C];
    /* 0x2C */ f32 sp2C;                            /* inferred */
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ f32 sp3C;                            /* inferred */
    /* 0x40 */ f32 sp40;                            /* inferred */
    /* 0x44 */ f32 sp44;                            /* inferred */
    /* 0x48 */ f32 sp48;                            /* inferred */
    /* 0x4C */ f32 sp4C;                            /* inferred */
};                                                  /* size = 0x50 */

struct _mips2c_stack_func_80932BD4 {
    /* 0x00 */ char pad0[0x2C];
    /* 0x2C */ f32 sp2C;                            /* inferred */
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ f32 sp3C;                            /* inferred */
    /* 0x40 */ f32 sp40;                            /* inferred */
    /* 0x44 */ f32 sp44;                            /* inferred */
    /* 0x48 */ f32 sp48;                            /* inferred */
    /* 0x4C */ f32 sp4C;                            /* inferred */
};                                                  /* size = 0x50 */

struct _mips2c_stack_func_80932C98 {
    /* 0x00 */ char pad0[0x3C];
    /* 0x3C */ f32 sp3C;                            /* inferred */
    /* 0x40 */ f32 sp40;                            /* inferred */
    /* 0x44 */ f32 sp44;                            /* inferred */
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_80933014 {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_809330D4 {};              /* size 0x0 */

struct _mips2c_stack_func_80933104 {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80933184 {};              /* size 0x0 */

struct _mips2c_stack_func_809331F8 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80933248 {};              /* size 0x0 */

struct _mips2c_stack_func_80933274 {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80933324 {};              /* size 0x0 */

struct _mips2c_stack_func_80933368 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809333A4 {};              /* size 0x0 */

struct _mips2c_stack_func_809333D8 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80933414 {};              /* size 0x0 */

struct _mips2c_stack_func_80933444 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80933480 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809334B8 {
    /* 0x00 */ char pad0[0x3C];
    /* 0x3C */ s16 sp3C;                            /* inferred */
    /* 0x3E */ char pad3E[0x1];
    /* 0x3F */ u8 sp3F;                             /* inferred */
    /* 0x40 */ f32 sp40;                            /* inferred */
    /* 0x44 */ f32 sp44;                            /* inferred */
    /* 0x48 */ f32 sp48;                            /* inferred */
    /* 0x4C */ f32 sp4C;                            /* inferred */
    /* 0x50 */ f32 sp50;                            /* inferred */
    /* 0x54 */ f32 sp54;                            /* inferred */
    /* 0x58 */ f32 sp58;                            /* inferred */
    /* 0x5C */ f32 sp5C;                            /* inferred */
    /* 0x60 */ f32 sp60;                            /* inferred */
    /* 0x64 */ f32 sp64;                            /* inferred */
    /* 0x68 */ f32 sp68;                            /* inferred */
    /* 0x6C */ f32 sp6C;                            /* inferred */
};                                                  /* size = 0x70 */

struct _mips2c_stack_func_809336C0 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80933760 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80933790 {};              /* size 0x0 */

struct _mips2c_stack_func_809337D4 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8093389C {};              /* size 0x0 */

struct _mips2c_stack_func_809338E0 {
    /* 0x00 */ char pad0[0x3C];
    /* 0x3C */ s16 sp3C;                            /* inferred */
    /* 0x3E */ char pad3E[0x1];
    /* 0x3F */ u8 sp3F;                             /* inferred */
    /* 0x40 */ f32 sp40;                            /* inferred */
    /* 0x44 */ f32 sp44;                            /* inferred */
    /* 0x48 */ f32 sp48;                            /* inferred */
    /* 0x4C */ f32 sp4C;                            /* inferred */
    /* 0x50 */ f32 sp50;                            /* inferred */
    /* 0x54 */ f32 sp54;                            /* inferred */
    /* 0x58 */ f32 sp58;                            /* inferred */
    /* 0x5C */ f32 sp5C;                            /* inferred */
    /* 0x60 */ f32 sp60;                            /* inferred */
    /* 0x64 */ f32 sp64;                            /* inferred */
    /* 0x68 */ f32 sp68;                            /* inferred */
    /* 0x6C */ f32 sp6C;                            /* inferred */
};                                                  /* size = 0x70 */

struct _mips2c_stack_func_80933AF4 {};              /* size 0x0 */

struct _mips2c_stack_func_80933B38 {};              /* size 0x0 */

struct _mips2c_stack_func_80933B48 {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80934018 {};              /* size 0x0 */

struct _mips2c_stack_func_809340BC {};              /* size 0x0 */

struct _mips2c_stack_func_80934178 {
    /* 0x00 */ char pad0[0x64];
    /* 0x64 */ f32 sp64;                            /* inferred */
    /* 0x68 */ f32 sp68;                            /* inferred */
    /* 0x6C */ f32 sp6C;                            /* inferred */
    /* 0x70 */ char pad70[0x8];
};                                                  /* size = 0x78 */

struct _mips2c_stack_func_80934464 {
    /* 0x00 */ char pad0[0x68];
};                                                  /* size = 0x68 */

s32 func_800BC4EC(Actor *, GlobalContext *, ?, s16); /* extern */
void func_80932784(EnFz *arg0, GlobalContext *arg1); /* static */
s32 func_809328A4(EnFz *arg0, f32 *arg1);           /* static */
void func_809328F4(Actor *arg0, GlobalContext *arg1, Vec3f *arg2, s32 arg3, f32 arg4); /* static */
void func_80932AE8(s32 arg0);                       /* static */
void func_80932AF4(void *arg0);                     /* static */
void func_80932BD4(void *arg0);                     /* static */
void func_80932C98(Actor *arg0, GlobalContext *arg1); /* static */
void func_80933014(EnFz *arg0, u16);                /* static */
void func_809330D4(Actor *arg0);                    /* static */
void func_80933104(EnFz *arg0, ? arg1);             /* static */
void func_80933184(EnFz *arg0);                     /* static */
void func_809331F8(EnFz *arg0, ? arg1);             /* static */
