typedef struct EnBsb {
    /* 0x0000 */ Actor actor;
    /* 0x0144 */ SkelAnime unk_144;                 /* inferred */
    /* 0x0188 */ Vec3s unk_188;                     /* inferred */
    /* 0x018E */ char pad_18E[0x78];                /* maybe part of unk_188[21]? */
    /* 0x0206 */ Vec3s unk_206;                     /* inferred */
    /* 0x020C */ char pad_20C[0x78];                /* maybe part of unk_206[21]? */
    /* 0x0284 */ void (*actionFunc)(EnBsb *, GlobalContext *);
    /* 0x0288 */ Path *unk_288;                     /* inferred */
    /* 0x028C */ s32 unk_28C;                       /* inferred */
    /* 0x0290 */ u8 unk_290;                        /* inferred */
    /* 0x0291 */ char pad_291[0x1];
    /* 0x0292 */ s16 unk_292;                       /* inferred */
    /* 0x0294 */ s16 unk_294;                       /* inferred */
    /* 0x0296 */ char pad_296[0x2];
    /* 0x0298 */ f32 unk_298;                       /* inferred */
    /* 0x029C */ char pad_29C[0x4];
    /* 0x02A0 */ f32 unk_2A0;                       /* inferred */
    /* 0x02A4 */ s32 unk_2A4;                       /* inferred */
    /* 0x02A8 */ s32 unk_2A8;                       /* inferred */
    /* 0x02AC */ s16 unk_2AC;                       /* inferred */
    /* 0x02AE */ char pad_2AE[0x1];
    /* 0x02AF */ u8 unk_2AF;                        /* inferred */
    /* 0x02B0 */ s32 unk_2B0;                       /* inferred */
    /* 0x02B4 */ s16 unk_2B4;                       /* inferred */
    /* 0x02B6 */ s16 unk_2B6;                       /* inferred */
    /* 0x02B8 */ s16 unk_2B8;                       /* inferred */
    /* 0x02BA */ s16 unk_2BA;                       /* inferred */
    /* 0x02BC */ s16 unk_2BC;                       /* inferred */
    /* 0x02BE */ char pad_2BE[0x2];
    /* 0x02C0 */ f32 unk_2C0;                       /* inferred */
    /* 0x02C4 */ f32 unk_2C4;                       /* inferred */
    /* 0x02C8 */ char pad_2C8[0x2];
    /* 0x02CA */ s16 unk_2CA;                       /* inferred */
    /* 0x02CC */ s16 unk_2CC;                       /* inferred */
    /* 0x02CE */ s16 unk_2CE;                       /* inferred */
    /* 0x02D0 */ char pad_2D0[0x2];
    /* 0x02D2 */ s16 unk_2D2;                       /* inferred */
    /* 0x02D4 */ char pad_2D4[0x4];                 /* maybe part of unk_2D2[3]? */
    /* 0x02D8 */ s32 unk_2D8;                       /* inferred */
    /* 0x02DC */ s32 unk_2DC;                       /* inferred */
    /* 0x02E0 */ f32 unk_2E0;                       /* inferred */
    /* 0x02E4 */ f32 unk_2E4;                       /* inferred */
    /* 0x02E8 */ f32 unk_2E8;                       /* inferred */
    /* 0x02EC */ Vec3f unk_2EC;                     /* inferred */
    /* 0x02F0 */ f32 unk_2F0;                       /* overlap; inferred */
    /* 0x02F8 */ CollisionPoly *unk_2F8;            /* inferred */
    /* 0x02FC */ char pad_2FC[0x8];                 /* maybe part of unk_2F8[3]? */
    /* 0x0304 */ CollisionPoly *unk_304;            /* inferred */
    /* 0x0308 */ char pad_308[0x14];                /* maybe part of unk_304[6]? */
    /* 0x031C */ s16 unk_31C;                       /* inferred */
    /* 0x031E */ s16 unk_31E;                       /* inferred */
    /* 0x0320 */ s16 unk_320;                       /* inferred */
    /* 0x0322 */ s16 unk_322;                       /* inferred */
    /* 0x0324 */ s16 unk_324;                       /* inferred */
    /* 0x0326 */ char pad_326[0x2];
    /* 0x0328 */ f32 unk_328;                       /* inferred */
    /* 0x032C */ f32 unk_32C;                       /* inferred */
    /* 0x0330 */ Vec3f unk_330;                     /* inferred */
    /* 0x033C */ char pad_33C[0xBF8];               /* maybe part of unk_330[256]? */
    /* 0x0F34 */ ColliderJntSph unk_F34;            /* inferred */
    /* 0x0F54 */ ColliderJntSphElement unk_F54;     /* inferred */
    /* 0x0F94 */ char pad_F94[0x184];               /* maybe part of unk_F54[7]? */
    /* 0x1118 */ u16 unk_1118;                      /* inferred */
    /* 0x111A */ s16 unk_111A;                      /* inferred */
    /* 0x111C */ s16 unk_111C;                      /* inferred */
    /* 0x111E */ char pad_111E[0xA];                /* maybe part of unk_111C[6]? */
    /* 0x1128 */ f32 unk_1128;                      /* inferred */
    /* 0x112C */ f32 unk_112C;                      /* inferred */
    /* 0x1130 */ f32 unk_1130;                      /* inferred */
    /* 0x1134 */ f32 unk_1134;                      /* inferred */
    /* 0x1138 */ f32 unk_1138;                      /* inferred */
    /* 0x113C */ f32 unk_113C;                      /* inferred */
    /* 0x1140 */ f32 unk_1140;                      /* inferred */
    /* 0x1144 */ f32 unk_1144;                      /* inferred */
    /* 0x1148 */ f32 unk_1148;                      /* inferred */
    /* 0x114C */ f32 unk_114C;                      /* inferred */
    /* 0x1150 */ f32 unk_1150;                      /* inferred */
    /* 0x1154 */ f32 unk_1154;                      /* inferred */
} EnBsb;                                            /* size = 0x1158 */

struct _mips2c_stack_EnBsb_Destroy {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnBsb_Draw {
    /* 0x00 */ char pad_0[0x3C];
    /* 0x3C */ f32 sp3C;                            /* inferred */
    /* 0x40 */ char pad_40[0x18];
};                                                  /* size = 0x58 */

struct _mips2c_stack_EnBsb_Init {
    /* 0x00 */ char pad_0[0x38];
};                                                  /* size = 0x38 */

struct _mips2c_stack_EnBsb_Update {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ ColliderJntSph *sp2C;                /* inferred */
    /* 0x30 */ CollisionCheckContext *sp30;         /* inferred */
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ char pad_38[0x8];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80C0B290 {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80C0B31C {
    /* 0x00 */ char pad_0[0x9C];
    /* 0x9C */ f32 sp9C;                            /* inferred */
    /* 0xA0 */ char pad_A0[0x4];
    /* 0xA4 */ f32 spA4;                            /* inferred */
    /* 0xA8 */ ? spA8;                              /* inferred */
    /* 0xA8 */ char pad_A8[0x4];
    /* 0xAC */ f32 spAC;                            /* inferred */
    /* 0xB0 */ char pad_B0[0x4];
    /* 0xB4 */ f32 spB4;                            /* inferred */
    /* 0xB8 */ f32 spB8;                            /* inferred */
    /* 0xBC */ f32 spBC;                            /* inferred */
    /* 0xC0 */ ? spC0;                              /* inferred */
    /* 0xC0 */ char pad_C0[0x4];
    /* 0xC4 */ f32 spC4;                            /* inferred */
    /* 0xC8 */ char pad_C8[0x4];
    /* 0xCC */ f32 spCC;                            /* inferred */
    /* 0xD0 */ f32 spD0;                            /* inferred */
    /* 0xD4 */ f32 spD4;                            /* inferred */
};                                                  /* size = 0xD8 */

struct _mips2c_stack_func_80C0B888 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80C0B970 {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ SkelAnime *sp20;                     /* inferred */
    /* 0x24 */ char pad_24[0x4];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80C0BA58 {
    /* 0x00 */ char pad_0[0x18];
    /* 0x18 */ SkelAnime *sp18;                     /* inferred */
    /* 0x1C */ char pad_1C[0x2];
    /* 0x1E */ s16 sp1E;                            /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80C0BC30 {
    /* 0x00 */ char pad_0[0x30];
    /* 0x30 */ s16 sp30;                            /* inferred */
    /* 0x32 */ s16 sp32;                            /* inferred */
    /* 0x34 */ s16 sp34;                            /* inferred */
    /* 0x36 */ char pad_36[0x2];
    /* 0x38 */ s16 sp38;                            /* inferred */
    /* 0x3A */ s16 sp3A;                            /* inferred */
    /* 0x3C */ s16 sp3C;                            /* inferred */
    /* 0x3E */ char pad_3E[0x2];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80C0BE1C {
    /* 0x00 */ char pad_0[0x30];
    /* 0x30 */ f32 *sp30;                           /* inferred */
    /* 0x34 */ f32 *sp34;                           /* inferred */
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80C0BF2C {};              /* size 0x0 */

struct _mips2c_stack_func_80C0BFE8 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80C0C0F4 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80C0C238 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80C0C32C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80C0C364 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ s32 sp24;                            /* inferred */
    /* 0x28 */ char pad_28[0x2];
    /* 0x2A */ s16 sp2A;                            /* inferred */
    /* 0x2C */ f32 sp2C;                            /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80C0C430 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80C0C484 {
    /* 0x00 */ char pad_0[0x32];
    /* 0x32 */ s16 sp32;                            /* inferred */
    /* 0x34 */ f32 sp34;                            /* inferred */
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80C0C610 {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80C0C6A8 {
    /* 0x00 */ char pad_0[0x30];
    /* 0x30 */ SkelAnime *sp30;                     /* inferred */
    /* 0x34 */ f32 sp34;                            /* inferred */
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80C0C86C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80C0C8EC {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ Actor *sp2C;                         /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80C0CA28 {
    /* 0x00 */ char pad_0[0x38];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80C0CB3C {
    /* 0x00 */ char pad_0[0x3C];
    /* 0x3C */ Actor *sp3C;                         /* inferred */
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80C0CCCC {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80C0CD04 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80C0CD90 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80C0CDE4 {
    /* 0x00 */ char pad_0[0x34];
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ f32 sp3C;                            /* inferred */
    /* 0x40 */ char pad_40[0x8];
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_80C0CF4C {
    /* 0x00 */ char pad_0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80C0CFDC {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80C0D00C {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ ? sp24;                              /* inferred */
    /* 0x24 */ char pad_24[0x8];
    /* 0x2C */ f32 sp2C;                            /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80C0D10C {
    /* 0x00 */ char pad_0[0x34];
    /* 0x34 */ f32 sp34;                            /* inferred */
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80C0D214 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80C0D27C {
    /* 0x00 */ char pad_0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80C0D334 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80C0D384 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80C0D3C0 {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ void *sp2C;                          /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80C0D51C {
    /* 0x00 */ char pad_0[0x3C];
    /* 0x3C */ Actor *sp3C;                         /* inferred */
    /* 0x40 */ char pad_40[0x4];
    /* 0x44 */ f32 sp44;                            /* inferred */
    /* 0x48 */ char pad_48[0x4];
    /* 0x4C */ f32 sp4C;                            /* inferred */
};                                                  /* size = 0x50 */

struct _mips2c_stack_func_80C0D964 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80C0D9B4 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80C0DA58 {};              /* size 0x0 */

struct _mips2c_stack_func_80C0DB18 {
    /* 0x00 */ char pad_0[0x3C];
    /* 0x3C */ PosRot *sp3C;                        /* inferred */
    /* 0x40 */ char pad_40[0x4];
    /* 0x44 */ f32 sp44;                            /* inferred */
    /* 0x48 */ char pad_48[0xA];                    /* maybe part of sp44[3]? */
    /* 0x52 */ s16 sp52;                            /* inferred */
    /* 0x54 */ char pad_54[0xC];                    /* maybe part of sp52[7]? */
    /* 0x60 */ f32 sp60;                            /* inferred */
    /* 0x64 */ f32 sp64;                            /* inferred */
    /* 0x68 */ char pad_68[0x4];
    /* 0x6C */ f32 sp6C;                            /* inferred */
};                                                  /* size = 0x70 */

struct _mips2c_stack_func_80C0E178 {};              /* size 0x0 */

struct _mips2c_stack_func_80C0E1C0 {
    /* 0x00 */ char pad_0[0x50];
    /* 0x50 */ f32 sp50;                            /* inferred */
    /* 0x54 */ char pad_54[0x4];
};                                                  /* size = 0x58 */

struct _mips2c_stack_func_80C0E3B8 {
    /* 0x00 */ char pad_0[0x30];
    /* 0x30 */ SkelAnime *sp30;                     /* inferred */
    /* 0x34 */ char pad_34[0x4];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80C0E480 {};              /* size 0x0 */

struct _mips2c_stack_func_80C0E4FC {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80C0E618 {
    /* 0x00 */ char pad_0[0x48];
    /* 0x48 */ f32 sp48;                            /* inferred */
    /* 0x4C */ f32 sp4C;                            /* inferred */
    /* 0x50 */ f32 sp50;                            /* inferred */
    /* 0x54 */ char pad_54[0x4];
};                                                  /* size = 0x58 */

struct _mips2c_stack_func_80C0E9CC {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ u32 sp24;                            /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80C0EEA0 {};              /* size 0x0 */

struct _mips2c_stack_func_80C0F078 {};              /* size 0x0 */

struct _mips2c_stack_func_80C0F170 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80C0F544 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80C0F640 {};              /* size 0x0 */

struct _mips2c_stack_func_80C0F758 {
    /* 0x00 */ char pad_0[0x40];
};                                                  /* size = 0x40 */

? func_800BC770(GlobalContext *, s16, s16);         /* extern */
? func_800BC848(Actor *, GlobalContext *, s32, ?);  /* extern */
s16 func_8013D83C(Path *, s32, PosRot *, f32 *);    /* extern */
? func_8013EC44(f32, s32, s32, s32);                /* extern */
? func_80169940(GlobalContext *, s16, s32);         /* extern */
void func_80C0B290(Actor *arg0, s32 arg1, Actor *, f32); /* static */
void func_80C0B31C(GlobalContext *arg0, Actor *arg1, CollisionPoly **arg2); /* static */
s32 func_80C0B888(EnBsb *arg0, GlobalContext *arg1); /* static */
void func_80C0B970(Actor *arg0, GlobalContext *arg1); /* static */
void func_80C0BA58(Actor *arg0, GlobalContext *arg1); /* static */
s32 func_80C0BC30(EnBsb *arg0);                     /* static */
void func_80C0BE1C(EnBsb *arg0, GlobalContext *arg1, EnBsb *, GlobalContext *); /* static */
