? func_800E0308(Camera *, Actor *);                 /* extern */
? func_8013AD9C(s16, s16, void *, void *, s32, s32); /* extern */
Actor *func_80BDE1A0(GlobalContext *arg0, GlobalContext *arg1, s32 arg2, s16 arg3); /* static */
void func_80BDE250(EnAl *arg0);                     /* static */
s32 func_80BDE27C(Actor *arg0, s32 arg1);           /* static */
void func_80BDE318(Actor *arg0, GlobalContext *arg1); /* static */
Actor *func_80BDE384(EnAl *arg0, GlobalContext *arg1); /* static */
s32 func_80BDE408(Actor *arg0, s16 arg1);           /* static */
s8 func_80BDE484(Actor *arg0, s32 arg1);            /* static */
s32 func_80BDE4E0(Actor *arg0, s16 *arg1, s16 arg2, Actor *); /* static */
s32 func_80BDE678(Actor *arg0, s16 *arg1, s16 arg2, Actor *); /* static */
s32 func_80BDE7FC(Actor *arg0, GlobalContext *arg1); /* static */
s32 func_80BDE92C(GlobalContext *arg0, GlobalContext *arg1); /* static */
s32 func_80BDEA14(GlobalContext *arg0, GlobalContext *arg1); /* static */
? *func_80BDEABC(Actor *arg0, GlobalContext *arg1); /* static */
s32 func_80BDEC2C(Actor *arg0, GlobalContext *arg1); /* static */
void func_80BDED20(void *arg0);                     /* static */
void func_80BDEE5C(EnAl *arg0);                     /* static */
void func_80BDEF3C(Actor *arg0, ? arg1);            /* static */
void func_80BDEFE4(Actor *arg0, ? arg1);            /* static */
? func_80BDF064(GlobalContext *arg0, GlobalContext *arg1); /* static */
s32 func_80BDF244(GlobalContext *arg0, GlobalContext *arg1, ? arg2); /* static */
s32 func_80BDF308(Actor *arg0, ? arg1, u8 *arg2);   /* static */
s32 func_80BDF390(EnAl *arg0, u8 *arg2, struct_80133038_arg2 *); /* static */
void func_80BDF414(Actor *arg0, ? arg1);            /* static */
void func_80BDF568(Actor *arg0, ? arg1);            /* static */
void func_80BDF578(Actor *arg0, GlobalContext *);   /* static */
s32 func_80BDF914(GlobalContext *arg0, s32 arg1, Gfx **arg2, Vec3f *arg3, Vec3s *rot, Actor *actor); /* static */
void func_80BDF950(GlobalContext *arg0, s32 arg1, Gfx **arg2, Vec3s *arg3, Actor *arg4); /* static */
void func_80BDFA34(GlobalContext *arg0, s32 arg1, Actor *arg2); /* static */
extern FlexSkeletonHeader D_0600A0D8;
static void D_80BDFC70;                             /* unable to generate initializer */
static ? D_80BDFCBC;                                /* unable to generate initializer */
static ? D_80BDFD14;                                /* unable to generate initializer */
static ? D_80BDFDD0;                                /* unable to generate initializer */
static ? D_80BDFDE8;                                /* unable to generate initializer */
static ? D_80BDFDF8;                                /* unable to generate initializer */
static ? D_80BDFE7C;                                /* unable to generate initializer */
static ? D_80BDFE84;                                /* unable to generate initializer */
static ? D_80BDFE8C;                                /* unable to generate initializer */
static ? D_80BDFED4;                                /* unable to generate initializer */
static ? D_80BDFF24;                                /* unable to generate initializer */
static ColliderCylinderInit D_80BDFFB8 = {
    {1, 0, 0, 0x39, 0x10, 1},
    {1, {0, 0, 0}, {0, 0, 0}, 0, 0, 1},
    {0xE, 0x3E, 0, {0, 0, 0}},
};
static CollisionCheckInfoInit2 D_80BDFFE4 = {0, 0, 0, 0, 0xFF};
static ActorAnimationEntryS D_80BDFFF0 = {
    {(AnimationHeader *)0x6000C54, 1.0f, 0, 0xFFFF, 0, 0xFFFC},
    {(AnimationHeader *)0x600DBE0, 1.0f, 0, 0xFFFF, 0, 0},
    {(AnimationHeader *)0x600DBE0, 1.0f, 0, 0xFFFF, 0, 0xFFFC},
    {(AnimationHeader *)0x600ACA0, 1.0f, 0, 0xFFFF, 2, 0},
    {(AnimationHeader *)0x600ACA0, -1.0f, 0, 0xFFFF, 2, 0},
    {(AnimationHeader *)0x600CA28, 1.0f, 0, 0xFFFF, 0, 0xFFFC},
    {(AnimationHeader *)0x600BCA4, 1.0f, 0, 0xFFFF, 2, 0},
    {(AnimationHeader *)0x600A764, 1.0f, 0, 0xFFFF, 0, 0xFFFC},
};
static Vec3f D_80BE0070 = {1000.0f, 0.0f, 0.0f};
static ? D_80BE007C;                                /* unable to generate initializer */
static ? D_80BE0094;                                /* unable to generate initializer */

typedef struct EnAl {
    /* 0x0000 */ Actor actor;
    /* 0x0144 */ SkelAnime unk144;                  /* inferred */
    /* 0x0188 */ void (*actionFunc)(EnAl *, GlobalContext *);
    /* 0x018C */ char pad18C[0x4];                  /* maybe part of actionFunc[2]? */
    /* 0x0190 */ MtxF unk190;                       /* inferred */
    /* 0x01D0 */ char pad1D0[0x140];                /* maybe part of unk190[6]? */
    /* 0x0310 */ ColliderCylinder unk310;           /* inferred */
    /* 0x035C */ u8 unk35C;                         /* inferred */
    /* 0x035D */ char pad35D[0x3];                  /* maybe part of unk35C[4]? */
    /* 0x0360 */ s32 *unk360;                       /* inferred */
    /* 0x0364 */ s32 unk364;                        /* inferred */
    /* 0x0368 */ Actor *unk368;                     /* inferred */
    /* 0x036C */ char pad36C[0x12];
    /* 0x037E */ Vec3s unk37E;                      /* inferred */
    /* 0x0384 */ char pad384[0x9C];                 /* maybe part of unk37E[27]? */
    /* 0x0420 */ Vec3s unk420;                      /* inferred */
    /* 0x0426 */ char pad426[0x9C];                 /* maybe part of unk420[27]? */
    /* 0x04C2 */ u16 unk4C2;                        /* inferred */
    /* 0x04C4 */ char pad4C4[0x4];                  /* maybe part of unk4C2[3]? */
    /* 0x04C8 */ f32 unk4C8;                        /* inferred */
    /* 0x04CC */ char pad4CC[0x8];                  /* maybe part of unk4C8[3]? */
    /* 0x04D4 */ f32 unk4D4;                        /* inferred */
    /* 0x04D8 */ char pad4D8[0x4];                  /* maybe part of unk4D4[2]? */
    /* 0x04DC */ s16 unk4DC;                        /* inferred */
    /* 0x04DE */ s16 unk4DE;                        /* inferred */
    /* 0x04E0 */ s16 unk4E0;                        /* inferred */
    /* 0x04E2 */ s16 unk4E2;                        /* inferred */
    /* 0x04E4 */ char pad4E4[0x8];                  /* maybe part of unk4E2[5]? */
    /* 0x04EC */ void *unk4EC;                      /* inferred */
    /* 0x04F0 */ s32 unk4F0;                        /* inferred */
    /* 0x04F4 */ char pad4F4[0x4];                  /* maybe part of unk4F0[2]? */
    /* 0x04F8 */ s32 unk4F8;                        /* inferred */
    /* 0x04FC */ char pad4FC[0x4];                  /* maybe part of unk4F8[2]? */
} EnAl;                                             /* size 0x500 */

Actor *func_80BDE1A0(GlobalContext *arg0, GlobalContext *arg1, s32 arg2, s16 arg3) {
    Actor *temp_v0;
    Actor *temp_v1;
    Actor *phi_s0;
    Actor *phi_s0_2;

    phi_s0 = NULL;
    phi_s0_2 = NULL;
loop_1:
    temp_v0 = func_ActorCategoryIterateById(arg1, phi_s0, arg2 & 0xFF & 0xFF, (s32) arg3);
    phi_s0_2 = temp_v0;
    if ((temp_v0 != 0) && ((temp_v0 == arg0) || (temp_v0->update == 0))) {
        temp_v1 = temp_v0->next;
        if (temp_v1 == 0) {

        } else {
            phi_s0 = temp_v1;
            goto loop_1;
        }
    }
    return phi_s0_2;
}

void func_80BDE250(EnAl *arg0) {
    arg0->unk144.animPlaybackSpeed = arg0->unk4C8;
    SkelAnime_FrameUpdateMatrix(arg0 + 0x144);
}

s32 func_80BDE27C(Actor *arg0, s32 arg1) {
    SkelAnime *temp_a0;
    s32 temp_t0;
    s32 temp_v0;
    s32 phi_v1;
    s32 phi_t0;

