typedef struct Boss06 {
    /* 0x000 */ Actor actor;
    /* 0x144 */ u8 unk_144;                         /* inferred */
    /* 0x145 */ char pad_145[0x1];
    /* 0x146 */ s16 unk_146;                        /* inferred */
    /* 0x148 */ s16 unk_148;                        /* inferred */
    /* 0x14A */ char pad_14A[0x2];
    /* 0x14C */ ColliderCylinder unk_14C;           /* inferred */
    /* 0x198 */ void (*actionFunc)(Boss06 *, GlobalContext *);
    /* 0x19C */ f32 unk_19C;                        /* inferred */
    /* 0x1A0 */ f32 unk_1A0;                        /* inferred */
    /* 0x1A4 */ f32 unk_1A4;                        /* inferred */
    /* 0x1A8 */ f32 unk_1A8;                        /* inferred */
    /* 0x1AC */ f32 unk_1AC;                        /* inferred */
    /* 0x1B0 */ f32 unk_1B0;                        /* inferred */
    /* 0x1B4 */ f32 unk_1B4;                        /* inferred */
    /* 0x1B8 */ char pad_1B8[0x4];
    /* 0x1BC */ f32 unk_1BC;                        /* inferred */
    /* 0x1C0 */ f32 unk_1C0;                        /* inferred */
    /* 0x1C4 */ char pad_1C4[0x4];
    /* 0x1C8 */ u8 unk_1C8;                         /* inferred */
    /* 0x1C9 */ u8 unk_1C9;                         /* inferred */
    /* 0x1CA */ s16 unk_1CA;                        /* inferred */
    /* 0x1CC */ f32 unk_1CC;                        /* inferred */
    /* 0x1D0 */ f32 unk_1D0;                        /* inferred */
    /* 0x1D4 */ f32 unk_1D4;                        /* inferred */
    /* 0x1D8 */ f32 unk_1D8;                        /* inferred */
    /* 0x1DC */ f32 unk_1DC;                        /* inferred */
    /* 0x1E0 */ f32 unk_1E0;                        /* inferred */
    /* 0x1E4 */ f32 unk_1E4;                        /* inferred */
    /* 0x1E8 */ char pad_1E8[0x18];                 /* maybe part of unk_1E4[7]? */
    /* 0x200 */ ? unk_200;                          /* inferred */
    /* 0x200 */ char pad_200[0x800];
    /* 0xA00 */ s16 unk_A00;                        /* inferred */
    /* 0xA02 */ char pad_A02[0x2];
    /* 0xA04 */ f32 unk_A04;                        /* inferred */
    /* 0xA08 */ f32 unk_A08;                        /* inferred */
    /* 0xA0C */ f32 unk_A0C;                        /* inferred */
    /* 0xA10 */ f32 unk_A10;                        /* inferred */
    /* 0xA14 */ f32 unk_A14;                        /* inferred */
    /* 0xA18 */ f32 unk_A18;                        /* inferred */
    /* 0xA1C */ f32 unk_A1C;                        /* inferred */
    /* 0xA20 */ f32 unk_A20;                        /* inferred */
    /* 0xA24 */ f32 unk_A24;                        /* inferred */
    /* 0xA28 */ f32 unk_A28;                        /* inferred */
    /* 0xA2C */ f32 unk_A2C;                        /* inferred */
} Boss06;                                           /* size = 0xA30 */

typedef struct {
    /* 0x00 */ Vec3f pos;
    /* 0x0C */ Vec3s rot;
    /* 0x12 */ s16 unk_12;                          /* inferred */
} PosRot;                                           /* size = 0x14 */

struct _mips2c_stack_Boss06_Destroy {};             /* size 0x0 */

struct _mips2c_stack_Boss06_Draw {
    /* 0x00 */ char pad_0[0x58];
    /* 0x58 */ void *sp58;                          /* inferred */
    /* 0x5C */ Gfx *sp5C;                           /* inferred */
    /* 0x60 */ s32 sp60;                            /* inferred */
    /* 0x64 */ s32 sp64;                            /* inferred */
    /* 0x68 */ f32 sp68;                            /* inferred */
    /* 0x6C */ char pad_6C[0x20];                   /* maybe part of sp68[9]? */
    /* 0x8C */ Gfx *sp8C;                           /* inferred */
    /* 0x90 */ Gfx *sp90;                           /* inferred */
    /* 0x94 */ char pad_94[0x3E];                   /* maybe part of sp90[16]? */
    /* 0xD2 */ u8 spD2;                             /* inferred */
    /* 0xD3 */ u8 spD3;                             /* inferred */
    /* 0xD4 */ char pad_D4[0xC];                    /* maybe part of spD3[13]? */
    /* 0xE0 */ f32 spE0;                            /* inferred */
    /* 0xE4 */ char pad_E4[0xC];
};                                                  /* size = 0xF0 */

struct _mips2c_stack_Boss06_Init {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_Boss06_Update {
    /* 0x00 */ char pad_0[0x7C];
    /* 0x7C */ f32 sp7C;                            /* inferred */
    /* 0x80 */ f32 sp80;                            /* inferred */
    /* 0x84 */ char pad_84[0xC];
};                                                  /* size = 0x90 */

struct _mips2c_stack_func_809F2120 {};              /* size 0x0 */

struct _mips2c_stack_func_809F2140 {};              /* size 0x0 */

struct _mips2c_stack_func_809F23CC {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809F24A8 {};              /* size 0x0 */

struct _mips2c_stack_func_809F24C8 {
    /* 0x00 */ char pad_0[0x48];
    /* 0x48 */ Actor *sp48;                         /* inferred */
    /* 0x4C */ char pad_4C[0x2];
    /* 0x4E */ s16 sp4E;                            /* inferred */
};                                                  /* size = 0x50 */

struct _mips2c_stack_func_809F2B64 {
    /* 0x00 */ char pad_0[0x38];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_809F2C44 {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_809F2E14 {};              /* size 0x0 */

struct _mips2c_stack_func_809F2E34 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ ColliderCylinder *sp1C;              /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_809F2ED0 {};              /* size 0x0 */

struct _mips2c_stack_func_809F2EE8 {};              /* size 0x0 */

void func_809F2120(s32 arg0, s32 arg1, s32 arg2);   /* static */
f32 func_809F2140();                                /* static */
void func_809F23CC(Boss06 *arg0);                   /* static */
void func_809F24A8(Boss06 *arg0, Boss06 *);         /* static */
void func_809F2E14(Boss06 *this, GlobalContext *globalCtx); /* static */
void func_809F2ED0(Boss06 *arg0, GlobalContext *arg1); /* static */
extern ? D_04023428;
extern ? D_06018BD0;
extern ? D_06018CF0;
extern ? D_06018DE0;
extern void D_06019360;
extern ? D_060193B0;
extern ? D_06019490;
extern s8 D_801F4E32;
extern f32 D_801F4E38;
extern f32 D_801F4E3C;
extern f32 D_801F4E40;
extern f32 D_801F4E44;
extern f32 D_801F4E48;
extern s16 D_801F4E4C;
