void func_809F2120(s32 arg0, s32 arg1, s32 arg2);   /* static */
f32 func_809F2140();                                /* static */
void func_809F23CC(Boss06 *arg0);                   /* static */
void func_809F24A8(Boss06 *arg0, Boss06 *);         /* static */
void func_809F2E14(Boss06 *this, GlobalContext *globalCtx); /* static */
void func_809F2ED0(Boss06 *arg0, GlobalContext *arg1); /* static */
extern ? D_04023428;
extern ? D_06018BD0;
extern ? D_06018CF0;
extern ? D_06018DE0;
extern void D_06019360;
extern ? D_060193B0;
extern ? D_06019490;
extern s8 D_801F4E32;
extern f32 D_801F4E38;
extern f32 D_801F4E3C;
extern f32 D_801F4E40;
extern f32 D_801F4E44;
extern f32 D_801F4E48;
extern s16 D_801F4E4C;
extern s8 D_801F4E4E;
extern f32 D_801F4E50;
extern f32 D_801F4E54;
extern f32 D_801F4E58;
extern f32 D_801F4E5C;
extern f32 D_801F4E60;
extern s16 D_801F4E64;
static DamageTable D_809F4080 = {
    {
        0xF0,
        0xF0,
        0,
        0xF1,
        0xF0,
        0xF0,
        0,
        0xF0,
        0xF0,
        0xF0,
        0xF0,
        0x21,
        0x30,
        0x40,
        0xF0,
        0xF0,
        0xF0,
        0xF0,
        0xF0,
        0,
        0xF0,
        0xF0,
        0xF0,
        0xF0,
        0xF0,
        0,
        0xF0,
        0,
        0,
        0,
        0,
        0xF0,
    },
};
static ColliderCylinderInit D_809F40C0 = {
    {3, 0x11, 9, 0x39, 0x10, 1},
    {3, {0xF7CFFFFF, 0, 4}, {0xF7FFFFFF, 0, 0}, 1, 5, 1},
    {0x5A, 0x8C, 0xA, {0, 0, 0}},
};
static ? D_809F40EC;                                /* unable to generate initializer */
static ? D_809F4370;
static Actor *D_809F4970;
static s32 D_809F4974;
static s32 D_809F4978;
static s32 D_809F497C;

typedef struct Boss06 {
    /* 0x0000 */ Actor actor;
    /* 0x0144 */ u8 unk144;                         /* inferred */
    /* 0x0145 */ char pad145[0x1];                  /* maybe part of unk144[2]? */
    /* 0x0146 */ s16 unk146;                        /* inferred */
    /* 0x0148 */ s16 unk148;                        /* inferred */
    /* 0x014A */ char pad14A[0x2];                  /* maybe part of unk148[2]? */
    /* 0x014C */ ColliderCylinder unk14C;           /* inferred */
    /* 0x0198 */ void (*actionFunc)(Boss06 *, GlobalContext *);
    /* 0x019C */ f32 unk19C;                        /* inferred */
    /* 0x01A0 */ f32 unk1A0;                        /* inferred */
    /* 0x01A4 */ f32 unk1A4;                        /* inferred */
    /* 0x01A8 */ f32 unk1A8;                        /* inferred */
    /* 0x01AC */ f32 unk1AC;                        /* inferred */
    /* 0x01B0 */ f32 unk1B0;                        /* inferred */
    /* 0x01B4 */ f32 unk1B4;                        /* inferred */
    /* 0x01B8 */ char pad1B8[0x4];                  /* maybe part of unk1B4[2]? */
    /* 0x01BC */ f32 unk1BC;                        /* inferred */
    /* 0x01C0 */ f32 unk1C0;                        /* inferred */
    /* 0x01C4 */ char pad1C4[0x4];                  /* maybe part of unk1C0[2]? */
    /* 0x01C8 */ u8 unk1C8;                         /* inferred */
    /* 0x01C9 */ u8 unk1C9;                         /* inferred */
    /* 0x01CA */ s16 unk1CA;                        /* inferred */
    /* 0x01CC */ f32 unk1CC;                        /* inferred */
    /* 0x01D0 */ f32 unk1D0;                        /* inferred */
    /* 0x01D4 */ f32 unk1D4;                        /* inferred */
    /* 0x01D8 */ f32 unk1D8;                        /* inferred */
    /* 0x01DC */ f32 unk1DC;                        /* inferred */
    /* 0x01E0 */ f32 unk1E0;                        /* inferred */
    /* 0x01E4 */ f32 unk1E4;                        /* inferred */
    /* 0x01E8 */ char pad1E8[0x15];
    /* 0x01FD */ u8 unk1FD;                         /* inferred */
    /* 0x01FE */ u8 unk1FE;                         /* inferred */
    /* 0x01FF */ u8 unk1FF;                         /* inferred */
    /* 0x0200 */ void unk200;                       /* inferred */
    /* 0x0201 */ char pad201[0x7FF];
    /* 0x0A00 */ s16 unkA00;                        /* inferred */
    /* 0x0A02 */ char padA02[0x2];                  /* maybe part of unkA00[2]? */
    /* 0x0A04 */ f32 unkA04;                        /* inferred */
    /* 0x0A08 */ f32 unkA08;                        /* inferred */
    /* 0x0A0C */ f32 unkA0C;                        /* inferred */
    /* 0x0A10 */ f32 unkA10;                        /* inferred */
    /* 0x0A14 */ f32 unkA14;                        /* inferred */
    /* 0x0A18 */ f32 unkA18;                        /* inferred */
    /* 0x0A1C */ f32 unkA1C;                        /* inferred */
    /* 0x0A20 */ f32 unkA20;                        /* inferred */
    /* 0x0A24 */ f32 unkA24;                        /* inferred */
    /* 0x0A28 */ f32 unkA28;                        /* inferred */
    /* 0x0A2C */ f32 unkA2C;                        /* inferred */
} Boss06;                                           /* size 0xA30 */

void func_809F2120(s32 arg0, s32 arg1, s32 arg2) {
    D_809F4974 = arg0;
    D_809F4978 = arg1;
    D_809F497C = arg2;
}

f32 func_809F2140(void) {
    f32 temp_f2;
    f32 temp_f2_2;
    f32 temp_f6;
    s32 temp_f16;
    s32 temp_hi;
    s32 temp_hi_2;
    s32 temp_t7;
    f32 phi_f2;
    f32 phi_f2_2;

    temp_hi = (s32) (D_809F4974 * 0xAB) % 0x763D;
    temp_hi_2 = (s32) (D_809F4978 * 0xAC) % 0x7663;
    temp_f16 = temp_hi_2;
    temp_t7 = (s32) (D_809F497C * 0xAA) % 0x7673;
    temp_f6 = (f32) temp_hi;
    D_809F4974 = temp_hi;
    D_809F4978 = temp_hi_2;
    D_809F497C = temp_t7;
    temp_f2 = (temp_f6 / 30269.0f) + ((f32) temp_f16 / 30307.0f) + ((f32) temp_t7 / 30323.0f);
    phi_f2 = temp_f2;
    phi_f2_2 = temp_f2;
    if (temp_f2 >= 1.0f) {
        do {
            temp_f2_2 = phi_f2 - 1.0f;
            phi_f2 = temp_f2_2;
