typedef struct EnHonotrap {
    /* 0x000 */ Actor actor;
    /* 0x144 */ void (*actionFunc)(EnHonotrap *, GlobalContext *);
    /* 0x148 */ ColliderCylinder unk148;            /* inferred */
    /* 0x194 */ char pad194[0x8C];                  /* maybe part of unk148[2]? */
    /* 0x220 */ s16 unk220;                         /* inferred */
    /* 0x222 */ s16 unk222;                         /* inferred */
    /* 0x224 */ char pad224[0x4];                   /* maybe part of unk222[3]? */
    /* 0x228 */ f32 unk228;                         /* inferred */
    /* 0x22C */ f32 unk22C;                         /* inferred */
    /* 0x230 */ f32 unk230;                         /* inferred */
    /* 0x234 */ f32 unk234;                         /* inferred */
    /* 0x238 */ char pad238[0x4];
    /* 0x23C */ f32 unk23C;                         /* inferred */
    /* 0x240 */ char pad240[0x84];                  /* maybe part of unk23C[34]? */
} EnHonotrap;                                       /* size = 0x2C4 */

struct _mips2c_stack_EnHonotrap_Destroy {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnHonotrap_Draw {
    /* 0x00 */ char pad0[0x1C];
    /* 0x1C */ Gfx *sp1C;                           /* inferred */
    /* 0x20 */ char pad20[0x8];                     /* maybe part of sp1C[3]? */
    /* 0x28 */ GraphicsContext *sp28;               /* inferred */
    /* 0x2C */ char pad2C[0x4];
};                                                  /* size = 0x30 */

struct _mips2c_stack_EnHonotrap_Init {
    /* 0x00 */ char pad0[0x24];
    /* 0x24 */ s32 sp24;                            /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_EnHonotrap_Update {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_8092E510 {
    /* 0x00 */ char pad0[0x24];
    /* 0x24 */ CollisionCheckContext *sp24;         /* inferred */
    /* 0x28 */ char pad28[0x10];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_8092E5A4 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8092E638 {
    /* 0x00 */ char pad0[0x70];
    /* 0x70 */ ? sp70;                              /* inferred */
    /* 0x70 */ char pad70[0xC];
    /* 0x7C */ ? sp7C;                              /* inferred */
    /* 0x7C */ char pad7C[0xC];
    /* 0x88 */ ? sp88;                              /* inferred */
    /* 0x88 */ char pad88[0x20];
};                                                  /* size = 0xA8 */

struct _mips2c_stack_func_8092E840 {
    /* 0x00 */ char pad0[0x20];
    /* 0x20 */ ColliderCylinder *sp20;              /* inferred */
    /* 0x24 */ s32 sp24;                            /* inferred */
    /* 0x28 */ char pad28[0x8];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_8092E988 {
    /* 0x00 */ char pad0[0x38];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_8092EBC0 {};              /* size 0x0 */

struct _mips2c_stack_func_8092EBDC {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8092EC9C {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_8092ECF0 {
    /* 0x00 */ char pad0[0x40];
    /* 0x40 */ f32 sp40;                            /* inferred */
    /* 0x44 */ char pad44[0x4];
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_8092EDC0 {};              /* size 0x0 */

struct _mips2c_stack_func_8092EDD8 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8092EE08 {};              /* size 0x0 */

struct _mips2c_stack_func_8092EE1C {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8092EE68 {};              /* size 0x0 */

struct _mips2c_stack_func_8092EE90 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8092EF3C {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_8092EF98 {
    /* 0x00 */ char pad0[0x44];
    /* 0x44 */ f32 sp44;                            /* inferred */
    /* 0x48 */ char pad48[0x8];
};                                                  /* size = 0x50 */

struct _mips2c_stack_func_8092F05C {};              /* size 0x0 */

struct _mips2c_stack_func_8092F074 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8092F0A4 {};              /* size 0x0 */

struct _mips2c_stack_func_8092F0B8 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8092F0F8 {};              /* size 0x0 */

struct _mips2c_stack_func_8092F10C {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8092F1A0 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8092F208 {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_8092F34C {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8092F3D8 {
    /* 0x00 */ char pad0[0x34];
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ f32 sp3C;                            /* inferred */
    /* 0x40 */ ? sp40;                              /* inferred */
    /* 0x40 */ char pad40[0xC];
    /* 0x4C */ ? sp4C;                              /* inferred */
    /* 0x4C */ char pad4C[0x18];
    /* 0x64 */ f32 sp64;                            /* inferred */
    /* 0x68 */ f32 sp68;                            /* inferred */
    /* 0x6C */ char pad6C[0x4];
};                                                  /* size = 0x70 */

struct _mips2c_stack_func_8092F5AC {};              /* size 0x0 */

struct _mips2c_stack_func_8092F5EC {
    /* 0x00 */ char pad0[0x30];
    /* 0x30 */ ? sp30;                              /* inferred */
    /* 0x30 */ char pad30[0x2];
    /* 0x32 */ s16 sp32;                            /* inferred */
    /* 0x34 */ char pad34[0xC];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_8092F7A8 {};              /* size 0x0 */

struct _mips2c_stack_func_8092F7BC {
    /* 0x00 */ char pad0[0x28];
    /* 0x28 */ s32 sp28;                            /* inferred */
    /* 0x2C */ char pad2C[0x4];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_8092F854 {};              /* size 0x0 */

struct _mips2c_stack_func_8092F878 {
    /* 0x00 */ char pad0[0x54];
    /* 0x54 */ s32 sp54;                            /* inferred */
    /* 0x58 */ char pad58[0x10];                    /* maybe part of sp54[5]? */
    /* 0x68 */ ? sp68;                              /* inferred */
    /* 0x68 */ char pad68[0x8];
    /* 0x70 */ f32 sp70;                            /* inferred */
    /* 0x74 */ char pad74[0x4];
    /* 0x78 */ s32 sp78;                            /* inferred */
    /* 0x7C */ s32 sp7C;                            /* inferred */
    /* 0x80 */ f32 sp80;                            /* inferred */
    /* 0x84 */ f32 sp84;                            /* inferred */
    /* 0x88 */ f32 sp88;                            /* inferred */
    /* 0x8C */ char pad8C[0xC];                     /* maybe part of sp88[4]? */
    /* 0x98 */ f32 *sp98;                           /* inferred */
    /* 0x9C */ char pad9C[0x4];
};                                                  /* size = 0xA0 */

struct _mips2c_stack_func_8092FE44 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_8092FEFC {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80930030 {
    /* 0x00 */ char pad0[0x40];
    /* 0x40 */ Gfx *sp40;                           /* inferred */
    /* 0x44 */ char pad44[0x8];                     /* maybe part of sp40[3]? */
    /* 0x4C */ Gfx *sp4C;                           /* inferred */
    /* 0x50 */ char pad50[0x10];
};                                                  /* size = 0x60 */

struct _mips2c_stack_func_80930190 {
    /* 0x00 */ char pad0[0xB8];
    /* 0xB8 */ ? spB8;                              /* inferred */
    /* 0xB8 */ char padB8[0x2];
    /* 0xBA */ s16 spBA;                            /* inferred */
    /* 0xBC */ char padBC[0x1C];
};                                                  /* size = 0xD8 */

? EffectSsBomb2_SpawnLayered(GlobalContext *, PosRot *, ? *, ? *, s32, s32); /* extern */
? func_800DFC90(? *, Camera *);                     /* extern */
void func_8092E510(Actor *arg0, GlobalContext *arg1); /* static */
void func_8092E5A4(? *arg0, Vec3f *arg1);           /* static */
void func_8092E638(Actor *arg0, GlobalContext *arg1, GlobalContext *); /* static */
void func_8092E840(Actor *arg0, GlobalContext *arg1, GlobalContext *); /* static */
void func_8092E988(Actor *arg0, GlobalContext *arg1, GlobalContext *); /* static */
void func_8092EBC0(Actor *arg0);                    /* static */
void func_8092EC9C(Actor *arg0);                    /* static */
void func_8092EDC0(EnHonotrap *arg0);               /* static */
void func_8092EE08(void *arg0);                     /* static */
void func_8092EE68(Actor *arg0);                    /* static */
