typedef struct EnGeg {
    /* 0x000 */ Actor actor;
    /* 0x144 */ SkelAnime unk144;                   /* inferred */
    /* 0x15C */ f32 unk15C;                         /* overlap; inferred */
    /* 0x160 */ char pad160[0x28];                  /* maybe part of unk15C[11]? */
    /* 0x188 */ void (*actionFunc)(EnGeg *, GlobalContext *);
    /* 0x18C */ ColliderCylinder unk18C;            /* inferred */
    /* 0x1D8 */ ColliderCylinder unk1D8;            /* inferred */
    /* 0x224 */ char pad224[0xC];
    /* 0x230 */ u16 unk230;                         /* inferred */
    /* 0x232 */ s16 unk232;                         /* inferred */
    /* 0x234 */ char pad234[0x4];                   /* maybe part of unk232[3]? */
    /* 0x238 */ s16 unk238;                         /* inferred */
    /* 0x23A */ char pad23A[0xA];                   /* maybe part of unk238[6]? */
    /* 0x244 */ s16 unk244;                         /* inferred */
    /* 0x246 */ char pad246[0x2];
    /* 0x248 */ s32 unk248;                         /* inferred */
    /* 0x24C */ Vec3s unk24C;                       /* inferred */
    /* 0x252 */ char pad252[0x66];                  /* maybe part of unk24C[18]? */
    /* 0x2B8 */ Vec3s unk2B8;                       /* inferred */
    /* 0x2BE */ char pad2BE[0x1D8];                 /* maybe part of unk2B8[79]? */
    /* 0x496 */ u16 unk496;                         /* inferred */
    /* 0x498 */ s16 unk498;                         /* inferred */
    /* 0x49A */ s16 unk49A;                         /* inferred */
    /* 0x49C */ s16 unk49C;                         /* inferred */
    /* 0x49E */ s16 unk49E;                         /* inferred */
    /* 0x4A0 */ s16 unk4A0;                         /* inferred */
    /* 0x4A2 */ s16 unk4A2;                         /* inferred */
    /* 0x4A4 */ s16 unk4A4;                         /* inferred */
    /* 0x4A6 */ s16 unk4A6;                         /* inferred */
    /* 0x4A8 */ s16 unk4A8;                         /* inferred */
    /* 0x4AA */ s16 unk4AA;                         /* inferred */
    /* 0x4AC */ s32 unk4AC;                         /* inferred */
    /* 0x4B0 */ char pad4B0[0x4];
    /* 0x4B4 */ Vec3f unk4B4;                       /* inferred */
    /* 0x4C0 */ char pad4C0[0x18];                  /* maybe part of unk4B4[3]? */
    /* 0x4D8 */ s16 unk4D8;                         /* inferred */
    /* 0x4DA */ char pad4DA[0x2];
    /* 0x4DC */ s32 unk4DC;                         /* inferred */
    /* 0x4E0 */ s16 unk4E0;                         /* inferred */
    /* 0x4E2 */ char pad4E2[0x2];
    /* 0x4E4 */ Vec3f unk4E4;                       /* inferred */
} EnGeg;                                            /* size = 0x4F0 */

struct _mips2c_stack_EnGeg_Destroy {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnGeg_Draw {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnGeg_Init {
    /* 0x00 */ char pad0[0x30];
    /* 0x30 */ ColliderCylinder *sp30;              /* inferred */
    /* 0x34 */ ? sp34;                              /* inferred */
    /* 0x34 */ char pad34[0x14];
};                                                  /* size = 0x48 */

struct _mips2c_stack_EnGeg_Update {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80BB16D0 {};              /* size 0x0 */

struct _mips2c_stack_func_80BB178C {
    /* 0x00 */ char pad0[0x34];
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ f32 sp3C;                            /* inferred */
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80BB18FC {
    /* 0x00 */ char pad0[0x18];
    /* 0x18 */ Vec3f *sp18;                         /* inferred */
    /* 0x1C */ Vec3f *sp1C;                         /* inferred */
    /* 0x20 */ char pad20[0x4];
    /* 0x24 */ f32 sp24;                            /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80BB19C0 {
    /* 0x00 */ char pad0[0x24];
    /* 0x24 */ Vec3f *sp24;                         /* inferred */
    /* 0x28 */ char pad28[0x4];
    /* 0x2C */ f32 sp2C;                            /* inferred */
    /* 0x30 */ s16 sp30;                            /* inferred */
    /* 0x32 */ s16 sp32;                            /* inferred */
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ f32 sp3C;                            /* inferred */
    /* 0x40 */ f32 sp40;                            /* inferred */
    /* 0x44 */ f32 sp44;                            /* inferred */
    /* 0x48 */ f32 sp48;                            /* inferred */
    /* 0x4C */ char pad4C[0x4];
};                                                  /* size = 0x50 */

struct _mips2c_stack_func_80BB1B14 {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80BB1C1C {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80BB1C8C {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80BB1D04 {};              /* size 0x0 */

struct _mips2c_stack_func_80BB1D64 {
    /* 0x00 */ char pad0[0x34];
    /* 0x34 */ ? sp34;                              /* inferred */
    /* 0x34 */ char pad34[0x4];
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ char pad3C[0x4];
    /* 0x40 */ ? sp40;                              /* inferred */
    /* 0x40 */ char pad40[0x4];
    /* 0x44 */ f32 sp44;                            /* inferred */
    /* 0x48 */ char pad48[0x4];
    /* 0x4C */ void *sp4C;                          /* inferred */
};                                                  /* size = 0x50 */

struct _mips2c_stack_func_80BB1FCC {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80BB2020 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80BB2088 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80BB217C {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80BB221C {
    /* 0x00 */ char pad0[0x27];
    /* 0x27 */ u8 sp27;                             /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80BB2520 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80BB26EC {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80BB27D4 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80BB2944 {
    /* 0x00 */ char pad0[0x24];
    /* 0x24 */ s16 sp24;                            /* inferred */
    /* 0x26 */ char pad26[0x1];
    /* 0x27 */ u8 sp27;                             /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80BB2A54 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80BB2B1C {
    /* 0x00 */ char pad0[0x68];
    /* 0x68 */ f32 sp68;                            /* inferred */
    /* 0x6C */ char pad6C[0x8];                     /* maybe part of sp68[3]? */
    /* 0x74 */ f32 sp74;                            /* inferred */
    /* 0x78 */ f32 sp78;                            /* inferred */
    /* 0x7C */ f32 sp7C;                            /* inferred */
};                                                  /* size = 0x80 */

struct _mips2c_stack_func_80BB2E00 {
    /* 0x00 */ char pad0[0x28];
    /* 0x28 */ SkelAnime *sp28;                     /* inferred */
    /* 0x2C */ s16 sp2C;                            /* inferred */
    /* 0x2E */ s16 sp2E;                            /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80BB2F7C {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80BB30B4 {
    /* 0x00 */ char pad0[0x24];
    /* 0x24 */ Actor *sp24;                         /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80BB31B8 {
    /* 0x00 */ char pad0[0x2C];
    /* 0x2C */ s32 sp2C;                            /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80BB32AC {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80BB3318 {
    /* 0x00 */ char pad0[0x30];
    /* 0x30 */ PosRot *sp30;                        /* inferred */
    /* 0x34 */ char pad34[0xC];                     /* maybe part of sp30[4]? */
    /* 0x40 */ f32 sp40;                            /* inferred */
    /* 0x44 */ char pad44[0x2];
    /* 0x46 */ s16 sp46;                            /* inferred */
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_80BB347C {};              /* size 0x0 */

struct _mips2c_stack_func_80BB3728 {
    /* 0x00 */ char pad0[0x28];
    /* 0x28 */ ? sp28;                              /* inferred */
    /* 0x28 */ char pad28[0x40];
    /* 0x68 */ s16 sp68;                            /* inferred */
    /* 0x6A */ s16 sp6A;                            /* inferred */
    /* 0x6C */ s16 sp6C;                            /* inferred */
    /* 0x6E */ char pad6E[0x2];
    /* 0x70 */ ? sp70;                              /* inferred */
    /* 0x70 */ char pad70[0xC];
    /* 0x7C */ ? sp7C;                              /* inferred */
    /* 0x7C */ char pad7C[0xC];
};                                                  /* size = 0x88 */

struct _mips2c_stack_func_80BB3860 {};              /* size 0x0 */

struct _mips2c_stack_func_80BB387C {
    /* 0x00 */ char pad0[0x2C];
    /* 0x2C */ f32 sp2C;                            /* inferred */
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ f32 sp3C;                            /* inferred */
    /* 0x40 */ f32 sp40;                            /* inferred */
    /* 0x44 */ char pad44[0x4];
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_80BB39F8 {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80BB3BE0 {
    /* 0x00 */ char pad0[0x30];
    /* 0x30 */ Gfx *sp30;                           /* inferred */
    /* 0x34 */ char pad34[0x4];
    /* 0x38 */ GraphicsContext *sp38;               /* inferred */
    /* 0x3C */ char pad3C[0x4];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80BB3CB4 {
    /* 0x00 */ char pad0[0x24];
    /* 0x24 */ f32 sp24;                            /* inferred */
};                                                  /* size = 0x28 */

? func_800AEF44(void *);                            /* extern */
? func_8019F4AC(Vec3f *, ?);                        /* extern */
? func_8019F570(Vec3f *, ?);                        /* extern */
u16 func_80BB16D0(EnGeg *arg0);                     /* static */
void func_80BB178C(Actor *arg0, GlobalContext *arg1); /* static */
s32 func_80BB18FC(EnGeg *arg0, Actor *arg1);        /* static */
void func_80BB19C0(Vec3f *arg0, EnGeg *arg1, GlobalContext *arg2); /* static */
s32 func_80BB1B14(EnGeg *arg0, GlobalContext *arg1); /* static */
void func_80BB1C1C(EnGeg *arg0);                    /* static */
void func_80BB1C8C(EnGeg *arg0);                    /* static */
void func_80BB1D04(EnGeg *arg0);                    /* static */
? func_80BB1D64(Actor *arg0, GlobalContext *arg1);  /* static */
