typedef struct EnWiz {
    /* 0x000 */ Actor actor;
    /* 0x144 */ SkelAnime unk144;                   /* inferred */
    /* 0x188 */ Vec3s unk188;                       /* inferred */
    /* 0x18E */ ? unk18E;                           /* inferred */
    /* 0x18E */ char pad18E[0x6];
    /* 0x194 */ ? unk194;                           /* inferred */
    /* 0x194 */ char pad194[0x6];
    /* 0x19A */ ? unk19A;                           /* inferred */
    /* 0x19A */ char pad19A[0x66];
    /* 0x200 */ Vec3s unk200;                       /* inferred */
    /* 0x206 */ char pad206[0x72];                  /* maybe part of unk200[20]? */
    /* 0x278 */ SkelAnime unk278;                   /* inferred */
    /* 0x2BC */ Vec3s unk2BC;                       /* inferred */
    /* 0x2C2 */ ? unk2C2;                           /* inferred */
    /* 0x2C2 */ char pad2C2[0x6];
    /* 0x2C8 */ ? unk2C8;                           /* inferred */
    /* 0x2C8 */ char pad2C8[0x6];
    /* 0x2CE */ ? unk2CE;                           /* inferred */
    /* 0x2CE */ char pad2CE[0x66];
    /* 0x334 */ Vec3s unk334;                       /* inferred */
    /* 0x33A */ char pad33A[0x72];                  /* maybe part of unk334[20]? */
    /* 0x3AC */ void (*actionFunc)(EnWiz *, GlobalContext *);
    /* 0x3B0 */ s16 unk3B0;                         /* inferred */
    /* 0x3B2 */ s16 unk3B2;                         /* inferred */
    /* 0x3B4 */ s16 unk3B4;                         /* inferred */
    /* 0x3B6 */ s16 unk3B6;                         /* inferred */
    /* 0x3B8 */ s16 unk3B8;                         /* inferred */
    /* 0x3BA */ char pad3BA[0x8];                   /* maybe part of unk3B8[5]? */
    /* 0x3C2 */ s16 unk3C2;                         /* inferred */
    /* 0x3C4 */ s16 unk3C4;                         /* inferred */
    /* 0x3C6 */ char pad3C6[0xE];                   /* maybe part of unk3C4[8]? */
    /* 0x3D4 */ f32 unk3D4;                         /* inferred */
    /* 0x3D8 */ f32 unk3D8;                         /* inferred */
    /* 0x3DC */ f32 unk3DC;                         /* inferred */
    /* 0x3E0 */ f32 unk3E0;                         /* inferred */
    /* 0x3E4 */ f32 unk3E4;                         /* inferred */
    /* 0x3E8 */ f32 unk3E8;                         /* inferred */
    /* 0x3EC */ f32 unk3EC;                         /* inferred */
    /* 0x3F0 */ f32 unk3F0;                         /* inferred */
    /* 0x3F4 */ f32 unk3F4;                         /* inferred */
    /* 0x3F8 */ f32 unk3F8;                         /* inferred */
    /* 0x3FC */ char pad3FC[0x18];                  /* maybe part of unk3F8[7]? */
    /* 0x414 */ f32 unk414;                         /* inferred */
    /* 0x418 */ f32 unk418;                         /* inferred */
    /* 0x41C */ f32 unk41C;                         /* inferred */
    /* 0x420 */ char pad420[0x30];                  /* maybe part of unk41C[13]? */
    /* 0x450 */ f32 unk450;                         /* inferred */
    /* 0x454 */ ColliderJntSph unk454;              /* inferred */
    /* 0x474 */ ColliderJntSphElement unk474;       /* inferred */
    /* 0x4B4 */ char pad4B4[0x240];                 /* maybe part of unk474[10]? */
    /* 0x6F4 */ ColliderCylinder unk6F4;            /* inferred */
    /* 0x740 */ s32 unk740;                         /* inferred */
    /* 0x744 */ char pad744[0x4];
    /* 0x748 */ s16 unk748;                         /* inferred */
    /* 0x74A */ s16 unk74A;                         /* inferred */
    /* 0x74C */ s16 unk74C;                         /* inferred */
    /* 0x74E */ s16 unk74E;                         /* inferred */
    /* 0x750 */ char pad750[0x2];
    /* 0x752 */ s16 unk752;                         /* inferred */
    /* 0x754 */ s16 unk754;                         /* inferred */
    /* 0x756 */ char pad756[0x2];
    /* 0x758 */ f32 unk758;                         /* inferred */
    /* 0x75C */ f32 unk75C;                         /* inferred */
    /* 0x760 */ Vec3f unk760;                       /* inferred */
    /* 0x76C */ char pad76C[0x614];                 /* maybe part of unk760[130]? */
} EnWiz;                                            /* size = 0xD80 */

struct _mips2c_stack_EnWiz_Destroy {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnWiz_Draw {
    /* 0x00 */ char pad0[0x58];
    /* 0x58 */ void *sp58;                          /* inferred */
    /* 0x5C */ Vec3s *sp5C;                         /* inferred */
    /* 0x60 */ char pad60[0x56];                    /* maybe part of sp5C[22]? */
    /* 0xB6 */ s16 spB6;                            /* inferred */
    /* 0xB8 */ char padB8[0x4];                     /* maybe part of spB6[3]? */
    /* 0xBC */ f32 spBC;                            /* inferred */
    /* 0xC0 */ char padC0[0x20];
};                                                  /* size = 0xE0 */

struct _mips2c_stack_EnWiz_Init {
    /* 0x00 */ char pad0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_EnWiz_Update {
    /* 0x00 */ char pad0[0x28];
    /* 0x28 */ ColliderCylinder *sp28;              /* inferred */
    /* 0x2C */ char pad2C[0x14];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80A455C4 {
    /* 0x00 */ char pad0[0x28];
    /* 0x28 */ u8 *sp28;                            /* inferred */
    /* 0x2C */ AnimationHeaderCommon **sp2C;        /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80A456A0 {
    /* 0x00 */ char pad0[0x2C];
    /* 0x2C */ Actor *sp2C;                         /* inferred */
    /* 0x30 */ char pad30[0x4];
    /* 0x34 */ PosRot *sp34;                        /* inferred */
    /* 0x38 */ Vec3f *sp38;                         /* inferred */
    /* 0x3C */ char pad3C[0x8];                     /* maybe part of sp38[3]? */
    /* 0x44 */ s32 sp44;                            /* inferred */
    /* 0x48 */ char pad48[0x4];
    /* 0x4C */ f32 sp4C;                            /* inferred */
    /* 0x50 */ f32 sp50;                            /* inferred */
    /* 0x54 */ f32 sp54;                            /* inferred */
    /* 0x58 */ f32 sp58;                            /* inferred */
    /* 0x5C */ f32 sp5C;                            /* inferred */
    /* 0x60 */ f32 sp60;                            /* inferred */
    /* 0x64 */ char pad64[0x4];
};                                                  /* size = 0x68 */

struct _mips2c_stack_func_80A45CD8 {
    /* 0x00 */ char pad0[0x44];
    /* 0x44 */ f32 sp44;                            /* inferred */
    /* 0x48 */ char pad48[0x18];
};                                                  /* size = 0x60 */

struct _mips2c_stack_func_80A460A4 {
    /* 0x00 */ char pad0[0x58];
};                                                  /* size = 0x58 */

struct _mips2c_stack_func_80A46280 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80A462F8 {
    /* 0x00 */ char pad0[0x30];
    /* 0x30 */ Vec3f *sp30;                         /* inferred */
    /* 0x34 */ char pad34[0xC];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80A46414 {
    /* 0x00 */ char pad0[0x38];
    /* 0x38 */ void *sp38;                          /* inferred */
    /* 0x3C */ ? sp3C;                              /* inferred */
    /* 0x3C */ char pad3C[0xC];
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_80A4668C {
    /* 0x00 */ char pad0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80A46764 {
    /* 0x00 */ char pad0[0x2C];
    /* 0x2C */ f32 sp2C;                            /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80A468CC {
    /* 0x00 */ char pad0[0x2E];
    /* 0x2E */ s16 sp2E;                            /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80A46990 {
    /* 0x00 */ char pad0[0x3C];
    /* 0x3C */ PosRot *sp3C;                        /* inferred */
    /* 0x40 */ char pad40[0x28];
};                                                  /* size = 0x68 */

struct _mips2c_stack_func_80A46C88 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A46CC4 {
    /* 0x00 */ char pad0[0x34];
    /* 0x34 */ f32 sp34;                            /* inferred */
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80A46DDC {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A46E24 {
    /* 0x00 */ char pad0[0x44];
    /* 0x44 */ Vec3f *sp44;                         /* inferred */
    /* 0x48 */ s16 sp48;                            /* inferred */
    /* 0x4A */ char pad4A[0x6];                     /* maybe part of sp48[4]? */
    /* 0x50 */ s32 sp50;                            /* inferred */
    /* 0x54 */ f32 sp54;                            /* inferred */
    /* 0x58 */ f32 sp58;                            /* inferred */
    /* 0x5C */ f32 sp5C;                            /* inferred */
    /* 0x60 */ s32 sp60;                            /* inferred */
    /* 0x64 */ f32 sp64;                            /* inferred */
};                                                  /* size = 0x68 */

struct _mips2c_stack_func_80A47000 {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80A470D8 {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80A47298 {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80A473B8 {
    /* 0x00 */ char pad0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80A4767C {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A476C8 {
    /* 0x00 */ char pad0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80A477E8 {
    /* 0x00 */ char pad0[0xA4];
    /* 0xA4 */ f32 spA4;                            /* inferred */
    /* 0xA8 */ f32 spA8;                            /* inferred */
    /* 0xAC */ f32 spAC;                            /* inferred */
    /* 0xB0 */ f32 spB0;                            /* inferred */
    /* 0xB4 */ f32 spB4;                            /* inferred */
    /* 0xB8 */ f32 spB8;                            /* inferred */
    /* 0xBC */ f32 spBC;                            /* inferred */
    /* 0xC0 */ f32 spC0;                            /* inferred */
    /* 0xC4 */ f32 spC4;                            /* inferred */
    /* 0xC8 */ char padC8[0x4];
    /* 0xCC */ s32 spCC;                            /* inferred */
};                                                  /* size = 0xD0 */

struct _mips2c_stack_func_80A47FCC {
    /* 0x00 */ char pad0[0x24];
    /* 0x24 */ f32 sp24;                            /* inferred */
    /* 0x28 */ f32 sp28;                            /* inferred */
    /* 0x2C */ char pad2C[0x4];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80A48138 {
    /* 0x00 */ char pad0[0x38];
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ f32 sp3C;                            /* inferred */
    /* 0x40 */ f32 sp40;                            /* inferred */
    /* 0x44 */ char pad44[0x8];                     /* maybe part of sp40[3]? */
    /* 0x4C */ f32 sp4C;                            /* inferred */
    /* 0x50 */ f32 sp50;                            /* inferred */
    /* 0x54 */ char pad54[0x4];
};                                                  /* size = 0x58 */

void func_80A455C4(Actor *arg0, s32 arg1, s32 arg2); /* static */
void func_80A456A0(Actor *arg0, GlobalContext *arg1); /* static */
void func_80A45CD8(Actor *arg0, GlobalContext *arg1); /* static */
void func_80A460A4(Actor *arg0);                    /* static */
void func_80A46280(EnWiz *, GlobalContext *);       /* static */
void func_80A462F8(EnWiz *arg0, GlobalContext *arg1); /* static */
void func_80A46414(Actor *arg0, void *arg1);        /* static */
void func_80A4668C(Actor *arg0);                    /* static */
void func_80A46764(Actor *arg0, ? arg1);            /* static */
void func_80A468CC(Actor *arg0, ? arg1);            /* static */
void func_80A46990(Actor *arg0, GlobalContext *arg1); /* static */
void func_80A46C88(Actor *arg0);                    /* static */
void func_80A46CC4(Actor *arg0, ? arg1);            /* static */
