? func_800B90F4(GlobalContext *, GlobalContext *);  /* extern */
void func_80B34F70(EnGg *arg0);                     /* static */
? func_80B34FB4(EnGg *arg0, GlobalContext *arg1);   /* static */
void func_80B35108(Actor *arg0, GlobalContext *arg1); /* static */
void func_80B351A4(EnGg *arg0);                     /* static */
void func_80B35250(Actor *arg0);                    /* static */
void func_80B352A4(void *arg0, ? arg1);             /* static */
void func_80B35450(Actor *arg0, GlobalContext *arg1); /* static */
void func_80B3556C(Actor *arg0, GlobalContext *arg1); /* static */
void func_80B35634(Actor *arg0, GlobalContext *arg1); /* static */
u16 func_80B357F0(Actor *arg0);                     /* static */
void func_80B3584C(EnGg *arg0);                     /* static */
void func_80B358D8(Actor *arg0, GlobalContext *arg1); /* static */
void func_80B35968(EnGg *arg0, GlobalContext *);    /* static */
void func_80B359DC(Actor *arg0, void *arg1);        /* static */
void func_80B35B24(? *arg0, GlobalContext *arg1);   /* static */
void func_80B35B44(void *arg0);                     /* static */
void func_80B35C84(void *arg0, GraphicsContext **arg1); /* static */
void func_80B3610C(void *arg0, GraphicsContext **arg1); /* static */
void func_80B363E8(void *arg0, void *arg1, void *arg2, void *arg3, void *arg4); /* static */
void func_80B364D4(? *arg0, GlobalContext *);       /* static */
s32 func_80B368B0(GlobalContext *arg0, s32 arg1, Gfx **arg2, Vec3f *arg3, Vec3s *arg5, Actor *actor, Gfx **gfx); /* static */
void func_80B368F0(GlobalContext *arg0, s32 arg1, Gfx **arg2, Vec3s *arg3, Actor *arg4, Gfx **gfx); /* static */
extern AnimationHeader D_0600F578;
extern FlexSkeletonHeader D_0600F6C0;
static ColliderCylinderInit D_80B36C00 = {
    {0xA, 0, 0, 0x39, 0x10, 1},
    {0, {0, 0, 0}, {0xF7CFFFFF, 0, 0}, 0, 1, 1},
    {0x18, 0x48, 0, {0, 0, 0}},
};
static CollisionCheckInfoInit2 D_80B36C2C = {0, 0x18, 0x48, 0, 0xFF};
static DamageTable D_80B36C38 = {
    {
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
    },
};
static ActorAnimationEntry D_80B36C58 = {
    {(AnimationHeader *)0x600F578, 1.0f, 0.0f, 0.0f, 0, -10.0f},
    {(AnimationHeader *)0x600D528, 1.0f, 0.0f, 0.0f, 2, -10.0f},
    {(AnimationHeader *)0x600D174, 1.0f, 0.0f, 0.0f, 2, -10.0f},
    {(AnimationHeader *)0x600ECC0, 1.0f, 0.0f, 0.0f, 2, -10.0f},
    {(AnimationHeader *)0x600BAF0, 1.0f, 0.0f, 0.0f, 0, -10.0f},
    {(AnimationHeader *)0x600AF40, 1.0f, 0.0f, 0.0f, 0, -10.0f},
    {(AnimationHeader *)0x600F578, 1.0f, 0.0f, 0.0f, 0, -10.0f},
    {(AnimationHeader *)0x600AF40, 1.0f, 0.0f, 0.0f, 0, -10.0f},
    {(AnimationHeader *)0x600F578, 1.0f, 0.0f, 0.0f, 0, -10.0f},
    {(AnimationHeader *)0x60100C8, 1.0f, 0.0f, 0.0f, 0, 0.0f},
    {(AnimationHeader *)0x600CDA0, 1.0f, 0.0f, 0.0f, 0, 0.0f},
    {(AnimationHeader *)0x600B560, 1.0f, 0.0f, 0.0f, 0, 0.0f},
    {(AnimationHeader *)0x600A4B4, 1.0f, 0.0f, 0.0f, 2, 0.0f},
    {(AnimationHeader *)0x600E86C, 1.0f, 0.0f, 0.0f, 2, 0.0f},
    {(AnimationHeader *)0x600D99C, 1.0f, 0.0f, 0.0f, 2, 0.0f},
    {(AnimationHeader *)0x600E2A4, 1.0f, 0.0f, 0.0f, 0, 0.0f},
};
static ? D_80B36DD8;                                /* unable to generate initializer */
static ? D_80B36DE4;                                /* unable to generate initializer */
static Vec3f D_80B36DF0 = {1800.0f, 300.0f, 200.0f};
static ? D_80B36DFC;                                /* unable to generate initializer */

typedef struct EnGg {
    /* 0x0000 */ Actor actor;
    /* 0x0144 */ ColliderCylinder unk144;           /* inferred */
    /* 0x0190 */ SkelAnime unk190;                  /* inferred */
    /* 0x01D4 */ void (*actionFunc)(EnGg *, GlobalContext *);
    /* 0x01D8 */ Vec3s unk1D8;                      /* inferred */
    /* 0x01DE */ Vec3s unk1DE;                      /* inferred */
    /* 0x01E4 */ Vec3s unk1E4;                      /* inferred */
    /* 0x01EA */ char pad1EA[0x72];                 /* maybe part of unk1E4[20]? */
    /* 0x025C */ Vec3s unk25C;                      /* inferred */
    /* 0x0262 */ char pad262[0x78];                 /* maybe part of unk25C[21]? */
    /* 0x02DA */ u8 unk2DA;                         /* inferred */
    /* 0x02DB */ char pad2DB[0x1];                  /* maybe part of unk2DA[2]? */
    /* 0x02DC */ s16 unk2DC;                        /* inferred */
    /* 0x02DE */ char pad2DE[0x4];                  /* maybe part of unk2DC[3]? */
    /* 0x02E2 */ s16 unk2E2;                        /* inferred */
    /* 0x02E4 */ s16 unk2E4;                        /* inferred */
    /* 0x02E6 */ s16 unk2E6;                        /* inferred */
    /* 0x02E8 */ s16 unk2E8;                        /* inferred */
    /* 0x02EA */ char pad2EA[0x1A];                 /* maybe part of unk2E8[14]? */
    /* 0x0304 */ s16 unk304;                        /* inferred */
    /* 0x0306 */ char pad306[0x2];                  /* maybe part of unk304[2]? */
    /* 0x0308 */ u8 unk308;                         /* inferred */
    /* 0x0309 */ u8 unk309;                         /* inferred */
    /* 0x030A */ s16 unk30A;                        /* inferred */
    /* 0x030C */ char pad30C[0x4];                  /* maybe part of unk30A[3]? */
    /* 0x0310 */ f32 unk310;                        /* inferred */
    /* 0x0314 */ char pad314[0x30];                 /* maybe part of unk310[13]? */
    /* 0x0344 */ ? unk344;                          /* inferred */
    /* 0x0345 */ char pad345[0x2F];
    /* 0x0374 */ u8 unk374;                         /* inferred */
    /* 0x0375 */ char pad375[0x3];                  /* maybe part of unk374[4]? */
    /* 0x0378 */ ? (*unk378)(void *, void *, void *); /* inferred */
    /* 0x037C */ ? (*unk37C)(? *, GlobalContext *, GraphicsContext *); /* inferred */
    /* 0x0380 */ char pad380[0x10];                 /* maybe part of unk37C[5]? */
} EnGg;                                             /* size 0x390 */

void func_80B34F70(EnGg *arg0) {
    arg0->actor.focus.pos.y = arg0->actor.world.pos.y + 80.0f;
    arg0->actor.focus.pos.x = arg0->actor.world.pos.x;
    arg0->actor.focus.pos.z = arg0->actor.world.pos.z;
    arg0->actor.focus.rot.x = arg0->actor.world.rot.x;
    arg0->actor.focus.rot.y = arg0->actor.world.rot.y;
    arg0->actor.focus.rot.z = arg0->actor.world.rot.z;
}

? func_80B34FB4(EnGg *arg0, GlobalContext *arg1) {
    f32 sp44;
    Vec3f sp40;
    f32 sp38;
    Vec3f sp34;
    f32 temp_f0;
    s16 temp_v0_2;
    void *temp_v0;
    s16 phi_v1;

    temp_v0 = arg1->actorCtx.actorList[2].first;
    sp40.x = temp_v0->world.pos.x;
    sp40.y = temp_v0->world.pos.y;
    sp40.z = temp_v0->world.pos.z;
    sp44 = temp_v0->unkC44 + 3.0f;
    sp34.x = arg0->actor.world.pos.x;
    sp34.y = arg0->actor.world.pos.y;
