s32 func_800C5A64(CollisionContext *, Vec3f *, f32); /* extern */
s32 func_80B1E29C(EnPp *arg0);                      /* static */
void func_80B1E3D4(EnPp *arg0, GlobalContext *arg1); /* static */
void func_80B1E5A8(EnPp *arg0, s32 arg1);           /* static */
void func_80B1E680(Actor *arg0);                    /* static */
s32 func_80B1E778(EnPp *arg0, GlobalContext *arg1); /* static */
void func_80B1E958(EnPp *arg0);                     /* static */
void func_80B1E970(EnPp *arg0, GlobalContext *arg1); /* static */
void func_80B1EBD8(EnPp *arg0, EnPp *);             /* static */
void func_80B1EC24(EnPp *arg0, GlobalContext *arg1); /* static */
void func_80B1EFFC(EnPp *arg0);                     /* static */
void func_80B1F048(EnPp *arg0, GlobalContext *arg1); /* static */
void func_80B1F0A4(EnPp *arg0);                     /* static */
void func_80B1F188(EnPp *arg0, GlobalContext *arg1); /* static */
void func_80B1F244(EnPp *arg0);                     /* static */
void func_80B1F29C(EnPp *arg0, GlobalContext *arg1); /* static */
void func_80B1F4A0(EnPp *arg0, s32);                /* static */
void func_80B1F560(EnPp *arg0, GlobalContext *arg1); /* static */
void func_80B1F664(EnPp *arg0);                     /* static */
void func_80B1F6B4(Actor *arg0, GlobalContext *arg1); /* static */
void func_80B1F770(Actor *arg0, GlobalContext *arg1); /* static */
void func_80B1F940(EnPp *arg0, GlobalContext *arg1); /* static */

void func_80B1FC7C(EnPp *arg0, GlobalContext *arg1); /* static */
void func_80B1FF20(EnPp *arg0, GlobalContext *arg1); /* static */
void func_80B20030(EnPp *arg0, GlobalContext *arg1); /* static */
void func_80B202B8(EnPp *arg0);                     /* static */
void func_80B203BC(EnPp *arg0, GlobalContext *arg1); /* static */
void func_80B20668(EnPp *arg0, GlobalContext *arg1); /* static */
s32 func_80B20E6C(GlobalContext *arg0, s32 arg1, Gfx **arg2, Vec3f *arg3, Vec3s *arg4, Actor *arg5); /* static */
void func_80B20F70(GlobalContext *arg0, s32 arg1, Gfx **arg2, Vec3s *arg3, Actor *arg4); /* static */
extern AnimationHeader D_0600A844;
extern FlexSkeletonHeader D_06012768;
static s32 D_80B21620 = 0;
static DamageTable D_80B21624 = {
    {
        0x10,
        0xF1,
        0,
        0xC1,
        0xF1,
        0xF1,
        0,
        0xD1,
        0xC1,
        0xF1,
        0xE0,
        0x21,
        0x31,
        0x42,
        0xF1,
        0x10,
        0xF1,
        0xC2,
        0x10,
        0x50,
        0,
        0,
        0xF1,
        0xF1,
        0xF1,
        0,
        0,
        0,
        0,
        0,
        0,
        0xC1,
    },
};
static ColliderJntSphElementInit D_80B21664 = {
    {2, {0xF7CFFFFF, 4, 0x10}, {0xF7CFFFFF, 0, 0}, 1, 5, 1},
    {1, {{0, 0, 0}, 0}, 1},
};
static ColliderJntSphInit D_80B21688 = {{0xC, 0x11, 9, 0x39, 0x10, 0}, 1, &D_80B21664};
static ColliderJntSphElementInit D_80B21698 = {{0, {0xF7CFFFFF, 4, 4}, {0xF7CFFFFF, 0, 0}, 1, 5, 1}, {1, {{0, 0, 0}, 0}, 1}};
static ColliderJntSphInit D_80B216BC = {{0xC, 0x11, 9, 0x39, 0x10, 0}, 1, &D_80B21698};
static ColliderQuadInit D_80B216CC = {
    {0xA, 0x11, 0, 0, 0, 3},
    {0, {0xF7CFFFFF, 4, 8}, {0, 0, 0}, 0x81, 0, 0},
    {
        {
            {0.0f, 0.0f, 0.0f},
            {0.0f, 0.0f, 0.0f},
            {0.0f, 0.0f, 0.0f},
            {0.0f, 0.0f, 0.0f},
        },
    },
};
static Color_RGBA8 D_80B2171C = {0x3C, 0x32, 0x14, 0xFF};
static Color_RGBA8 D_80B21720 = {0x28, 0x1E, 0x1E, 0xFF};
static ? D_80B21724;                                /* unable to generate initializer */
static ? D_80B2174C;                                /* unable to generate initializer */
static s16 D_80B21758 = {0, 0x1000, 0xF000};
static ? D_80B2175E;                                /* unable to generate initializer */
static s32 D_80B21760 = {
    0x3F800000,
    0,
    0x3F000000,
    0x3F800000,
    0,
    0xBF000000,
    0xBF800000,
    0,
    0x3F000000,
    0xBF800000,
    0,
    0xBF000000,
    0x3F000000,
    0,
    0x3F800000,
    0xBF000000,
    0,
    0x3F800000,
    0x3F000000,
    0,
    0xBF800000,
    0xBF000000,
    0,
    0xBF800000,
    0,
    0,
    0,
};
static Vec3f D_80B217CC;                            /* type too large by 8; unable to generate initializer */
static f32 D_80B217D0 = 0.0f;
static Vec3f D_80B217D8;                            /* type too large by 8; unable to generate initializer */
static f32 D_80B217DC = 0.0f;
static f32 D_80B217E0 = 0.0f;

typedef struct EnPp {
    /* 0x0000 */ Actor actor;
    /* 0x0144 */ SkelAnime unk144;                  /* inferred */
    /* 0x0188 */ Vec3s unk188;                      /* inferred */
    /* 0x018E */ char pad18E[0x96];                 /* maybe part of unk188[26]? */
    /* 0x0224 */ Vec3s unk224;                      /* inferred */
    /* 0x022A */ char pad22A[0x96];                 /* maybe part of unk224[26]? */
    /* 0x02C0 */ void (*actionFunc)(EnPp *, GlobalContext *);
    /* 0x02C4 */ s16 unk2C4;                        /* inferred */
    /* 0x02C6 */ s16 unk2C6;                        /* inferred */
    /* 0x02C8 */ s16 unk2C8;                        /* inferred */
    /* 0x02CA */ s16 unk2CA;                        /* inferred */
    /* 0x02CC */ s16 unk2CC;                        /* inferred */
    /* 0x02CE */ s16 unk2CE;                        /* inferred */
    /* 0x02D0 */ s16 unk2D0;                        /* inferred */
    /* 0x02D2 */ s16 unk2D2;                        /* inferred */
    /* 0x02D4 */ s16 unk2D4;                        /* inferred */
    /* 0x02D6 */ char pad2D6[0x2];                  /* maybe part of unk2D4[2]? */
    /* 0x02D8 */ f32 unk2D8;                        /* inferred */
    /* 0x02DC */ f32 unk2DC;                        /* inferred */
    /* 0x02E0 */ f32 unk2E0;                        /* inferred */
    /* 0x02E4 */ f32 unk2E4;                        /* inferred */
    /* 0x02E8 */ f32 unk2E8;                        /* inferred */
    /* 0x02EC */ char pad2EC[0x18];                 /* maybe part of unk2E8[7]? */
    /* 0x0304 */ f32 unk304;                        /* inferred */
    /* 0x0308 */ f32 unk308;                        /* inferred */
    /* 0x030C */ f32 unk30C;                        /* inferred */
    /* 0x0310 */ f32 unk310;                        /* inferred */
    /* 0x0314 */ char pad314[0x4];                  /* maybe part of unk310[2]? */
    /* 0x0318 */ f32 unk318;                        /* inferred */
    /* 0x031C */ char pad31C[0xC];                  /* maybe part of unk318[4]? */
    /* 0x0328 */ Vec3f unk328;                      /* inferred */
    /* 0x0334 */ f32 unk334;                        /* inferred */
    /* 0x0338 */ f32 unk338;                        /* inferred */
    /* 0x033C */ f32 unk33C;                        /* inferred */
    /* 0x0340 */ char pad340[0x8];                  /* maybe part of unk33C[3]? */
    /* 0x0348 */ f32 unk348;                        /* inferred */
    /* 0x034C */ f32 unk34C;                        /* inferred */
    /* 0x0350 */ f32 unk350;                        /* inferred */
    /* 0x0354 */ f32 unk354;                        /* inferred */
    /* 0x0358 */ f32 unk358;                        /* inferred */
    /* 0x035C */ char pad35C[0x4];                  /* maybe part of unk358[2]? */
    /* 0x0360 */ f32 unk360;                        /* inferred */
    /* 0x0364 */ Vec3f unk364;                      /* inferred */
    /* 0x0370 */ s32 unk370;                        /* inferred */
    /* 0x0374 */ Vec3f unk374;                      /* inferred */
    /* 0x0380 */ char pad380[0x6C];                 /* maybe part of unk374[10]? */
    /* 0x03EC */ s16 unk3EC;                        /* inferred */
    /* 0x03EE */ char pad3EE[0x2];                  /* maybe part of unk3EC[2]? */
    /* 0x03F0 */ s16 unk3F0;                        /* inferred */
    /* 0x03F2 */ s16 unk3F2;                        /* inferred */
    /* 0x03F4 */ s16 unk3F4;                        /* inferred */
    /* 0x03F6 */ char pad3F6[0x2];                  /* maybe part of unk3F4[2]? */
    /* 0x03F8 */ f32 unk3F8;                        /* inferred */
    /* 0x03FC */ f32 unk3FC;                        /* inferred */
    /* 0x0400 */ f32 unk400;                        /* inferred */
    /* 0x0404 */ s32 unk404;                        /* inferred */
    /* 0x0408 */ Vec3f unk408;                      /* inferred */
    /* 0x0414 */ char pad414[0x7C];
    /* 0x0490 */ f32 unk490;                        /* inferred */
    /* 0x0494 */ ColliderJntSph unk494;             /* inferred */
    /* 0x04B4 */ ColliderJntSphElement unk4B4;      /* inferred */
    /* 0x04F4 */ ColliderJntSph unk4F4;             /* inferred */
    /* 0x0514 */ ColliderJntSphElement unk514;      /* inferred */
    /* 0x0554 */ ColliderQuad unk554;               /* inferred */
    /* 0x05D4 */ CollisionPoly *unk5D4;             /* inferred */
    /* 0x05D8 */ s32 unk5D8;                        /* inferred */
    /* 0x05DC */ s32 unk5DC;                        /* inferred */
    /* 0x05E0 */ f32 unk5E0;                        /* inferred */
    /* 0x05E4 */ char pad5E4[0x4];                  /* maybe part of unk5E0[2]? */
    /* 0x05E8 */ f32 unk5E8;                        /* inferred */
} EnPp;                                             /* size 0x5EC */

void EnPp_Init(Actor *thisx, GlobalContext *globalCtx) {
    EnPp *this = (EnPp *) thisx;
    s32 sp1E0;
    s32 sp1DC;
    s32 sp1D8;
    s8 sp1D7;
    s8 sp1D6;
    s8 sp1D5;
    s8 sp1D4;
    s8 sp1D3;
    s8 sp1D2;
    s8 sp1D1;
    s8 sp1D0;
    s8 sp1CF;
    s8 sp1CE;
    s8 sp1CD;
    s8 sp1CC;
    s8 sp1CB;
    s8 sp1CA;
    s8 sp1C9;
    s8 sp1C8;
    void sp44;
    ColliderQuad *sp34;
    ColliderQuad *temp_a1;
    s16 temp_v0;
    s16 temp_v0_2;
    s16 temp_v0_3;
    s32 phi_v0;

    this->actor.targetMode = 4;
    this->actor.colChkInfo.mass = 0x3C;
    this->actor.colChkInfo.health = 3;
    this->actor.colChkInfo.damageTable = &D_80B21624;
    SkelAnime_InitSV(globalCtx, &this->unk144, &D_06012768, &D_0600A844, &this->unk188, &this->unk224, 0x1A);
    temp_v0 = this->actor.world.rot.z;
    if (temp_v0 == 0) {
