typedef struct EnPp {
    /* 0x000 */ Actor actor;
    /* 0x144 */ SkelAnime unk_144;                  /* inferred */
    /* 0x188 */ Vec3s unk_188;                      /* inferred */
    /* 0x18E */ char pad_18E[0x96];                 /* maybe part of unk_188[26]? */
    /* 0x224 */ Vec3s unk_224;                      /* inferred */
    /* 0x22A */ char pad_22A[0x96];                 /* maybe part of unk_224[26]? */
    /* 0x2C0 */ void (*actionFunc)(EnPp *, GlobalContext *);
    /* 0x2C4 */ s16 unk_2C4;                        /* inferred */
    /* 0x2C6 */ s16 unk_2C6;                        /* inferred */
    /* 0x2C8 */ s16 unk_2C8;                        /* inferred */
    /* 0x2CA */ s16 unk_2CA;                        /* inferred */
    /* 0x2CC */ s16 unk_2CC;                        /* inferred */
    /* 0x2CE */ s16 unk_2CE;                        /* inferred */
    /* 0x2D0 */ s16 unk_2D0;                        /* inferred */
    /* 0x2D2 */ s16 unk_2D2;                        /* inferred */
    /* 0x2D4 */ s16 unk_2D4;                        /* inferred */
    /* 0x2D6 */ char pad_2D6[0x52];                 /* maybe part of unk_2D4[42]? */
    /* 0x328 */ Vec3f unk_328;                      /* inferred */
    /* 0x334 */ f32 unk_334;                        /* inferred */
    /* 0x338 */ f32 unk_338;                        /* inferred */
    /* 0x33C */ f32 unk_33C;                        /* inferred */
    /* 0x340 */ char pad_340[0x8];                  /* maybe part of unk_33C[3]? */
    /* 0x348 */ f32 unk_348;                        /* inferred */
    /* 0x34C */ f32 unk_34C;                        /* inferred */
    /* 0x350 */ f32 unk_350;                        /* inferred */
    /* 0x354 */ f32 unk_354;                        /* inferred */
    /* 0x358 */ f32 unk_358;                        /* inferred */
    /* 0x35C */ char pad_35C[0x4];
    /* 0x360 */ f32 unk_360;                        /* inferred */
    /* 0x364 */ Vec3f unk_364;                      /* inferred */
    /* 0x370 */ s32 unk_370;                        /* inferred */
    /* 0x374 */ Vec3f unk_374;                      /* inferred */
    /* 0x380 */ char pad_380[0x6C];                 /* maybe part of unk_374[10]? */
    /* 0x3EC */ s16 unk_3EC;                        /* inferred */
    /* 0x3EE */ char pad_3EE[0x2];
    /* 0x3F0 */ s16 unk_3F0;                        /* inferred */
    /* 0x3F2 */ s16 unk_3F2;                        /* inferred */
    /* 0x3F4 */ s16 unk_3F4;                        /* inferred */
    /* 0x3F6 */ char pad_3F6[0x2];
    /* 0x3F8 */ f32 unk_3F8;                        /* inferred */
    /* 0x3FC */ f32 unk_3FC;                        /* inferred */
    /* 0x400 */ f32 unk_400;                        /* inferred */
    /* 0x404 */ s32 unk_404;                        /* inferred */
    /* 0x408 */ Vec3f unk_408;                      /* inferred */
    /* 0x414 */ char pad_414[0x7C];                 /* maybe part of unk_408[11]? */
    /* 0x490 */ f32 unk_490;                        /* inferred */
    /* 0x494 */ ColliderJntSph unk_494;             /* inferred */
    /* 0x4B4 */ ColliderJntSphElement unk_4B4;      /* inferred */
    /* 0x4F4 */ ColliderJntSph unk_4F4;             /* inferred */
    /* 0x514 */ ColliderJntSphElement unk_514;      /* inferred */
    /* 0x554 */ ColliderQuad unk_554;               /* inferred */
    /* 0x5D4 */ CollisionPoly *unk_5D4;             /* inferred */
    /* 0x5D8 */ s32 unk_5D8;                        /* inferred */
    /* 0x5DC */ char pad_5DC[0x4];
    /* 0x5E0 */ f32 unk_5E0;                        /* inferred */
    /* 0x5E4 */ char pad_5E4[0x4];
    /* 0x5E8 */ f32 unk_5E8;                        /* inferred */
} EnPp;                                             /* size = 0x5EC */

struct _mips2c_stack_EnPp_Destroy {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_EnPp_Draw {
    /* 0x00 */ char pad_0[0x4C];
    /* 0x4C */ GraphicsContext *sp4C;               /* inferred */
    /* 0x50 */ f32 sp50;                            /* inferred */
    /* 0x54 */ char pad_54[0x4];
    /* 0x58 */ f32 sp58;                            /* inferred */
    /* 0x5C */ f32 sp5C;                            /* inferred */
    /* 0x60 */ f32 sp60;                            /* inferred */
    /* 0x64 */ ? sp64;                              /* inferred */
    /* 0x64 */ char pad_64[0x44];
};                                                  /* size = 0xA8 */

struct _mips2c_stack_EnPp_Init {
    /* 0x000 */ char pad_0[0x34];
    /* 0x034 */ ColliderQuad *sp34;                 /* inferred */
    /* 0x038 */ char pad_38[0xC];                   /* maybe part of sp34[4]? */
    /* 0x044 */ ? sp44;                             /* inferred */
    /* 0x044 */ char pad_44[0x184];
    /* 0x1C8 */ s8 sp1C8;                           /* inferred */
    /* 0x1C9 */ s8 sp1C9;                           /* inferred */
    /* 0x1CA */ s8 sp1CA;                           /* inferred */
    /* 0x1CB */ s8 sp1CB;                           /* inferred */
    /* 0x1CC */ s8 sp1CC;                           /* inferred */
    /* 0x1CD */ s8 sp1CD;                           /* inferred */
    /* 0x1CE */ s8 sp1CE;                           /* inferred */
    /* 0x1CF */ s8 sp1CF;                           /* inferred */
    /* 0x1D0 */ s8 sp1D0;                           /* inferred */
    /* 0x1D1 */ s8 sp1D1;                           /* inferred */
    /* 0x1D2 */ s8 sp1D2;                           /* inferred */
    /* 0x1D3 */ s8 sp1D3;                           /* inferred */
    /* 0x1D4 */ s8 sp1D4;                           /* inferred */
    /* 0x1D5 */ s8 sp1D5;                           /* inferred */
    /* 0x1D6 */ s8 sp1D6;                           /* inferred */
    /* 0x1D7 */ s8 sp1D7;                           /* inferred */
    /* 0x1D8 */ s32 sp1D8;                          /* inferred */
    /* 0x1DC */ s32 sp1DC;                          /* inferred */
    /* 0x1E0 */ s32 sp1E0;                          /* inferred */
    /* 0x1E4 */ char pad_1E4[0x4];
};                                                  /* size = 0x1E8 */

struct _mips2c_stack_EnPp_Update {
    /* 0x00 */ char pad_0[0x30];
    /* 0x30 */ ColliderJntSph *sp30;                /* inferred */
    /* 0x34 */ CollisionCheckContext *sp34;         /* inferred */
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ WaterBox *sp3C;                      /* inferred */
    /* 0x40 */ char pad_40[0x8];
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_80B1E29C {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ Vec3f *sp20;                         /* inferred */
    /* 0x24 */ Vec3f *sp24;                         /* inferred */
    /* 0x28 */ char pad_28[0x4];
    /* 0x2C */ f32 sp2C;                            /* inferred */
    /* 0x30 */ char pad_30[0x4];
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ char pad_38[0x2];
    /* 0x3A */ s16 sp3A;                            /* inferred */
    /* 0x3C */ f32 sp3C;                            /* inferred */
    /* 0x40 */ char pad_40[0x8];
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_80B1E3D4 {
    /* 0x00 */ char pad_0[0x98];
    /* 0x98 */ f32 sp98;                            /* inferred */
    /* 0x9C */ f32 sp9C;                            /* inferred */
    /* 0xA0 */ f32 spA0;                            /* inferred */
    /* 0xA4 */ f32 spA4;                            /* inferred */
    /* 0xA8 */ f32 spA8;                            /* inferred */
    /* 0xAC */ f32 spAC;                            /* inferred */
    /* 0xB0 */ f32 spB0;                            /* inferred */
    /* 0xB4 */ f32 spB4;                            /* inferred */
    /* 0xB8 */ f32 spB8;                            /* inferred */
    /* 0xBC */ char pad_BC[0x4];
};                                                  /* size = 0xC0 */

struct _mips2c_stack_func_80B1E5A8 {
    /* 0x00 */ char pad_0[0x34];
    /* 0x34 */ f32 sp34;                            /* inferred */
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80B1E680 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B1E778 {
    /* 0x00 */ char pad_0[0x50];
    /* 0x50 */ Vec3f *sp50;                         /* inferred */
    /* 0x54 */ char pad_54[0xC];
};                                                  /* size = 0x60 */

struct _mips2c_stack_func_80B1E958 {};              /* size 0x0 */

struct _mips2c_stack_func_80B1E970 {
    /* 0x00 */ char pad_0[0x34];
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ char pad_38[0x4];
    /* 0x3C */ f32 sp3C;                            /* inferred */
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80B1EBD8 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B1EC24 {
    /* 0x00 */ char pad_0[0x30];
    /* 0x30 */ f32 *sp30;                           /* inferred */
    /* 0x34 */ char pad_34[0x8];                    /* maybe part of sp30[3]? */
    /* 0x3C */ f32 sp3C;                            /* inferred */
    /* 0x40 */ char pad_40[0x4];
    /* 0x44 */ f32 sp44;                            /* inferred */
    /* 0x48 */ char pad_48[0x4];
    /* 0x4C */ f32 sp4C;                            /* inferred */
};                                                  /* size = 0x50 */

struct _mips2c_stack_func_80B1EFFC {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B1F048 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ f32 sp1C;                            /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80B1F0A4 {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ f32 sp2C;                            /* inferred */
    /* 0x30 */ char pad_30[0x4];
    /* 0x34 */ f32 sp34;                            /* inferred */
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80B1F188 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80B1F244 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B1F29C {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ f32 sp20;                            /* inferred */
    /* 0x24 */ void *sp24;                          /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80B1F4A0 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B1F560 {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ f32 sp2C;                            /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80B1F664 {};              /* size 0x0 */

struct _mips2c_stack_func_80B1F6B4 {
    /* 0x00 */ char pad_0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80B1F770 {
    /* 0x00 */ char pad_0[0x44];
    /* 0x44 */ f32 sp44;                            /* inferred */
    /* 0x48 */ char pad_48[0x4];
    /* 0x4C */ f32 sp4C;                            /* inferred */
};                                                  /* size = 0x50 */

struct _mips2c_stack_func_80B1F940 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ void *sp24;                          /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80B1FAD0 {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ Vec3f *sp2C;                         /* inferred */
    /* 0x30 */ char pad_30[0x4];
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ char pad_38[0x4];
    /* 0x3C */ f32 sp3C;                            /* inferred */
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80B1FC7C {
    /* 0x00 */ char pad_0[0x5C];
    /* 0x5C */ f32 sp5C;                            /* inferred */
    /* 0x60 */ WaterBox *sp60;                      /* inferred */
    /* 0x64 */ f32 sp64;                            /* inferred */
    /* 0x68 */ char pad_68[0x4];
    /* 0x6C */ f32 sp6C;                            /* inferred */
};                                                  /* size = 0x70 */

struct _mips2c_stack_func_80B1FF20 {
    /* 0x00 */ char pad_0[0x38];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80B20030 {
    /* 0x00 */ char pad_0[0x60];
    /* 0x60 */ ? sp60;                              /* inferred */
    /* 0x60 */ char pad_60[0x6C];
    /* 0xCC */ f32 spCC;                            /* inferred */
    /* 0xD0 */ f32 spD0;                            /* inferred */
    /* 0xD4 */ f32 spD4;                            /* inferred */
};                                                  /* size = 0xD8 */

struct _mips2c_stack_func_80B202B8 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80B203BC {
    /* 0x00 */ char pad_0[0x70];
    /* 0x70 */ f32 sp70;                            /* inferred */
    /* 0x74 */ WaterBox *sp74;                      /* inferred */
    /* 0x78 */ f32 sp78;                            /* inferred */
    /* 0x7C */ char pad_7C[0x4];
    /* 0x80 */ f32 sp80;                            /* inferred */
    /* 0x84 */ char pad_84[0x4];
};                                                  /* size = 0x88 */

struct _mips2c_stack_func_80B20668 {
    /* 0x00 */ char pad_0[0x3C];
    /* 0x3C */ s32 sp3C;                            /* inferred */
    /* 0x40 */ s32 sp40;                            /* inferred */
    /* 0x44 */ char pad_44[0x4];
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_80B20E6C {};              /* size 0x0 */

struct _mips2c_stack_func_80B20F70 {
    /* 0x00 */ char pad_0[0x38];
    /* 0x38 */ Vec3f *sp38;                         /* inferred */
    /* 0x3C */ Vec3f *sp3C;                         /* inferred */
    /* 0x40 */ Vec3f *sp40;                         /* inferred */
    /* 0x44 */ Vec3f *sp44;                         /* inferred */
    /* 0x48 */ char pad_48[0x4];
    /* 0x4C */ ? sp4C;                              /* inferred */
    /* 0x4C */ char pad_4C[0xC];
    /* 0x58 */ ? sp58;                              /* inferred */
    /* 0x58 */ char pad_58[0x10];
};                                                  /* size = 0x68 */

s32 func_800C5A64(CollisionContext *, Vec3f *, f32); /* extern */
s32 func_80B1E29C(EnPp *arg0);                      /* static */
void func_80B1E3D4(EnPp *arg0, GlobalContext *arg1); /* static */
void func_80B1E5A8(EnPp *arg0, s32 arg1);           /* static */
void func_80B1E680(Actor *arg0);                    /* static */
s32 func_80B1E778(EnPp *arg0, GlobalContext *arg1); /* static */
void func_80B1E958(EnPp *arg0);                     /* static */
void func_80B1E970(EnPp *arg0, GlobalContext *arg1); /* static */
void func_80B1EBD8(EnPp *arg0, EnPp *);             /* static */
void func_80B1EC24(EnPp *arg0, GlobalContext *arg1); /* static */
void func_80B1EFFC(EnPp *arg0);                     /* static */
void func_80B1F048(EnPp *arg0, ? arg1);             /* static */
void func_80B1F0A4(EnPp *arg0);                     /* static */
