u8 *func_8013BEDC(GlobalContext *, s32, ?, s32 *);  /* extern */
void func_808D8940(EnSw *arg0, GlobalContext *arg1); /* static */
? func_808D8B58(Actor *arg0);                       /* static */
s16 func_808D8D60(Actor *arg0, GlobalContext *arg1, s32 arg2); /* static */
void func_808D8ED0(Actor *arg0, GlobalContext *arg1); /* static */
void func_808D8FC4(EnSw *arg0, GlobalContext *arg1); /* static */
u8 func_808D90C4(Actor *arg0);                      /* static */
void func_808D90F0(Actor *arg0, s32 arg1, s16 arg2); /* static */
? func_808D91C4(Actor *arg0, CollisionPoly *arg1);  /* static */
void func_808D93BC(Actor *arg0);                    /* static */
s32 func_808D9440(Vec3f *arg0, Vec3f *arg1, Vec3f *arg2, Vec3f *arg3, CollisionPoly **arg4, u32 *arg5, CollisionPoly **, s32 *); /* static */
void func_808D94D0(Actor *arg0, Vec3f *arg1, s32 arg2, s32 arg3, s16 arg4); /* static */
void func_808D9894(EnSw *arg0, Vec3f *arg1);        /* static */
s32 func_808D9968(EnSw *arg0, GlobalContext *arg1); /* static */
s32 func_808D99C8(Actor *arg0, GlobalContext *arg1); /* static */
? func_808D9A70(Actor *arg0, Vec3f *arg1, EnSw *);  /* static */
? func_808D9C18(Actor *arg0);                       /* static */
void func_808D9DA0(Actor *arg0);                    /* static */
void func_808D9E44(Actor *arg0, s32, s32, s32);     /* static */
void func_808D9F08(EnSw *arg0);                     /* static */
void func_808D9F78(Actor *arg0, GlobalContext *arg1, s32 arg2); /* static */
void func_808DA024(Actor *arg0, Vec3f *arg1);       /* static */
s32 func_808DA08C(Actor *arg0, GlobalContext *arg1); /* static */
s32 func_808DB7F4(GlobalContext *arg0, s32 arg1, Gfx **arg2, Vec3f *arg3, Vec3s *arg5, Actor *actor); /* static */
extern Gfx D_06003FB0;
extern Gfx D_060043D8;
extern Gfx D_060045C0;
extern Gfx D_06004658;
extern Gfx D_060046F0;
extern Gfx D_06004788;
extern Gfx D_06004820;
extern Gfx D_060048B8;
extern Gfx D_06004950;
extern Gfx D_060049E8;
extern SkeletonHeader D_06005298;
static ColliderSphereInit D_808DB9E0 = {
    {0xA, 0x11, 9, 0x39, 0x10, 4},
    {0, {0xF7CFFFFF, 0, 0}, {0xF7CFFFFF, 0, 0}, 1, 1, 1},
    {0, {{0, 0, 0}, 0x10}, 0x64},
};
static CollisionCheckInfoInit2 D_808DBA0C = {1, 0, 0, 0, 0xFF};
static DamageTable D_808DBA18 = {
    {
        1,
        1,
        0,
        1,
        1,
        1,
        0,
        1,
        1,
        1,
        2,
        0x22,
        0x32,
        0x42,
        1,
        1,
        1,
        2,
        1,
        0x51,
        1,
        1,
        1,
        1,
        1,
        0,
        0,
        0,
        0,
        0,
        0,
        1,
    },
};
static CollisionCheckInfoInit2 D_808DBA38 = {1, 0, 0, 0, 0xFF};
static DamageTable D_808DBA44 = {
    {
        0x10,
        1,
        0,
        1,
        1,
        1,
        0,
        1,
        1,
        1,
        2,
        0x22,
        0x32,
        0x42,
        1,
        1,
        1,
        2,
        0x10,
        0x51,
        1,
        1,
        1,
        1,
        1,
        0,
        0,
        0,
        0,
        0,
        0,
        1,
    },
};
static ActorAnimationEntryS D_808DBA64 = {
    {(AnimationHeader *)0x6000304, 1.0f, 0, 0xFFFF, 3, 0},
    {(AnimationHeader *)0x6000304, 1.0f, 0, 0xFFFF, 3, 0xFFFC},
    {(AnimationHeader *)0x60055A8, 1.0f, 0, 0xFFFF, 1, 0xFFFC},
    {(AnimationHeader *)0x6005B98, 1.0f, 0, 0xFFFF, 1, 0xFFFC},
};
static Color_RGBA8 D_808DBAA4 = {0xAA, 0x82, 0x5A, 0xFF};
static Color_RGBA8 D_808DBAA8 = {0x64, 0x3C, 0x14, 0};
static Vec3f D_808DBAAC = {0.0f, 1.0f, 0.0f};

typedef struct EnSw {
    /* 0x0000 */ Actor actor;
    /* 0x0144 */ SkelAnime unk144;                  /* inferred */
    /* 0x0154 */ f32 unk154;                        /* overlap; inferred */
    /* 0x0158 */ char pad158[0x30];                 /* maybe part of unk154[13]? */
    /* 0x0188 */ void (*actionFunc)(EnSw *, GlobalContext *);
    /* 0x018C */ ColliderSphere unk18C;             /* inferred */
    /* 0x01E4 */ u8 *unk1E4;                        /* inferred */
    /* 0x01E8 */ Vec3s unk1E8;                      /* inferred */
    /* 0x01EE */ char pad1EE[0xAE];                 /* maybe part of unk1E8[30]? */
    /* 0x029C */ Vec3s unk29C;                      /* inferred */
    /* 0x02A2 */ char pad2A2[0xAE];                 /* maybe part of unk29C[30]? */
    /* 0x0350 */ f32 unk350;                        /* inferred */
    /* 0x0354 */ f32 unk354;                        /* inferred */
    /* 0x0358 */ f32 unk358;                        /* inferred */
    /* 0x035C */ f32 unk35C;                        /* inferred */
    /* 0x0360 */ f32 unk360;                        /* inferred */
    /* 0x0364 */ f32 unk364;                        /* inferred */
    /* 0x0368 */ f32 unk368;                        /* inferred */
    /* 0x036C */ f32 unk36C;                        /* inferred */
    /* 0x0370 */ f32 unk370;                        /* inferred */
    /* 0x0374 */ Vec3f unk374;                      /* inferred */
    /* 0x0380 */ char pad380[0x90];                 /* maybe part of unk374[13]? */
    /* 0x0410 */ u16 unk410;                        /* inferred */
    /* 0x0412 */ u8 unk412;                         /* inferred */
    /* 0x0413 */ char pad413[0x1];                  /* maybe part of unk412[2]? */
    /* 0x0414 */ f32 unk414;                        /* inferred */
    /* 0x0418 */ char pad418[0x30];                 /* maybe part of unk414[13]? */
    /* 0x0448 */ f32 unk448;                        /* inferred */
    /* 0x044C */ f32 unk44C;                        /* inferred */
    /* 0x0450 */ f32 unk450;                        /* inferred */
    /* 0x0454 */ s16 unk454;                        /* inferred */
    /* 0x0456 */ s16 unk456;                        /* inferred */
    /* 0x0458 */ s16 unk458;                        /* inferred */
    /* 0x045A */ s16 unk45A;                        /* inferred */
    /* 0x045C */ s16 unk45C;                        /* inferred */
    /* 0x045E */ s16 unk45E;                        /* inferred */
    /* 0x0460 */ s16 unk460;                        /* inferred */
    /* 0x0462 */ s16 unk462;                        /* inferred */
    /* 0x0464 */ s16 unk464;                        /* inferred */
    /* 0x0466 */ char pad466[0x32];                 /* maybe part of unk464[26]? */
    /* 0x0498 */ s16 unk498;                        /* inferred */
    /* 0x049A */ char pad49A[0x2];                  /* maybe part of unk498[2]? */
    /* 0x049C */ s32 unk49C;                        /* inferred */
    /* 0x04A0 */ s32 unk4A0;                        /* inferred */
} EnSw;                                             /* size 0x4A4 */

void func_808D8940(EnSw *arg0, GlobalContext *arg1) {
    Vec3f spB8;
    Vec3f spAC;
    f32 spA8;
    f32 spA4;
    f32 spA0;
    f32 sp9C;
    f32 sp98;
    f32 sp94;
    f32 *temp_s5;
    f32 temp_f4;
    s16 temp_s0;
    s32 temp_s1;
    s16 phi_s0;
    s32 phi_s1;

    temp_s0 = (s16) (s32) ((Rand_ZeroOne() - 0.5f) * 65536.0f);
    temp_s5 = &sp94;
    spA4 = arg0->actor.floorHeight;
    phi_s0 = temp_s0;
    phi_s1 = 0;
    do {
        temp_f4 = Rand_ZeroOne() * 4.0f;
        sp94 = 0.0f;
        sp98 = (Rand_ZeroOne() * 0.2f) + 0.1f;
        sp9C = Rand_ZeroOne() + 1.0f;
        Lib_Vec3f_TranslateAndRotateY(&D_801D15B0, phi_s0, (Vec3f *) temp_s5, &spAC);
        sp94 = 0.0f;
        sp98 = 0.7f;
        sp9C = 2.0f;
        Lib_Vec3f_TranslateAndRotateY(&D_801D15B0, phi_s0, (Vec3f *) temp_s5, &spB8);
