typedef struct EnJso {
    /* 0x000 */ Actor actor;
    /* 0x144 */ SkelAnime unk_144;                  /* inferred */
    /* 0x188 */ Vec3s unk_188;                      /* inferred */
    /* 0x18E */ ? unk_18E;                          /* inferred */
    /* 0x18E */ char pad_18E[0x6];
    /* 0x194 */ ? unk_194;                          /* inferred */
    /* 0x194 */ char pad_194[0x6];
    /* 0x19A */ ? unk_19A;                          /* inferred */
    /* 0x19A */ char pad_19A[0x66];
    /* 0x200 */ Vec3s unk_200;                      /* inferred */
    /* 0x206 */ char pad_206[0x72];                 /* maybe part of unk_200[20]? */
    /* 0x278 */ void (*actionFunc)(EnJso *, GlobalContext *);
    /* 0x27C */ s16 unk_27C;                        /* inferred */
    /* 0x27E */ s16 unk_27E;                        /* inferred */
    /* 0x280 */ s16 unk_280;                        /* inferred */
    /* 0x282 */ s16 unk_282;                        /* inferred */
    /* 0x284 */ char pad_284[0x2];
    /* 0x286 */ s16 unk_286;                        /* inferred */
    /* 0x288 */ s16 unk_288;                        /* inferred */
    /* 0x28A */ s16 unk_28A;                        /* inferred */
    /* 0x28C */ s16 unk_28C;                        /* inferred */
    /* 0x28E */ s16 unk_28E;                        /* inferred */
    /* 0x290 */ s16 unk_290;                        /* inferred */
    /* 0x292 */ s16 unk_292;                        /* inferred */
    /* 0x294 */ s16 unk_294;                        /* inferred */
    /* 0x296 */ s16 unk_296;                        /* inferred */
    /* 0x298 */ s16 unk_298;                        /* inferred */
    /* 0x29A */ s16 unk_29A;                        /* inferred */
    /* 0x29C */ s16 unk_29C;                        /* inferred */
    /* 0x29E */ s16 unk_29E;                        /* inferred */
    /* 0x2A0 */ s16 unk_2A0;                        /* inferred */
    /* 0x2A2 */ s16 unk_2A2;                        /* inferred */
    /* 0x2A4 */ s16 unk_2A4;                        /* inferred */
    /* 0x2A6 */ s16 unk_2A6;                        /* inferred */
    /* 0x2A8 */ s16 unk_2A8;                        /* inferred */
    /* 0x2AA */ s16 unk_2AA;                        /* inferred */
    /* 0x2AC */ char pad_2AC[0x8];                  /* maybe part of unk_2AA[5]? */
    /* 0x2B4 */ Vec3f unk_2B4;                      /* inferred */
    /* 0x2C0 */ char pad_2C0[0x86];                 /* maybe part of unk_2B4[12]? */
    /* 0x346 */ s16 unk_346;                        /* inferred */
    /* 0x348 */ s16 unk_348;                        /* inferred */
    /* 0x34A */ s16 unk_34A;                        /* inferred */
    /* 0x34C */ u8 unk_34C;                         /* inferred */
    /* 0x34D */ u8 unk_34D;                         /* inferred */
    /* 0x34E */ u8 unk_34E;                         /* inferred */
    /* 0x34F */ char pad_34F[0x1];
    /* 0x350 */ f32 unk_350;                        /* inferred */
    /* 0x354 */ f32 unk_354;                        /* inferred */
    /* 0x358 */ char pad_358[0x4];
    /* 0x35C */ ColliderCylinder unk_35C;           /* inferred */
    /* 0x3A8 */ ColliderQuad unk_3A8;               /* inferred */
    /* 0x428 */ ColliderQuad unk_428;               /* inferred */
    /* 0x4A8 */ s32 unk_4A8;                        /* inferred */
    /* 0x4AC */ s32 unk_4AC;                        /* inferred */
    /* 0x4B0 */ s16 unk_4B0;                        /* inferred */
    /* 0x4B2 */ char pad_4B2[0x2];
    /* 0x4B4 */ s32 unk_4B4;                        /* inferred */
    /* 0x4B8 */ s16 unk_4B8;                        /* inferred */
    /* 0x4BA */ char pad_4BA[0x2];
    /* 0x4BC */ u32 unk_4BC;                        /* inferred */
    /* 0x4C0 */ u16 unk_4C0;                        /* inferred */
    /* 0x4C2 */ s16 unk_4C2;                        /* inferred */
    /* 0x4C4 */ char pad_4C4[0x4];                  /* maybe part of unk_4C2[3]? */
    /* 0x4C8 */ Vec3f unk_4C8;                      /* inferred */
    /* 0x4D4 */ Vec3f unk_4D4;                      /* inferred */
    /* 0x4E0 */ ? unk_4E0;                          /* inferred */
    /* 0x4E0 */ char pad_4E0[0x4];
    /* 0x4E4 */ f32 unk_4E4;                        /* inferred */
    /* 0x4E8 */ f32 unk_4E8;                        /* inferred */
    /* 0x4EC */ f32 unk_4EC;                        /* inferred */
    /* 0x4F0 */ f32 unk_4F0;                        /* inferred */
    /* 0x4F4 */ f32 unk_4F4;                        /* inferred */
    /* 0x4F8 */ f32 unk_4F8;                        /* inferred */
    /* 0x4FC */ f32 unk_4FC;                        /* inferred */
    /* 0x500 */ f32 unk_500;                        /* inferred */
    /* 0x504 */ char pad_504[0x10];                 /* maybe part of unk_500[5]? */
    /* 0x514 */ s16 unk_514;                        /* inferred */
    /* 0x516 */ char pad_516[0xACA];                /* maybe part of unk_514[1382]? */
    /* 0xFE0 */ Vec3f unk_FE0;                      /* inferred */
} EnJso;                                            /* size = 0xFEC */

struct _mips2c_stack_EnJso_Destroy {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_EnJso_Init {
    /* 0x000 */ char pad_0[0x4C];
    /* 0x04C */ ? sp4C;                             /* inferred */
    /* 0x04C */ char pad_4C[0x184];
    /* 0x1D0 */ s8 sp1D0;                           /* inferred */
    /* 0x1D1 */ s8 sp1D1;                           /* inferred */
    /* 0x1D2 */ s8 sp1D2;                           /* inferred */
    /* 0x1D3 */ s8 sp1D3;                           /* inferred */
    /* 0x1D4 */ s8 sp1D4;                           /* inferred */
    /* 0x1D5 */ s8 sp1D5;                           /* inferred */
    /* 0x1D6 */ s8 sp1D6;                           /* inferred */
    /* 0x1D7 */ s8 sp1D7;                           /* inferred */
    /* 0x1D8 */ s8 sp1D8;                           /* inferred */
    /* 0x1D9 */ s8 sp1D9;                           /* inferred */
    /* 0x1DA */ s8 sp1DA;                           /* inferred */
    /* 0x1DB */ s8 sp1DB;                           /* inferred */
    /* 0x1DC */ s8 sp1DC;                           /* inferred */
    /* 0x1DD */ s8 sp1DD;                           /* inferred */
    /* 0x1DE */ s8 sp1DE;                           /* inferred */
    /* 0x1DF */ s8 sp1DF;                           /* inferred */
    /* 0x1E0 */ s32 sp1E0;                          /* inferred */
    /* 0x1E4 */ s32 sp1E4;                          /* inferred */
    /* 0x1E8 */ s32 sp1E8;                          /* inferred */
    /* 0x1EC */ ? sp1EC;                            /* inferred */
    /* 0x1EC */ char pad_1EC[0x184];
    /* 0x370 */ s8 sp370;                           /* inferred */
    /* 0x371 */ s8 sp371;                           /* inferred */
    /* 0x372 */ s8 sp372;                           /* inferred */
    /* 0x373 */ s8 sp373;                           /* inferred */
    /* 0x374 */ s8 sp374;                           /* inferred */
    /* 0x375 */ s8 sp375;                           /* inferred */
    /* 0x376 */ s8 sp376;                           /* inferred */
    /* 0x377 */ s8 sp377;                           /* inferred */
    /* 0x378 */ s8 sp378;                           /* inferred */
    /* 0x379 */ s8 sp379;                           /* inferred */
    /* 0x37A */ s8 sp37A;                           /* inferred */
    /* 0x37B */ s8 sp37B;                           /* inferred */
    /* 0x37C */ s8 sp37C;                           /* inferred */
    /* 0x37D */ s8 sp37D;                           /* inferred */
    /* 0x37E */ s8 sp37E;                           /* inferred */
    /* 0x37F */ s8 sp37F;                           /* inferred */
    /* 0x380 */ s32 sp380;                          /* inferred */
    /* 0x384 */ s32 sp384;                          /* inferred */
    /* 0x388 */ s32 sp388;                          /* inferred */
    /* 0x38C */ char pad_38C[0x4];
};                                                  /* size = 0x390 */

struct _mips2c_stack_EnJso_Update {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ ColliderCylinder *sp2C;              /* inferred */
    /* 0x30 */ CollisionCheckContext *sp30;         /* inferred */
    /* 0x34 */ char pad_34[0xC];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_809ADBC8 {
    /* 0x00 */ char pad_0[0x28];
    /* 0x28 */ AnimationHeaderCommon **sp28;        /* inferred */
    /* 0x2C */ f32 sp2C;                            /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_809ADC7C {};              /* size 0x0 */

struct _mips2c_stack_func_809ADCB8 {
    /* 0x00 */ char pad_0[0x38];
    /* 0x38 */ f32 *sp38;                           /* inferred */
    /* 0x3C */ Vec3f *sp3C;                         /* inferred */
    /* 0x40 */ f32 *sp40;                           /* inferred */
    /* 0x44 */ PosRot *sp44;                        /* inferred */
    /* 0x48 */ char pad_48[0x16];                   /* maybe part of sp44[6]? */
    /* 0x5E */ s16 sp5E;                            /* inferred */
    /* 0x60 */ f32 sp60;                            /* inferred */
    /* 0x64 */ Actor *sp64;                         /* inferred */
};                                                  /* size = 0x68 */

struct _mips2c_stack_func_809AE754 {
    /* 0x00 */ char pad_0[0x38];
    /* 0x38 */ PosRot *sp38;                        /* inferred */
    /* 0x3C */ char pad_3C[0x4];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_809AE87C {
    /* 0x00 */ char pad_0[0x3C];
    /* 0x3C */ f32 sp3C;                            /* inferred */
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_809AE9B0 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ void *sp1C;                          /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_809AEA08 {
    /* 0x00 */ char pad_0[0x28];
    /* 0x28 */ SkelAnime *sp28;                     /* inferred */
    /* 0x2C */ char pad_2C[0x8];                    /* maybe part of sp28[3]? */
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ f32 sp3C;                            /* inferred */
    /* 0x40 */ Actor *sp40;                         /* inferred */
    /* 0x44 */ f32 sp44;                            /* inferred */
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_809AECA8 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809AED00 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809AED54 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809AEDAC {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_809AEE44 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809AEEC0 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ f32 sp24;                            /* inferred */
    /* 0x28 */ f32 sp28;                            /* inferred */
    /* 0x2C */ f32 sp2C;                            /* inferred */
    /* 0x30 */ char pad_30[0x8];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_809AF064 {
    /* 0x00 */ char pad_0[0x38];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_809AF110 {
    /* 0x00 */ char pad_0[0x40];
    /* 0x40 */ f32 sp40;                            /* inferred */
    /* 0x44 */ f32 sp44;                            /* inferred */
    /* 0x48 */ f32 sp48;                            /* inferred */
    /* 0x4C */ f32 sp4C;                            /* inferred */
};                                                  /* size = 0x50 */

struct _mips2c_stack_func_809AF28C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809AF2F8 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809AF368 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809AF3C0 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809AF3FC {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809AF440 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809AF470 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ ? sp24;                              /* inferred */
    /* 0x24 */ char pad_24[0xC];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_809AF53C {
    /* 0x00 */ char pad_0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_809AF5F8 {
    /* 0x00 */ char pad_0[0x34];
    /* 0x34 */ ? sp34;                              /* inferred */
    /* 0x34 */ char pad_34[0xC];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_809AF714 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809AF76C {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809AF7F4 {
    /* 0x00 */ char pad_0[0x2C];
    /* 0x2C */ f32 sp2C;                            /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_809AF8D0 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_809AF99C {
    /* 0x00 */ char pad_0[0x34];
    /* 0x34 */ f32 sp34;                            /* inferred */
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_809AFA58 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809AFAF4 {
    /* 0x00 */ char pad_0[0x1C];
    /* 0x1C */ Actor *sp1C;                         /* inferred */
    /* 0x20 */ Actor *sp20;                         /* inferred */
    /* 0x24 */ char pad_24[0x4];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_809AFC10 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_809AFE38 {
    /* 0x000 */ char pad_0[0x74];
    /* 0x074 */ Actor *sp74;                        /* inferred */
    /* 0x078 */ char pad_78[0x10];                  /* maybe part of sp74[5]? */
    /* 0x088 */ ? sp88;                             /* inferred */
    /* 0x088 */ char pad_88[0x6C];
    /* 0x0F4 */ f32 spF4;                           /* inferred */
    /* 0x0F8 */ f32 spF8;                           /* inferred */
    /* 0x0FC */ f32 spFC;                           /* inferred */
};                                                  /* size = 0x100 */

struct _mips2c_stack_func_809B0034 {
    /* 0x00 */ char pad_0[0x3C];
    /* 0x3C */ s32 sp3C;                            /* inferred */
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_809B0734 {};              /* size 0x0 */

struct _mips2c_stack_func_809B0820 {
    /* 0x00 */ char pad_0[0x28];
    /* 0x28 */ Vec3f *sp28;                         /* inferred */
    /* 0x2C */ Vec3f *sp2C;                         /* inferred */
    /* 0x30 */ Vec3f *sp30;                         /* inferred */
    /* 0x34 */ Vec3f *sp34;                         /* inferred */
    /* 0x38 */ char pad_38[0x4];
    /* 0x3C */ ? sp3C;                              /* inferred */
    /* 0x3C */ char pad_3C[0xC];
    /* 0x48 */ ? sp48;                              /* inferred */
    /* 0x48 */ char pad_48[0x10];
};                                                  /* size = 0x58 */

struct _mips2c_stack_func_809B0B70 {};              /* size 0x0 */

struct _mips2c_stack_func_809B0BB0 {
    /* 0x00 */ char pad_0[0x50];
};                                                  /* size = 0x50 */

? func_800F0590(GlobalContext *, PosRot *, ?, ?);   /* extern */
? func_8016981C(GlobalContext *, s16, Vec3f *, PosRot *, ? *); /* extern */
? func_801A0654(Vec3f *, ?, ?);                     /* extern */
void func_809ADBC8(EnJso *arg0, s32 arg1, EnJso *); /* static */
void func_809ADC7C(EnJso *arg0);                    /* static */
void func_809AE754(EnJso *arg0, GlobalContext *arg1, EnJso *, GlobalContext *); /* static */
void func_809AE9B0(EnJso *arg0, GlobalContext *arg1); /* static */
void func_809AECA8(Actor *arg0, s32);               /* static */
void func_809AED54(EnJso *arg0);                    /* static */
void func_809AEE44(EnJso *arg0);                    /* static */
void func_809AF064(EnJso *arg0, GlobalContext *arg1); /* static */
void func_809AF28C(EnJso *arg0);                    /* static */
void func_809AF368(EnJso *arg0);                    /* static */
