typedef struct EnRailSkb {
    /* 0x000 */ Actor actor;
    /* 0x144 */ ColliderJntSph unk144;              /* inferred */
    /* 0x164 */ ColliderJntSphElement unk164;       /* inferred */
    /* 0x1A4 */ char pad1A4[0x40];
    /* 0x1E4 */ SkelAnime unk1E4;                   /* inferred */
    /* 0x228 */ void (*actionFunc)(EnRailSkb *, GlobalContext *);
    /* 0x22C */ void *unk22C;                       /* inferred */
    /* 0x230 */ char pad230[0x4];
    /* 0x234 */ Vec3f unk234;                       /* inferred */
    /* 0x240 */ char pad240[0x9C];                  /* maybe part of unk234[14]? */
    /* 0x2DC */ s32 unk2DC;                         /* inferred */
    /* 0x2E0 */ s32 unk2E0;                         /* inferred */
    /* 0x2E4 */ s32 unk2E4;                         /* inferred */
    /* 0x2E8 */ s32 unk2E8;                         /* inferred */
    /* 0x2EC */ f32 unk2EC;                         /* inferred */
    /* 0x2F0 */ f32 unk2F0;                         /* inferred */
    /* 0x2F4 */ Vec3s unk2F4;                       /* inferred */
    /* 0x2FA */ char pad2FA[0x72];                  /* maybe part of unk2F4[20]? */
    /* 0x36C */ Vec3s unk36C;                       /* inferred */
    /* 0x372 */ char pad372[0x7E];                  /* maybe part of unk36C[22]? */
    /* 0x3F0 */ s16 unk3F0;                         /* inferred */
    /* 0x3F2 */ s16 unk3F2;                         /* inferred */
    /* 0x3F4 */ s16 unk3F4;                         /* inferred */
    /* 0x3F6 */ s16 unk3F6;                         /* inferred */
    /* 0x3F8 */ s16 unk3F8;                         /* inferred */
    /* 0x3FA */ s16 unk3FA;                         /* inferred */
    /* 0x3FC */ s16 unk3FC;                         /* inferred */
    /* 0x3FE */ s16 unk3FE;                         /* inferred */
    /* 0x400 */ u16 unk400;                         /* inferred */
    /* 0x402 */ u8 unk402;                          /* inferred */
    /* 0x403 */ u8 unk403;                          /* inferred */
} EnRailSkb;                                        /* size = 0x404 */

struct _mips2c_stack_EnRailSkb_Destroy {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnRailSkb_Draw {
    /* 0x00 */ char pad0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_EnRailSkb_Init {
    /* 0x00 */ char pad0[0x34];
    /* 0x34 */ ColliderJntSph *sp34;                /* inferred */
    /* 0x38 */ char pad38[0x8];
};                                                  /* size = 0x40 */

struct _mips2c_stack_EnRailSkb_Update {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80B708C0 {
    /* 0x00 */ char pad0[0x70];
    /* 0x70 */ f32 sp70;                            /* inferred */
    /* 0x74 */ f32 sp74;                            /* inferred */
    /* 0x78 */ f32 sp78;                            /* inferred */
    /* 0x7C */ char pad7C[0x4];
};                                                  /* size = 0x80 */

struct _mips2c_stack_func_80B70AB4 {};              /* size 0x0 */

struct _mips2c_stack_func_80B70B04 {
    /* 0x00 */ char pad0[0x4C];
    /* 0x4C */ s32 sp4C;                            /* inferred */
    /* 0x50 */ char pad50[0x4];
    /* 0x54 */ s32 sp54;                            /* inferred */
    /* 0x58 */ f32 sp58;                            /* inferred */
    /* 0x5C */ f32 sp5C;                            /* inferred */
    /* 0x60 */ f32 sp60;                            /* inferred */
    /* 0x64 */ f32 sp64;                            /* inferred */
    /* 0x68 */ char pad68[0x8];
};                                                  /* size = 0x70 */

struct _mips2c_stack_func_80B70D24 {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80B70FA0 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B70FF8 {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80B710AC {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B710E4 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B71114 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B7114C {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80B71228 {};              /* size 0x0 */

struct _mips2c_stack_func_80B7123C {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80B712FC {};              /* size 0x0 */

struct _mips2c_stack_func_80B71314 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B71354 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B713A4 {
    /* 0x00 */ char pad0[0x2C];
    /* 0x2C */ SkelAnime *sp2C;                     /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80B71488 {};              /* size 0x0 */

struct _mips2c_stack_func_80B714D8 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B7151C {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B715AC {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80B71650 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B716A8 {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80B717C8 {};              /* size 0x0 */

struct _mips2c_stack_func_80B717E0 {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80B718B0 {};              /* size 0x0 */

struct _mips2c_stack_func_80B718C4 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B71910 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B71954 {
    /* 0x00 */ char pad0[0x2C];
    /* 0x2C */ PosRot *sp2C;                        /* inferred */
    /* 0x30 */ f32 sp30;                            /* inferred */
    /* 0x34 */ char pad34[0x2];
    /* 0x36 */ s16 sp36;                            /* inferred */
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80B71A08 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B71A58 {
    /* 0x00 */ char pad0[0x2C];
    /* 0x2C */ SkelAnime *sp2C;                     /* inferred */
    /* 0x30 */ char pad30[0x6];                     /* maybe part of sp2C[2]? */
    /* 0x36 */ s16 sp36;                            /* inferred */
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80B71B6C {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B71BB8 {
    /* 0x00 */ char pad0[0x34];
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ char pad38[0x8];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80B71D8C {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80B71DF0 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B71EA8 {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80B71F3C {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80B72100 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B72190 {
    /* 0x00 */ char pad0[0x2C];
    /* 0x2C */ SkelAnime *sp2C;                     /* inferred */
    /* 0x30 */ char pad30[0x2];
    /* 0x32 */ s16 sp32;                            /* inferred */
    /* 0x34 */ char pad34[0x4];                     /* maybe part of sp32[3]? */
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ f32 sp3C;                            /* inferred */
    /* 0x40 */ f32 sp40;                            /* inferred */
    /* 0x44 */ char pad44[0x4];
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_80B723F8 {};              /* size 0x0 */

struct _mips2c_stack_func_80B72430 {
    /* 0x00 */ char pad0[0x42];
    /* 0x42 */ s16 sp42;                            /* inferred */
    /* 0x44 */ f32 sp44;                            /* inferred */
    /* 0x48 */ char pad48[0x4];
    /* 0x4C */ f32 sp4C;                            /* inferred */
    /* 0x50 */ ? sp50;                              /* inferred */
    /* 0x50 */ char pad50[0x4];
    /* 0x54 */ f32 sp54;                            /* inferred */
    /* 0x58 */ char pad58[0x4];
    /* 0x5C */ f32 sp5C;                            /* inferred */
    /* 0x60 */ f32 sp60;                            /* inferred */
    /* 0x64 */ f32 sp64;                            /* inferred */
};                                                  /* size = 0x68 */

struct _mips2c_stack_func_80B725C0 {
    /* 0x00 */ char pad0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80B726B4 {
    /* 0x00 */ char pad0[0x84];
    /* 0x84 */ f32 sp84;                            /* inferred */
    /* 0x88 */ f32 sp88;                            /* inferred */
    /* 0x8C */ f32 sp8C;                            /* inferred */
};                                                  /* size = 0x90 */

struct _mips2c_stack_func_80B72830 {};              /* size 0x0 */

struct _mips2c_stack_func_80B7285C {};              /* size 0x0 */

struct _mips2c_stack_func_80B72880 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80B72970 {
    /* 0x00 */ char pad0[0x2C];
    /* 0x2C */ ColliderJntSph *sp2C;                /* inferred */
    /* 0x30 */ CollisionCheckContext *sp30;         /* inferred */
    /* 0x34 */ char pad34[0x8];                     /* maybe part of sp30[3]? */
    /* 0x3C */ void *sp3C;                          /* inferred */
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80B72E88 {
    /* 0x00 */ char pad0[0x24];
    /* 0x24 */ ? sp24;                              /* inferred */
    /* 0x24 */ char pad24[0x18];
    /* 0x3C */ void *sp3C;                          /* inferred */
    /* 0x40 */ char pad40[0x8];
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_80B7302C {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

void func_80B708C0(Actor *arg0, GlobalContext *arg1); /* static */
s32 func_80B70AB4(s32 arg0, f32 arg1, f32 arg2, f32 arg3); /* static */
s32 func_80B70B04(Actor *arg0, f32 arg1, s32 arg2, f32 arg3); /* static */
void func_80B70D24(Actor *arg0, GlobalContext *arg1); /* static */
void func_80B70FA0(EnRailSkb *arg0, GlobalContext *); /* static */
void func_80B710AC(Actor *arg0);                    /* static */
void func_80B71114(Actor *arg0);                    /* static */
void func_80B71228(EnRailSkb *arg0);                /* static */
void func_80B712FC(EnRailSkb *arg0);                /* static */
void func_80B71354(EnRailSkb *arg0);                /* static */
void func_80B71488(EnRailSkb *arg0);                /* static */
void func_80B7151C(Actor *arg0);                    /* static */
void func_80B71650(EnRailSkb *arg0);                /* static */
