s32 func_80A7429C(Actor *arg0, GlobalContext *arg1); /* static */
void func_80A7436C(Actor *arg0, s16 arg1);          /* static */
void func_80A74510(EnPr2 *arg0, s32 arg1, EnPr2 *); /* static */
void func_80A745C4(EnPr2 *arg0);                    /* static */
void func_80A745FC(Actor *arg0, GlobalContext *arg1); /* static */
void func_80A74888(EnPr2 *arg0, f32, EnPr2 *);      /* static */
void func_80A748E8(Actor *arg0, Actor *arg1);       /* static */
void func_80A74DEC(f32 arg0, Actor *arg1, Actor *); /* static */
void func_80A74E90(EnPr2 *, GlobalContext *);       /* static */
void func_80A751B4(EnPr2 *arg0);                    /* static */
void func_80A75310(EnPr2 *, GlobalContext *);       /* static */
void func_80A755D8(Actor *arg0, GlobalContext *arg1); /* static */
s32 func_80A758E8(GlobalContext *arg0, s32 arg1, Gfx **arg2, Vec3f *arg3, Vec3s *arg4, Actor *arg5); /* static */
void func_80A75950(GlobalContext *arg0, s32 arg1, Gfx **arg2, Vec3s *arg3, Actor *arg4); /* static */
s32 func_80A759D8(GlobalContext *arg0, s32 arg1, Gfx **arg2, Vec3f *arg3, Vec3s *arg4, Actor *arg5, Gfx **gfx); /* static */
extern AnimationHeaderCommon D_06003904;
extern FlexSkeletonHeader D_06004188;
extern AnimationHeader D_06004340;
static DamageTable D_80A75BC0 = {
    {
        0,
        0,
        0,
        0xF1,
        0xF1,
        0xF1,
        0,
        0xF1,
        0,
        0,
        0,
        0xF1,
        0xF1,
        0xF2,
        0,
        0,
        0xF1,
        0,
        0,
        0xF1,
        0,
        0,
        0,
        0xF1,
        0,
        0,
        0,
        0,
        0,
        0,
        0,
        0xF1,
    },
};
static ColliderCylinderInit D_80A75BE0 = {
    {0xA, 0x11, 9, 0x11, 0x10, 1},
    {0, {0xF7CFFFFF, 8, 4}, {0xF7CFFFFF, 0, 0}, 1, 1, 1},
    {0x11, 0x20, 0xFFF6, {0, 0, 0}},
};
static ? D_80A75C2C;                                /* unable to generate initializer */
static ? D_80A75C38;                                /* unable to generate initializer */
static ? D_80A75C3C;                                /* unable to generate initializer */

typedef struct ActorContext {
    /* 0x0000 */ Vec3f unk0;                        /* inferred */
    /* 0x0002 */ u8 unk2;                           /* overlap */
    /* 0x0003 */ u8 unk3;
    /* 0x0004 */ s8 unk4;
    /* 0x0005 */ u8 unk5;
    /* 0x0006 */ char pad6[0x5];                    /* maybe part of unk5[6]? */
    /* 0x000B */ s8 unkB;
    /* 0x000C */ s16 unkC;
    /* 0x000E */ u8 totalLoadedActors;
    /* 0x000F */ u8 undrawnActorCount;
    /* 0x0010 */ ActorListEntry actorList[12];
    /* 0x00A0 */ Actor *undrawnActors[32];
    /* 0x0120 */ TargetContext targetContext;
    /* 0x01B8 */ u32 switchFlags[4];
    /* 0x01C8 */ u32 chestFlags;
    /* 0x01CC */ u32 clearedRooms;
    /* 0x01D0 */ u32 clearedRoomsTemp;
    /* 0x01D4 */ u32 collectibleFlags[4];
    /* 0x01E4 */ TitleCardContext titleCtxt;
    /* 0x01F4 */ u8 unk1F4;
    /* 0x01F5 */ u8 unk1F5;
    /* 0x01F6 */ char pad1F6[0x2];                  /* maybe part of unk1F5[3]? */
    /* 0x01F8 */ f32 unk1F8;
    /* 0x01FC */ Vec3f unk1FC;
    /* 0x0208 */ char pad208[0x48];                 /* maybe part of unk1FC[7]? */
    /* 0x0250 */ void *unk250;
    /* 0x0254 */ u32 unk254[5];
    /* 0x0268 */ u8 unk268;
    /* 0x0269 */ char pad269[0xF];                  /* maybe part of unk268[16]? */
    /* 0x0278 */ u16 unk278;
    /* 0x027A */ char pad27A[0xA];                  /* maybe part of unk278[6]? */
} ActorContext;                                     /* size 0x284 */

typedef struct EnPr2 {
    /* 0x0000 */ Actor actor;
    /* 0x0144 */ SkelAnime unk144;                  /* inferred */
    /* 0x0188 */ Vec3s unk188;                      /* inferred */
    /* 0x018E */ char pad18E[0x18];                 /* maybe part of unk188[5]? */
    /* 0x01A6 */ Vec3s unk1A6;                      /* inferred */
    /* 0x01AC */ char pad1AC[0x18];                 /* maybe part of unk1A6[5]? */
    /* 0x01C4 */ void (*actionFunc)(EnPr2 *, GlobalContext *);
    /* 0x01C8 */ s16 unk1C8;                        /* inferred */
    /* 0x01CA */ char pad1CA[0x2];                  /* maybe part of unk1C8[2]? */
    /* 0x01CC */ Path *unk1CC;                      /* inferred */
    /* 0x01D0 */ char pad1D0[0x4];                  /* maybe part of unk1CC[2]? */
    /* 0x01D4 */ s16 unk1D4;                        /* inferred */
    /* 0x01D6 */ s16 unk1D6;                        /* inferred */
    /* 0x01D8 */ s16 unk1D8;                        /* inferred */
    /* 0x01DA */ s16 unk1DA;                        /* inferred */
    /* 0x01DC */ s16 unk1DC;                        /* inferred */
    /* 0x01DE */ s16 unk1DE;                        /* inferred */
    /* 0x01E0 */ s16 unk1E0;                        /* inferred */
    /* 0x01E2 */ char pad1E2[0x2];                  /* maybe part of unk1E0[2]? */
    /* 0x01E4 */ s16 unk1E4;                        /* inferred */
    /* 0x01E6 */ s16 unk1E6;                        /* inferred */
    /* 0x01E8 */ char pad1E8[0x4];                  /* maybe part of unk1E6[3]? */
    /* 0x01EC */ s16 unk1EC;                        /* inferred */
    /* 0x01EE */ s16 unk1EE;                        /* inferred */
    /* 0x01F0 */ s16 unk1F0;                        /* inferred */
    /* 0x01F2 */ char pad1F2[0x2];                  /* maybe part of unk1F0[2]? */
    /* 0x01F4 */ s16 unk1F4;                        /* inferred */
    /* 0x01F6 */ char pad1F6[0x2];                  /* maybe part of unk1F4[2]? */
    /* 0x01F8 */ f32 unk1F8;                        /* inferred */
    /* 0x01FC */ char pad1FC[0x4];                  /* maybe part of unk1F8[2]? */
    /* 0x0200 */ f32 unk200;                        /* inferred */
    /* 0x0204 */ f32 unk204;                        /* inferred */
    /* 0x0208 */ f32 unk208;                        /* inferred */
    /* 0x020C */ f32 unk20C;                        /* inferred */
    /* 0x0210 */ s32 unk210;                        /* inferred */
    /* 0x0214 */ char pad214[0x4];                  /* maybe part of unk210[2]? */
    /* 0x0218 */ s32 unk218;                        /* inferred */
    /* 0x021C */ Vec3f unk21C;                      /* inferred */
    /* 0x0228 */ Vec3f unk228;                      /* inferred */
    /* 0x0234 */ f32 unk234;                        /* inferred */
    /* 0x0238 */ f32 unk238;                        /* inferred */
    /* 0x023C */ f32 unk23C;                        /* inferred */
    /* 0x0240 */ char pad240[0x30];                 /* maybe part of unk23C[13]? */
    /* 0x0270 */ Vec3f unk270;                      /* inferred */
    /* 0x027C */ ColliderCylinder unk27C;           /* inferred */
} EnPr2;                                            /* size 0x2C8 */

void EnPr2_Init(Actor *thisx, GlobalContext *globalCtx) {
    EnPr2 *this = (EnPr2 *) thisx;
    Actor *sp34;
    Actor *temp_v1;
    Actor *temp_v1_3;
    s16 temp_v0;
    s16 temp_v1_2;

    this->actor.targetMode = 3;
    this->actor.hintId = 0x5B;
    this->unk1EC = 0xFF;
    this->actor.colChkInfo.health = 1;
    this->actor.colChkInfo.damageTable = &D_80A75BC0;
    SkelAnime_InitSV(globalCtx, &this->unk144, &D_06004188, &D_06004340, &this->unk188, &this->unk1A6, 5);
    this->actor.colChkInfo.mass = 0xA;
    this->unk1E0 = this->actor.params & 0xF;
    Math_Vec3f_Copy(&this->unk228, &this->actor.home.pos);
    if (this->unk1E0 == 2) {
        this->unk208 = (f32) (((s32) this->actor.params >> 4) & 0xFF) * 20.0f;
    }
    this->unk1F4 = 0xFF;
    this->actor.shape.yOffset = 500.0f;
    this->actor.shape.shadowScale = 12.0f;
