typedef struct EnPr2 {
    /* 0x000 */ Actor actor;
    /* 0x144 */ SkelAnime unk144;                   /* inferred */
    /* 0x188 */ Vec3s unk188;                       /* inferred */
    /* 0x18E */ char pad18E[0x18];                  /* maybe part of unk188[5]? */
    /* 0x1A6 */ Vec3s unk1A6;                       /* inferred */
    /* 0x1AC */ char pad1AC[0x18];                  /* maybe part of unk1A6[5]? */
    /* 0x1C4 */ void (*actionFunc)(EnPr2 *, GlobalContext *);
    /* 0x1C8 */ s16 unk1C8;                         /* inferred */
    /* 0x1CA */ char pad1CA[0x2];
    /* 0x1CC */ Path *unk1CC;                       /* inferred */
    /* 0x1D0 */ char pad1D0[0x4];
    /* 0x1D4 */ s16 unk1D4;                         /* inferred */
    /* 0x1D6 */ s16 unk1D6;                         /* inferred */
    /* 0x1D8 */ s16 unk1D8;                         /* inferred */
    /* 0x1DA */ s16 unk1DA;                         /* inferred */
    /* 0x1DC */ s16 unk1DC;                         /* inferred */
    /* 0x1DE */ s16 unk1DE;                         /* inferred */
    /* 0x1E0 */ s16 unk1E0;                         /* inferred */
    /* 0x1E2 */ char pad1E2[0x2];
    /* 0x1E4 */ s16 unk1E4;                         /* inferred */
    /* 0x1E6 */ s16 unk1E6;                         /* inferred */
    /* 0x1E8 */ char pad1E8[0x4];                   /* maybe part of unk1E6[3]? */
    /* 0x1EC */ s16 unk1EC;                         /* inferred */
    /* 0x1EE */ s16 unk1EE;                         /* inferred */
    /* 0x1F0 */ s16 unk1F0;                         /* inferred */
    /* 0x1F2 */ char pad1F2[0x2];
    /* 0x1F4 */ s16 unk1F4;                         /* inferred */
    /* 0x1F6 */ char pad1F6[0x2];
    /* 0x1F8 */ f32 unk1F8;                         /* inferred */
    /* 0x1FC */ char pad1FC[0x4];
    /* 0x200 */ f32 unk200;                         /* inferred */
    /* 0x204 */ f32 unk204;                         /* inferred */
    /* 0x208 */ f32 unk208;                         /* inferred */
    /* 0x20C */ f32 unk20C;                         /* inferred */
    /* 0x210 */ char pad210[0x8];                   /* maybe part of unk20C[3]? */
    /* 0x218 */ s32 unk218;                         /* inferred */
    /* 0x21C */ Vec3f unk21C;                       /* inferred */
    /* 0x228 */ Vec3f unk228;                       /* inferred */
    /* 0x234 */ char pad234[0x3C];                  /* maybe part of unk228[6]? */
    /* 0x270 */ Vec3f unk270;                       /* inferred */
    /* 0x27C */ ColliderCylinder unk27C;            /* inferred */
} EnPr2;                                            /* size = 0x2C8 */

struct _mips2c_stack_EnPr2_Destroy {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnPr2_Draw {
    /* 0x00 */ char pad0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_EnPr2_Init {
    /* 0x00 */ char pad0[0x34];
    /* 0x34 */ Actor *sp34;                         /* inferred */
    /* 0x38 */ char pad38[0x8];
};                                                  /* size = 0x40 */

struct _mips2c_stack_EnPr2_Update {
    /* 0x00 */ char pad0[0x58];
    /* 0x58 */ f32 sp58;                            /* inferred */
    /* 0x5C */ f32 sp5C;                            /* inferred */
    /* 0x60 */ f32 sp60;                            /* inferred */
    /* 0x64 */ char pad64[0xC];
};                                                  /* size = 0x70 */

struct _mips2c_stack_func_80A7429C {
    /* 0x00 */ char pad0[0x18];
    /* 0x18 */ s16 sp18;                            /* inferred */
    /* 0x1A */ s16 sp1A;                            /* inferred */
    /* 0x1C */ void *sp1C;                          /* inferred */
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80A7436C {
    /* 0x00 */ char pad0[0x2E];
    /* 0x2E */ s16 sp2E;                            /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80A74510 {
    /* 0x00 */ char pad0[0x30];
    /* 0x30 */ AnimationHeaderCommon **sp30;        /* inferred */
    /* 0x34 */ f32 sp34;                            /* inferred */
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80A745C4 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A745FC {
    /* 0x00 */ char pad0[0x2C];
    /* 0x2C */ PosRot *sp2C;                        /* inferred */
    /* 0x30 */ Vec3f *sp30;                         /* inferred */
    /* 0x34 */ char pad34[0x4];
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ char pad3C[0xC];
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_80A74888 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A748E8 {
    /* 0x00 */ char pad0[0x2C];
    /* 0x2C */ Vec3f *sp2C;                         /* inferred */
    /* 0x30 */ f32 *sp30;                           /* inferred */
    /* 0x34 */ char pad34[0x8];                     /* maybe part of sp30[3]? */
    /* 0x3C */ f32 sp3C;                            /* inferred */
    /* 0x40 */ char pad40[0x4];
    /* 0x44 */ f32 sp44;                            /* inferred */
    /* 0x48 */ s32 sp48;                            /* inferred */
    /* 0x4C */ s32 sp4C;                            /* inferred */
    /* 0x50 */ char pad50[0xC];                     /* maybe part of sp4C[4]? */
    /* 0x5C */ void *sp5C;                          /* inferred */
};                                                  /* size = 0x60 */

struct _mips2c_stack_func_80A74DEC {
    /* 0x00 */ char pad0[0x20];
    /* 0x20 */ Vec3f *sp20;                         /* inferred */
    /* 0x24 */ s32 sp24;                            /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80A74E90 {
    /* 0x00 */ char pad0[0x2C];
    /* 0x2C */ PosRot *sp2C;                        /* inferred */
    /* 0x30 */ Vec3f *sp30;                         /* inferred */
    /* 0x34 */ char pad34[0xC];                     /* maybe part of sp30[4]? */
    /* 0x40 */ WaterBox *sp40;                      /* inferred */
    /* 0x44 */ Actor *sp44;                         /* inferred */
};                                                  /* size = 0x48 */

struct _mips2c_stack_func_80A751B4 {
    /* 0x00 */ char pad0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80A75310 {
    /* 0x00 */ char pad0[0x58];
    /* 0x58 */ ActorContext *sp58;                  /* inferred */
    /* 0x5C */ char pad5C[0x8];                     /* maybe part of sp58[3]? */
    /* 0x64 */ f32 sp64;                            /* inferred */
    /* 0x68 */ f32 sp68;                            /* inferred */
    /* 0x6C */ f32 sp6C;                            /* inferred */
    /* 0x70 */ char pad70[0x4];
    /* 0x74 */ WaterBox *sp74;                      /* inferred */
    /* 0x78 */ char pad78[0x8];
};                                                  /* size = 0x80 */

struct _mips2c_stack_func_80A755D8 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80A758E8 {};              /* size 0x0 */

struct _mips2c_stack_func_80A75950 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80A759D8 {};              /* size 0x0 */

s32 func_80A7429C(Actor *arg0, GlobalContext *arg1); /* static */
void func_80A7436C(Actor *arg0, s16 arg1);          /* static */
void func_80A74510(EnPr2 *arg0, s32 arg1, EnPr2 *); /* static */
void func_80A745C4(EnPr2 *arg0);                    /* static */
void func_80A745FC(Actor *arg0, ? arg1);            /* static */
void func_80A74888(EnPr2 *arg0, f32, EnPr2 *);      /* static */
void func_80A748E8(Actor *arg0, Actor *arg1);       /* static */
void func_80A74DEC(f32 arg0, Actor *arg1, Actor *); /* static */
void func_80A74E90(EnPr2 *, GlobalContext *);       /* static */
void func_80A751B4(EnPr2 *arg0);                    /* static */
void func_80A75310(EnPr2 *, GlobalContext *);       /* static */
void func_80A755D8(Actor *arg0, GlobalContext *arg1); /* static */
