struct _mips2c_stack_EnGinkoMan_BankAward {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_EnGinkoMan_BankAward2 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_EnGinkoMan_DepositDialogue {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_EnGinkoMan_Destroy {};         /* size 0x0 */

struct _mips2c_stack_EnGinkoMan_Dialogue {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_EnGinkoMan_Draw {
    /* 0x00 */ char pad0[0x34];
    /* 0x34 */ Gfx *sp34;                           /* inferred */
    /* 0x38 */ Gfx *sp38;                           /* inferred */
    /* 0x3C */ char pad3C[0xC];
};                                                  /* size = 0x48 */

struct _mips2c_stack_EnGinkoMan_FacePlayer {
    /* 0x00 */ char pad0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_EnGinkoMan_Idle {
    /* 0x00 */ char pad0[0x24];
    /* 0x24 */ s32 sp24;                            /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_EnGinkoMan_Init {
    /* 0x00 */ char pad0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_EnGinkoMan_OverrideLimbDraw {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnGinkoMan_PostLimbDraw {};    /* size 0x0 */

struct _mips2c_stack_EnGinkoMan_SetupBankAward {};  /* size 0x0 */

struct _mips2c_stack_EnGinkoMan_SetupBankAward2 {}; /* size 0x0 */

struct _mips2c_stack_EnGinkoMan_SetupDialogue {};   /* size 0x0 */

struct _mips2c_stack_EnGinkoMan_SetupIdle {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnGinkoMan_SetupStamp {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnGinkoMan_Stamp {
    /* 0x00 */ char pad0[0x20];
    /* 0x20 */ SkelAnime *sp20;                     /* inferred */
    /* 0x24 */ char pad24[0x4];
};                                                  /* size = 0x28 */

struct _mips2c_stack_EnGinkoMan_SwitchAnimation {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnGinkoMan_Update {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnGinkoMan_WaitForDialogueInput {
    /* 0x00 */ char pad0[0x20];
    /* 0x20 */ void *sp20;                          /* inferred */
    /* 0x24 */ char pad24[0x4];
};                                                  /* size = 0x28 */

struct _mips2c_stack_EnGinkoMan_WaitForRupeeCount {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

void EnGinkoMan_FacePlayer(Actor *arg0, GlobalContext *arg1); /* static */
s32 EnGinkoMan_OverrideLimbDraw(GlobalContext *arg0, s32 arg1, Gfx **arg2, Vec3f *arg3, Vec3s *arg5, Actor *actor); /* static */
void EnGinkoMan_PostLimbDraw(GlobalContext *arg0, s32 arg1, Gfx **arg2, Vec3s *arg3, Actor *actor); /* static */
void EnGinkoMan_WaitForDialogueInput(Actor *arg0, GlobalContext *arg1); /* static */
void EnGinkoMan_WaitForRupeeCount(Actor *arg0, GlobalContext *arg1); /* static */
extern ? D_060008C0;
extern ? D_06000AC4;
extern AnimationHeader D_060043F0;
extern ? D_06004A7C;
extern Gfx D_0600B1D8;
extern FlexSkeletonHeader D_0600C240;
static ActorAnimationEntry animations[5] = {
    {(AnimationHeader *)0x60008C0, 1.0f, 0.0f, 0.0f, 0, -4.0f},
    {(AnimationHeader *)0x60043F0, 1.0f, 0.0f, 0.0f, 0, -4.0f},
    {(AnimationHeader *)0x6004F40, 1.0f, 0.0f, 0.0f, 2, -4.0f},
