void func_80A563CC(EnRat *arg0);                    /* static */
s32 func_80A56444(Actor *arg0, CollisionPoly *arg1, Vec3f *arg2); /* static */
void func_80A5665C(EnRat *arg0);                    /* static */
void func_80A566E0(Actor *arg0);                    /* static */
s32 func_80A56994(GlobalContext *arg0, Vec3f *arg1, Vec3f *arg2, Vec3f *arg3, CollisionPoly **arg4, u32 *arg5, s32 *); /* static */
s32 func_80A56AFC(Actor *arg0, Vec3f *arg1);        /* static */
void func_80A56EB8(Actor *arg0, ? *arg1, Vec3f *arg2); /* static */
void func_80A56F68(Actor *arg0, GlobalContext *arg1); /* static */
void func_80A57010(Actor *arg0, GlobalContext *arg1); /* static */
void func_80A57118(Actor *arg0, GlobalContext *arg1); /* static */
void func_80A57180(EnRat *arg0);                    /* static */
void func_80A5723C(EnRat *arg0, GlobalContext *arg1); /* static */
void func_80A57330(EnRat *arg0);                    /* static */
void func_80A57384(Actor *arg0, GlobalContext *arg1); /* static */
void func_80A57488(Actor *arg0);                    /* static */
void func_80A574E8(Actor *arg0, ? arg1);            /* static */
void func_80A57570(Actor *arg0);                    /* static */
void func_80A575F4(Actor *arg0);                    /* static */
void func_80A5764C(Actor *arg0, GlobalContext *arg1); /* static */
void func_80A57918(EnRat *arg0);                    /* static */
void func_80A57984(Actor *arg0, Vec3f *arg1);       /* static */
void func_80A57A08(Actor *arg0, Vec3f *arg1, u8);   /* static */
void func_80A57A9C(Actor *arg0, ? arg1);            /* static */
s32 func_80A57F10(GlobalContext *arg0, s32 arg1, Gfx **arg2, Vec3f *arg3, Vec3s *arg5, Actor *actor); /* static */
void func_80A57F4C(GraphicsContext **arg0, s32 arg1, Gfx **arg2, Vec3s *arg3, Actor *arg4); /* static */
extern ? D_04015DB0;
extern AnimationHeader D_06000174;
extern AnimationHeader D_0600026C;
extern FlexSkeletonHeader D_06001858;
static ColliderSphereInit D_80A58400;               /* type too large by 4; unable to generate initializer */
static s16 D_80A58428 = {0x17, 0x64};
static DamageTable D_80A5842C = {
    {
        0x10,
        1,
        1,
        1,
        1,
        1,
        0,
        0xF0,
        1,
        1,
        1,
        2,
        2,
        2,
        1,
        1,
        1,
        2,
        0x10,
        1,
        0,
        0,
        1,
        1,
        1,
        0,
        0,
        0,
        0,
        0,
        0,
        1,
    },
};
static CollisionCheckInfoInit D_80A5844C = {1, 0x1E, 0x1E, 0x32};
static void *D_80A58454 = {(void *)0x4091DE0, (void *)0x4091FE0, (void *)0x40921E0, (void *)0x40923E0};
static InitChainEntry D_80A58464;                   /* unable to generate initializer */
static void D_80A58470;                             /* unable to generate initializer */
static s32 D_80A58494 = 0;
static Vec3f D_80A58498 = {0.0f, 0.6f, 0.0f};
static Color_RGBA8 D_80A584A4 = {0xFF, 0xFF, 0xFF, 0xFF};
static ? D_80A584A8;                                /* unable to generate initializer */
static ? D_80A584B4;                                /* unable to generate initializer */
static ? D_80A584C0;                                /* unable to generate initializer */
static Vec3f D_80A584CC = {0.0f, 3.0f, 0.0f};

typedef struct EnRat {
    /* 0x0000 */ Actor actor;
    /* 0x0144 */ SkelAnime unk144;                  /* inferred */
    /* 0x0188 */ void (*unk188)(EnRat *, GlobalContext *); /* inferred */
    /* 0x018C */ u8 unk18C;                         /* inferred */
    /* 0x018D */ u8 unk18D;                         /* inferred */
    /* 0x018E */ s16 unk18E;                        /* inferred */
    /* 0x0190 */ s16 unk190;                        /* inferred */
    /* 0x0192 */ s16 unk192;                        /* inferred */
    /* 0x0194 */ Vec3s unk194;                      /* inferred */
    /* 0x019A */ char pad19A[0x36];                 /* maybe part of unk194[10]? */
    /* 0x01D0 */ Vec3s unk1D0;                      /* inferred */
    /* 0x01D6 */ char pad1D6[0x36];                 /* maybe part of unk1D0[10]? */
    /* 0x020C */ f32 unk20C;                        /* inferred */
    /* 0x0210 */ f32 unk210;                        /* inferred */
    /* 0x0214 */ f32 unk214;                        /* inferred */
    /* 0x0218 */ f32 unk218;                        /* inferred */
    /* 0x021C */ f32 unk21C;                        /* inferred */
    /* 0x0220 */ f32 unk220;                        /* inferred */
    /* 0x0224 */ f32 unk224;                        /* inferred */
    /* 0x0228 */ f32 unk228;                        /* inferred */
    /* 0x022C */ f32 unk22C;                        /* inferred */
    /* 0x0230 */ char pad230[0x28];                 /* maybe part of unk22C[11]? */
    /* 0x0258 */ f32 unk258;                        /* inferred */
    /* 0x025C */ f32 unk25C;                        /* inferred */
    /* 0x0260 */ s32 unk260;                        /* inferred */
    /* 0x0264 */ s32 unk264;                        /* inferred */
    /* 0x0268 */ ColliderSphere unk268;             /* inferred */
} EnRat;                                            /* size 0x2C0 */

void EnRat_Init(Actor *thisx, GlobalContext *globalCtx) {
    EnRat *this = (EnRat *) thisx;
    s16 temp_v1;
    s32 temp_s1;
    void **temp_s0;
    f32 phi_f4;
    void **phi_s0;

    Actor_ProcessInitChain(&this->actor, &D_80A58464);
    Collider_InitAndSetSphere(globalCtx, &this->unk268, &this->actor, &D_80A58400);
    temp_v1 = this->actor.params;
    temp_s1 = temp_v1 & 0xFF;
    this->unk268.dim.worldSphere.radius = D_80A58428;
    if ((temp_v1 & 0x8000) != 0) {
        this->actor.params = 1;
    } else {
        this->actor.params = 0;
    }
    SkelAnime_InitSV(globalCtx, &this->unk144, &D_06001858, &D_0600026C, &this->unk194, &this->unk1D0, 0xA);
    ActorShape_Init(&this->actor.shape, 0.0f, func_800B3FC0, 25.0f);
    if (this->actor.params == 0) {
        Effect_Add(globalCtx, &this->unk260, 2, 0U, (u8) 0, &D_80A58470);
