typedef struct EnArrow {
    /* 0x000 */ Actor actor;
    /* 0x144 */ SkelAnime unk144;                   /* inferred */
    /* 0x188 */ Vec3s unk188;                       /* inferred */
    /* 0x18E */ char pad18E[0x1A];                  /* maybe part of unk188[5]? */
    /* 0x1A8 */ ColliderQuad unk1A8;                /* inferred */
    /* 0x1C0 */ s32 unk_1C0;                        /* overlap */
    /* 0x1C4 */ char pad1C4[0x64];                  /* maybe part of unk_1C0[26]? */
    /* 0x228 */ Vec3f unk228;                       /* inferred */
    /* 0x234 */ Vec3f unk234;                       /* inferred */
    /* 0x240 */ s32 unk240;                         /* inferred */
    /* 0x244 */ char pad244[0x1C];                  /* maybe part of unk240[8]? */
    /* 0x260 */ u8 unk260;                          /* inferred */
    /* 0x261 */ u8 unk261;                          /* inferred */
    /* 0x262 */ u8 unk262;                          /* inferred */
    /* 0x263 */ u8 unk263;                          /* inferred */
    /* 0x264 */ Actor *unk264;                      /* inferred */
    /* 0x268 */ Vec3f unk268;                       /* inferred */
    /* 0x274 */ void (*actionFunc)(EnArrow *, GlobalContext *);
} EnArrow;                                          /* size = 0x278 */

struct _mips2c_stack_EnArrow_Destroy {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_EnArrow_Draw {
    /* 0x00 */ char pad0[0x2C];
    /* 0x2C */ Gfx *sp2C;                           /* inferred */
    /* 0x30 */ char pad30[0x4];
    /* 0x34 */ GraphicsContext *sp34;               /* inferred */
    /* 0x38 */ char pad38[0x4];
    /* 0x3C */ Gfx *sp3C;                           /* inferred */
    /* 0x40 */ char pad40[0x18];                    /* maybe part of sp3C[7]? */
    /* 0x58 */ GraphicsContext *sp58;               /* inferred */
    /* 0x5C */ f32 sp5C;                            /* inferred */
    /* 0x60 */ char pad60[0x3];
    /* 0x63 */ u8 sp63;                             /* inferred */
    /* 0x64 */ char pad64[0x4];                     /* maybe part of sp63[5]? */
    /* 0x68 */ Gfx *sp68;                           /* inferred */
    /* 0x6C */ char pad6C[0x14];                    /* maybe part of sp68[6]? */
    /* 0x80 */ Gfx *sp80;                           /* inferred */
    /* 0x84 */ char pad84[0x14];                    /* maybe part of sp80[6]? */
    /* 0x98 */ GraphicsContext *sp98;               /* inferred */
    /* 0x9C */ f32 sp9C;                            /* inferred */
    /* 0xA0 */ f32 spA0;                            /* inferred */
    /* 0xA4 */ s32 spA4;                            /* inferred */
    /* 0xA8 */ char padA8[0x8];
};                                                  /* size = 0xB0 */

struct _mips2c_stack_EnArrow_Init {
    /* 0x00 */ char pad0[0x30];
    /* 0x30 */ ColliderQuad *sp30;                  /* inferred */
    /* 0x34 */ char pad34[0x4];
};                                                  /* size = 0x38 */

struct _mips2c_stack_EnArrow_Update {
    /* 0x00 */ char pad0[0x44];
    /* 0x44 */ ? sp44;                              /* inferred */
    /* 0x44 */ char pad44[0x14];
};                                                  /* size = 0x58 */

struct _mips2c_stack_func_8088A514 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8088A594 {
    /* 0x00 */ char pad0[0x2C];
    /* 0x2C */ Actor *sp2C;                         /* inferred */
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_8088A7D8 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_8088A894 {
    /* 0x00 */ char pad0[0x44];
    /* 0x44 */ u32 sp44;                            /* inferred */
    /* 0x48 */ char pad48[0x4];
    /* 0x4C */ f32 sp4C;                            /* inferred */
    /* 0x50 */ f32 sp50;                            /* inferred */
    /* 0x54 */ f32 sp54;                            /* inferred */
    /* 0x58 */ f32 sp58;                            /* inferred */
    /* 0x5C */ f32 sp5C;                            /* inferred */
    /* 0x60 */ f32 sp60;                            /* inferred */
    /* 0x64 */ f32 sp64;                            /* inferred */
    /* 0x68 */ f32 sp68;                            /* inferred */
    /* 0x6C */ f32 sp6C;                            /* inferred */
    /* 0x70 */ f32 sp70;                            /* inferred */
    /* 0x74 */ CollisionPoly *sp74;                 /* inferred */
};                                                  /* size = 0x78 */

struct _mips2c_stack_func_8088AA98 {
    /* 0x00 */ char pad0[0x44];
    /* 0x44 */ f32 sp44;                            /* inferred */
    /* 0x48 */ f32 sp48;                            /* inferred */
    /* 0x4C */ f32 sp4C;                            /* inferred */
    /* 0x50 */ f32 sp50;                            /* inferred */
    /* 0x54 */ WaterBox *sp54;                      /* inferred */
};                                                  /* size = 0x58 */

struct _mips2c_stack_func_8088ACE0 {
    /* 0x00 */ char pad0[0x3C];
    /* 0x3C */ CollisionContext *sp3C;              /* inferred */
    /* 0x40 */ PosRot *sp40;                        /* inferred */
    /* 0x44 */ Vec3f *sp44;                         /* inferred */
    /* 0x48 */ char pad48[0x8];                     /* maybe part of sp44[3]? */
    /* 0x50 */ s32 sp50;                            /* inferred */
    /* 0x54 */ f32 sp54;                            /* inferred */
    /* 0x58 */ f32 sp58;                            /* inferred */
    /* 0x5C */ f32 sp5C;                            /* inferred */
    /* 0x60 */ ? sp60;                              /* inferred */
    /* 0x60 */ char pad60[0x14];
    /* 0x74 */ f32 sp74;                            /* inferred */
    /* 0x78 */ f32 sp78;                            /* inferred */
    /* 0x7C */ Actor *sp7C;                         /* inferred */
    /* 0x80 */ char pad80[0x2];
    /* 0x82 */ u16 sp82;                            /* inferred */
    /* 0x84 */ ? sp84;                              /* inferred */
    /* 0x84 */ char pad84[0xC];
    /* 0x90 */ CollisionPoly *sp90;                 /* inferred */
    /* 0x94 */ f32 sp94;                            /* inferred */
    /* 0x98 */ char pad98[0x4];
    /* 0x9C */ f32 sp9C;                            /* inferred */
    /* 0xA0 */ f32 spA0;                            /* inferred */
    /* 0xA4 */ f32 spA4;                            /* inferred */
    /* 0xA8 */ u32 spA8;                            /* inferred */
    /* 0xAC */ CollisionPoly *spAC;                 /* inferred */
};                                                  /* size = 0xB0 */

struct _mips2c_stack_func_8088B630 {
    /* 0x00 */ char pad0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_8088B6B0 {
    /* 0x00 */ char pad0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_8088B88C {
    /* 0x00 */ char pad0[0x30];
    /* 0x30 */ s32 sp30;                            /* inferred */
    /* 0x34 */ f32 sp34;                            /* inferred */
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ f32 sp3C;                            /* inferred */
    /* 0x40 */ f32 sp40;                            /* inferred */
    /* 0x44 */ f32 sp44;                            /* inferred */
    /* 0x48 */ f32 sp48;                            /* inferred */
    /* 0x4C */ Vec3f *sp4C;                         /* inferred */
};                                                  /* size = 0x50 */

? EffectSsHitMark_SpawnCustomScale(GlobalContext *, ?, ?, PosRot *); /* extern */
? EffectSsStone1_Spawn(GlobalContext *, PosRot *, ?, u16); /* extern */
u32 func_800BC188(s32);                             /* extern */
? func_80115D5C(GlobalContext *, Actor *);          /* extern */
void func_8088A514(Actor *arg0);                    /* static */
void func_8088A7D8(GlobalContext *arg0, EnArrow *arg1); /* static */
void func_8088A894(EnArrow *arg0, GlobalContext *arg1); /* static */
void func_8088AA98(Actor *arg0, GlobalContext *arg1, s32); /* static */
void func_8088B88C(GlobalContext *arg0, EnArrow *arg1, Vec3f *arg2, EnArrow *); /* static */
extern ? D_01000000;
extern SkeletonHeader D_04014560;
extern ? D_0406F9F0;
extern ? D_0406FAE0;
static ColliderQuadInit D_8088C1E0 = {
    {0xA, 9, 0, 0, 8, 3},
