s16 func_80BBCA80(GlobalContext *arg0, GlobalContext *arg1); /* static */
u16 func_80BBD348(Actor *arg0, GlobalContext *arg1); /* static */
s32 func_80BBD8F0(Actor *arg0, GlobalContext *arg1); /* static */
s32 func_80BBD93C(GlobalContext *arg0, GlobalContext *arg1); /* static */
void func_80BBD98C(Actor *arg0, GlobalContext *arg1); /* static */
s32 func_80BBDACC(Actor *arg0, GlobalContext *arg1); /* static */
s32 func_80BBDC34(GlobalContext *arg0, GlobalContext *arg1); /* static */
s32 func_80BBDCFC(GlobalContext *arg0, GlobalContext *); /* static */
void func_80BBDDF8(Actor *arg0);                    /* static */
void func_80BBDE78(Actor *arg0);                    /* static */
void func_80BBDF28(Actor *arg0);                    /* static */
void func_80BBDFA8(EnSGoro *arg0, GlobalContext *arg1); /* static */
void func_80BBE05C(EnSGoro *arg0);                  /* static */
void func_80BBE0E4(EnSGoro *arg0);                  /* static */
? func_80BBE144(Actor *arg0, Actor *arg1);          /* static */
? func_80BBE374(Actor *arg0, Actor *arg1);          /* static */
void func_80BBE498(Actor *arg0, GlobalContext *arg1); /* static */
void func_80BBE73C(GlobalContext *arg0, GlobalContext *arg1); /* static */
void func_80BBE844(GlobalContext *arg0, GlobalContext *arg1); /* static */
void func_80BBE904(GlobalContext *arg0, GlobalContext *arg1); /* static */
void func_80BBE9F8(GlobalContext *arg0, GlobalContext *arg1); /* static */
void func_80BBEAD8(GlobalContext *arg0, GlobalContext *arg1); /* static */
void func_80BBEBF8(Actor *arg0, GlobalContext *arg1); /* static */
void func_80BBECBC(Actor *arg0, GlobalContext *arg1); /* static */
void func_80BBEEB4(GlobalContext *arg0, GlobalContext *arg1); /* static */
void func_80BBEF34(Actor *arg0, GlobalContext *arg1); /* static */
void func_80BBEFA0(Actor *arg0, GlobalContext *arg1); /* static */
void func_80BBF01C(Actor *arg0, GlobalContext *arg1); /* static */
? func_80BBF298(s16 arg0, s16 arg1, void *arg2, s16 *arg3, s32 arg4, s32 arg5); /* static */
s32 func_80BBF3D0(GlobalContext *arg0, s32 arg1, Gfx **arg2, Vec3f *arg3, Vec3s *rot, Actor *actor); /* static */
void func_80BBF3EC(GlobalContext *arg0, s32 arg1, Actor *arg2); /* static */
void func_80BBF5F0(Actor *arg0, GlobalContext *arg1); /* static */
void func_80BBF6BC(void *arg0, GraphicsContext **arg1); /* static */
extern ? D_060091A8;
extern FlexSkeletonHeader D_06011AC8;
extern AnimationHeader D_06012DE0;
static ColliderCylinderInit D_80BBF820 = {
    {1, 0, 9, 0x39, 0x10, 1},
    {1, {0, 0, 0}, {0xF7CFFFFF, 0, 0}, 1, 1, 1},
    {0, 0, 0, {0, 0, 0}},
};
static CollisionCheckInfoInit2 D_80BBF84C = {0, 0, 0, 0, 0xFF};
static DamageTable D_80BBF858 = {
    {
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
        1,
    },
};
static ActorAnimationEntryS D_80BBF878 = {
    {(AnimationHeader *)0x6011D98, 1.0f, 0, 0xFFFF, 0, 0},
    {(AnimationHeader *)0x6011D98, 1.0f, 0, 0xFFFF, 0, 0xFFFC},
    {(AnimationHeader *)0x6012DE0, 2.0f, 0, 0xFFFF, 2, 0},
    {(AnimationHeader *)0x6012DE0, 2.0f, 0, 0xFFFF, 2, 0xFFFC},
    {(AnimationHeader *)0x6012DE0, -2.0f, 0, 0xFFFF, 2, 0xFFFC},
    {(AnimationHeader *)0x6003E28, 1.0f, 0, 0xFFFF, 0, 0},
    {(AnimationHeader *)0x6003E28, 1.0f, 0, 0xFFFF, 0, 0xFFFC},
    {(AnimationHeader *)0x6004DD4, 1.0f, 0, 0xFFFF, 0, 0},
    {(AnimationHeader *)0x600283C, 1.0f, 0, 0xFFFF, 0, 0},
    {(AnimationHeader *)0x6007764, 1.0f, 0, 0xFFFF, 0, 0},
    {(AnimationHeader *)0x6005790, 1.0f, 0, 0xFFFF, 0, 0},
    {(AnimationHeader *)0x6003650, 1.0f, 0, 0xFFFF, 0, 0},
    {(AnimationHeader *)0x6002C48, 1.0f, 0, 0xFFFF, 0, 0xFFFC},
    {(AnimationHeader *)0x6013DB0, 1.0f, 0, 0xFFFF, 0, 0xFFFC},
    {(AnimationHeader *)0x60143AC, 1.0f, 0, 0xFFFF, 2, 0xFFFC},
    {(AnimationHeader *)0x6014CE0, 1.0f, 0, 0xFFFF, 0, 0xFFF8},
};
static ? D_80BBF978;                                /* unable to generate initializer */

typedef struct EnSGoro {
    /* 0x0000 */ Actor actor;
    /* 0x0144 */ char pad144[0x4];
    /* 0x0148 */ SkelAnime unk148;                  /* inferred */
    /* 0x018C */ void (*actionFunc)(EnSGoro *, GlobalContext *);
    /* 0x0190 */ ColliderCylinder unk190;           /* inferred */
    /* 0x01DC */ u16 unk1DC;                        /* inferred */
    /* 0x01DE */ char pad1DE[0xE];                  /* maybe part of unk1DC[8]? */
    /* 0x01EC */ s16 unk1EC;                        /* inferred */
    /* 0x01EE */ s16 unk1EE;                        /* inferred */
    /* 0x01F0 */ char pad1F0[0x4];                  /* maybe part of unk1EE[3]? */
    /* 0x01F4 */ s32 unk1F4;                        /* inferred */
    /* 0x01F8 */ Vec3s unk1F8;                      /* inferred */
    /* 0x01FE */ char pad1FE[0x66];                 /* maybe part of unk1F8[18]? */
    /* 0x0264 */ Vec3s unk264;                      /* inferred */
    /* 0x026A */ char pad26A[0x9E];
    /* 0x0308 */ s32 unk308;                        /* inferred */
    /* 0x030C */ char pad30C[0x4];                  /* maybe part of unk308[2]? */
} EnSGoro;                                          /* size 0x310 */

typedef struct GameAllocNode {
    /* 0x0000 */ GameAllocNode *next;
    /* 0x0004 */ GameAllocNode *prev;
    /* 0x0008 */ u32 size;
    /* 0x000C */ char padC[0x2];
    /* 0x000E */ s16 unkE;                          /* inferred */
} GameAllocNode;                                    /* size 0x10 */

typedef struct GameState {
    /* 0x0000 */ GraphicsContext *gfxCtx;
    /* 0x0004 */ void (*main)(GameState *);
    /* 0x0008 */ void (*destroy)(GameState *);
    /* 0x000C */ void (*nextGameStateInit)(GameState *);
    /* 0x0010 */ u32 nextGameStateSize;
    /* 0x0014 */ Input input[4];
    /* 0x0074 */ TwoHeadArena heap;
    /* 0x0084 */ GameAlloc alloc;
    /* 0x0098 */ f32 unk98;                         /* inferred */
    /* 0x009B */ u8 running;                        /* overlap */
    /* 0x009C */ u32 frames;
    /* 0x00A0 */ char padA0[0x2];
    /* 0x00A2 */ u8 framerateDivisor;
    /* 0x00A3 */ char padA3[0x1];                   /* maybe part of framerateDivisor[2]? */
} GameState;                                        /* size 0xA4 */

s16 func_80BBCA80(GlobalContext *arg0, GlobalContext *arg1) {
    void *sp1C;
    s16 temp_v0;
    s32 temp_a1;
    u16 temp_v0_2;
    u16 temp_v0_3;
    u16 temp_v0_4;
    u16 temp_v0_5;
    u16 temp_v0_6;
    u16 temp_v0_7;
    u16 temp_v0_8;
    u16 temp_v0_9;
    u32 temp_t7;
    u8 temp_v1_10;
    u8 temp_v1_11;
    u8 temp_v1_2;
    u8 temp_v1_3;
    u8 temp_v1_4;
    u8 temp_v1_5;
    u8 temp_v1_6;
    u8 temp_v1_7;
    u8 temp_v1_8;
    u8 temp_v1_9;
    void *temp_v1;

    temp_v0 = arg0->unk1C;
    temp_t7 = temp_v0 & 0xF;
    temp_v1 = arg1->actorCtx.actorList[2].first;
    switch (temp_t7) {
    case 0:
        temp_a1 = (s32) (temp_v0 & 0x7F0) >> 4;
        if ((gSaveContext.weekEventReg[22] & 4) == 0) {
            if (temp_v1->unk14B == 1) {
                temp_v1_2 = gSaveContext.weekEventReg[36];
