typedef struct EnPeehat {
    /* 0x000 */ Actor actor;
    /* 0x144 */ SkelAnime unk_144;                  /* inferred */
    /* 0x188 */ Vec3s unk_188;                      /* inferred */
    /* 0x18E */ char pad_18E[0x8A];                 /* maybe part of unk_188[24]? */
    /* 0x218 */ Vec3s unk_218;                      /* inferred */
    /* 0x21E */ char pad_21E[0x8A];                 /* maybe part of unk_218[24]? */
    /* 0x2A8 */ void (*actionFunc)(EnPeehat *, GlobalContext *);
    /* 0x2AC */ char pad_2AC[0x2];
    /* 0x2AE */ u8 unk_2AE;                         /* inferred */
    /* 0x2AF */ char pad_2AF[0x1];
    /* 0x2B0 */ s16 unk_2B0;                        /* inferred */
    /* 0x2B2 */ s16 unk_2B2;                        /* inferred */
    /* 0x2B4 */ s16 unk_2B4;                        /* inferred */
    /* 0x2B6 */ char pad_2B6[0x6];                  /* maybe part of unk_2B4[4]? */
    /* 0x2BC */ f32 unk_2BC;                        /* inferred */
    /* 0x2C0 */ f32 unk_2C0;                        /* inferred */
    /* 0x2C4 */ f32 unk_2C4;                        /* inferred */
    /* 0x2C8 */ f32 unk_2C8;                        /* inferred */
    /* 0x2CC */ f32 unk_2CC;                        /* inferred */
    /* 0x2D0 */ f32 unk_2D0;                        /* inferred */
    /* 0x2D4 */ char pad_2D4[0xC];                  /* maybe part of unk_2D0[4]? */
    /* 0x2E0 */ Vec3f unk_2E0;                      /* inferred */
    /* 0x2EC */ Vec3f unk_2EC;                      /* inferred */
    /* 0x2F0 */ f32 unk_2F0;                        /* overlap; inferred */
    /* 0x2F8 */ char pad_2F8[0x4];
    /* 0x2FC */ f32 unk_2FC;                        /* inferred */
    /* 0x300 */ char pad_300[0xC4];                 /* maybe part of unk_2FC[50]? */
    /* 0x3C4 */ ColliderCylinder unk_3C4;           /* inferred */
    /* 0x410 */ ColliderSphere unk_410;             /* inferred */
    /* 0x468 */ ColliderTris unk_468;               /* inferred */
    /* 0x488 */ ColliderTrisElement unk_488;        /* inferred */
    /* 0x4E4 */ char pad_4E4[0x5C];
} EnPeehat;                                         /* size = 0x540 */

struct _mips2c_stack_EnPeehat_Destroy {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_EnPeehat_Draw {
    /* 0x00 */ char pad_0[0x34];
    /* 0x34 */ ColliderTris *sp34;                  /* inferred */
    /* 0x38 */ char pad_38[0x8];                    /* maybe part of sp34[3]? */
    /* 0x40 */ ? sp40;                              /* inferred */
    /* 0x40 */ char pad_40[0xC];
    /* 0x4C */ ? sp4C;                              /* inferred */
    /* 0x4C */ char pad_4C[0xC];
    /* 0x58 */ ? sp58;                              /* inferred */
    /* 0x58 */ char pad_58[0x10];
};                                                  /* size = 0x68 */

struct _mips2c_stack_EnPeehat_Init {
    /* 0x00 */ char pad_0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_EnPeehat_Update {
    /* 0x00 */ char pad_0[0x54];
    /* 0x54 */ CollisionContext *sp54;              /* inferred */
    /* 0x58 */ ColliderCylinder *sp58;              /* inferred */
    /* 0x5C */ CollisionCheckContext *sp5C;         /* inferred */
    /* 0x60 */ char pad_60[0x4];
    /* 0x64 */ PosRot *sp64;                        /* inferred */
    /* 0x68 */ char pad_68[0x4];
    /* 0x6C */ u32 sp6C;                            /* inferred */
    /* 0x70 */ CollisionPoly *sp70;                 /* inferred */
    /* 0x74 */ ? sp74;                              /* inferred */
    /* 0x74 */ char pad_74[0x14];
};                                                  /* size = 0x88 */

struct _mips2c_stack_func_80897170 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_808971DC {
    /* 0x00 */ char pad_0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80897258 {
    /* 0x00 */ char pad_0[0x42];
    /* 0x42 */ s16 sp42;                            /* inferred */
    /* 0x44 */ f32 sp44;                            /* inferred */
    /* 0x48 */ f32 sp48;                            /* inferred */
    /* 0x4C */ f32 sp4C;                            /* inferred */
};                                                  /* size = 0x50 */

struct _mips2c_stack_func_80897390 {
    /* 0x00 */ char pad_0[0x58];
};                                                  /* size = 0x58 */

struct _mips2c_stack_func_80897498 {
    /* 0x00 */ char pad_0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80897520 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80897648 {
    /* 0x00 */ char pad_0[0x30];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_808976DC {
    /* 0x00 */ char pad_0[0x34];
    /* 0x34 */ ? sp34;                              /* inferred */
    /* 0x34 */ char pad_34[0x4];
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ char pad_3C[0x4];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80897864 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80897910 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ s32 sp24;                            /* inferred */
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80897A34 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80897A94 {
    /* 0x00 */ char pad_0[0x30];
    /* 0x30 */ PosRot *sp30;                        /* inferred */
    /* 0x34 */ char pad_34[0x4];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80897D00 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80897D48 {
    /* 0x00 */ char pad_0[0x34];
    /* 0x34 */ ? sp34;                              /* inferred */
    /* 0x34 */ char pad_34[0x4];
    /* 0x38 */ f32 sp38;                            /* inferred */
    /* 0x3C */ char pad_3C[0x4];
};                                                  /* size = 0x40 */

struct _mips2c_stack_func_80897EAC {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80897F44 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ s32 sp24;                            /* inferred */
    /* 0x28 */ char pad_28[0x8];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80898124 {};              /* size 0x0 */

struct _mips2c_stack_func_80898144 {
    /* 0x00 */ char pad_0[0x20];
    /* 0x20 */ Vec3f *sp20;                         /* inferred */
    /* 0x24 */ Vec3f *sp24;                         /* inferred */
    /* 0x28 */ char pad_28[0x4];
    /* 0x2C */ s32 sp2C;                            /* inferred */
    /* 0x30 */ char pad_30[0x8];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_808982E0 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80898338 {
    /* 0x00 */ char pad_0[0x34];
    /* 0x34 */ Vec3f *sp34;                         /* inferred */
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80898414 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_80898454 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_808984E0 {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

struct _mips2c_stack_func_80898594 {
    /* 0x00 */ char pad_0[0x20];
};                                                  /* size = 0x20 */

struct _mips2c_stack_func_80898654 {
    /* 0x00 */ char pad_0[0x18];
};                                                  /* size = 0x18 */

struct _mips2c_stack_func_808986A4 {
    /* 0x00 */ char pad_0[0x38];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_8089874C {
    /* 0x00 */ char pad_0[0x38];
};                                                  /* size = 0x38 */

struct _mips2c_stack_func_80898E74 {
    /* 0x00 */ char pad_0[0x24];
    /* 0x24 */ GraphicsContext *sp24;               /* inferred */
    /* 0x28 */ char pad_28[0x8];
};                                                  /* size = 0x30 */

struct _mips2c_stack_func_80899024 {
    /* 0x00 */ char pad_0[0x28];
};                                                  /* size = 0x28 */

? func_800BE568(Actor *, f32 *);                    /* extern */
void func_80897170(Actor *arg0);                    /* static */
void func_808971DC(Actor *arg0, GlobalContext *arg1); /* static */
void func_80897258(GlobalContext *arg0, EnPeehat *arg1, ? *arg2, f32 arg3, f32 arg4); /* static */
void func_80897390(Actor *arg0, GlobalContext *arg1); /* static */
void func_80897498(EnPeehat *arg0);                 /* static */
void func_80897520(Actor *arg0, GlobalContext *arg1); /* static */
void func_80897648(Actor *arg0, f32, Actor *);      /* static */
void func_808976DC(EnPeehat *arg0, GlobalContext *arg1); /* static */
void func_80897864(Actor *arg0);                    /* static */
void func_80897910(Actor *arg0, void *arg1);        /* static */
void func_80897A34(EnPeehat *arg0);                 /* static */
void func_80897A94(Actor *arg0, GlobalContext *arg1); /* static */
