s32 func_800B7128(void *, void *, Actor *);         /* extern */
s32 func_800B8C78(GlobalContext *, EnHorse *);      /* extern */
? func_800B8C9C(GlobalContext *, EnHorse *, s32);   /* extern */
s32 func_800B8CEC(GlobalContext *, EnHorse *);      /* extern */
f32 func_800C3FA0(CollisionContext *, ? *, ? *);    /* extern */
f32 func_800C40B4(CollisionContext *, CollisionPoly **, s32 *, f32 *); /* extern */
f32 func_800C4188(GlobalContext *, s32, s32 *, s32 *, void *, ? *); /* extern */
s32 func_800F3940(void *);                          /* extern */
? func_800F415C(EnHorse *, s16, s16);               /* extern */
? func_80138258(EnHorse *, GlobalContext *, ? *, void (*)(void *, GlobalContext *, s32), s32 (*)(void *, void **, s32, ?), s32); /* extern */
? func_80138300(s32, u8, f32 *, Vec3f *);           /* extern */
? func_8013835C(s32, ?, ?, void *);                 /* extern */
? func_80138410(? *);                               /* extern */
? func_8013859C(GlobalContext *, ? *, s32, s32);    /* extern */
? func_80138700(GlobalContext *, ? *);              /* extern */
? func_8017D7C0(f32, f32, f32, f32, f32, f32, f32 *); /* extern */
s32 func_801A5100();                                /* extern */
void func_8087B730(s32 arg0, s32 arg1, Vec3f *arg2); /* static */
void func_8087B784(Actor *arg1, EnHorse *arg2, s16 arg3, ?); /* static */
void func_8087B7C0(Actor *arg0, EnHorse *arg1, void *arg2); /* static */
void func_8087C0AC(Actor *arg0, EnHorse *);         /* static */

static ? D_80888F40;                                /* unable to generate initializer */
static ColliderCylinderInit D_80888F74 = {
    {0xA, 8, 0, 0x39, 0x12, 1},
    {0, {4, 0, 2}, {0xF7CFFFFF, 0, 0}, 0x19, 0, 1},
    {0x14, 0x46, 0, {0, 0, 0}},
};
static ColliderCylinderInit D_80888FA0 = {
    {0xA, 0, 0, 0x39, 0x12, 1},
    {0, {0xF7CFFFFF, 0, 0}, {0xF7CFFFFF, 0, 0}, 0, 0, 1},
    {0x14, 0x46, 0, {0, 0, 0}},
};
static ? D_80888FCC;                                /* unable to generate initializer */
static ColliderJntSphInit D_80888FF0;               /* type too large by 4; unable to generate initializer */
static ? *D_80888FFC = &D_80888FCC;
static CollisionCheckInfoInit D_80889000 = {0xA, 0x23, 0x64, 0xFE};
static ? D_80889008;                                /* unable to generate initializer */
static InitChainEntry D_80889010;                   /* unable to generate initializer */
static ? D_80889018;                                /* unable to generate initializer */
static ? D_80889030;                                /* unable to generate initializer */
static ? D_80889048;                                /* unable to generate initializer */
static ? D_80889052;                                /* unable to generate initializer */
static ? D_80889054;                                /* unable to generate initializer */
static ? D_8088905C;                                /* unable to generate initializer */
static ? D_80889074;                                /* unable to generate initializer */
static ? D_8088908C;                                /* unable to generate initializer */
static ? D_808890E8;                                /* unable to generate initializer */
static ? D_808890F0;                                /* unable to generate initializer */
static ? D_8088911C;                                /* unable to generate initializer */
static ? D_80889148;                                /* unable to generate initializer */
static ? D_80889154;                                /* unable to generate initializer */
static ? D_80889160;                                /* unable to generate initializer */
static ? D_808891C8;                                /* unable to generate initializer */
static ? D_808891D4;                                /* unable to generate initializer */
static ? D_808891E0;                                /* unable to generate initializer */
static ? D_808891EC;                                /* unable to generate initializer */
static ? D_808891F8;                                /* unable to generate initializer */
static ? D_80889204;                                /* unable to generate initializer */
static ? D_80889210;                                /* unable to generate initializer */
static ? D_80889214;                                /* unable to generate initializer */
static void *D_80889268 = (void *)0x416570A4;       /* const */
static void *D_8088926C = (void *)0x416570A4;       /* const */
static void *D_80889270 = (void *)0x41686666;       /* const */

typedef struct EnHorse {
    /* 0x0000 */ Actor actor;
    /* 0x0144 */ s32 unk144;                        /* inferred */
    /* 0x0148 */ s32 unk148;                        /* inferred */
    /* 0x014C */ s32 unk14C;                        /* inferred */
    /* 0x0150 */ s32 unk150;                        /* inferred */
    /* 0x0154 */ s8 unk154;                         /* inferred */
    /* 0x0155 */ char pad155[0x3];                  /* maybe part of unk154[4]? */
    /* 0x0158 */ ? unk158;                          /* inferred */
    /* 0x0159 */ char pad159[0x4B];
    /* 0x01A4 */ SkelAnime unk1A4;                  /* inferred */
    /* 0x01E8 */ s32 unk1E8;                        /* inferred */
    /* 0x01EC */ s32 unk1EC;                        /* inferred */
    /* 0x01F0 */ f32 unk1F0;                        /* inferred */
    /* 0x01F4 */ f32 unk1F4;                        /* inferred */
    /* 0x01F8 */ f32 unk1F8;                        /* inferred */
    /* 0x01FC */ s16 unk1FC;                        /* inferred */
    /* 0x01FE */ char pad1FE[0x2];                  /* maybe part of unk1FC[2]? */
    /* 0x0200 */ s32 unk200;                        /* inferred */
    /* 0x0204 */ s32 unk204;                        /* inferred */
    /* 0x0208 */ s32 unk208;                        /* inferred */
    /* 0x020C */ s32 unk20C;                        /* inferred */
    /* 0x0210 */ f32 unk210;                        /* inferred */
    /* 0x0214 */ s32 unk214;                        /* inferred */
    /* 0x0218 */ Vec3f unk218;                      /* inferred */
    /* 0x0224 */ char pad224[0x10];
    /* 0x0234 */ u8 unk234;                         /* inferred */
    /* 0x0235 */ char pad235[0x3];                  /* maybe part of unk234[4]? */
    /* 0x0238 */ s32 unk238;                        /* inferred */
    /* 0x023C */ s32 unk23C;                        /* inferred */
    /* 0x0240 */ ? (*unk240)(EnHorse *, GlobalContext *); /* inferred */
    /* 0x0244 */ f32 unk244;                        /* inferred */
    /* 0x0248 */ f32 unk248;                        /* inferred */
    /* 0x024C */ char pad24C[0x4];                  /* maybe part of unk248[2]? */
    /* 0x0250 */ s16 unk250;                        /* inferred */
    /* 0x0252 */ char pad252[0x2];                  /* maybe part of unk250[2]? */
    /* 0x0254 */ s32 unk254;                        /* inferred */
    /* 0x0258 */ f32 unk258;                        /* inferred */
    /* 0x025C */ f32 unk25C;                        /* inferred */
    /* 0x0260 */ f32 unk260;                        /* inferred */
    /* 0x0264 */ f32 unk264;                        /* inferred */
    /* 0x0268 */ f32 unk268;                        /* inferred */
    /* 0x026C */ f32 unk26C;                        /* inferred */
    /* 0x0270 */ f32 unk270;                        /* inferred */
    /* 0x0274 */ char pad274[0x4];                  /* maybe part of unk270[2]? */
    /* 0x0278 */ ObjectContext unk278;              /* inferred */
    /* 0x0284 */ s16 *unk284;                       /* overlap; inferred */
    /* 0x0288 */ u8 unk288;                         /* inferred */
    /* 0x0289 */ u8 unk289;                         /* inferred */
    /* 0x028A */ u8 unk28A;                         /* inferred */
    /* 0x028B */ char pad28B[0x1];                  /* maybe part of unk28A[2]? */
    /* 0x028C */ s8 unk28C;                         /* inferred */
    /* 0x028D */ char pad28D[0x19];                 /* maybe part of unk28C[26]? */
    /* 0x02A6 */ u8 unk2A6;                         /* inferred */
    /* 0x02A7 */ char pad2A7[0x11];                 /* maybe part of unk2A6[18]? */
    /* 0x02B8 */ s16 unk2B8;                        /* inferred */
    /* 0x02BA */ char pad2BA[0x4];                  /* maybe part of unk2B8[3]? */
    /* 0x02BE */ s16 unk2BE;                        /* inferred */
    /* 0x02C0 */ char pad2C0[0x2];                  /* maybe part of unk2BE[2]? */
    /* 0x02C2 */ s16 unk2C2;                        /* inferred */
    /* 0x02C4 */ char pad2C4[0x11];
    /* 0x02D5 */ u8 unk2D5;                         /* inferred */
    /* 0x02D6 */ u8 unk2D6;                         /* inferred */
    /* 0x02D7 */ char pad2D7[0x1];                  /* maybe part of unk2D6[2]? */
    /* 0x02D8 */ s8 unk2D8;                         /* inferred */
    /* 0x02D9 */ char pad2D9[0x19];                 /* maybe part of unk2D8[26]? */
    /* 0x02F2 */ u8 unk2F2;                         /* inferred */
    /* 0x02F3 */ char pad2F3[0x11];                 /* maybe part of unk2F2[18]? */
    /* 0x0304 */ s16 unk304;                        /* inferred */
    /* 0x0306 */ char pad306[0x4];                  /* maybe part of unk304[3]? */
    /* 0x030A */ s16 unk30A;                        /* inferred */
    /* 0x030C */ char pad30C[0x15];
    /* 0x0321 */ u8 unk321;                         /* inferred */
    /* 0x0322 */ u8 unk322;                         /* inferred */
    /* 0x0323 */ char pad323[0x57];                 /* maybe part of unk322[88]? */
    /* 0x037A */ u8 unk37A;                         /* inferred */
    /* 0x037B */ char pad37B[0x9];                  /* maybe part of unk37A[10]? */
    /* 0x0384 */ s16 unk384;                        /* inferred */
    /* 0x0386 */ char pad386[0x26];                 /* maybe part of unk384[20]? */
    /* 0x03AC */ u16 unk3AC;                        /* inferred */
    /* 0x03AE */ char pad3AE[0x3A];                 /* maybe part of unk3AC[30]? */
    /* 0x03E8 */ f32 unk3E8;                        /* inferred */
    /* 0x03EC */ s16 unk3EC;                        /* inferred */
    /* 0x03EE */ char pad3EE[0x13A];                /* maybe part of unk3EC[158]? */
    /* 0x0528 */ f32 unk528;                        /* inferred */
    /* 0x052C */ s32 unk52C;                        /* inferred */
    /* 0x0530 */ char pad530[0x5C];                 /* maybe part of unk52C[24]? */
    /* 0x058C */ s32 unk58C;                        /* inferred */
    /* 0x0590 */ s32 unk590;                        /* inferred */
} EnHorse;                                          /* size 0x594 */

typedef struct {
    /* 0x0000 */ s16 id;
    /* 0x0002 */ s16 unk2;                          /* inferred */
    /* 0x0004 */ void *segment;
    /* 0x0008 */ DmaRequest dmaReq;
    /* 0x0028 */ OSMesgQueue loadQueue;
    /* 0x0040 */ void *loadMsg;
} ObjectStatus;                                     /* size 0x44 */

void func_8087B730(s32 arg0, s32 arg1, Vec3f *arg2) {
    void *temp_v0;

    temp_v0 = arg0 + (arg1 * 0xA);
    arg2->x = (f32) temp_v0->unk0;
    arg2->y = (f32) temp_v0->unk2;
    arg2->z = (f32) temp_v0->unk4;
}

void func_8087B784(Actor *arg1, EnHorse *arg2, s16 arg3) {
    func_800F415C(arg2, arg3, arg3);
}

void func_8087B7C0(Actor *arg0, EnHorse *arg1, void *arg2) {
    s32 spA4;
    void *spA0;
    Vec3f sp8C;
    Vec3f sp80;
    f32 sp7C;
    f32 sp78;
    f32 sp74;
    f32 sp70;
    s32 sp6C;
    s32 sp68;
    f32 sp64;
    s32 sp60;
    Vec3f sp50;
    s16 sp4A;
    s16 sp48;
    Vec3s *sp3C;
    Vec3f *sp38;
    Actor *temp_a0;
    f32 temp_f0;
    f32 temp_f0_10;
    f32 temp_f0_11;
    f32 temp_f0_2;
    f32 temp_f0_3;
    f32 temp_f0_4;
    f32 temp_f0_5;
    f32 temp_f0_6;
    f32 temp_f0_7;
    f32 temp_f0_8;
    f32 temp_f0_9;
    f32 temp_f2;
    s16 temp_a0_2;
